{"title":"BBC.The.Ottomans.Europes.Muslim.Emperors.2of3.PDTV.XviD.AC3..avi","uid":9078907,"size":593836190,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0032b990ae3d1acfc93eef6066c5daaedb00fa02&amp;dn=BBC.The.Ottomans.Europes.Muslim.Emperors.2of3.PDTV.XviD.AC3..avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MVGroup","files":-1,"time":1382352900,"description":"The Ottomans: Europe's Muslim Emperors \nIt was the world's last Islamic empire - a super-power of a million square miles. From its capital in Istanbul it matched the glories of Ancient Rome. And after six centuries in power it collapsed less than a hundred years ago. Rageh Omaar, who has reported from across this former empire, sets out to discover why the Ottomans have vanished from our understanding of the history of Europe. Why so few realise the importance of Ottoman history in today's Middle East. And why you have to know the Ottoman story to understand the roots of many of today's trouble spots from Palestine, Iraq and Israel to Libya, Syria, Egypt, Bosnia and Kosovo.\n\n\n\nEpisode 1\nIn this first episode, the unlikely roots of the Ottomans are revealed. From nomadic horsemen, in a rural backwater of modern day Turkey, they became rulers of a vast empire spanning three continents. At an incredible speed they came to rule over Baghdad and Cairo in the south, where they controlled the holiest sites of Islam - Mecca, Medina and Jerusalem, and they reached deep into Europe, taking in Sarajevo and threatening the gates of Vienna. This is the forgotten story of how one dynasty, a single family, became Islamic rulers over huge swathes of the modern world.\n\nEpisode 2\nContinuing his fascinating journey to rediscover the central role played by the Ottoman Empire in Europe and the Middle East, Rageh Omaar explores the huge contrasts in the times of two very different Ottoman sultans. The most famous Suleiman the Magnificent in the golden age of the 16th century and the troubled reign of Abdul Hamid II in the 19th century when the Ottomans were dubbed 'the Sick Man of Europe'. Rageh examines the cultural legacy as well as the physical, religious and political architecture of Ottoman rule to find out what a Muslim world run from Europe was really like. It reveals the backdrop to the relationship between Islam and Europe today, how the Ottomans became central in the power politics of Europe and what could have happened had they succeeded in their successive bids to seize Vienna, then a key European capital.\n\nEpisode 3\nIn the final episode Rageh Omaar explains how the collapse of this Islamic super-power following the First World War has left problems for Europe and the Middle East that are still being felt today. Rageh also reveals how struggles at the heart of the Ottoman story have have recently been reignited on the streets they once ruled, from Syria to Turkey. From its capital in Istanbul the Ottoman Empire matched the glories of Ancient Rome. Yet its achievements have been largely lost in the trauma of its last few years. Brutality, massacres and the carve-up of former Ottoman lands created a legacy of tension and conflict that continue to this day. The heartland of the former empire - modern day Turkey - turned its back on its Islamic, Ottoman past. It underwent a social revolution led by military commander and secular visionary Mustafa Kemal- Ataturk. So why is Ottomanism back on the political agenda? And why are many politicians in the West hoping that Turkey can provide a role model as a modern, Islamic democracy?\n\n\nTechnical Specs \nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate:  1199 kbps\nVideo Resolution: 720 x 404\nVideo Aspect Ratio: 1.782 (~16:9)\nFrames Per Second: 25\nAudio Codec: 0x2000 (Dolby AC3) \nAudio Bitrate: 128 kb/s  48000 Hz)\nAudio Streams: stereo (2/0)\nAudio Languages: English\nRunTime Per Part: 59.Mins\nNumber Of Parts: 3\nPart Size: 567 MB\nSource: PDTV\nEncoded by Harry65\n\n\n\n\n\n &lt;a href=&quot;\nhttp://www.bbc.co.uk/programmes/b03d0jhz&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bbc.co.uk/programmes/b03d0jhz&lt;/a&gt;","torrent":{"xt":"urn:btih:0032b990ae3d1acfc93eef6066c5daaedb00fa02","amp;dn":"BBC.The.Ottomans.Europes.Muslim.Emperors.2of3.PDTV.XviD.AC3..avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0032b990ae3d1acfc93eef6066c5daaedb00fa02","infoHashBuffer":{"type":"Buffer","data":[0,50,185,144,174,61,26,207,201,62,239,96,102,197,218,174,219,0,250,2]},"announce":[],"urlList":[]}}