{"title":"Farming with Nature - Successful Temperate Permaculture","uid":3897961,"size":366567424,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:0034af9b87727c00376d0292d2c6f21ffff1b7d6&amp;dn=Farming+with+Nature+-+Successful+Temperate+Permaculture&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"diinero","files":1,"time":1195395544,"description":"Farming with Nature - A Case Study of Successful Temperate Permaculture\n\nVideo: (37 minutes)\n\nHow an Austrian farmer simply observes nature and survives without depending on subsidies, chemical fertilisers or pesticides of any kind.\n\nSepp Holzer created an edible landscape at 1500 metres above sea level - one of the few perfectly working permaculture systems in Europe.\n\nBetween the pinetree monocultures of Austria he built a fishpond system with his own water power station, planted 9000 fruit trees of the most various kinds in connection with many other plants to support each other (plant families). Thirty different types of potatoes, many different grains, fruits, vegetables, herbs and wildflowers are growing just about everywhere - in the forest, on extremely steep hills, on rocky soil, on pathways, around ponds, as well as raised beds. All of this he grows without the use of any pesticides, herbicides or fertilizer. Holzer says: &quot;I couldn&amp;#039;t understand that still everybody at the agricultural schools told you these chemicals are useful. They drowned us in brochures of the chemical fertilizers with the latest information on how many kilos of which stuff you should get. But if you follow their instructions you only have trouble, your purse is empty, you have a lot of hard work to do, and you&amp;#039;re destroying all this important life in your ground, and your own health with it. Sorry, but I really don&amp;#039;t want to spoil my own land with this poison!&quot;\n\nInstead of using chemicals, he simply observes nature and finds out which plants support each other. In autumn he collects many seeds and stores them, and whenever he can, he throws this seed mixture on his ground. Along pathways, on new patches of terraces, anywhere. There is no square meter of ground with only one type of plant. All plants grow together and support each other. No plant or insect is unwanted. Diversity is a key word for Holzer, not only on the level of plants but also on the economic level. Holzer now has a lot of different sources of income. He sells all the products of his land; fruit trees, fruits, grains, vegetables, fish, and mushrooms, all guaranteed biological. Further, he sells seeds of many of these plants including very rare ones. Next to that, Holzer gives advice to farmers who want to change their farms into permaculture places or people who want to build up a permaculture garden. Sepp also gives guided tours over his own property to interested people, who have a growing interest in permaculture. He also gives seminars on old techniques such as grinding your own grains, making your own bread and butter etc. He also rents out his mountain huts for people who want to spend time in nature as a holiday. So it looks like Holzer will never be short of ideas, his economic success is an exception in the whole area.\n\nMost farmers in Europe are completely dependent on subsidies. The EU supports farmers, especially in disadvantaged regions in order to keep the cultivation of the land alive. The price is high: 54.3 % of the EU expenses (=41 billion ECU) are flowing into agriculture! 1997 it was 80 billion DM (even though the farmers are only 4.4 % of the working population).\n\nSepp Holzer: &quot;I find it painful to watch all these farmers going broke and selling their land for next to nothing, mostly to rich academic people who know even less what to do with the land. If these farmers only knew what they could do with their land! Nature has so much to offer, so many possibilities!&quot; ","torrent":{"xt":"urn:btih:0034af9b87727c00376d0292d2c6f21ffff1b7d6","amp;dn":"Farming+with+Nature+-+Successful+Temperate+Permaculture","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0034af9b87727c00376d0292d2c6f21ffff1b7d6","infoHashBuffer":{"type":"Buffer","data":[0,52,175,155,135,114,124,0,55,109,2,146,210,198,242,31,255,241,183,214]},"announce":[],"urlList":[]}}