{"title":"Advance In The Dance - A Complete Bellydance Choreography with R","uid":8321923,"size":646606895,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:00a2385b6788056331bcf0abf5796e44ea4844fa&amp;dn=Advance+In+The+Dance+-+A+Complete+Bellydance+Choreography+with+R&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"sara_melika","files":2,"time":1364694120,"description":"This is a complete belly dance routine with a veil entrance, belly dance Oriental, drum solo and a finale again with the veil. The instruction on the video is much like a workshop, however Rania goes through the entire routine in about an hour. You should have a pretty solid background already of belly dance instruction because this is definitely for the intermediate student.\n\nRania has the routine divided into twelve sections. She will walk through the choreo in the section and then there is an opportunity to run it through with music one time before continuing to the next section. I did notice in one section that the walk through and the run through had some variations so there is some inconsistency throughout. Don't take it too seriously, this routine is intended for the soloist. The music is fast and the transitions are quick which add to the advanced level of the choreography.\n\nThe music is not referenced on the video cover nor on the dvd which I find annoying from Hollywood Music Center. I did recognize the music for the Oriental section which is &quot;Raghed&quot; (Oriental Routine) from Virginia presents Khan Al Khalili | Al-Ahram Orchestra. I emailed HMC about the music on the video and they responed the Oriental music is &quot;Sharm El-Sheik&quot; from the CD Exotic Cairo and the drum solo portion is from the CD Belly Dance Oasis &quot;Tabla Makes you Dance&quot;. Since I found the music on the Virginia album, I was interested in the drum solo. I am not sure it is the same drum solo on the video as it is on cd HMC referenced. Unless HMC edited the drum solo &lt;music&gt; (which they have done on previous instructional videos) and used the last section which is the faster portion of the drum music for the choreo. I have not yet confirmed if they are the same. I decided to learn the drum choreo for inspiration and select my own drum music.\n\nAnd as for the finale. I have not completed the section and do not recognize the music. It is not the same music as &quot;Raghed&quot;. I selected the finale music from another song from the same belly dance cd to edit to my music set. The finale choreo seems adaptable enough to fit into most endings.\n\nMy take on the dvd; a fun dvd to learn a new choreo if you are not inclined to come up with one on your own. It is a great cabaret belly dance routine. Plan to use different music for the drum solo and the finale. But in the end, it will become your own routine.","torrent":{"xt":"urn:btih:00a2385b6788056331bcf0abf5796e44ea4844fa","amp;dn":"Advance+In+The+Dance+-+A+Complete+Bellydance+Choreography+with+R","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00a2385b6788056331bcf0abf5796e44ea4844fa","infoHashBuffer":{"type":"Buffer","data":[0,162,56,91,103,136,5,99,49,188,240,171,245,121,110,68,234,72,68,250]},"announce":[],"urlList":[]}}