{"title":"Actual Window Manager v7.4.3 Incl Crack [TorDigger]","uid":8169338,"size":14311794,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:011ce5c0caef23b8ae489382d7086042693204b8&amp;dn=Actual+Window+Manager+v7.4.3+Incl+Crack+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"TorDigger","files":11,"time":1361393135,"description":"Actual Window Manager\n\nActual Window Manager is an innovative desktop organization application which introduces unconventional window controls and also automatic general window operations making your work more productive, convenient and enjoyable. It has more than 50 handy tools to help you in daily routine window manipulations.\n\nActual Window Manager is a technologically advanced utility tool that interacts with the Windows operating system's shell to bring the extended manipulation functionality to every window in the system.\nIt allows you to roll up/unroll windows, hide them to the Windows notification area (system tray), keep them always-on-top of others, make them semi-transparent - and many other advanced window actions available both in the automatic way (upon startup, activation/deactivation, minimization etc.) and in the manual way (via extra buttons added to each window's title bar or via extra options added to each window's system window menu).\n\nActual Window Manager keeps track of all the configuration changes you make to each individual window and applies the changes automatically on-the-fly! In addition, Actual Window Manager operates semi-automatically, therefore you will not be required spend a lot of time trying to understand how it works.\n\nHere are some key features of &quot;Actual Window Manager&quot;:\nWindow Settings:\nÂ· Provides advanced abilities to manipulate windows in various ways (both automatic and manual).\nVirtual Desktops:\nÂ· Extends general window management with the ability to group windows within virtual desktops.\nMultiple Monitors Extensions:\nÂ· Enhances common WindowsÂ® user interface for multiple display environments.\n\nActual Window Manager 7.4.3 (19.02.2013)\n\n[!] Actual Taskbar did not appear at startup if the &quot;Show window contents while\ndragging&quot; option was disabled in Windows.[*] Compatibility with MAXQDA is improved.[*] Windows 7: &quot;Desktop Divider's Up/Down/Left/Right&quot; hotkey combinations\nare modified to avoid conflicts with the system hotkeys.\n[-] In some cases specific window settings did not apply to 64-bit applications\n(e.g. Waterfox).\n[-] Windows 8: Alt-Tab Task Switcher did not switch windows when pressing\nAlt-Tab shortly.\n[-] Mouse pointer moved to a wrong place when activating Excel windows via\ntaskbar previews if the &quot;Put the mouse into window on preview click&quot; option\nwas enabled.\n[-] When locking the mouse in a maximized window, the mouse pointer could be\ndragged beyond monitor boundaries.\n[-] Windows 7: Hand tool did not work with the folder tree in Windows Explorer\nwindows.\n\nSupported OS:\n\nWindows 8/7/Server*/Vista/2008/XP/2003/2000\nx86/x64\n\nHomepage: http://www.actualtools.com/windowmanager/\n\nInstallation Instructions:\n\n- Install program\n- Copy content from crack folder and paste into default installation directory.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.\n","torrent":{"xt":"urn:btih:011ce5c0caef23b8ae489382d7086042693204b8","amp;dn":"Actual+Window+Manager+v7.4.3+Incl+Crack+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"011ce5c0caef23b8ae489382d7086042693204b8","infoHashBuffer":{"type":"Buffer","data":[1,28,229,192,202,239,35,184,174,72,147,130,215,8,96,66,105,50,4,184]},"announce":[],"urlList":[]}}