{"title":"Red Browser V 1.8.0.ipa","uid":11694695,"size":16644172,"categoryP":"applications","categoryS":"ios_(ipad_iphone)","magnet":"?xt=urn:btih:019ddccfe0c993f2172fd1550202e2640574994d&amp;dn=Red+Browser+V+1.8.0.ipa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zxfghfg","files":1,"time":1423667630,"description":"Red Onion is a unique browser that lets you access the Internet privately and anonymously. With Red Onion you can bypass corporate, school, public wifi internet filters and access the entire Internet without restrictions with complete security. Not only that with the built downloader you can freely download videos and music without ever revealing your true identity or IP address.\n\nRed Onion is a full-fledged Tor-powered browser that offers you a REAL solution, with multiple tabs, customizable start screen, built in ad-blocker, history, bookmarks, and much much more.\n\nFeatures:\n- Internet access tunneled over the Tor network\n- Websites do not see your real IP address\n- Access the entire Internet from behind corporate/ISP/national internet filters and censors\n- Auto clean up of cookies on exit\n- Reset history/tabs/etc on restart (App Settings &gt; Full Reset or Always Full Reset options for flexibility)\n- Access websites on the &quot;dark net&quot; of anonymous .onion web sites, only accessible through Tor\n- Multiple tabs, Bookmarks &amp; History\n- Supports Do Not Track\n- Start screen with the most frequent visited history entry's\n- Real-time search in your browsing history, bookmarks and tabs\n- Search engine integration in the Address bar\n- Share URL's via Twitter, Mail, Google+\n- Search in the webpage\n- Download files by just tapping the link or &quot;long press&quot; the link to Force Download it\n- Simultaneous downloads (App Settings &gt; Concurrent Downloads - default is set to 1 for performance can be changed to max of 5)\n- User-Agent spoofing \n- Ad-block (for most ad-networks)\n- Passcode lock and Touch ID support\n- File Manager - Preview Apple supported format right from within the app or &quot;Open in...&quot; others app on your device.\n- Multi format video/audio player allows you to play almost any video and audio format without leaving the app\n- Address bar search engine options (Google, Bing, DuckDuckGo, StartPage can be changed App Settings &gt; Search Engine)\n- Extract audio from mp4 files (convert to mp3)\n- Robust File Manager\n\n\nImportant Notes:\n- Web browsing/downloading through the anonymization network will be SIGNIFICANTLY SLOWER than through a non-tunneled browser like Safari. This is necessary and a small price to pay to keep your identity protected.\n- This product uses the Tor distributed networks is produced independently from the Tor(r) anonymity software and carries no guarantee from The Tor Project about quality, suitability or anything else","torrent":{"xt":"urn:btih:019ddccfe0c993f2172fd1550202e2640574994d","amp;dn":"Red+Browser+V+1.8.0.ipa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"019ddccfe0c993f2172fd1550202e2640574994d","infoHashBuffer":{"type":"Buffer","data":[1,157,220,207,224,201,147,242,23,47,209,85,2,2,226,100,5,116,153,77]},"announce":[],"urlList":[]}}