{"title":"Earthsiege","uid":10238320,"size":26417439,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:01d1225813a9f197f21f21ab2a3cab619e5c7e0b&amp;dn=Earthsiege&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"btgbullseye","files":-1,"time":1401214102,"description":"Metaltech: Earthsiege is a mecha-style simulation video game developed by Dynamix and FASA Corporation and released in 1994. Earthsiege is the first in a long line of video games in the Earthsiege universe, which contains Earthsiege 2 (1995) and Metaltech: Battledrome (1995), as well as action game Hunter Hunted (1996), strategy games MissionForce: CyberStorm (1997) and Cyberstorm 2: Corporate Wars (1998), direct sequel mecha-simulation Starsiege (1999), and first-person shooters Starsiege: Tribes (1999), Tribes 2 (2001), Tribes: Vengeance (2004) and Tribes: Ascend (2012).\n\nIn Earthsiege, players are placed in the cockpit of various massive bipedal war machines known as HERCULANs (Humaniform-Emulation Roboticized Combat Unit with Leg-Articulated Navigation) (or 'HERCs' for short). Set in the 25th or 26th century, Earthsiege is a technologically advanced setting with many futuristic weapons and vehicles. Earthsiege takes place across North America, South America, Antarctica, and Asia.\n\n--------------------------------------\n\nGameplay in Earthsiege consists of piloting the mecha-style Hercs in combat against opposing Hercs. The Herc can be steered with a keyboard or joystick, though some controls are only found on the keyboard. The mouse can be used to interact with the various buttons in the cockpit.\n\nHercs battle with various ranged and projectile weapons, including lasers, missiles, and autocannons. They offer rechargeable shields and armor plating for defense. When the shields are depleted, armor begins taking damage; when armor is low, internal components can take damage, and weapons and even limbs can be destroyed. A Herc that has lost a leg is immediately incapacitated, leaving more salvage (in the form of scrap metal and weapons) for the player.\n\nOutside of battle, the player manages his squad's Hercs and resources. The player selects the weapons mounted on each Herc, and can repair existing Hercs and weapons, as well as build new ones, with scrap metal. Additionally, the player can bring up to three squad mates along on missions. Squad mates can be assigned Hercs before the mission beings, and during a mission they can be issued basic orders. As squad mates complete more missions, their skills and rank rise.\n\n--------------------------------------\n\nTwenty years have passed since the Cybrid Overthrow. Humanity still lingers, and the Resistance is growing in strength. Using hit-and-run tactics against the machines, the survivors have managed to survive and even capture Cybrid weapons and equipment.\n\nThe whole game has at minimum of 5 campaigns of about 7 missions each. Success and failure of the missions might trigger secondary missions and campaigns to rectify previous failures, all in all resulting in 45 missions in 8 campaigns.\n\n__________________________________________________________________\n\n\nThis is a straight rip from my disk that I've had for nearly 20 years. No known copy protection.\n\nMount with Daemon Tools/Alcohol, or burn to disk.","torrent":{"xt":"urn:btih:01d1225813a9f197f21f21ab2a3cab619e5c7e0b","amp;dn":"Earthsiege","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01d1225813a9f197f21f21ab2a3cab619e5c7e0b","infoHashBuffer":{"type":"Buffer","data":[1,209,34,88,19,169,241,151,242,31,33,171,42,60,171,97,158,92,126,11]},"announce":[],"urlList":[]}}