{"title":"Dracula's Daughter .mkv","uid":11145069,"size":734607614,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:01dc6a8403650ce241bd9b81fa537812b6d839e4&amp;dn=Dracula%27s+Daughter+.mkv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"strawberry5","files":-1,"time":1412246296,"description":"Dracula's Daughter (1936)\n\nHungarian countess Marya Zaleska seeks the aid of a noted psychiatrist, in hopes of freeing herself of a mysterious evil influence.\n\nRight after the success of James Whale's &quot;Bride of Frankenstein&quot; (sequel to &quot;Frankenstein&quot;, also directed by Whale), Universal Studios decided to make a sequel to their other horror classic film, Tod Browning's &quot;Dracula&quot;. Story says that the studio chose Whale again for the project, but his script proved to be too outrageous and subversive that was immediately rejected. It would be Garret Fort, writer of the first &quot;Dracula&quot;, who would give flesh to the sequel's screenplay and the experienced director Lambert Hillyer was set to direct it. Like &quot;Bride&quot;, this sequel would be focused on a feminine version of the previous monster; it's name, &quot;Dracula's Daughter&quot;.\n\nThe film starts right after the original ends, with Count Dracula killed by Professor Van Helsing (Edward Van Sloan), however, to his misfortune, he is arrested for the murder of the Transylvanian nobleman and sent to prison as nobody believes he killed an ancient vampire. Realizing that nobody will believe him, Van Helsing asks the help of his dear friend, Dr. Jeffrey Garth (Otto Kruger), a former student of his who has become a prominent psychiatrist. While this events happen, a mysterious woman steals Dracula's body and a new series of murders start, complicating Van Helsing's defense and Garth's investigation. To make things worse, Countess Marya Zaleska (Gloria Holden) arrives and her seductive charms will prove too strong for Garth to resist them.\n\nUnlike &quot;Frankenstein&quot;, where there was still material in the source novel to build up a sequel; in &quot;Dracula&quot;'s case things get complicated, as the monster is effectively killed at the end. However, Garret Fort builds up an original story of mystery, horror and even nods to screwball comedy. &quot;Dracula's Daughter&quot;'s themes of betrayal, deception, and the quest for redemption are dark indeed, but Fort manages to add some light-hearted moments that break the suspense in an appropriate manner. Another highlight is that the vampire's sex appeal is enhanced and explored even further than posterior sequels of the now-franchise.\n\nDirector Lambert Hillyer had a big experience directing many low-budget films, ranging from westerns to crime dramas, so he was used to work with similar budget constrains. The movie's strength is in its story, and Hillyer knew it, so he keeps a simple yet very effective style that, while nothing too impressive, manages to create the perfect atmosphere for the plot. With nothing more than his well assembled cast and Fort's excellent screenplay, he conceives a film that maybe won't be remembered as influential, but will surely tell its story properly and deliver what it promises.\n\nThe cast is vital in this film, as their job is what sets apart the film from other Universal sequels. Otto Kruger is a very good lead actor, with nice looks and an ease for this kind of characters. He has great chemistry with both Gloria Holden and Marguerite Churchill and his performance is one of the film's highlights. Holden portrays the seductive Countess with power and grace in a complicated role as her character is at the same time dominated by a strong sex appeal and a sad and tragic fate. Churchill is superb in her comedy role, and more than mere comic relief, she adds the touch of screwball comedy to the film, giving her energy and charm. And finally, Edward Van Sloan returns as the experienced Van Helsing, and while his role here is more as a spiritual guide to Kruger, he gives another fine performance.\n\nThe film's main weakness is without a doubt its low-budget, that not only forced the choice of Hillyer as a director, but it also made it have less production values than other sequels. In a way, this may had been of help, as Hillyer's style bends together perfectly with low-budget projects and also gave the film a look closer to crime melodrama, which was rising in popularity at the time. Sure, Bela Lugosi is definitely missed, but &quot;Dracula's Daughter&quot; makes up for his absence with a witty (and bold for its time) screenplay and a well-assembled cast.\n\nTime has left this film unappreciated, but there is a lot in there to praise, and while nowhere near the best of the Classic Universal Horror films, &quot;Dracula's Daughter&quot; is better than many of the films of its time, and an essential viewing \nfor any fan of Gothic horror. 7/10\n\n\nCopyright Disclaimer: Under Section 107 of the Copyright Act 1976, allowance is made for fair-use purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use, tips the balance in favour of fair use. \n","torrent":{"xt":"urn:btih:01dc6a8403650ce241bd9b81fa537812b6d839e4","amp;dn":"Dracula%27s+Daughter+.mkv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01dc6a8403650ce241bd9b81fa537812b6d839e4","infoHashBuffer":{"type":"Buffer","data":[1,220,106,132,3,101,12,226,65,189,155,129,250,83,120,18,182,216,57,228]},"announce":[],"urlList":[]}}