{"title":"The Book of Names by Jill Gregory &amp; Karen Tintori","uid":9665408,"size":492626,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:03126dad329f2b4d1a830cadfe6c5897f77eb407&amp;dn=The+Book+of+Names+by+Jill+Gregory+%26amp%3B+Karen+Tintori&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"PirateBook","files":1,"time":1393369032,"description":"\nWithin each generation, there are thirty-six righteous souls. Their lives hold the key to the fate of the world. Now someone wants them dead.\n\nWhen a childhood tragedy comes back to haunt Professor David Shepherd, he finds himself in possession of knowledge that holds the world in a delicate balance. He uncovers the Book of Names---an ancient text originating with the biblical Adam, and thought lost to history forever. \n\nBy Kabbalistic tradition, the book contains the names of each generation's thirty-six righteous souls---the Hidden Ones---by whose merits alone the world continues to exist. Legend holds that if all thirty-six Hidden Ones were eliminated, the world would meet its end.\n\nWhen the Hidden Ones start dying of unnatural causes, the world grows increasingly unstable: war in Afghanistan, massive flooding in New York, brutal terrorist attacks in Melbourne, a tanker explosion in Iran. David finds himself battling against the Gnoseos, a secret religious sect whose goal is to destroy the world by eliminating all of the righteous souls. \n\nDavid's involvement quickly turns personal when his stepdaughter's name is discovered to be one of the endangered. With the help of a brilliant and beautiful Israeli ancient texts expert, David races to decipher the traditions of the Kabbalah to save the righteous souls, his stepdaughter, and perhaps the world.\n\nGenre: Fiction, Thriller","torrent":{"xt":"urn:btih:03126dad329f2b4d1a830cadfe6c5897f77eb407","amp;dn":"The+Book+of+Names+by+Jill+Gregory+%26amp%3B+Karen+Tintori","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03126dad329f2b4d1a830cadfe6c5897f77eb407","infoHashBuffer":{"type":"Buffer","data":[3,18,109,173,50,159,43,77,26,131,12,173,254,108,88,151,247,126,180,7]},"announce":[],"urlList":[]}}