{"title":"The Bible, Old and New Testaments, King James Version [republicV","uid":7795059,"size":8705180,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:03c78ca83ec9e9f1b63f1d6056b3b3b7ccfff590&amp;dn=The+Bible%2C+Old+and+New+Testaments%2C+King+James+Version+%5BrepublicV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"republicV","files":-1,"time":1352122816,"description":"The Authorized Version, commonly known as the King James Version, the King James Bible or simply the KJV, is an English translation by the Church of England of the Christian Bible begun in 1604 and completed in 1611. First printed by the King's Printer, Robert Barker, this was the third such official translation into English; the first having been the Great Bible commissioned by the Church of England in the reign of King Henry VIII, and the second having been the Bishop's Bible of 1568. In January 1604, King James I of England convened the Hampton Court Conference where a new English version was conceived in response to the perceived problems of the earlier translations as detected by the Puritans, a faction within the Church of England.\nJames gave the translators instructions intended to guarantee that the new version would conform to the ecclesiology and reflect the episcopal structure of the Church of England and its beliefs about an ordained clergy. The translation was by 47 scholars, all of whom were members of the Church of England. In common with most other translations of the period, the New Testament was translated from Greek, the Old Testament was translated from Hebrew text, while the Apocrypha were translated from the Greek and Latin.\nIn the Book of Common Prayer (1662), the text of the Authorized Version replaced the text of the Great Bible - for Epistle and Gospel readings - and as such was authorized by Act of Parliament. By the first half of the 18th century, the Authorized Version was effectively unchallenged as the English translation used in Anglican and other Protestant churches. Over the course of the 18th century, the Authorized Version supplanted the Latin Vulgate as the standard version of scripture for English speaking scholars.","torrent":{"xt":"urn:btih:03c78ca83ec9e9f1b63f1d6056b3b3b7ccfff590","amp;dn":"The+Bible%2C+Old+and+New+Testaments%2C+King+James+Version+%5BrepublicV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03c78ca83ec9e9f1b63f1d6056b3b3b7ccfff590","infoHashBuffer":{"type":"Buffer","data":[3,199,140,168,62,201,233,241,182,63,29,96,86,179,179,183,204,255,245,144]},"announce":[],"urlList":[]}}