{"title":"De Bijbel David DVD NL (dvd5)(Nl subs) RETAIL TBS","uid":6731371,"size":4681320615,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:0423070e8f5c37abf5330b4650899ed7fabc07ed&amp;dn=De+Bijbel+David+DVD+NL+%28dvd5%29%28Nl+subs%29+RETAIL+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Sammynet","files":19,"time":1318169726,"description":"Nederlands\nDavid\nDavid, van schaapherder tot koning. Een van de bekendste verhalen uit de Bijbel is dat van David, de tenger gebouwde herdersjongen, die de enorme reus Goliath velt met een steentje uit zijn slinger. David is jong, knap en bereid om voor de zaak-van-God te strijden. Bovendien is hij muzikaal. Hij bespeelde zijn harp zo fraai dat zelfs een geesteszieke man als koning Saul ervan tot rust kwam. David was een mens naar Gods hart van de Bijvelvertellers. Maar wat te denken van diezelfde David, doe Sauls vrouw afpakt? Die de koningsdochter Michal manipuleert? Die heult met de aartsvijanden van Israel en generaal Abner tot overlopen uitdaagt? Die zijn buurvrouw Bathseba verleidt en haar man om het leven laat brengen als zij zwanger blijkt te zijn van David? Door deze beide kanten van David naast elkaar te zetten krijgen we een beeld van een bijzonder mens, een man van vlees en bloed.\n\nFilm informatie\nDuur        : 180 min\nMedia       : DVD\nTaal        : Engels\nOndertitels : Nederland\n\nEngels\nDavid\nThe tribes of Israel need to defeat the superior might of the Philistines: &quot;Now appoint a king to lead us, such as all the other nations have.&quot; (I Samuel, 8:5). And so the prophet Samuel gives the Hebrews their first king, Saul, a simple farmer, who with God's help becomes a brave and mighty warlord who leads the united tribes of Israel against their enemies. Saul, however, has incessant doubts about his mission. Not trustful enough of divine wisdom, he acts of his own accord and thus sins against the Lord. The influential prophet Samuel turns away from Saul in order to select a new king according to God's will: David. He is still a young boy, tending sheep in the fields, when, secretly Samuel oints him as the next king of the Israelites. When David - as courageous as he is intelligent - emerges victorious from his encounter with Goliath, the Philistines' most powerful warrior\n\n &lt;a href=&quot;\nhttp://www.christelijkevideotheek.nl/film/De_Bijbel:_David/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.christelijkevideotheek.nl/film/De_Bijbel:_David/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0118933/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0118933/&lt;/a&gt;","torrent":{"xt":"urn:btih:0423070e8f5c37abf5330b4650899ed7fabc07ed","amp;dn":"De+Bijbel+David+DVD+NL+%28dvd5%29%28Nl+subs%29+RETAIL+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0423070e8f5c37abf5330b4650899ed7fabc07ed","infoHashBuffer":{"type":"Buffer","data":[4,35,7,14,143,92,55,171,245,51,11,70,80,137,158,215,250,188,7,237]},"announce":[],"urlList":[]}}