{"title":"Uncommon Sense: Out of the Box Thinking for An In the Box World","uid":8692585,"size":7164414,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:04e0b672177cb7ac963931507296c5281e495fd3&amp;dn=Uncommon+Sense%3A+Out+of+the+Box+Thinking+for+An+In+the+Box+World&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Djofullinn","files":1,"time":1373909149,"description":"&quot;Peter Cochrane is one of our most far-sighted visionaries, and brings brilliant clarity and focus to our understanding of ourselves and our technologies, and of how profoundly each is transforming the other.&quot; -Douglas Adams, Author, The Hitch Hiker's Guide to the Galaxy\n\nIn Uncommon Sense, Peter Cochrane's follow up to the radical 108 Tips for Time Traveller, Peter explains how very simple analysis allows the prediction of such debacles as the 3G auction and the subsequent collapse of an industry, whilst simple-minded thinking is dangerous in the context of a world that is predominantly chaotic and out of control.\n\nPeople balked when Peter suggested a wholesale move to eWorking, the rise of email and text messaging, and the dotcom regime mirroring the boom and bust cycle of the industrial revolution. His predictions of the use and growth of mobile devices and communication, or use of chip implants for humans to replace ID cards, passports, and medical records, or iris scanners and fingerprint readers - were all seen as unlikely. Today they are a reality.\n\nHow then will the world react to his predictions as set out in Uncommon Sense of a networked world of distributed ignorance and sharing overcoming an old world of concentrated skill and control? To everything becoming 'Napsterised' in every dimension, where storage and processing power cost nothing, and become connected without the help of the old network companies? A world where individuals create their own networks, where laws of copyright and resale, and old business models have to be changed as giant industries are dragged kicking and screaming out of the 19th Century and into the 21st?\n\nPeter Cochrane poses and answers questions, suggests solutions, and raises red flags on issues that need to be addressed. Tables, diagrams, pictures and illustrations generously support all of the text, with the most difficult aspects illustrated by simulations and other material on a CD and links to a web site with an ongoing expansion of the themes addressed.\n &lt;a href=&quot;\nhttp://www.amazon.com/Uncommon-Sense-Out-Thinking-World/dp/184112477X/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1373901856&amp;sr=1-1&amp;keywords=uncommon+sense&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Uncommon-Sense-Out-Thinking-World/dp/184112477X/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1373901856&amp;sr=1-1&amp;keywords=uncommon+sense&lt;/a&gt;","torrent":{"xt":"urn:btih:04e0b672177cb7ac963931507296c5281e495fd3","amp;dn":"Uncommon+Sense%3A+Out+of+the+Box+Thinking+for+An+In+the+Box+World","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04e0b672177cb7ac963931507296c5281e495fd3","infoHashBuffer":{"type":"Buffer","data":[4,224,182,114,23,124,183,172,150,57,49,80,114,150,197,40,30,73,95,211]},"announce":[],"urlList":[]}}