{"title":"Walk.Hard.The.Dewey.Cox.Story.(Unrated).1080p.AC3(DD).5.1ch.Blu-","uid":4863343,"size":4302879065,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:0606c2aaa0765dec8b850b7da775ea616b4164b7&amp;dn=Walk.Hard.The.Dewey.Cox.Story.%28Unrated%29.1080p.AC3%28DD%29.5.1ch.Blu-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":4,"uploader":"brickop","files":4,"time":1240356459,"description":"**Bricktop HD for PS3**  \n\nThis is meant for playback on PS3 i dont believe it will work with XBOX.\nThis file is kept under 4 gigs for easy storage (Dang FAT32!)\n\nWalk Hard &quot;The Dewey Cox Story&quot;(Unrated) (2007)\nJudd Apatow and Jake Kasdan team up to take the swagger out of the traditional music biopic with this look at the troubled life of fictional music legend Dewey Cox (John C. Reilly). Apatow and Kasdan both write and produce, while Freaks and Geeks and Orange County director Kasdan steps into the director's chair. Dewey Cox is a rock &amp; roll legend whose songs have the power to shake a nation. Despite the fact that Cox's career has been something of a roller coaster ride, the fact remains that he never went out of style in the eyes of his many adoring fans. He's rubbed elbows with everyone from Elvis Presley to the Beatles, ingested every drug known to man (often in doses large enough to kill a healthy horse), starred in his own television show, and slept with hundreds of women, yet somehow he still finds the time to write some of the best-known songs ever to hit the airwaves. Now, after being married multiple times and fathering enough offspring to populate a small island nation, this musical icon continues to turn out the hits while attempting to win the heart of his beautiful backup singer Darlene (Jenna Fischer). While no one doubts that Dewey Cox will continue to dominate the airwaves, does this larger-than-life superstar really have what it takes to avoid the temptations of the rock &amp; roll lifestyle and finally settle down with one woman?\n\n\n\n\n\n\nCodec..........: H.264\nResolution.....: 1920x1080\nBitrate........: 4.2 Mbps\nFramerate......: 24fps\nAudio..........: AC3 Dolby Digital 5.1CH Surround (448Kb)\nSubtitles......: None\nExtension......: M2TS\n\n\nPlease if you like the movie PLEASE SEED it so others can enjoy it to.\n\n","torrent":{"xt":"urn:btih:0606c2aaa0765dec8b850b7da775ea616b4164b7","amp;dn":"Walk.Hard.The.Dewey.Cox.Story.%28Unrated%29.1080p.AC3%28DD%29.5.1ch.Blu-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0606c2aaa0765dec8b850b7da775ea616b4164b7","infoHashBuffer":{"type":"Buffer","data":[6,6,194,170,160,118,93,236,139,133,11,125,167,117,234,97,107,65,100,183]},"announce":[],"urlList":[]}}