{"title":"Coast to Coast Am June 25, 2013 - Snowden &amp; Hastings Pleiadi","uid":8636269,"size":56434669,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:06215cb605d8a7c9c1a742f3601ded3197c33b58&amp;dn=Coast+to+Coast+Am+June+25%2C+2013+-+Snowden+%26amp%3B+Hastings+Pleiadi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pyramid91","files":5,"time":1372755911,"description":"MP3 version wins!\nCourtesy of Coast to Coast Am's wonderful  &quot;Coast Insider&quot; service!\nShow description:\n\nDate:\n06-25-13\nHost:\nGeorge Noory\nGuests:\nAlex  Jones,                   Christine  Day\nIn the first half, documentary filmmaker and alternative media activist Alex Jones spoke about the Edward Snowden case, the death of journalist Michael Hastings, the recent Bilderberg meeting, and related topics. Hastings told a friend that he was working on &quot;the biggest story yet&quot; about the CIA, just before his fatal car accident. Jones suggested that foul play such as a car bomb might have been involved, as witnesses saw the car blowing up before it went off the road and hit a tree. There has also been speculation it could have been a kind of cyber attack into the computer system of Hastings' car. In Hastings' last interview he said that the government had declared war on the press, and we're going into tyranny, Jones recounted. \nSnowden's revelations about NSA spying are not treason, Jones declared. The 4th amendment calls for people to be secure in their person, papers, and effects, against unreasonable searches and seizures-- it is treason to violate the Bill of Rights, he added. What do you think about Snowden? Take the C2C Insta-Poll. Jones noted that press coverage has steadily increased over the years of the annual Bilderberg meeting (this year held in Watford, UK), casting a light on their secretive proceedings, and the British Prime Minister arrived publicly for the first time. The idea that world leaders are meeting in secret, and setting policy was criticized in Parliament a week after the conference, he added. \n-----------------------------------------\nIn the latter half, &quot;Pleiadian Ambassador,&quot; Christine Day, talked about how she's spent years traveling the world helping people connect with the Pleiadians, Lemurians and spiritual realms that offer assistance in our lives. She described walking near a meadow in 1993 and seeing a huge spaceship, at which point she began telepathically communicating with Pleiadian beings and was filled with an incredible light. At that moment, she recalled her full memory of her Pleiadian heritage and her mission here on Earth-- to act as a bridge between humans and Pleiadians. She further believes that her spiritual awakening with the alien entities allowed her to heal herself of advanced Systemic Lupus, a condition doctors told her was terminal. \nThe Pleiadians informed her that Earth is undergoing an enormous transformation, a kind of birthing process shifting into a higher dimension. During this process, the planet is going through a lot of upheaval such as extreme weather, and humans are evolving via a crystalline structure that is changing our bodies, she explained. The crystalline structure is anchored between the cells of our body, and is creating a new kind of electrical system, she continued. Day also spoke about the significance of crop circles-- there are energetic or ley lines forming between the crop formations and megalithic sites, &quot;and this is creating a sacred webbing or energetic womb around our earth plane that is supporting the birthing of our planet,&quot; into the higher dimension. \nNews segment guests: Catherine Austin Fitts, Peter Davenport \nWebsite(s):\n christinedayonline.com\n\n prisonplanet.com\nVideo(s):\n Endgame\nBook(s):\n Pleiadian Initiations of Light\n Pleiadian Principles for Living\n  9-11: Descent into Tryanny\n","torrent":{"xt":"urn:btih:06215cb605d8a7c9c1a742f3601ded3197c33b58","amp;dn":"Coast+to+Coast+Am+June+25%2C+2013+-+Snowden+%26amp%3B+Hastings+Pleiadi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06215cb605d8a7c9c1a742f3601ded3197c33b58","infoHashBuffer":{"type":"Buffer","data":[6,33,92,182,5,216,167,201,193,167,66,243,96,29,237,49,151,195,59,88]},"announce":[],"urlList":[]}}