{"title":"Steve Reich - Music for sicians","uid":6395272,"size":119802430,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:06313912ba52c92bbfbb50b28ebef09e65ced91d&amp;dn=+Steve+Reich+-+Music+for+sicians&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"nuovonadrachal","files":2,"time":1305502341,"description":"Format: Musepack\n\nIf Steve Reich's Music for 18 Musicians is simply described in terms of its materials and organization -- 11 chords followed by 11 pieces built on those chords -- then it might seem utterly dry and monotonous. The actual music, though, is far from lackluster. When this recording was released in 1978, the impact on the new music scene was immediate and overwhelming. Anyone who saw potential in minimalism and had hoped for a major breakthrough piece found it here. The beauty of its pulsing added-note harmonies and the sustained power and precision of the performance were the music's salient features; and instead of the sterile, electronic sound usually associated with minimalism, the music's warm resonance was a welcome change. Yet repeated listening brought out a subtle and important shift in Reich's conception: the patterns were no longer static repetitions moving in and out of phase with each other, but were now flexible units that grew organically and changed incrementally over the course of the work. This discovery indicated a promising new direction for Reich, one that put him ahead of his peers by giving his music greater interest and adaptability and led to the more elaborate works of the next two decades.\nReview by Blair Sanderson (amazon.com)\n\nMore info at https://secure.wikimedia.org/wikipedia/en/wiki/Music_for_18_Musicians","torrent":{"xt":"urn:btih:06313912ba52c92bbfbb50b28ebef09e65ced91d","amp;dn":"+Steve+Reich+-+Music+for+sicians","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06313912ba52c92bbfbb50b28ebef09e65ced91d","infoHashBuffer":{"type":"Buffer","data":[6,49,57,18,186,82,201,43,191,187,80,178,142,190,240,158,101,206,217,29]},"announce":[],"urlList":[]}}