{"title":"Rock n Roll (my) Best 500","uid":8728704,"size":4153751176,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:0634db7c45d709e55e5d4f642a01e52ce8299582&amp;dn=Rock+n+Roll+%28my%29+Best+500&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"paberu","files":500,"time":1374555679,"description":"Compilation of my favorite Rock songs from the 60s to now. Includes songs by the following artists.\n\nAC/DC, Airbourne, Alice Cooper, Bad English, The Beatles, Bee Gees, Billy Idol, Billy Joel, Blondie, Bob Dylan, Bon Jovi, Boston, Bruce Springsteen, Bryan Adams, Cat Stevens, Chuck Berry, The Clash, Damn Yankees, David Bowie, Def Leppard, Derek and the Dominoes, The Doors, E.L.O., Eagles, Eric Clapton, Fleetwood Mac, Foo Fighters, Gnarls Barkley, Guns n' Roses, Iggy Pop, INXS, Iron Maiden, Janis Joplin, Jimi Hendrix, Joan Jett, Joe Esposito, Journey, Kansas, Kid Rock, The Killers, Kiss, Led Zeppelin, Lenny Kravitz, Lynyrd Skynyrd, Metallica, Motley Crue, Mr. Big, Nickelback, The Outfield, Pearl Jam, Phil Collins, Pink Floyd, Poison, The Police, Queen, R.E.M., Ratt, Rick Springfield, Robbie Williams, Rod Stewart, The Rolling Stones, Roxette, Sammy Hagar, Scorpions, Steppenwolf, Styx, Tom Petty and The Heartbreakers, Twisted Sister, U2, Van Halen, Van Morrison, Velvet Revolver, Whitesnake, The Who, ZZ Top, 4 Non Blondes\n","torrent":{"xt":"urn:btih:0634db7c45d709e55e5d4f642a01e52ce8299582","amp;dn":"Rock+n+Roll+%28my%29+Best+500","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0634db7c45d709e55e5d4f642a01e52ce8299582","infoHashBuffer":{"type":"Buffer","data":[6,52,219,124,69,215,9,229,94,93,79,100,42,1,229,44,232,41,149,130]},"announce":[],"urlList":[]}}