{"title":"[PDF] [1999] Ceramics and Ceramic Composites Materialographic Pr","uid":6446706,"size":12841799,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:067b25281e1e24fa31ac8e728cfacd5d49a27924&amp;dn=%5BPDF%5D+%5B1999%5D+Ceramics+and+Ceramic+Composites+Materialographic+Pr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"lyndavilla","files":2,"time":1307292979,"description":"DOWNLOAD MORE EBOOKS, MAGAZINES, &amp; PDFS:\n  &lt;a href=&quot;\nhttp://buyabook.ws/download-ebooks-magazines-pdfs-more/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://buyabook.ws/download-ebooks-magazines-pdfs-more/&lt;/a&gt;\n\nBOOK INFO:\n\nCeramics and ceramic composites are now used in almost all areas of technology and have potential for even greater and more widespread applications. To make this a reality, it is increasingly necessary to understand the microstructure of the material and its relationship with properties and performance. Central to this is the characterization of the material, in particular using optical and scanning electron microscopy techniques.\nThis book acts as an expert guide to the various steps necessary for successful and accurate characterization of these materials including the crucially important preparation stage, the techniques used to reveal the microstructure and the analysis of the results.\nIn particular, the book presents fundamental information on preparing polished sections of ceramics and ceramic composites including the main steps of sampling, sectioning, mounting and impregnation, and mechanical grinding, lapping and polishing. It discusses microstructural imaging in the optical microscope (OM) and the use of the scanning electron microscope (SEM). Etching or contrast enhancement following final polishing in order to reveal the material's microstructure is also covered.\nAn entire chapter is devoted to material-specific preparation procedures for polished sections. These procedures take into account the properties of the ceramic or composite being examined and the purpose of the examination. They have proven to be very suitable for the respective materials and are effective for revealing the pores. The examples presented here for ceramics and ceramic composites provide polished sections of good to excellent quality for routine examination under the optical microscope. They include tips for etching and contrast enhancement, as well as microstructural images. Chapter 5 discusses the preparation of polished sections for purposes of examination and contains information on producing oblique sections and controlled removal of material. It also addresses the production of thin sections. \n\nAs a complement to the examination of the microstructure, chapter 6 provides insight into the evaluation of hardness testing indentations. Chapter 7 concludes this work with an overview of the technical literature.","torrent":{"xt":"urn:btih:067b25281e1e24fa31ac8e728cfacd5d49a27924","amp;dn":"%5BPDF%5D+%5B1999%5D+Ceramics+and+Ceramic+Composites+Materialographic+Pr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"067b25281e1e24fa31ac8e728cfacd5d49a27924","infoHashBuffer":{"type":"Buffer","data":[6,123,37,40,30,30,36,250,49,172,142,114,140,250,205,93,73,162,121,36]},"announce":[],"urlList":[]}}