{"title":"The Evidence-based Guide to Antipsychotic Medications{BBS}","uid":6791028,"size":3103997,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:069cb91d88633de754d80638b7b32eb66f8ce8d1&amp;dn=The+Evidence-based+Guide+to+Antipsychotic+Medications%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1320265233,"description":"The first in a new series, The Evidence-Based Guide to Antipsychotic Medications, is a table-rich, comprehensive overview of our current knowledge regarding the use of antipsychotic medications to treat a broad range of psychiatric conditions, from mood and anxiety disorders to schizophrenia. Coverage includes not only FDA-approved usage but also off-label uses of both time-tested and newer medications. Central to the volume s clinical utility are two standout features: Key Clinical Points and the Appendixes. The former are located at the end of each chapter and consist of the most critical knowledge to be gleaned from that section. The latter represent a storehouse of useful information, including drug tables (names, strengths, formulations, pharmacokinetics, and dosing); advice on initiating and monitoring antipsychotic medications; common side effects and their management; and special considerations for use during pregnancy and breastfeeding. The Evidence-Based Guide to Antipsychotic Medications has synthesized an enormous amount of medical literature and clinical experience to create a concise, yet comprehensive guide for busy clinicians and advanced students that is rigorous, yet reader-friendly.\n\n\n# Paperback: 371 pages\n# Publisher: American Psychiatric Publishing, Inc.; 1 edition (December 9, 2009)\n# Language: English\n# ISBN-10: 1585623660\n# ISBN-13: 978-1585623662","torrent":{"xt":"urn:btih:069cb91d88633de754d80638b7b32eb66f8ce8d1","amp;dn":"The+Evidence-based+Guide+to+Antipsychotic+Medications%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"069cb91d88633de754d80638b7b32eb66f8ce8d1","infoHashBuffer":{"type":"Buffer","data":[6,156,185,29,136,99,61,231,84,216,6,56,183,179,46,182,111,140,232,209]},"announce":[],"urlList":[]}}