{"title":"Bartholomew - Hidden Nature - The Startling Insights of Viktor S","uid":3494262,"size":10800334,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:06d6e99ee9f6c5b23a82f19860daf6b6ad347ed4&amp;dn=Bartholomew+-+Hidden+Nature+-+The+Startling+Insights+of+Viktor+S&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"red_gonzo","files":1,"time":1149937816,"description":"This is Alick Bartholomew&amp;#039;s amazing book Hidden Nature - The Startling Insights of Viktor Schauberger (2003) which puts out Schauberger&amp;#039;s ideas in a simple, easy to read and understandable way. Schauberger, a famous austrian natural philosopher, predicted the ecological catastrophes which are occuring all around us and proposed the solution - return to the principles of mother nature. The author explains these, offering a vital key to understanding where our culture has gone wrong, and how we could put things right again. In Hidden Nature he uncovers Schauberger&amp;#039;s vision of transforming our machinery to work in a vortex-like fashion like it happens in nature. This fascinating book is a comprehensive breakdown of Viktor Schauberger&amp;#039;s stunning ideas and observations. 260 pages, many pictures. A must read for everyone.\n\nFrom the backcover:\nViktor Schauberger was a pioneer of the study of the subtle energies in nature and the importance of living water in all natural processes. This book describes and explains his insights in contemporary, accessible language. His amazing discoveries ? which address issues such as sick water, ailing forests, climate change and, above all, renewable energy ? have dramatic implications for how we should work with nature and its resources. Protesting against the harmful effects of modern technology, Schauberger demonstrated radically new methods of working in harmony with nature&amp;#039;s own energies. He applied his theories to many revolutionary designs, culminating in prototypes for pollution-free energy machines. Schauberger (1885-1958) was far ahead of his time. From his unusually detailed observations of the natural world, he pioneered a ompletely new understanding of how nature works. He foresaw, and tried to warn against, the global waste and costly ecological destruction of our age.\n\nAbout the author:\nAlick Bartholomew read Geology and Geography at the University of Cambridge, followed by graduate studies at the University of Chicago. He has commissioned and published many books on Viktor Schauberger and has been working with Schauberger material for over twenty years.\n","torrent":{"xt":"urn:btih:06d6e99ee9f6c5b23a82f19860daf6b6ad347ed4","amp;dn":"Bartholomew+-+Hidden+Nature+-+The+Startling+Insights+of+Viktor+S","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06d6e99ee9f6c5b23a82f19860daf6b6ad347ed4","infoHashBuffer":{"type":"Buffer","data":[6,214,233,158,233,246,197,178,58,130,241,152,96,218,246,182,173,52,126,212]},"announce":[],"urlList":[]}}