{"title":"What the Customer Wants You to Know ,Ram Charan,Epub,Qwerty80","uid":7976329,"size":546338,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:075f2ba4e3285863e19987482ade00ec9481121f&amp;dn=What+the+Customer+Wants+You+to+Know+%2CRam+Charan%2CEpub%2CQwerty80&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"KatQwerty","files":3,"time":1356997541,"description":"\n \n \nFrom the bestselling author of What the CEO Wants You to Know?how to rethink sales from the outside in\n \n \n?We have to face the truth: the process of selling is broken. Customers have more choices and are under intense pressure. Yet few companies are facing this reality. When they don?t, a lingering malaise sets in.?\n \n \nMore than ever these days, the sales process tends to be a war about price?a frustrating, unpleasant war that takes all the fun out of selling.\n \n \nBut there?s a better way to think about sales, says bestselling author Ram Charan, who is famous for clarifying and simplifying difficult business problems. What the customer wants you to know is how his or her business works, so you can help make it work better. It sounds simple, but there?s a catch: you won?t be able to do that with your traditional sales approach.\n \n \nInstead of starting with your product or service, start with your customer?s problems. Focus on becoming your customer?s trusted partner, someone he can turn to for creative, cost-effective solutions that are based on your deep knowledge of his values, goals, problems, and customers.\n \n \nThis book defines a new approach to selling?which Charan calls value creation selling?that while radical is nonetheless practical. VCS has been battle-tested in companies in a variety of industries, such as Unifi, Mead-Westvaco, and Thomson Financial. \n\n[b]\nIt will enable you to:\n\n\n? Gain a deeper knowledge of your customer?s problems\n? Understand how your customer?s company really makes decisions\n? Help your customer improve margins and drive revenue growth\n? Connect sales with other key functions such as finance and manufacturing\n? Come up with new customized offerings\n? Make price much less of an issue\n[/b] \n \nVCS gets you out of the hell of commoditization and low prices. It differentiates you from the competition, paving the way to better pricing, better margins, and higher revenue growth, built on win-win relationships that deepen over time.\n\nSomeday, every company will listen more closely to the customer, and every manager will realize that sales is everyone?s business, not just the sales department?s. In the meantime, this eye-opening book will show you how to get started.\n ","torrent":{"xt":"urn:btih:075f2ba4e3285863e19987482ade00ec9481121f","amp;dn":"What+the+Customer+Wants+You+to+Know+%2CRam+Charan%2CEpub%2CQwerty80","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"075f2ba4e3285863e19987482ade00ec9481121f","infoHashBuffer":{"type":"Buffer","data":[7,95,43,164,227,40,88,99,225,153,135,72,42,222,0,236,148,129,18,31]},"announce":[],"urlList":[]}}