{"title":"Paul Dukas - Orchestral Works - NRPO, Jean Fournet (1993)","uid":13379976,"size":400296174,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:078887de15424a441aacb39b9eb5f69724dfe5ac&amp;dn=Paul+Dukas+-+Orchestral+Works+-+NRPO%2C+Jean+Fournet+%281993%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Scheheraz","files":25,"time":1454268176,"description":"PAUL DUKAS (1865-1935)\r\nL'Apprenti sorcier • La Péri • Symphony in C Major\r\n\r\nGramophone [6/1993]:\r\n&quot;The appearance of this disc was well timed to mark the eightieth birthday on April 18th of Jean Fournet who, after a dozen years at the Opera-Comique, was Musical Director of the Netherlands Radio Philharmonic throughout the 1960s and 1970s. The magnificently sonorous introductory fanfare to La Péri immediately makes it plain that he is able to draw the best from his old orchestra, who play splendidly throughout for him. If one were tempted to ask whether, with 30 versions already in the current catalogue, another Apprenti sorcier was needed, the answer is supplied in this magisterial, deliberately but finely paced reading. Familiarity with the piece should not lessen our admiration for its superb scoring: this is a vivid performance, with a positively awesome return of the sorcerer after his apprentice's mayhem.\r\nDukas was so excessively self-critical of his compositions that he destroyed many before they could be published: he would also have cast away the exotic ''dance poem'' La Péri had it not been for the agonized intervention of his friends. It was premiered in 1912, though not by Diaghilev's Ballets Russes, for which it had been intended: it is a score of sumptuous coloration illustrating the legend of a Péri who by her seductive dancing regains the flower of immortality from a Persian king who had snatched it from her. A highly poetic work: its huge climax is admirably captured in this spacious recording.\r\nIt is certainly time we had a new recording of Dukas's only surviving symphony (a second was discarded), for it is nearly 20 years since Martinon's performance (EMI, 7/74), musically excellent as that was. This is the earliest of the three works on this disc, and, being contemporary with Debussy's Nocturnes, points the dichotomy in French music in the last decade of the nineteenth century. The vigour of the well-reasoned first movement and the excitable finale (both of which reveal the influence of Franck) is offset by the pensive lyricism of the central Andante: though the symphony is over-extended, it is full of invention. Terrific playing and recording. Interestingly, the booklet analyses the structure of all the works and reinforces this by intermediate cues on the disc.&quot; --Lionel Salter\r\n\r\n1. Fanfare pour précéder La Péri [2:24]\r\n2. La Péri: Poème dansé en un tableau [19:19]\r\nSymphony in C Major\r\n3. I. Allegro non troppo vivace, ma con fuoco [14:10]\r\n4. II. Andante espressivo e sostenuto [15:14]\r\n5. III. Allegro spiritoso [11:13]\r\n6. L'Apprenti sorcier: Scherzo d'après une ballade de Goethe [12:01]\r\nTotal time: 74:21\r\n\r\nThe Radio Philharmonic Orchestra, Netherlands\r\nJean Fournet\r\n\r\nRecorded: 7 September, 1990 Muziekcentrum-Hilversum; 30 August, 1991 Concertgebouw Haarlem; 26/27 March, 1992 Concertgebouw Haarlem\r\nRecording &amp; Sound engineering: NOB-Audio: Jaap Bogaart, Arie Dubbeldam, Peter Wentzel, Bert van Koperen\r\nProducer: NOB Music Group\r\nCo-production with EO-broadcasting company\r\n© 1993 Denon Records / Nippon Columbia Co.,Ltd.\r\nDenon CO-75284","torrent":{"xt":"urn:btih:078887de15424a441aacb39b9eb5f69724dfe5ac","amp;dn":"Paul+Dukas+-+Orchestral+Works+-+NRPO%2C+Jean+Fournet+%281993%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"078887de15424a441aacb39b9eb5f69724dfe5ac","infoHashBuffer":{"type":"Buffer","data":[7,136,135,222,21,66,74,68,26,172,179,155,158,181,246,151,36,223,229,172]},"announce":[],"urlList":[]}}