{"title":"UP-Apple Mortgage Cake [2014] REUPLOADED","uid":15433069,"size":733426242,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:089c02614636e147cb08e29829be5a5254a131ae&amp;dn=UP-Apple+Mortgage+Cake+%5B2014%5D+REUPLOADED&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ELEEJG1935","files":1,"time":1469740899,"description":"Angela Logan is a single mother with three teenage boys, a completely chaotic life, and a house that's falling apart, the same house where she sat in the kitchen as a child and listened to her grandmother's stories about the joys of baking. Now, with the basement flooded, the roof collapsing, a mountain of debt and 10 days to pay her mortgage and taxes, Angela risks everything and decides to bake her way out of her mess, selling her amazing apple cakes to save her family and home from foreclosure. With the help of strangers around the world who order her cakes, The Hilton Hotel that gives her a space to bake in, and CNN, MSNBC, The Today Show and other media outlets that share her story, Angela proves that hard work and determination do pay off and good things do happen to good people \r\n\r\n\r\nBased on a True story. As a little girl Angela Morgan would sit in her Grandmothers kitchen and help her make tasty apple cinnamon cakes. Fast forward Angela his now a divorced single mother who is trying to raise three boy, and only working part time jobs, and volunteering at a center for battered women. The house left to her by her grandmother is in terrible shape due to a bad contractor and the city has given her 10 days to pay the $4000 back taxes or they are going to be homeless. He youngest son as be suspended for bringing a knife to school What can she do? He son suggest that she bake 100 cakes and sells them at $40 each. Can she do it? It sounds simple. But with a little help from a friend, and a lot of prayers, anything can happen. \r\n\r\n\r\n\r\nDirector: Michael Scott\r\nWriter: Jamie Pachino\r\nStars: Kimberly Elise, A.J. Saudin, Shanice Banton","torrent":{"xt":"urn:btih:089c02614636e147cb08e29829be5a5254a131ae","amp;dn":"UP-Apple+Mortgage+Cake+%5B2014%5D+REUPLOADED","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"089c02614636e147cb08e29829be5a5254a131ae","infoHashBuffer":{"type":"Buffer","data":[8,156,2,97,70,54,225,71,203,8,226,152,41,190,90,82,84,161,49,174]},"announce":[],"urlList":[]}}