{"title":"Clausewitz: His Life and Work (2014) pdf","uid":11033467,"size":13639073,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:08bfcba7912febedc1ee92da9860a6acc118d755&amp;dn=Clausewitz%3A+His+Life+and+Work+%282014%29+pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bookzilla","files":1,"time":1410748297,"description":"Carl von Clausewitz's On War, is generally considered the greatest text on military theory ever written. Clausewitz is a touchstone for the field today, and is read by scholars, students, and military personnel around the world. \n\n And yet to Clausewitz himself, far more important than achieving recognition for his scholarly and theoretical contributions was achieving glory on the field of battle-winning renown not with his pen but with his sword.\n\n Military historian Donald Stoker's perceptive biography of Carl von Clausewitz moves skillfully between Clausewitz's career as a solider and his work as a theoretician and author, exploring the composition of On War and other works while also emphasizing the many military engagements in which Clausewitz fought. Though Clausewitz certainly spilled his share of ink, he also spilled blood--his as well as that of the enemy. As an officer in the Prussian army, Clausewitz fought in battles from Jena-Auerstedt to Waterloo, as well as the battle of Borodino while serving the Russians. Stoker takes readers through the heat of these battles, providing historical overview and discussing each engagement in detail. Rich context is provided by Clausewitz himself, who wrote abundant letters to his wife and friends throughout his life, and from which Stoker draws extensively.\n\n Clausewitz argues for the centrality of Clausewitz's work as a soldier, but it does not neglect his historical achievements in military theory. Stoker unpacks each of Clausewitz's significant works, considering their influences and describing the circumstances around their composition. The interplay between the biographical details of Clausewitz's life and the arguments put forth in his written works allows for a deeper understanding of these familiar texts, and Stoker's insightful commentary adds depth to the discussion. The result is an absorbing reassessment of both the man and his legacy, and a significant contribution to the study of Clausewitz and his place in today's military and political landscape.\n","torrent":{"xt":"urn:btih:08bfcba7912febedc1ee92da9860a6acc118d755","amp;dn":"Clausewitz%3A+His+Life+and+Work+%282014%29+pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08bfcba7912febedc1ee92da9860a6acc118d755","infoHashBuffer":{"type":"Buffer","data":[8,191,203,167,145,47,235,237,193,238,146,218,152,96,166,172,193,24,215,85]},"announce":[],"urlList":[]}}