{"title":"As you Wish: Inconceivable Tales from the Making of The Princess","uid":11236489,"size":8476078,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:09123d2e4f463005ec6ed6874e592f973859f336&amp;dn=As+you+Wish%3A+Inconceivable+Tales+from+the+Making+of+The+Princess&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"teddyox","files":3,"time":1413600682,"description":"From actor Cary Elwes, who played the iconic role of Westley in The Princess Bride, comes a first-person account and behind-the-scenes look at the making of the cult classic film filled with never-before-told stories, exclusive photographs, and interviews with costars Robin Wright, Wallace Shawn, Billy Crystal, Christopher Guest, and Mandy Patinkin, as well as author and screenwriter William Goldman, producer Norman Lear, and director Rob Reiner.\n\nThe Princess Bride has been a family favorite for close to three decades. Ranked by the American Film Institute as one of the top 100 Greatest Love Stories and by the Writers Guild of America as one of the top 100 screenplays of all time, The Princess Bride will continue to resonate with audiences for years to come.\n\nCary Elwes was inspired to share his memories and give fans an unprecedented look into the creation of the film while participating in the twenty-fifth anniversary cast reunion. In As You Wish he has created an enchanting experience; in addition to never-before seen photos and interviews with his fellow cast mates, there are plenty of set secrets and backstage stories.\n\nWith a foreword by Rob Reiner and a limited edition original poster by acclaimed artist Shepard Fairey, As You Wish is a must-have for all fans of this beloved film","torrent":{"xt":"urn:btih:09123d2e4f463005ec6ed6874e592f973859f336","amp;dn":"As+you+Wish%3A+Inconceivable+Tales+from+the+Making+of+The+Princess","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09123d2e4f463005ec6ed6874e592f973859f336","infoHashBuffer":{"type":"Buffer","data":[9,18,61,46,79,70,48,5,236,110,214,135,78,89,47,151,56,89,243,54]},"announce":[],"urlList":[]}}