{"title":"Jean Stafford - The Collected Stories (pdf)","uid":8683370,"size":5199725,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:09709059fa09967f842e53064c8f1ec1f8d5d91e&amp;dn=Jean+Stafford+-+The+Collected+Stories+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pharmakate","files":-1,"time":1373744021,"description":"The Collected Stories of Jean Stafford (Dutton, 1969, 1984). 463 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\nJean Stafford was a fine short story writer and novelist; read about her sad life story on wikipedia. A good place to begin in this collection is &quot;The Interior Castle,&quot; the background of which is described fascinatingly in the wikipedia article.\n\ndescription:\n\nWinner of the 1970 Pulitzer Prize for fiction, this collection of thirty stories includes some of Jean Stafford's best short fiction from the period 1944-1968. Including such favorites as &quot;In the Zoo,&quot; &quot;Children Are Bored on Sunday,&quot; and &quot;Beatrice Trueblood's Story,&quot; the collection offers the work of this popular writer of the 1940s and 1950s to a new generation of readers and critics.\n\nReview\n\nThe appearance of these stories in one volume is an event in our literature. To have built up so distinguished a collection, each story excellent in its own way and each an original departure in relation to the others, is a triumph. (Guy Davenport New York Times Book Review )\n\nMiss Stafford's craftsmanship and her mastery of the short story form are by now so well known that it seems superfluous to praise these stories. That they are impeccably done is obvious. (Joyce Carol Oates Book World )\n\nShe writes about people whom loneliness has driven slightly mad, but also about people who are secure and comforted; she explores childhood and old age, poverty and wealth, tragedy and comedy. The comedy is usually wry... but often moves one to laughter. Above all, Miss Stafford will not be hurried... To me, this book is most solidly achieved. (John Wain New York Review Of Books )\n\nAbout the Author\n\nJean Stafford (1915-79) was the author of three novels as well as several children's and nonfiction books. She was awarded the Pulitzer Prize in 1970.","torrent":{"xt":"urn:btih:09709059fa09967f842e53064c8f1ec1f8d5d91e","amp;dn":"Jean+Stafford+-+The+Collected+Stories+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09709059fa09967f842e53064c8f1ec1f8d5d91e","infoHashBuffer":{"type":"Buffer","data":[9,112,144,89,250,9,150,127,132,46,83,6,76,143,30,193,248,213,217,30]},"announce":[],"urlList":[]}}