{"title":"Batman (2007-12) 670-675 (digital) (OkC.O.M.P.U.T.O.-Novus-HD) [","uid":10632813,"size":177456449,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:09d9c47c31c0648bb727d9d9b44ceed498b05c27&amp;dn=Batman+%282007-12%29+670-675+%28digital%29+%28OkC.O.M.P.U.T.O.-Novus-HD%29+%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dadrkhomr","files":-1,"time":1406343708,"description":"A Novus Release\n\n\n\n\nThis torrent includes the HD versions.\n  \n \n\n\n*Note: You can download all or only choose which version you'd prefer by deselecting the one you don't want when you add the torrent to your client software. If you're adding the torrent via magnet link, you can deselect any undesired file in the list of files once the torrent has begun downloading.\n\n========================================================\n\n\n\n\n\n\n\n#670  &quot;The Resurrection of Ra's al Ghul,&quot; Prelude  Ra's al Ghul has enigmatically returned from the dead...but what does that mean for Batman's teenaged son, Damian--whose mother is Ra's al Ghul's daughter? It will take the combined skills of Batman, Robin and Nightwing to get to the bottom of these mysteries and stop Ra's al Ghul's insidious plans. Part 3 of 10.\n\n#671  &quot;The Resurrection of Ra's al Ghul,&quot; Part 4 of 7  It's the fight of the year: Batman vs. Ra's al Ghul vs. the Sensei! Will anyone survive? Plus, the secrets of Nanda Parbat stand revealed.\n\n#672  Batman arrives just in time to stop what appears to be an impostor Batman from storming the Gotham City police department, but what stunning secret does the impostor share with The Dark Knight? Find out as details behind the group conspiring against Batman are revealed in part 1 of a 4-part arc!\n\n#673  After a recent skirmish, Batman's body lies near death! Meanwhile, his delirious mind travels back to a defining adventure in the life of young Bruce Wayne...the hunt for his parents' killer! And is Bat-Mite actually visiting Batman? Or has insanity finally come to claim The Dark Knight?\n\n#674  Batman learns the tragic story behind the last of the &quot;Batman Replacements!&quot; This tale leads to revelations about Batman's participation in a bizarre isolation experiment years ago, and how involved The Black Glove may have been in his life since his early crime-fighting years! \n\n#675  Momentarily freed of the recent drama surrounding the Black Glove and the Replacement Batmen, The Caped Crusader enjoys an evening with his most recent girlfriend, Jezebel Jet. But an attack from the Ten-Eyed Man leads to stunning revelations in this finale to a 4-part storyline!\n\n\n\n\n\nThanks goes to OkC.O.M.P.U.T.O this release.","torrent":{"xt":"urn:btih:09d9c47c31c0648bb727d9d9b44ceed498b05c27","amp;dn":"Batman+%282007-12%29+670-675+%28digital%29+%28OkC.O.M.P.U.T.O.-Novus-HD%29+%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09d9c47c31c0648bb727d9d9b44ceed498b05c27","infoHashBuffer":{"type":"Buffer","data":[9,217,196,124,49,192,100,139,183,39,217,217,180,76,238,212,152,176,92,39]},"announce":[],"urlList":[]}}