{"title":"Paul Karasik &amp; David Mazzucchelli: City of Glass","uid":8657024,"size":27441726,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:0b24d93b7e75d8d32e62ca2b0093d0e8830c7114&amp;dn=Paul+Karasik+%26amp%3B+David+Mazzucchelli%3A+City+of+Glass&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"fudoh101","files":1,"time":1373238283,"description":"Paul Auster's novel adapted into comic form by Paul Karasik &amp; David Mazzucchelli\n\nPublished by Avon Books 1994\n147 pages\n\n\nOn the 2004 re-issue:\nKarasik and Mazzucchelli's 1994 comics adaptation of Auster's existentialist mystery novel, reprinted here with an introduction by Art Spiegelman, has been a cult classic for years. The Comics Journal named it one of the 100 best comics of the century. Miraculously, it deepens the darkness and power of its source. Auster's novel (about a novelist named Quinn who's mistaken for a detective named Paul Auster and loses his mind and identity in the course of a meaningless case) zooms around in metafictional spirals, but it doesn't have a lot of visual content. In fact, it's mostly about the breakdown of the idea of representation and the widening chasm between signifier and signified. So the artists, perversely and brilliantly, play fast and loose with the text. Mazzucchelli draws everything in a bluntly sketched, bold-lined style, and having set up a suitably film noir mood at the beginning, he substitutes literal depictions of what's happening for symbolic or iconic images wherever possible. One character's monologue about the loss of meaning in his speech is drawn as a long zoom down his throat, followed by Charon arising from a void, a cave drawing, a series of holes and symbols of muteness and finally a broken marionette at the bottom of a well. This reflected, shattered Glass introduces a whole new set of resonances to Auster's story, about the things images can and can't represent when language fails.","torrent":{"xt":"urn:btih:0b24d93b7e75d8d32e62ca2b0093d0e8830c7114","amp;dn":"Paul+Karasik+%26amp%3B+David+Mazzucchelli%3A+City+of+Glass","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b24d93b7e75d8d32e62ca2b0093d0e8830c7114","infoHashBuffer":{"type":"Buffer","data":[11,36,217,59,126,117,216,211,46,98,202,43,0,147,208,232,131,12,113,20]},"announce":[],"urlList":[]}}