{"title":"Beethoven complete piano sonatas Alfred Brendel (Philips set)","uid":10112119,"size":2227993622,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0b94af2461bf1469dc5ee840bcac4d8b58c64683&amp;dn=Beethoven+complete+piano+sonatas+Alfred+Brendel+%28Philips+set%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"magneez","files":50,"time":1399532266,"description":"FLAC + CUE\n\nrandom review:\n\nThis collection is one of the finest possessions that any lover of music--classical or otherwise-- could possibly own. Alfred Brendel's interpretation of Beethoven's serious, probing piano works is in my opinion among the greatest interpretive achievements of the 20th century, and these recordings capture Brendel's performance in a luminous, ambient sonic wonderland that I find all but overwhelming. You will be drawn into a poetic and reflective space that will astound, enchant, and disturb you... consider Brendel's statement about the slow movement of the Moonlight Sonata, hideously sentimentalized by most artists: in Brendel's words, it's &quot;a mystic realm of awe and shuddering.&quot; Think about this, and listen to Brendel's interpretation, and you'll have a great start on this rich, deep, expansive collection of total artistry. Avoiding bombast, Brendel lays bare the incredible architecture that underlies Beethoven's work, and in so doing Brendel fully unleashes Beethoven's artistic and emotional power, a world of musical romance and argumentation that begins to speak to you with an eloquence ranging far beyond the complexities of speech. With Brendel as your guide, you are ushered into a world in which you fully perceive Beethoven's creative genius; before you opens a world of depth and insight and enchantment and meaning. This recording belongs in the library of any serious lover of classical music--and indeed, of any person who believes that music and its performance speak with eloquence of something that is inexpressably deep and meaningful about human existence, something that only music can fully describe. It's very hard to put into words... just listen.","torrent":{"xt":"urn:btih:0b94af2461bf1469dc5ee840bcac4d8b58c64683","amp;dn":"Beethoven+complete+piano+sonatas+Alfred+Brendel+%28Philips+set%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b94af2461bf1469dc5ee840bcac4d8b58c64683","infoHashBuffer":{"type":"Buffer","data":[11,148,175,36,97,191,20,105,220,94,232,64,188,172,77,139,88,198,70,131]},"announce":[],"urlList":[]}}