{"title":"Ben Bova - The Aftermath (The Grand Tour #15) [AUDIBLE RIP]","uid":12239210,"size":183875399,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0bda671e043ac9564d9701f371ccc32d864ef772&amp;dn=Ben+Bova+-+The+Aftermath+%28The+Grand+Tour+%2315%29+%5BAUDIBLE+RIP%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Cybotage","files":1,"time":1439685443,"description":"In the wake of the Asteroid Wars that tore across the solar system, Victor Zacharius makes his living running the ore-carrier Syracuse. With his wife and two children, he plies the Asteroid Belt, hauling whatever cargo can be found.\n\nWhen the Syracuse stumbles into the middle of a military attack on the habitat Chrysalis, Victor flees in a control pod to draw the attacker's attention away from his family. Now, as his wife and children plunge into the far deeps of space, Victor has been rescued by the seductive Cheena Madagascar. He must do her bidding if he's to have a prayer of ever seeing his family again.\n\nElverda Apacheta is the solar system's greatest sculptor. The cyborg Dorn was formerly Dorik Harbin, the ruthless military commander responsible for the attack on Chrysalis. Their lives and destinies have been linked by their joint discovery of the alien artifact that had, earlier, profoundly affected industrialist Martin Humphries. Similarly transformed by the artifact's mysterious powers, Apacheta and Dorn now prowl the Belt, determined to find the bodies of the many victims of Harbin's atrocities so that they can be given proper burials.\n\nKao Yuan is the captain of Viking, owned by Martin Humphries, who's determined to kill Dorn and Elverda because they know too much about the artifact and its power over him. But the Viking's second-in-command, Tamara Vishinsky, appears to have the real power on board ship.\n\nWhen the Viking catches up to Apacheta and Dorn, their confrontation begins a series of events involving them, the Zacharius family, and Martin Humphries and his son in the transformation of the human solar system.\n\n\n\nNarrated by: Emily Janice Card, Gabrielle de Cuir, Stephen Hoye, Stefan Rudnicki\nLength: 12 hrs and 2 mins \nFormat: M4A\nBitrate: 32 Kbps\nUnabridged Audiobook\nRelease Date:08-06-07\nPublisher: Macmillan Audio","torrent":{"xt":"urn:btih:0bda671e043ac9564d9701f371ccc32d864ef772","amp;dn":"Ben+Bova+-+The+Aftermath+%28The+Grand+Tour+%2315%29+%5BAUDIBLE+RIP%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0bda671e043ac9564d9701f371ccc32d864ef772","infoHashBuffer":{"type":"Buffer","data":[11,218,103,30,4,58,201,86,77,151,1,243,113,204,195,45,134,78,247,114]},"announce":[],"urlList":[]}}