{"title":"Curriculum Development and Evaluation in Nursing, 3E- Keating [P","uid":11253867,"size":2414900,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0cb2f0ceaa514477879b4454941dc75d5d295e0f&amp;dn=Curriculum+Development+and+Evaluation+in+Nursing%2C+3E-+Keating+%5BP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"0xmovva","files":-1,"time":1413871032,"description":"TITLE/EDITION Curriculum Development and Evaluation in Nursing, Third Edition\nAuthor: Sarah B. Keating \nPaperback: 504 pages\nPublisher: Springer Publishing Company; 3 edition (September 16, 2014)\nLanguage: English\nISBN-10: 0826130275\nISBN-13: 978-0826130273 \nFormat: Retail PDF\nNOTE: this is the standalone ebook and may not include access codes that come packaged with the bound book\n\n__________________________________________________________________________________\n\n\nNew Edition of The Leading Nursing Text on Curriculum Development and Evaluation!\n\nThis third edition of the leading nursing text on curriculum development and evaluation continues to address relevant NLN and AACN core competencies for curricula in all undergraduate and graduate nursing programs. Written for graduate students and faculty, this new edition responds to the many changes that have occurred in nursing and education since the second edition was published. These include the continued shortage of nursing faculty and the projected additional losses of experienced faculty due to impending retirements, as well as the implementation of the Affordable Care Act and Consensus Model for Advanced Practice Nursing.\n\nThis third edition covers curriculum development and evaluation in detail and provides the knowledge and practical applications needed by new and experienced faculty to confidently embrace the academic role. With an emphasis on interdisciplinary collaboration throughout, the text focuses on the growth of simulation, guidance for new faculty transitioning from a clinical to academic role, developing curricula for practice and academic settings, program evaluation, accreditation activities, and recommendation for research in nursing education. Also addressed is the explosion of DNP programs across the country and its effect on practice and education, as well as the controversy surrounding the use of simulation. Chapter objectives, discussion points, learning activities, references and a glossary enhance learning and retention of material. The text is a valuable resource for CNE certification review.\n\nNew to the Third Edition:\n\nNew chapter: Role of Faculty in Curriculum Development and Evaluation\nNew chapter: Financial Support and Budget Management for Curriculum Development\nNew chapter: Research and Evidence-Based Practice in Nursing Education\nEmphasis on guiding the assimilation of new instructors into faculty roles of program and curriculum development, instructional design, and student evaluation\nNew content on curriculum evaluation, financial support, and budget management\nStrong focus on Interdisciplinary Educational Collaboration throughout\nAddresses the need for preparing more faculty to educate thousands of new nurses as defined by the IOM Report, the Affordable Care Act, and the Consensus Model","torrent":{"xt":"urn:btih:0cb2f0ceaa514477879b4454941dc75d5d295e0f","amp;dn":"Curriculum+Development+and+Evaluation+in+Nursing%2C+3E-+Keating+%5BP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0cb2f0ceaa514477879b4454941dc75d5d295e0f","infoHashBuffer":{"type":"Buffer","data":[12,178,240,206,170,81,68,119,135,155,68,84,148,29,199,93,93,41,94,15]},"announce":[],"urlList":[]}}