{"title":"Tom Waits 24 Bit Vinyl Pack","uid":8722553,"size":16762932497,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0cdace8b047fbe5e209c2a6e2198de3dd7b5be84&amp;dn=Tom+Waits+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"politux","files":-1,"time":1374447123,"description":"\n  Tom Waits 24 Bit Vinyl Pack\n\n  Genre: Pop/Rock\n  Styles: Alternative, College Rock, Experimental, Singer/Songwriter\n  Source: vinyl\n  Codec: FLAC\n  Bit Rates: ~ 2,900 - 3,100 kbps\n  Bit Depth: 24\n  Sampling Rate: 96,000 Hz\n\n  1974 The Heart of Saturday Night\n  1977 Foreign Affairs\n  1980 Heartattack and Vine\n  1981 Bounced Checks\n  1983 Swordfishtrombones\n  1985 Rain Dogs \n  1987 Franks Wild Years\n  1992 Bone Machine\n  1999 Mule Variations\n  2002 Blood Money\n  2004 Real Gone\n  2006 Orphans\n  2009 Glitter and Doom Live\n\n  In the 1970s, Tom Waits combined a lyrical focus on desperate, low-life characters with a persona that seemed to embody the same lifestyle, which he sang about in a raspy, gravelly voice. From the '80s on, his work became increasingly theatrical as he moved into acting and composing. Growing up in Southern California, Waits attracted the attention of manager Herb Cohen, who also handled Frank Zappa, and was signed by him at the beginning of the 1970s, resulting in the material later released as The Early Years and The Early Years, Vol. 2. His formal recording debut came with Closing Time (1973) on Asylum Records, an album that contained &quot;Ol' 55,&quot; which was covered by labelmates the Eagles for their On the Border album. Waits attracted critical acclaim and a cult audience for his subsequent albums, The Heart of Saturday Night (1974), the two-LP live set Nighthawks at the Diner (1975), Small Change (1976), Foreign Affairs (1977), Blue Valentine (1978), and Heart Attack and Vine (1980). His music and persona proved highly cinematic, and, starting in 1978, he launched parallel careers as an actor and as a composer of movie music. He wrote songs for and appeared in Paradise Alley (1978), wrote the title song for On the Nickel (1980), and was hired by director Francis Coppola to write the music for One from the Heart (1982), which earned him an Academy Award nomination. While working on that project, Waits met and married playwright Kathleen Brennan, with whom he later collaborated.\n\n  Moving to Island Records, Waits made Swordfishtrombones (1983), which found him experimenting with horns and percussion and using unusual recording techniques. The same year, he appeared in Coppola's Rumble Fish and The Outsiders, and, in 1984, he appeared in the director's The Cotton Club. In 1985, he released Rain Dogs. In 1986, he appeared in Down by Law and made his theatrical debut with Chicago's Steppenwolf Theatre in Frank's Wild Years, a musical play he had written with Brennan. An album based on the play was released in 1987, the same year Waits appeared in the films Candy Mountain and Ironweed. In 1988, he released a film and soundtrack album depicting one of his concerts, Big Time. In 1989, he appeared in the films Bearskin: An Urban Fairytale, Cold Feet, and Wait Until Spring. His work for the theater continued in 1990 when Waits partnered with opera director Robert Wilson and beat novelist William Burroughs and staged The Black Rider in Hamburg, Germany. In 1991, he appeared in the films Queens' Logic, The Fisher King, and At Play in the Fields of the Lord. In 1992, he scored the film Night on Earth; released the album Bone Machine, which won a Grammy Award for Best Alternative Music Album; appeared in the film Bram Stoker's Dracula; and returned to Hamburg for the staging of his second collaboration with Robert Wilson, Alice. The Black Rider was documented on CD in 1993, the same year Waits appeared in the film Short Cuts.\n\n  A long absence from recording resulted in the 1998 release of Beautiful Maladies, a retrospective of his work for Island. In 1999, Waits finally returned with a new album, Mule Variations. The record was a critical success, winning a Grammy for Best Contemporary Folk album, and was also his first for the independent Epitaph Records' Anti subsidiary. A small tour followed, but Waits jumped right back into the studio and began working on not one but two new albums. By the time he emerged in the spring of 2002, both Alice and Blood Money were released on Anti Records. Blood Money consisted of the songs from the third Wilson/Waits collaboration that was staged in Denmark in 2000 and won Best Drama of the Year. After limited touring in support of these two endeavors, Waits returned to the recording studio and issued Real Gone in 2004. The album marked a large departure for him in that it contained no keyboards at all, focusing only on stringed and rhythm instruments. Glitter and Doom Live appeared in 2009. Waits didn't release another studio album of new material until 2011, when he issued Bad as Me on Anti in the Fall. He uncharacteristically issued a track listing two months in advance of the release, and the pre-release title track as a digital single. He also took the unusual step of releasing a video in which he allowed bits of all the album's songs to play while he scolded bloggers and peer-to-peer sites for invading his privacy.","torrent":{"xt":"urn:btih:0cdace8b047fbe5e209c2a6e2198de3dd7b5be84","amp;dn":"Tom+Waits+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0cdace8b047fbe5e209c2a6e2198de3dd7b5be84","infoHashBuffer":{"type":"Buffer","data":[12,218,206,139,4,127,190,94,32,156,42,110,33,152,222,61,215,181,190,132]},"announce":[],"urlList":[]}}