{"title":"Annette Peacock - I'm The One (1972) [FLAC]","uid":7148666,"size":220461123,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0cda61edaf04c9ce5ecfa78f178fc2f5591c9283&amp;dn=Annette+Peacock+-+I%27m+The+One+%281972%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":-1,"time":1333221053,"description":"2010 - IRONICRECORDS / CD\n\nAnnette Peacock's work as a vocalist, pianist, and composer is austere, cryptic, laconic, minimalistic, and relentlessly individual. Her dry delivery and penchant for stark, stripped-down musical &quot;environments&quot; have made her something of a cult figure and an icon of the avant-garde. An early participant (1961-1962) in Dr. Timothy Leary's psychedelic culture experiments and a longtime adherent of Zen Macrobiotics, Peacock has been releasing albums since 1968. But her career has been marked by fairly long periods of silence; this partly explains her relative obscurity.\n\nAside from a brief period of formal study at Juilliard during the 1970s, Peacock is entirely self-taught. Born in Brooklyn, she began composing by the time she was five. Her first professional association was with saxophonist Albert Ayler, with whom she toured Europe in the 1960s. She soon began to write in an idiom she calls the &quot;free-form song,&quot; which emphasizes the use of space in contrast to the busy, cacophonous tendencies of free jazz. During this period she met and married her first husband, the double bass virtuoso Gary Peacock. She also began to write material specifically for the avant-garde pianist Paul Bley and his trio. For decades, Bley has remained one of her most devoted interpreters.\n\nAmong her other accomplishments, Peacock is an unsung pioneer of electronic music. Years before the commercial emergence of synthesizers, she received a prototype from inventor Robert Moog. This prompted her to synthesize her own voice, which according to most reports had never been done before. Ultimately these experiments brought about an innovative 1971 album, The Bley/Peacock Synthesizer Show.\n\nDespite her decidedly unorthodox profile, Peacock has had several interesting points of contact with mainstream culture. In 1978 she sang three songs on Feels Good to Me, a minor classic by progressive rock drummer Bill Bruford. Her song &quot;My Mama Never Taught Me How to Cook&quot; appears on the soundtrack of Kevin Smith's 1997 film Chasing Amy. And a sample from Peacock's song &quot;Survival&quot; crops up in &quot;Tell 'Em Yu Madd&quot; by Militant the Madd Rapper featuring Busta Rhymes. Most notably, David Bowie has shown interest in Peacock's work over the years. On his 1999 album Hours, the rock legend makes a fairly explicit reference to Peacock's song &quot;I'm the One.&quot; Bowie subsequently invited Peacock to collaborate.\n\nPianist Marilyn Crispell saluted Peacock with a 1997 ECM disc titled Nothing Ever Was, Anyway: The Music of Annette Peacock. Peacock's one-track guest performance on the album ended a 12-year recording hiatus (her longest yet). But her official return to the studio came in 2000 with her own An Acrobat's Heart, also on ECM. Although many of her compositions appeared on Paul Bley's ECM titles through the years, Peacock had never herself previously recorded for the German-based label.\n\n1 I'm the One 6:45\n2 7 Days 3:54\n3 Pony 6:15\n4 Been and Gone 2:20\n5 Blood 2:00\n6 One Way 6:12\n7 Love Me Tender 3:45\n8 Gesture Without Plot 3:29\n9 Did You Hear Me Mommy? 1:44","torrent":{"xt":"urn:btih:0cda61edaf04c9ce5ecfa78f178fc2f5591c9283","amp;dn":"Annette+Peacock+-+I%27m+The+One+%281972%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0cda61edaf04c9ce5ecfa78f178fc2f5591c9283","infoHashBuffer":{"type":"Buffer","data":[12,218,97,237,175,4,201,206,94,207,167,143,23,143,194,245,89,28,146,131]},"announce":[],"urlList":[]}}