{"title":"STOLEN INNOCENCE - Elissa Wall. Read RenÃƒÂ©e Raudman {FerraBit}","uid":5484154,"size":823564281,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0ce541c678b98e75db8ef0b81b8ca6ad9432485a&amp;dn=STOLEN+INNOCENCE+-+Elissa+Wall.+Read+Ren%C3%83%C2%A9e+Raudman+%7BFerraBit%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"FerraBit","files":-1,"time":1270604442,"description":"STOLEN INNOCENCE by Elissa Wall (2008)\n\nMy Story of Growing Up in a Polygamous Sect, \nBecoming a Teenage Bride, and Breaking Free of Warren Jeffs\n\nRead by . . : RenÃƒÂ©e Raudman\nPublisher . : Tantor Media (2008)\nISBN . . . .: 1400107903 | 9781400107902\nFormat . . .: MP3. 153 tracks, 784 MB\nBitrate . . : ~115 kbps (iTunes 9, VBR (highest), Mono, 44.1 kHz)\nSource . . .: 13 CDs (16 hours)\nGenre . . . : Nonfiction\nUnabridged .: Unabridged\n\nNicely tagged and labeled, combined about half of the CD tracks, scanned cover included.\n\nThanks for sharing &amp; caring.\nCheers, FerraBit\nApril 2010\n\n Links:\nhttp://en.wikipedia.org/wiki/Elissa_Wall\nhttp://en.wikipedia.org/wiki/Warren_Jeffs\n\n Originally posted:               &lt;a href=&quot;\nhttps://thepiratebay.se/user/FerraBit&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/user/FerraBit&lt;/a&gt; (TPB) &amp; Demonoid\nPlease present your library card, and comment me some loving.\n______________________________________\n\n\nIn September 2007, a packed courtroom in St. George, Utah, sat hushed as Elissa Wall, the star witness against polygamous sect leader Warren Jeffs, gave captivating testimony of how Jeffs forced her to marry her first cousin at age fourteen. This harrowing and vivid account proved to be the most compelling evidence against Jeffs, showing the harsh realities of this closed community and the lengths to which Jeffs went in order to control the sect's women. \n\nNow, in this courageous memoir, Elissa Wall tells the incredible and inspirational story of how she emerged from the confines of the Fundamentalist Church of Latter Day Saints (FLDS) and helped bring one of America's most notorious criminals to justice. Offering a child's perspective on life in the FLDS, Wall discusses her tumultuous youth, explaining how her family's turbulent past intersected with her strong will and identified her as a girl who needed to be controlled through marriage. Detailing how Warren Jeffs's influence over the church twisted its already rigid beliefs in dangerous new directions, Wall portrays the inescapable mind-set and unrelenting pressure that forced her to wed despite her repeated protests that she was too young. \n\nOnce she was married, Wall's childhood shattered as she was obligated to follow Jeffs's directives and submit to her husband in &quot;mind, body, and soul.&quot; With little money and no knowledge of the outside world, she was trapped and forced to endure the pain and abuse of her loveless relationship, which eventually pushed her to spend nights sleeping in her truck rather than face the tormentor in her bed. \n\nYet even in those bleak times, she retained a sliver of hope that one day she would find a way out, and one snowy night that came in the form of a rugged stranger named Lamont Barlow. Their chance encounter set in motion a friendship and eventual romance that gave her the strength she needed to break free from her past and sever the chains of the church. \n\nBut though she was out of the FLDS, Wall would still have to face Jeffs---this time in court. In Stolen Innocence, she delves into the difficult months on the outside that led her to come forward against him, working with prosecutors on one of the biggest criminal cases in Utah's history, so that other girls still inside the church might be spared her cruel fate. \n\nMore than a tale of survival and freedom, Stolen Innocence is the story of one heroic woman who stood up for what was right and reclaimed her life.","torrent":{"xt":"urn:btih:0ce541c678b98e75db8ef0b81b8ca6ad9432485a","amp;dn":"STOLEN+INNOCENCE+-+Elissa+Wall.+Read+Ren%C3%83%C2%A9e+Raudman+%7BFerraBit%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ce541c678b98e75db8ef0b81b8ca6ad9432485a","infoHashBuffer":{"type":"Buffer","data":[12,229,65,198,120,185,142,117,219,142,240,184,27,140,166,173,148,50,72,90]},"announce":[],"urlList":[]}}