{"title":"Freddie Hubbard - 1963 - The Body &amp; The Soul (2010 SACD 24 8","uid":9143920,"size":731590617,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0cf2dc60a24d49ed7be29d0a1f0d5bfc3eb655ca&amp;dn=Freddie+Hubbard+-+1963+-+The+Body+%26amp%3B+The+Soul+%282010+SACD+24+8&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"eika256","files":-1,"time":1383561423,"description":"Freddie Hubbard - 1963 - The Body &amp; The Soul (2010)\nSACD 24 bits, 88.2 KHz\n\nAt age 25, Freddie Hubbard made inroads into modern jazz most trumpeters could not imagine, much less come through with. As a soloist, one of Hubbard's crowning achievements in his early period was this recording on which he teamed with Wayne Shorter, marginally as a performer but prominent in the role of arranger/conductor for his first time ever. Utilizing a septet, 16-piece big band, and orchestra plus stings to play concise, tight tunes, Shorter provides the backdrop to employ Hubbard's bold toned trumpet and all of its devices in a full display of his powerful melodic talents. Yeoman Reggie Workman plays bass on all selections, with drummer Louis Hayes in the seven-piece combo, and great work from Philly Joe Jones in the larger bands. Interestingly enough, the three tracks with the smaller ensemble are the most interesting, due to the presence of Eric Dolphy, Curtis Fuller, Cedar Walton, and Shorter on the front line. &quot;Clarence's Place&quot; is a post-bop jewel with spiky brass accents and Dolphy's ribald and outre alto sax solo contrasting Shorter's relatively reserved tenor, &quot;Dedicated to You&quot; is a wisp of a tune, while &quot;Body &amp; Soul,&quot; an atypical choice for the opening selection, is a straight read of the classic ballad with a chart that sounds larger than the small horn section, and a wavering flute via Dolphy. The big band does an unusual soul-jazz treatment of the Brazilian number &quot;Manha de Carnaval&quot; flavored by Robert Northern's French horn, while &quot;Aries&quot; is a hard bop show stopper with two-note accents buoying Hubbard's great lyrical lines, and goes further into hard bop with &quot;Thermo&quot; as the horns demand attention with the trumpeter as an afterthought. The string section, ten pieces strong, joins the big band on the film noir type Duke Ellington piece &quot;Chocolate Shake,&quot; the stock &quot;I Got It Bad,&quot; and &quot;Skylark,&quot; with its soft clarion intro bubbling underneath with the violins, violas, and cellos. The manner in which this recording is programmed is thoughtful in that it lends to the diversity of the project, but is seamless from track to track. Dan Morgenstern's hefty liner notes also explain the concept behind this ambitious project, one which did not compare to any of Hubbard's other recordings in his career. Therefore it stands alone as one of the most unique productions in his substantive discography, and a quite credible initial go-round for Shorter as an orchestrator. (AllMusic)\n\nTrack list:\n01. Body And Soul\n02. Carnival (Manha De Carnaval)\n03. Chocolate Shake\n04. Dedicated To You\n05. Clarence's Place\n06. Aries\n07. Skylark\n08. I Got It Bad (And That Ain't Good)\n09. Thermo\n\nPersonnel:\n1, 4, 5\nFreddie Hubbard - trumpet\nWayne Shorter - tenor saxophone\nCurtis Fuller - trombone\nEric Dolphy - alto saxophone\nCedar Walton - piano\nReggie Workman - bass\nLouis Hayes - drums\n2, 6, 9\nWayne Shorter - arranger, conductor\nFreddie Hubbard, Clark Terry, Ernie Royal, Al DeRisi - trumpet\nEric Dolphy - alto saxophone, flute\nSeldon Powell, Jerome Richardson - tenor saxophone\nCharles Davis - baritone saxophone\nCurtis Fuller, Melba Liston - trombone\nRobert Powell - tuba\nBob Northern - French horn\nCedar Walton - piano\nReggie Workman - bass\nPhilly Joe Jones - drums\n3, 7, 8\nWayne Shorter - arranger, conductor\nFreddie Hubbard, Ed Armour, Richard Williams - trumpet\nEric Dolphy - alto saxophone, flute\nBob Northern, Julius Watkins - French horns\nCurtis Fuller, Melba Liston - trombone\nJerome Richardson - baritone saxophone\nCedar Walton - piano\nReggie Workman - bass\nPhilly Joe Jones - drums\nHarry Cykman, Morris Stonzek, Arnold Eidus, Sol Shapiro, Charles McCracken, Harry Katzman, Harry Lookofsky, Gene Orloff, Julius Held, Raoul Poliakin - strings\n\nEnjoy and share!","torrent":{"xt":"urn:btih:0cf2dc60a24d49ed7be29d0a1f0d5bfc3eb655ca","amp;dn":"Freddie+Hubbard+-+1963+-+The+Body+%26amp%3B+The+Soul+%282010+SACD+24+8","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0cf2dc60a24d49ed7be29d0a1f0d5bfc3eb655ca","infoHashBuffer":{"type":"Buffer","data":[12,242,220,96,162,77,73,237,123,226,157,10,31,13,91,252,62,182,85,202]},"announce":[],"urlList":[]}}