{"title":"The Postman(1997)DVDRip.AC3(ENG)-DROCK","uid":6652269,"size":733580230,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0d750e6317bb494b6d7140967abbbd945dc0ca95&amp;dn=The+Postman%281997%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"drock232","files":-1,"time":1315207017,"description":"Kevin Costner directed and stars in this adaptation of David Brin's science fiction novel The Postman (1985), first published in 1982 issues of Isaac Asimov's Science Fiction Magazine. Costner's return to directing after his Oscar-winning Dances With Wolves(1990) is a futuristic epic depicting the aftermath of a destructive war. Some 16 years from the present day, America has been turned into a wasteland of separated communities minus a national government. A vagabond (Costner) who travels through these little villages performing Shakespeare is captured by marauders known as the Holnists, and thrown into a totalitarian labor camp run by a Hitler-like dictator, General Bethlehem (Will Patton).\n\nMaking an escape, the drifter, known to some as &quot;Shakespeare,&quot; stumbles across an abandoned U.S. Postal Service jeep and dons the dead postal-worker's uniform. With a scheme simply to get food, he sets out to deliver 15-year-old mail, proclaiming himself The Postman, and discovers that residents accept his lies about a restored United States government because they desperately need something to believe in. This hope leads to the thought that perhaps the United States of America could indeed be restored, so an unusually inspired young man, Ford (Laren Tate) is deputized with the &quot;Neither snow, nor rain...&quot; oath to become the country's second Postman. At the town of Pineview, the attractive Abby (Olivia Williams), who has an impotent husband, asks The Postman to impregnate her. After Abby's husband is killed during a raid by Bethlehem, she is taken prisoner but injures Bethlehem and makes an escape. Pregnant, she spends the winter nursing the wounded Postman in a snowbound cabin. When spring comes, they emerge to discover that Ford has organized an entire squad of mail deliverers who regard The Postman as a mythical hero. The Postman reluctantly accepts his messianic role in the rebirth of the country, even as it becomes clear that the rebel force must ultimately battle and defeat the Holnist army in order to regain the American Dream. \n\nRipped with Handbrake.\n\nLength: 3 Hours 18 Minutes\n\nFile Type: MP4\n\nFrame Width: 912\n\nFrame Height: 384\n\nFrame Rate: 23fps\n\nAudio\n\n159kbps","torrent":{"xt":"urn:btih:0d750e6317bb494b6d7140967abbbd945dc0ca95","amp;dn":"The+Postman%281997%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d750e6317bb494b6d7140967abbbd945dc0ca95","infoHashBuffer":{"type":"Buffer","data":[13,117,14,99,23,187,73,75,109,113,64,150,122,187,189,148,93,192,202,149]},"announce":[],"urlList":[]}}