{"title":"FALLOUT 3 CRACK [TRiViUM]","uid":4472202,"size":15840318,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0d9bf0b913f825f44a11d6c37bc1d68b2b84b514&amp;dn=FALLOUT+3+CRACK+%5BTRiViUM%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"grimreaper420","files":8,"time":1225179072,"description":"Fallout 3 (c) 1C Company\n\nRELEASE DATE ............ : 10/2008\nRELEASE SiZE .............. : 1 rar\nPROTECTiON .. : StarForce 5.60.1.27\n\n\nRELEASE NOTES\n\nThe third game in the Fallout series, Fallout 3 is a\nsingleplayer action role-playing game (RPG) set in a\npost-apocalyptic Washington DC. Combining the horrific\ninsanity of the Cold War era theory of mutually assured\ndestruction gone terribly wrong, with the kitschy naivety of\nAmerican 1950s nuclear propaganda, Fallout 3 will satisfy\nboth players familiar with the popular first two games in its\nseries as well as those coming to the franchise for the first\ntime.\n\nThe Story: Vault 101 - Jewel of the Wastes\nFor 200 years, Vault 101, a fallout shelter, has faithfully\nserved the surviving residents of Washington DC and its\nenvirons, now known as the Capital Wasteland. Though the\nglobal atomic war of 2077 left the US all but destroyed, the\nresidents of Vault 101 enjoy a life free from the constant\nstress of the outside world. Giant Insects, Raiders, Slavers,\nand yes, even Super Mutants are all no match for superior\nVault-Tec engineering. Yet one fateful morning, you awake to\nfind that your father has defied the Overseer and left the\ncomfort and security afforded by Vault 101 for reasons\nunknown. Leaving the only home youve ever known, you emerge\nfrom the Vault into the harsh Wasteland sun to search for\nyour father, and the truth.\n\nFeatures:\n\n- Limitless Freedom! - Take in the sights and sounds of the\nvast Capital Wasteland! See the great monuments of the\nUnited States lying in post-apocalyptic ruin! You make the\nchoices that define you and change the world. Just keep an\neye on your Rad Meter!\n- Experience S.P.E.C.I.A.L.! - Vault-Tec engineers bring you\nthe latest in human ability simulation - the SPECIAL\nCharacter System! Utilizing new breakthroughs in\npoints-based ability representation, SPECIAL affords\nunlimited customization of your character. Also included\nare dozens of unique skills and perks to choose from, each\nwith a dazzling variety of effects!\n- Fantastic New Views! - The wizards at Vault-Tec have done\nit again! No longer constrained to just one view,\nexperience the world from 1st or 3rd person perspective.\nCustomize your view with the touch of a button!\n- The Power of Choice! - Feeling like a dastardly villain\ntoday, or a Good Samaritan? Pick a side or walk the line,\nas every situation can be dealt with in many different\nways. Talk out your problems in a civilized fashion, or\njust flash your Plasma Rifle.\n- Blast Em Away With V.A.T.S.! -Even the odds in combat with\nthe Vault-Tec Assisted Targeting System for your Pip-Boy\nModel 3000! V.A.T.S. allows you to pause time in combat,\ntarget specific body parts on your target, queue up\nattacks, and let Vault-Tec take out your aggression for\nyou. Rain death and destruction in an all-new cinematic\npresentation featuring gory dismemberments and spectacular\nexplosions.\n- Mind-Blowing Artificial Intelligence! - At Vault-Tec, we\nrealize that the key to reviving civilization after a\nglobal nuclear war is people. Our best minds pooled their\nefforts to produce an advanced version of Radiant AI,\nAmericas First Choice in Human Interaction Simulation.\nFacial expressions, gestures, unique dialog, and lifelike\nbehavior are brought together with stunning results by the\nlatest in Vault-Tec technology.\n- Eye-Popping Prettiness! - Witness the harsh realities of\nnuclear fallout rendered like never before in modern\nsuper-deluxe HD graphics. From the barren Wasteland, to the\ndanger-filled offices and metro tunnels of DC, to the\nhideous rotten flesh of a mutants face.\n\niNSTALL NOTES\n\n\n- Unpack\n- Install the game\n- Copy the cracked content from the TRiViUM folder\n- Execute install.crack.bat\n- Make sure u have dozen bottles of good cold beer\n- Enjoy Fallout 3 ;)\n\n\n","torrent":{"xt":"urn:btih:0d9bf0b913f825f44a11d6c37bc1d68b2b84b514","amp;dn":"FALLOUT+3+CRACK+%5BTRiViUM%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d9bf0b913f825f44a11d6c37bc1d68b2b84b514","infoHashBuffer":{"type":"Buffer","data":[13,155,240,185,19,248,37,244,74,17,214,195,123,193,214,139,43,132,181,20]},"announce":[],"urlList":[]}}