{"title":"Sexually BrokenSkinny girl with long legs Amber Rayne  Matt Wil","uid":7826057,"size":1018321596,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:0de0856e283060dd1afda4cabf739b80856ac7ae&amp;dn=Sexually+Broken%5CSkinny+girl+with+long+legs+Amber+Rayne++Matt+Wil&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"merzedes","files":-1,"time":1352928846,"description":"Skinny girl with long legs a deep throat and tiny ass is sex destroyed, brutal bondage real orgasms | Amber Rayne | Matt Williams\n\n\n\nMP4 only.\n\nAmber Rayne is back and this time she brought pig tails and cute socks! Lets take that cute, sexy, tiny ass, long legs, and deep throat and fuck it all up, what do you say?\n\n The first thing you will notice, if you have any understanding of how tough and difficult bondage really is, is that Amber's elbows are tightly bound behind her back touching. Not a comfy box tie, but a brutal elbow tie.\n\n We start by sliding our cock in and out of Amber's throat. Notice we didn't say mouth, that's too easy. We are plunging deep into this girl's throat, controlling her air intake, cutting off her ability to breathe. We own her, she will breathe when we want her to breathe. She gets air and we get a great blow job, it's a win-win. After we turn Amber all loopy, dizzy and out of breath, we flip her tiny body around and slam the cock ball deep into her tight little pussy. Within seconds she cums. Happens every time after a long, brutal deep throat session, every time.\n\n We lead Amber though a sexual gauntlet of devastation. We fuck her rough and hard, she cums, we toss her over and deep fuck her throat; she fights for air, for survival and when she thinks she can't take any more we toss her around again and fuck her ass. She cums more, we toss, we fuck her throat, she flashes, gags, struggles but we are relentless. We then fuck her pussy, again she cums.\n\n Amber is completely helpless. Cum drunk, she finds herself deep in subspace and still severely bound. At this point she is nothing more than but a sex puppet. We use each hole and use it well. In the end we vibrate out a few more screaming orgasms then finger blast her to one massive squirting climax. We hogtie her and her cute sock and tighten the bondage to a Category 4 level of pain. Amber has liquid seeping out of ever hole as she is left to languish, awaiting our return..\n\n\nScreens  &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/11_14arayne3/SexuallyBroken-Amber-Rayne-Matt-Williams-Skinny%20girl%20with%20long%20legs%20a%20deep%20throat%20and%20tiny%20ass%20is%20sex%20destroyed,%20brutal%20bondage%20real%20orgasms.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/11_14arayne3/SexuallyBroken-Amber-Rayne-Matt-Williams-Skinny%20girl%20with%20long%20legs%20a%20deep%20throat%20and%20tiny%20ass%20is%20sex%20destroyed,%20brutal%20bondage%20real%20orgasms.php&lt;/a&gt;\n\n\n8000 uploads and counting, if you like what Shallow2 and I upload, how about leaving us a nice comment below ? :)   \n \nCheers  :-)  \n\n\t\t","torrent":{"xt":"urn:btih:0de0856e283060dd1afda4cabf739b80856ac7ae","amp;dn":"Sexually+Broken%5CSkinny+girl+with+long+legs+Amber+Rayne++Matt+Wil","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0de0856e283060dd1afda4cabf739b80856ac7ae","infoHashBuffer":{"type":"Buffer","data":[13,224,133,110,40,48,96,221,26,253,164,202,191,115,155,128,133,106,199,174]},"announce":[],"urlList":[]}}