{"title":"Conicise Encyclopedia of Philosphy of Language [Non-Fiction] Mob","uid":8874111,"size":438630456,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0eceff3bba9dc9e74ed5d015a3ab9eff40634300&amp;dn=Conicise+Encyclopedia+of+Philosphy+of+Language+%5BNon-Fiction%5D+Mob&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"K-Slender","files":5,"time":1378146811,"description":"The distinguished international contributors present a clear, accessible guide to the fundamental questions raised by the philosophers about language. Contributions include Graeme Forbes on necessity, Susan Haack on deviant logics, Paul Horwich on truth, Charles Travis on Wittgenstein, L.J. Cohen on linguistic philosophy, Ruth Kempson on semantics and syntax and Christopher Hookway on ontology, to name but a few. A wide range of topics are covered from the metaphysics and ontology of language, language and mind, truth and meaning, to theories or reference, speech act theory, philosophy of logic and formal semantics. There are also articles on key figures from the twentieth century and earlier.\n\nBased on the foundation provided by the award-winning Encyclopedia of Language and Linguistics this single volume provides a collection of articles that will be an invaluable reference tool for all those interested in the area of philosophy of language, and also to those in cognitive science and psychology. All the articles have been thoroughly revised and updated. This volume gives a unique survey of topics that are at the very core of contemporary philosophy. ","torrent":{"xt":"urn:btih:0eceff3bba9dc9e74ed5d015a3ab9eff40634300","amp;dn":"Conicise+Encyclopedia+of+Philosphy+of+Language+%5BNon-Fiction%5D+Mob","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0eceff3bba9dc9e74ed5d015a3ab9eff40634300","infoHashBuffer":{"type":"Buffer","data":[14,206,255,59,186,157,201,231,78,213,208,21,163,171,158,255,64,99,67,0]},"announce":[],"urlList":[]}}