{"title":"Roberto Rossellini - Europa '51 (1952)","uid":4590725,"size":1259606938,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0f56308ff25d423cc2456a160fff248b5794cf21&amp;dn=Roberto+Rossellini+-+Europa+%5C%2751+%281952%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"closedoor","files":4,"time":1229816437,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0043511/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0043511/&lt;/a&gt;\n\nPoster http://img.photobucket.com/albums/v280/tomasutpen/album3/europa51.jpg\n\nThe life of a wealthy American woman (Ingrid Bergman) living in Rome is thrown into turmoil when her young son commits suicide over what he perceived to be her lack of affection for him. The woman's grief leads her to the realization that she has been living a shallow, bourgeoise existence and propels her to change her ways. As if on a spiritual quest, she begins devoting her life to helping the less fortunate - a sick prostitute, an unwed mother with numerous children - all of which disturbs her husband (Alexander Knox). When she helps a delinquent youth escape from the police, her husband deems her mentally unbalanced and has her committed to an asylum for life.\n\nThe second film collaboration between Italian director Roberto Rossellini and his wife Ingrid Bergman, Europa '51 (1952), was for many years dismissed by critics as a flawed and overtly didactic movie that lacked the passion of Stromboli (1950) or the artistry of Voyage to Italy (aka Viaggio in Italia, 1953). Even Ingrid Bergman, who was pregnant at the time it was filmed, had little to say about the film in her autobiography, My Story, except to note &quot;we were in such a hurry to get through that movie before it showed.&quot; At the time of the film's release, however, Bergman was still a figure of considerable controversy for having left her husband and daughter for Rossellini and the public reception of their films was considerably colored by the resulting scandal. Only in recent years has Europa '51 enjoyed a resurgence of interest, partly due to Martin Scorsese's unequivocal praise for it in his documentary on Italian cinema, My Voyage to Italy (Il Mio Viaggio in Italia, 1999).\n\nRossellini first came up with the initial concept for Europa '51 while he was filming The Flowers of St. Francis (1950) and later presented a completed story outline to Bergman as a present at Christmas. &quot;Roberto,&quot; Ingrid recalled (in The Adventures of Roberto Rossellini by Tag Gallagher), &quot;was talking to me about...what we would do if Saint Francis came back today. What would we do? We would do the same thing. He would be laughed at...He said, 'I am going to make a story about Saint Francis and [Francis is] going to be you. It was just how we would behave in '51 if a woman gives up a rich husband, a rich life, all her friends, everything, and goes out into the street to help the poor.'&quot; \n\nLike most of Rossellini's movies, the actual filming of Europa '51 was often chaotic, unpredictable and full of disruptions. First, it took more than sixteen months for the script to evolve from its early draft penned by Federico Fellini and Tullio Pinelli (with the help of a Dominican priest) to a screenplay by Jean-Paul Dreyfus aka &quot;Le Chanois&quot; (a Communist writer-director and former member of the French Resistance) to its final form with contributions from Rossellini and countless screenwriters including Donald Ogden Stewart, a former MGM scenarist who was now blacklisted by Hollywood for his political beliefs. Causing further delays was Rossellini's decision to switch producers, dropping his French investors and a Paris location in favor of Rome and a partnership with Carlo Ponti and Dino De Laurentiis who agreed not to meddle in his affairs but also didn't grant him a percentage of the picture - something Rossellini had enjoyed since 1943. \n\nCasting Europa '51 was relatively less complicated and memorable supporting roles were filled by Italian director Ettore Giannini as the Communist intellectual (director Luchino Visconti was originally offered the part but turned it down) and Fellini's wife, Giulietta Masina, as Passerotto, a relentlessly upbeat single mother living in dire poverty with her many children. Masina had made her screen debut in Rossellini's Paisan (1946) and had just completed her first major role in her husband's Variety Lights (1950).\n\nOnce filming began on Europa '51, there were new problems to face. Even though most of the cast and crew were Italian, the film was shot in English. &quot;The work was very complicated,&quot;[cinematographer Aldo] Tonti recalled (in Tag Gallagher's Rossellini biography), &quot;We were surrounded by throngs of journalists and photographers all the time, and Roberto was constantly changing the scenario, shooting all over Rome with the troupe, going from one end of the city to the other. What I remember is that Ingrid, ever so calm and serene, would sit in crannies knitting away, always, always, during the wearisome waiting for something to be shot.&quot;\n\nAccording to Donald Spoto in Notorious, his biography of Ingrid Bergman, Rossellini wanted his actors to invent their dialogue as they went along which proved to be an intimidating proposition, especially for Bergman. &quot;...Good actors need good writers, and she was given none,&quot; Spoto wrote. &quot;To aggravate the situation, Rome was in the grip of a terrific heat wave, so Roberto decided to film at night and sent his cast to bed by day...In addition, she [Bergman] came down with a heavy cold she could not lose for weeks.&quot; Ingrid's co-star, Alexander Knox, also found Rossellini's methods challenging. &quot;Only twice did I have my dialogue the night before a scene was to be shot,&quot; said Knox. &quot;Both times, the lines were changed when we met on the set in the morning. All the rest of the time I had no dialogue until a few minutes before the camera turned. Once I was lit for a close-up and the camera had started turning before anyone realized that I had not been given any dialogue. I just sat there, smiling fatuously at Roberto and cameraman Aldo Tonti, and smoking a cigarette. Suddenly, Rossellini spoke. 'Look at Ingrid,' he said, 'and tell her you're not going out tonight.' I laughed, turned again to Ingrid, and said obediently, 'I'm not going out tonight.' The camera was still turning. 'Basta' Rossellini said at length. The camera stopped turning, the lights faded, and I leaned back. 'Well,' I asked, 'am I going out tonight or not?' 'I don't know,' said Roberto. 'But I'll know in a week or two - and I won't have to come back into this set.'&quot; (from The Adventures of Roberto Rossellini by Tag Gallagher).\n\nWhen it first opened in Italy, Europa '51 was well received by the public and most Italian critics; it even won Rossellini the prestigious International Award at the Venice Film Festival. It was all downhill from there. Released in the U.S. as The Greatest Love, it received less than positive reviews with Bosley Crowther of The New York Times, mirroring the opinions of many critics when he called the film a &quot;dismal and dolorous account of the frustrations of a socially distinguished young matron...&quot; The decidedly uncommercial film generated no business in the U.S. and drifted into obscurity. Its reputation wasn't helped in later years when Bergman biographer Donald Spoto wrote that Europa '51 &quot;suffered from abrupt transitions, unclear motivations and an odd mix of religious conviction, social conscience, political outrage and frank sermonizing.&quot; \n\nMore recently film scholars have come to view the Rossellini-Bergman films in a different light, realizing that both thematically and artistically, Rossellini's work was ahead of its time, particularly in the case of Europa '51. While the film could certainly be viewed as Rossellini's vision of the current state of the world in all its confusion, Europa '51 is also an exploration of Ingrid Bergman's persona. The critic Guarner said it best when he wrote, &quot;An attempt is made to express a far-reaching moral conflict, which is incarnated in a woman's face, merely by means of a series of actions, sketched out in a few strokes with a simplification that touches on abstraction. Ultimately, it is this face that gives coherence to an otherwise discontinuous film, in the same way as the image of Falconetti or Anna Karina fills the gaps in [Dreyer's] La Passion de Jeanne d'Arc [1928] and [Godard's] Vivre sa vie [1962]....The film is an ascent from the darkness of the beginning towards a dazzling light of the end, when Irene...regain[s] her inner freedom.&quot;\n\nProducer: Dino De Laurentiis, Carlo Ponti, Roberto Rossellini\nDirector: Roberto Rossellini\nScreenplay: Roberto Rossellini, Sandro De Feo, Ivo Perilli, Brunello Rondi, Mario Pannunzio\nCinematography: Aldo Tonti\nEditing: Jolanda Benvenuti\nMusic: Renzo Rossellini\nProduction Design: Virgilio Marchi\nCast: Ingrid Bergman (Irene Girard), Alexander Knox (George Girard), Ettore Giannini (Andrea), Teresa Pellati (Ines), Marcella Rovena (Mrs. Puglis), Giulietta Masina (Passerotto), Tina Perna (Cesira).\nC-113m. \n\nby Jeff Stafford \n\n\nI hate emule but i dl it ~1 month from emule and upload in binmovie_ru (see in google) and now in tpb. \n\nGreat film. Pity NO ENGLISH SUBS!\n\nThis is rip by &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;9cdef0e9f9dbfdeef8f9f2f5fddcd8f5eac4dff0fdeff5fff3b2fff3f1&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\nIn two files.\n\n\nFile 1: Europa 51 Roberto Rossellini-DVDrip-CD1-Dual (Italian-Spanish) BlueGardenia-DivXClasico.com.avi\nFilesize: 603.16 Mb ( 632Ã‚Â 463Ã‚Â 360 bytes )\nPlay length: 00:53:32.199 (80305 frames)\nSubtitles: Present (SubRip format) spanish srt\nVideo: 576x432 (1.33:1), 25 fps, DivX Codec 5.2.1 build 1328 ~1335 kbps avg, 0.21 bit/pixel\nAudio #1: 48 kHz, MPEG Layer 3, 2 ch, ~112.00 kbps avg spanish\nAudio #2: 48 kHz, MPEG Layer 3, 2 ch, ~112.00 kbps avg italian\n\n\nFile 2: Europa 51 Roberto Rossellini-DVDrip-CD2-Dual (Italian-Spanish) BlueGardenia-DivXClasico.com.avi\nFilesize: 598.00 Mb ( 627Ã‚Â 044Ã‚Â 352 bytes )\nPlay length: 00:54:51.840 (82296 frames)\nSubtitles: Present (SubRip format)spanish srt\nVideo: 576x432 (1.33:1), 25 fps, DivX Codec 5.2.1 build 1328 ~1284 kbps avg, 0.21 bit/pixel\nAudio #1: 48 kHz, MPEG Layer 3, 2 ch, ~112.00 kbps avg spanish\nAudio #2: 48 kHz, MPEG Layer 3, 2 ch, ~112.00 kbps avg italian\n\nSubtitles spanish sync srt includ.\n\nscreenshots\n &lt;a href=&quot;\nhttp://img1.immage.de/2012e1wan1t3vq.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img1.immage.de/2012e1wan1t3vq.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img1.immage.de/2012g2jkwrtf7v.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img1.immage.de/2012g2jkwrtf7v.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img1.immage.de/2012bc8e947q0t1tyin.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img1.immage.de/2012bc8e947q0t1tyin.jpg&lt;/a&gt;\n\n\nEnjoy.","torrent":{"xt":"urn:btih:0f56308ff25d423cc2456a160fff248b5794cf21","amp;dn":"Roberto+Rossellini+-+Europa+%5C%2751+%281952%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f56308ff25d423cc2456a160fff248b5794cf21","infoHashBuffer":{"type":"Buffer","data":[15,86,48,143,242,93,66,60,194,69,106,22,15,255,36,139,87,148,207,33]},"announce":[],"urlList":[]}}