{"title":"Carr-Conspiracy to Destroy All Existing Governments&amp;Religions","uid":4739189,"size":117137,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:10180bcbfd379e8115be0ca446503e638be3d765&amp;dn=Carr-Conspiracy+to+Destroy+All+Existing+Governments%26Religions&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"red_gonzo","files":1,"time":1235465894,"description":"This is William Guy Carr's amazing booklet The Conspiracy to Destroy All Existing Governments and Religions which is a short but very informative survey of the origins of the Luciferian conspiracy that has vowed itself to destroy governments and religions all around the world. Clearly referring to John Robison's main work Proofs of a Conspiracy (1798) who published documents which had been entrusted to his care by members of Weishaupt's Illuminati while he had been touring Europe prior to the outbreak of the French Revolution in 1789. The Bavarian Government discovered Weishaupt's conspiracy when lightning struck one of his couriers dead as he rode through Ratisbon on his way to Paris. The police found a copy of the revised version of the conspiracy in transit to members of Weishaupt's Illuminati who had been charged with the responsibility of fomenting the Great French Revolution. This first major project, leading to the ultimate destruction of all governments and religions, was scheduled to break out in 1789. Weishaupt's plan is extremely simple. He organized the Illuminati and then formed the Grand Orient Lodges to infiltrate the Illuminati into Blue or European Masonry, using the Lodges as their secret headquarters. Thus the conspirators could operate under the cloak of philanthropy. Published after Carr's death, this fascinating booklet explains the origins, philosophy and the master plan for bringing a new order into place. 30 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:10180bcbfd379e8115be0ca446503e638be3d765","amp;dn":"Carr-Conspiracy+to+Destroy+All+Existing+Governments%26Religions","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10180bcbfd379e8115be0ca446503e638be3d765","infoHashBuffer":{"type":"Buffer","data":[16,24,11,203,253,55,158,129,21,190,12,164,70,80,62,99,139,227,215,101]},"announce":[],"urlList":[]}}