{"title":"Adin Steinsaltz - The Thirteen Petalled Rose (pdf)","uid":8590197,"size":1599846,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1025fea8d409353a6086cf05da3a88d80ea6dbe5&amp;dn=Adin+Steinsaltz+-+The+Thirteen+Petalled+Rose+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"pharmakate","files":-1,"time":1371621848,"description":"Adin Steinsaltz - The Thirteen Petalled Rose: A Discourse on the Essence of Jewish Existence and Belief (Basic Books, 2006). 200 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\nModern classic of Jewish Kabbalah.\n\ndescription:\n\nFrom Madonna's music videos to the glossy pages of celebrity magazines and back to the Lower East Side of Manhattan, Jewish mysticism has stepped into the modern consciousness like never before. In this classic work, world-renowned scholar Adin Steinsaltz answers the major questions asked by modern Jews about the nature of existence in God's universe. The title The Thirteen Petalled Rose is taken from the opening of the classic Jewish text on mysticism, the Zohar, and refers to the &quot;collective souls of the Jewish people,&quot; which scholars have likened to the fullness of a rose and its thirteen petals. Along with a new preface by the author, this edition contains a new chapter on prayer that provides the most up-to-date account of the Kabbalistic view of devotion. Another new chapter recounts and interprets the prophet Elijah's Introduction to the Zohar. \n\n&quot;Steinsaltz possesses a mind of the quality that occurs perhaps once or twice in a generation, or several generations.... In [The Thirteen Petalled Rose] one can encounter the classical Jewish mystical view of reality, delineated lucidly, concisely, profoundly and, what is so rare, believingly. It is an utterly authentic expression of Judaism yet so unknown even among the well-informed and therefore so necessary, so welcome.&quot; (Herbert Weiner, Oxford University)\n\n-----\n\nfor an introduction to Kabbalah, see Herbert Weiner's 9 1/2 Mystics:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8233033&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8233033&lt;/a&gt;\n\na short collection of excerpts from the Zohar:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8213772&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8213772&lt;/a&gt;","torrent":{"xt":"urn:btih:1025fea8d409353a6086cf05da3a88d80ea6dbe5","amp;dn":"Adin+Steinsaltz+-+The+Thirteen+Petalled+Rose+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1025fea8d409353a6086cf05da3a88d80ea6dbe5","infoHashBuffer":{"type":"Buffer","data":[16,37,254,168,212,9,53,58,96,134,207,5,218,58,136,216,14,166,219,229]},"announce":[],"urlList":[]}}