{"title":"Wonders of The World - St Peters (Architecture Art Ebook).pdf","uid":10091366,"size":4153661,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:10e67339172ef02e7743a95bde33ece1c2206728&amp;dn=Wonders+of+The+World+-+St+Peters+%28Architecture+Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"STBGD","files":-1,"time":1399203451,"description":"Keith Miller &quot;St Peter's (Wonders of the World)&quot;\n256 pages | PDF | 2,7 MB\n\n\nMary Beard is a Professor of Classics at Cambridge University. She is the editor of The Wonders of the World which is &quot;a small series of books that will focus on some of the world's most famous sites or monuments.&quot; Several books have already been published, including Beard's The Parthenon (Wonders of the World), Beard's and Keith Hopkins' The Colosseum (Wonders of the World) and Cathy Gere's The Tomb of Agamemnon (Wonders of the World). Keith Miller's first book is a worthy addition to the series. \n\nLike the other books in the series, this book reveals the architectural and cultural implications of its subject. It is aimed not at specialists but at the general inquisitive reader (&quot;the intelligent ignorant,&quot; as Beard often refers to herself). \n\nKeith Miller starts his book in the 1st century CE at the Hippodrome of Nero, one of two places where the Apostle Peter may have been crucified. It continues 250 years later with the conversion of Emperor Constantine in the fourth century, and his building of the first Christian basilica, commonly known as Old St Peter's. Miller enlivens the step-by-step creation of the present-day basilica with some of the functions the building has performed: for example, the imposing of woolen pallia on newly consecrated metropolitan archbishops and the coronations of Charlemagne and other emperors. \n\nIn 1506 Pope Julius II had the fourth-century building mostly demolished. Miller carefully describes the complicated development of the new basilica. He describes how Donato Bramante's plan was superseded by Peruzzi (after Bramante's death in 1514), then the contributions of Sangallo, Michelangelo and Raphael. He explains Bernini's colonnades, baldacchino and statuary throughout the building. He provides an in-depth look at the underground grottoes and the necropolis. \n\nI thought Miller was particularly good on the question of precisely where St Peter is supposed to be buried and whether his tomb is actually here. He reviews Pius XII's 1950 confirmation, and the later discovery that there were bones of at least four different people, one a woman. Miller provides a balanced view of the debate, including some irrefutable evidence that someone of great significance was buried on the site. He carefully analyzes the necropolis, with drawings and a chronology. \n\nMiller's background is in art history, and he is excellent at describing the works of art still in the basilica or have been moved from the building. He is good at delineating architectural perspectives, magnitude and dynamics. \n\nI would have preferred footnotes and a better bibliography; Miller does acknowledge a few texts including James Lees-Milne's St. Peter's: The Story of Saint Peter's Basilica in Rome published in 1967, as well as &quot;various texts&quot; by Gottfried Semper. Despite these nits, this book is readable and well researched. ","torrent":{"xt":"urn:btih:10e67339172ef02e7743a95bde33ece1c2206728","amp;dn":"Wonders+of+The+World+-+St+Peters+%28Architecture+Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10e67339172ef02e7743a95bde33ece1c2206728","infoHashBuffer":{"type":"Buffer","data":[16,230,115,57,23,46,240,46,119,67,169,91,222,51,236,225,194,32,103,40]},"announce":[],"urlList":[]}}