{"title":"Standup Comedy - Lily Tomlin - This is a Recording (1971)","uid":6088552,"size":45428988,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:11857570c7bc86c44769fe3654cfc843916d799f&amp;dn=Standup+Comedy+-+Lily+Tomlin+-+This+is+a+Recording+%281971%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rambam1776","files":-1,"time":1294443608,"description":"I recently pulled a large number of comedy albums from a variety of sources. Some of them were ready to go, some needed tag fixing, some needed to be converted from FLAC to something humans use, and some were old LP rips from vinyl that were torrented as a single mp3 file, regardless of track. I am releasing these with this generic disclaimer at the top to save the time of having to explain each one individually. These are released AS IS, and lower bit rate albums cannot be re-torrented as higher quality as I do not HAVE the original albums. I am just doing what I can to make sure as much standup comedy as possible is out there on the public trackers and not just on private ones. Much thanks to all the original OPs, especially those folks who have ripped older LP albums that are so much harder to find than more recent stuff. Wherever possible, I have fixed tags, included album notes and artwork, and listed the album tracks. As a lover of comedy, I hope some of you younger folks take a chance on loading some of the older and perhaps unknown (to YOU!) stuff, and giving it a chance. There WAS comedy before Daniel Tosh and Tim Minchin, and some of it was freaking brilliant. Try to expand your repertoire. Enjoy.\n\n\n\nThis Is A Recording is a comedy album released in 1972 by actress-comedienne Lily Tomlin. The full album is comic sketches of Tomlin in her most famous character, Ernestine, the noisy, rather annoying and uncaring telephone operator. The album, Tomlin's first, won her a Grammy Award for Best Comedy Recording. Tomlin became the first woman to win this award for a solo recording (in 1962 Elaine May won for an album with Mike Nichols; in the years since only Whoopi Goldberg among female comedians has won the award.\n\nTrack listing\n\n1. Alexander Graham Bell\n2. Mr. Veedle\n3. The Marriage Counselor\n4. Joan Crawford\n5. Obscene Phone Call\n6. The Repairman\n7. The Bordello\n8. Strike\n9. Peeved\n10. Ernestine\n11. The Pageant\n12. The F.B.I.\n13. The Mafia and the Pope\n14. Mrs. Mitchell\n15. Awards Dinner\n16. Boswick 9\n17. I.B.M.\n\n &lt;a href=&quot;\nhttp://laughstore.stores.yahoo.net/liltomthisis.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://laughstore.stores.yahoo.net/liltomthisis.html&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.amazon.com/This-Recording-Lily-Tomlin/dp/B000069Z10&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/This-Recording-Lily-Tomlin/dp/B000069Z10&lt;/a&gt;\n &lt;a href=&quot;\nhttp://bayimg.com/IAcOjAADn&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/IAcOjAADn&lt;/a&gt;\n &lt;a href=&quot;\nhttp://allmusic.com/artist/lily-tomlin-p237/biography&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://allmusic.com/artist/lily-tomlin-p237/biography&lt;/a&gt;\n\n\nBiography\n\nby Sandy Lawson\n\nShe has been on the cover of Time, People, American Film, and The Advocate. She's been on the silver screen, the little screen, in comedy clubs, and onstage for over four decades. Lily Tomlin is a staple of American comedy. Best known for her larger-than-life and still-believable characters, many remember her from Rowan and Martin's Laugh-In TV, where Tomlin introduced viewers to Ernestine, the snappy telephone operator, and Edith Ann, the little girl who sits in the big chair and tells it like she sees it. Her ingenuity and knack for creating such loveable, laughable characters have rendered her a following that will last a lifetime\n\nAnother highlight of Tomlin's career (look up the word &quot;longevity&quot;), and perhaps one that most comprehensively captures her talents, is her long-running off-Broadway show The Search for Signs of Intelligent Life in the Universe, on which she collaborated with partner in showbiz and life, Jane Wagner, and won the Tony Award for Best Actress in 1986. The show was so celebrated, in fact, that it was revived for a second run in the year 2000. It was also made into a movie (which the making of was made into a documentary, simply titled Lily Tomlin, in 1986) and published as a book. In the show, Tomlin plays a host of characters, from bag lady to angst-ridden punk rock teen.\n\nNot a conventional leading lady, Lily Tomlin has still managed to capture the hearts and imagination of millions of Americans in such box-office hits as 9 to 5 with Dolly Parton and Jane Fonda, All of Me with Steve Martin, and Big Business with Bette Midler. And who can forget Lily Tomlin in the '80s remake of The Incredible Shrinking Woman, in which she played both a disappearing housewife and the incorrigible super-consumer woman Mrs. Judy Beasley?\n\nBefore her string of box-office comedies, Tomlin was nominated for an Oscar for her dramatic role in Nashville, directed by Robert Altman. Later, Tomlin would team up again with Altman for a part in his award-winning Short Cuts, playing opposite Tom Waits. Additionally, Lily Tomlin played the character of Miss Jane in the remake of The Beverly Hillbillies, produced two animated specials revolving around the character of Edith Ann (who also made her own guest appearances on Sesame Street and Saturday Night Live), and had a regular role on Murphy Brown as Kay Carter-Shepley, the new FYI producer.\n\nThroughout the '70s, when Tomlin was touring her act in nightclubs, she made a series of sound recordings, including This Is a Recording, That's the Truth, and Modern Scream. Before pursuing a career in comedy, Lily Tomlin (born Mary Jean) was premed at Wayne State University in Detroit, MI.\n\n","torrent":{"xt":"urn:btih:11857570c7bc86c44769fe3654cfc843916d799f","amp;dn":"Standup+Comedy+-+Lily+Tomlin+-+This+is+a+Recording+%281971%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11857570c7bc86c44769fe3654cfc843916d799f","infoHashBuffer":{"type":"Buffer","data":[17,133,117,112,199,188,134,196,71,105,254,54,84,207,200,67,145,109,121,159]},"announce":[],"urlList":[]}}