{"title":"Houndstooth - No News from Home (2015) [FLAC]","uid":12164475,"size":241181199,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1190062aac22218d4ad7fb19d7ba269998403010&amp;dn=Houndstooth+-+No+News+from+Home+%282015%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"politux","files":12,"time":1437997301,"description":"\n  Houndstooth - No News from Home (2015) [FLAC]\n\n  Genre: Rock\n  Style: Indie, Alternative\n  Source: WEB\n  Codec: FLAC\n  Bit rate: ~ 1,000 kbps\n  Bit depth: 16\n  Sample rate: 44.1 kHz\n\n  01 Bliss Boat \n  02 Amelia \n  03 No News From Home \n  04 Green Light \n  05 Wasted Hours \n  06 Witching Hour \n  07 Borderlands \n  08 Yellow Stone \n  09 Double Vision \n  10 Spirit \n  11 They're Racing Tonight \n\n  The second studio long-player from the Portland, Oregon-based indie rock unit, No News From Home finds Houndstooth doubling down on the fuzzed-out, Americana-laced dream pop of their 2013 debut, offering up an evocative ten-track set that skillfully pairs the confectionary with the cerebral. Katie Bernstein's laconic delivery lends an air of rural, garage-rock cool to standout cuts like &quot;Amelia,&quot; &quot;Borderlands,&quot; and the wistful title track, but where contemporaries like Courtney Barnett and Alvvays go wry, Bernstein, perhaps in a nod to the overcast skies of her Pacific Northwest stomping grounds, opts for a sort of bucolic melancholia. More weary than jaded, her deadpan delivery is punctuated to great effect by guitarist and co-vocalist John Gnorski's tube-driven, vibrato-heavy leads, and when he croons along beside her, it often invokes the alternately chill and subtly coiled dynamic between John Doe and Exene Cervenka (X) and Rick Rizzo and Janet Beveridge Bean (Eleventh Dream Day), especially on the Gnorski-led rocker &quot;Witching House.&quot; Houndstooth more often than not stay true to their ramshackle indie pop roots, but forays into kaleidoscopic, psych-rock (&quot;Double Vision&quot;), and vintage, saddle shoe country-pop (&quot;Spirit&quot;) show a real willingness to explore around the edges of their sonic foundation -- they frequently exhibit the kind of effortless technical acumen that can only come from endless hours spent in a van together, and that blissful one or two hours post-midnight where all of that rest stop/club basement mundaneness gets a much needed reprieve. Subtle, yet curiously persuasive, No News From Home is as unassuming as it is alluring. It won't stop you in your tracks, but it will cause you to slow down and look both ways before crossing","torrent":{"xt":"urn:btih:1190062aac22218d4ad7fb19d7ba269998403010","amp;dn":"Houndstooth+-+No+News+from+Home+%282015%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1190062aac22218d4ad7fb19d7ba269998403010","infoHashBuffer":{"type":"Buffer","data":[17,144,6,42,172,34,33,141,74,215,251,25,215,186,38,153,152,64,48,16]},"announce":[],"urlList":[]}}