{"title":"Authoritarianism and Polarization in American Politics [blackatk","uid":8673895,"size":2112891,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:122b132c5f7c680a13bf94a9c4f71c30fe758805&amp;dn=Authoritarianism+and+Polarization+in+American+Politics+%5Bblackatk&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"blackatk","files":-1,"time":1373549151,"description":"Publication Date: August 24, 2009 | ISBN-10: 052171124X | ISBN-13: 978-0521711241 | Edition: 1\n\nAlthough politics at the elite level has been polarized for some time, a scholarly controversy has raged over whether ordinary Americans are polarized. This book argues that they are and that the reason is growing polarization of worldviews - what guides people's view of right and wrong and good and evil. These differences in worldview are rooted in what Marc J. Hetherington and Jonathan D. Weiler describe as authoritarianism. They show that differences of opinion concerning the most provocative issues on the contemporary issue agenda - about race, gay marriage, illegal immigration, and the use of force to resolve security problems - reflect differences in individuals' levels of authoritarianism. This makes authoritarianism an especially compelling explanation of contemporary American politics. Events and strategic political decisions have conspired to make all these considerations more salient. The authors demonstrate that the left and the right have coalesced around these opposing worldviews, which has provided politics with more incandescent hues than before.\n\nReview\n&quot;What makes this book genuinely impressive is that it remains grounded at all times in hard empirical evidence while simultaneously advancing provocative arguments about America's political conflicts (including a certain-to-be-controversial chapter devoted to the role which authoritarianism played in the Clinton/Obama war)...I really recommend this book...&quot;\n-Glenn Greenwald, Salon.com\n\n&quot;Hetherington and Weiler's Authoritarianism and Polarization in American Politics breaks new ground in the debate about the nature of polarization in the American public and in so doing reinvigorates the study of authoritarianism. This is an important and compelling work that will be of interest to all students of American politics.&quot;\n-Edward G. Carmines, Indiana University\n\n&quot;The once-dormant concept of authoritarianism has seen a rebirth in recent years, as scholars have begun to appreciate fully its explanatory power. Nowhere has this power been analyzed more thoughtfully than in Authoritarianism and Polarization in American Politics, where Hetherington and Weiler argue persuasively that the evolving political landscape, whose topography is often shaped by visceral issues such as race, crime, feminism, sexual orientation, immigration, and terrorism, is the inevitable result of the clashing and irreconcilable worldviews of individuals with, and without, authoritarian belief systems, who simply think about the world in fundamentally different, and polarized, ways. Perhaps the most important contribution of this book, however, is the insight that authoritarianism does not explain everything political; conditions sometimes arise that cause people with different worldviews to see the world the same way. After 9/11 a large proportion of Americans supported torture, wiretapping, and preemptive war. These were not fringe positions taken only by hard-core authoritarians. Rather, the authors show that reasonable people want to feel safe, too, and will support a strong hand when they feel threatened. This book will be central to our understanding of the roots and ramifications of post-9/11 politics.&quot;\n-Jon Hurwitz, University of Pittsburgh\n\n&quot;This book tackles two of the most fundamental problems in the study of contemporary American politics -- the polarization of the electorate and the role, if any, of ideology in directing the political choices of ordinary citizens. It brings an entirely new light to both by bringing into view the deep psychological roots of political belief and behavior. It is a work of exceptional reach and vision.&quot;\n-Paul Sniderman, Stanford University\n\n&quot;Where political science has a long tradition of seeing political conflict through the lens of 'issues' debates about public policy, Hetherington and Weiler see the fundamental sorting process as instead a matter of personality. For them the new defining reality of American politics is a choice between authoritarian and non-authoritarian styles of reacting. The widely noted polarization of American politics is from their viewpoint a polarization between people, some of whom hold a worldview where issues are simple, choices black and white, and tradition a reliable guide to action, and others who prefer complexity, nuance, and change. Because these differences of worldview involve cherished symbols, they produce a party politics of deadlock.&quot;\n-James A. Stimson, University of North Carolina, Chapel Hill\nBook Description\nA scholarly controversy has raged over whether ordinary Americans are polarized. This book argues that they are because the left and right are increasingly divided by an overarching worldview that guides people's view of right and wrong. This divide is rooted in authoritarianism, causing especially contentious political conflict.\n\n\nPaperback: 246 pages\nPublisher: Cambridge University Press; 1 edition (August 24, 2009)\nLanguage: English\nISBN-10: 052171124X\nISBN-13: 978-0521711241\n\n &lt;a href=&quot;\nhttp://www.amazon.com/Authoritarianism-Polarization-American-Politics-Hetherington/dp/052171124X&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Authoritarianism-Polarization-American-Politics-Hetherington/dp/052171124X&lt;/a&gt;\n","torrent":{"xt":"urn:btih:122b132c5f7c680a13bf94a9c4f71c30fe758805","amp;dn":"Authoritarianism+and+Polarization+in+American+Politics+%5Bblackatk","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"122b132c5f7c680a13bf94a9c4f71c30fe758805","infoHashBuffer":{"type":"Buffer","data":[18,43,19,44,95,124,104,10,19,191,148,169,196,247,28,48,254,117,136,5]},"announce":[],"urlList":[]}}