{"title":"The Anthony Cumia Show 2015-03-18 MP4 MP3 combo","uid":11766117,"size":304552540,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:125c4b1ee43bac0557a87d8a038a34999ce08d08&amp;dn=The+Anthony+Cumia+Show+2015-03-18+MP4+MP3+combo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"mothergoose58","files":2,"time":1426859914,"description":"Note: More sound / encoding issues with the source vid. After encoding a file with pass-through audio (that was 320MB!) I decided to use just the right channel (the left drops out 1/3rd of the way through for some reason with AAC encoders) only and pan it to both L and R. Sounds fine to me and keeps the file size much lower.\n\n*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nGuest: Bobo\n\nEpisode 129 &quot;Fun with Bobo&quot;: Wednesday's show begins with Ant explaining his green attire paired with the green screen yesterday, we take a look at St. Patrick's Day in Minneapolis, find out that Bobo is in the house today, and Anthony gives Bobo a &quot;tattoo money challenge&quot;. He then goes through a news story where Dick Cheney is hating on Obama, discusses dictatorships, indulges in some &quot;gun chat&quot;, plays a (propaganda) video of a gun store, and tells us about his newest on-line game, &quot;Battlefield Hardline&quot;. After a couple of calls, KtC checks in on Bobo, we see racist targets for purchase at a gun show, read some of the Azealia Banks interview from Playboy, talk about Starbucks &quot;fantastic&quot; idea involving race, watch a &quot;thug life&quot; video, and take a gander at crazy white people attempting to plan a trip to Mars. We watch a blame shifting airplane smoker, learn that Penn State has suspended a fraternity because of nude photos, the family of the asshole kid in a viral video beating down an innocent kid speaks out, and Ant checks back in with a TACS covered Bobo to get a final money count.\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:125c4b1ee43bac0557a87d8a038a34999ce08d08","amp;dn":"The+Anthony+Cumia+Show+2015-03-18+MP4+MP3+combo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"125c4b1ee43bac0557a87d8a038a34999ce08d08","infoHashBuffer":{"type":"Buffer","data":[18,92,75,30,228,59,172,5,87,168,125,138,3,138,52,153,156,224,141,8]},"announce":[],"urlList":[]}}