{"title":"Standup Comedy - Jim Norton - Trinkets I Own Made From Gorilla H","uid":4319879,"size":115255135,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:12b9d3bee77c56f56b08349a5a895bf427f34ef3&amp;dn=Standup+Comedy+-+Jim+Norton+-+Trinkets+I+Own+Made+From+Gorilla+H&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rambam1776","files":33,"time":1217371328,"description":"I finally got an invitation to join Demonoid, where my Google searches for torrents I cannot find here keep showing great stuff. I spent all last week grabbing comedy albums which I am now going to upload here. Other than going to the trouble of fixing tags and getting artwork and details, these torrents are as the original posters seeded them. I am not endorsing or recommending all of these. In fact, I think some of them suck. However, there is a major lack of well seeded comedy torrents here, and I hope to encourage more people to post new ones. Also, who says *MY* taste matches somebody elses? The reviews are from ALLMUSIC or from AMAZON. As usual, much thanks to the OPs who put these out and about.\n\nRambam1776\n\n\n\nJim Norton - Trinkets I Own Made From Gorilla Hands\n\nJim Norton (born July 19, 1968) is an American stand-up comedian, actor and author hailing from New Jersey. He is heard on the nationally syndicated Opie and Anthony radio program. He has appeared on the Tonight Show with Jay Leno five times and the Late Show with David Letterman, filmed an HBO stand-up special for the series One Night Stand, co-starred in the short-lived HBO sitcom Lucky Louie and had a cameo in the film Spider-Man. He is best known for his so-called &quot;cringe humor&quot; style, which deals with sensitive and uncomfortable subjects. Norton recently hosted the filming of four episodes for an HBO stand-up showcase titled Down and Dirty with Jim Norton.\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Jim_Norton_%28comedian%29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Jim_Norton_%28comedian%29&lt;/a&gt;\n\nJim Norton is one of the best and most fearless comedic minds in the business, a man who knows little to no boundaries and never fails to take the most drastic risks with his act. His 2003 independent release &quot;Yellow Discipline&quot; proves these facts about Norton, providing a perfect snapshot of his on-stage performance at that time. But like any good comedian, Norton and his act have grown by leaps and bounds since that debut recording hit the market, as well as the man&amp;#039;s popularity with audiences nationwide. Luckily, this growth is also captured on album, with the release of Norton&amp;#039;s sophomore effort &quot;Trinkets I Own Made From Gorilla Hands.&quot;\n\nRecorded a few months prior to his return to the radio airwaves on XM Satellite Radio&amp;#039;s popular &quot;Opie and Anthony Show,&quot; Norton&amp;#039;s latest release finds him alot more brutal and a great deal more comfortable on stage. Granted, it seemed impossible for Norton to improve, as &quot;Yellow Discipline&quot; was as close to a perfect act as a comedian could hope for. But improve he does, dazzling the audience over the hour-long set featured on &quot;Trinkets.&quot;\n\nPerhaps the most brilliant aspect of Norton&amp;#039;s act is that he never plays it safe. While many comedians stick to the middle-of-the-road by addressing such topics as airports, driving or fast food, Norton opts for a different route. On &quot;Trinkets,&quot; Norton takes on more risky subject matter, evidenced by his rants on people with OCD, the absurdity of ethnic pride, and gay parenthood. Norton is never afraid to be offensive, which in turn leads to his never failing to be extremely funny. The material on &quot;Trinkets&quot; is guaranteed to send the squeamish running, which is exactly what fans of true comedy are looking for. Norton realizes this too, it seems, never holding back his opinions and theories on real-life subjects and making other comedians look redundant in the process.\n\nThe album closes out with a devastatingly funny clip of an answering machine message left on Norton&amp;#039;s machine by his mother. It&amp;#039;s inclusion is not only extremely funny, but it is an interesting contrast to the bulk of &quot;Trinkets.&quot; After about an hour of brutal, merciless stand up comedy encompassing the most edgy subject matter, it is nice to know that Norton does in fact have a mother. His detractors would probably claim that he couldn&amp;#039;t possibly be the spawn of human beings, but the closing track proves them wrong and shows that everybody has to answer to their mother in the end.\n\nJim Norton is one of a few comics out there keeping comedy alive and well in America. With the business full of bland acts these days, it&amp;#039;s refreshing to find such an innovative and original act like Norton&amp;#039;s out there for mass consumption. &quot;Trinkets&quot; proves that Norton is a force to be reckoned with in comedy and leaves the listener with the hope that it is one in a long line of recordings by this comedic genius.\n\nTo purchase Jim Norton&amp;#039;s &quot;Trinkets I Own Made From Gorilla Hands,&quot; visit www.eatabullet.com\n\nTrack listing\n1.\t&quot;another dumb, bumbling Vinny intro&quot; \n2.\t&quot;hot French people&quot; \n3.\t&quot;the Blackout of &amp;#039;03&quot; \n4.\t&quot;a fun date&quot; \n5.\t&quot;penile philosophy &amp; blackout humor&quot; \n6.\t&quot;no water = messy bowl&quot; \n7.\t&quot;OCD scumbags&quot; \n8.\t&quot;a tip on flirting&quot; \n9.\t&quot;bloody lump on the linoleum&quot; \n10.\t&quot;ethnic pride drivel&quot; \n11.\t&quot;the &amp;#039;N&amp;#039; word&quot; \n12.\t&quot;understandable racism&quot; \n13.\t&quot;relations with the elderly&quot; \n14.\t&quot;nervous tics&quot; \n15.\t&quot;legless old lady&quot; \n16.\t&quot;gay snipers&quot; \n17.\t&quot;a shot in the eye&quot; \n18.\t&quot;mean-spirited Christopher Reeve jokes&quot; \n19.\t&quot;boys don&amp;#039;t cry&quot; \n20.\t&quot;alcohol &amp; true confessions&quot; \n21.\t&quot;gay mommies&quot; \n22.\t&quot;awful Cosmo advice&quot; \n23.\t&quot;television comedy&quot; \n24.\t&quot;reality TV&quot; \n25.\t&quot;shameless Yellow Discipline plug&quot; \n26.\t&quot;donkey-sex and German porn&quot; \n27.\t&quot;you like sucking that?&quot; \n28.\t&quot;madcap ideas about oral sex&quot; \n29.\t&quot;Vinny&amp;#039;s mercifully brief outro&quot; \n30.\t&quot;a phone call from mother&quot; \n\n","torrent":{"xt":"urn:btih:12b9d3bee77c56f56b08349a5a895bf427f34ef3","amp;dn":"Standup+Comedy+-+Jim+Norton+-+Trinkets+I+Own+Made+From+Gorilla+H","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12b9d3bee77c56f56b08349a5a895bf427f34ef3","infoHashBuffer":{"type":"Buffer","data":[18,185,211,190,231,124,86,245,107,8,52,154,90,137,91,244,39,243,78,243]},"announce":[],"urlList":[]}}