{"title":"EXPLOITED COLLEGE GIRLS - Haley - Amateur Anal Orgasm SD","uid":8939629,"size":423559037,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:12f2e1174a63457b7e32e555cee696063dbe8c6a&amp;dn=EXPLOITED+COLLEGE+GIRLS+-+Haley+-+Amateur+Anal+Orgasm+SD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"beta2008x","files":1,"time":1379636121,"description":" &lt;a href=&quot; http://imgboxxx.com/viewer.php?file=crf8r_lyh.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://imgboxxx.com/viewer.php?file=crf8r_lyh.jpg&lt;/a&gt;\n  &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=biwye_ecg_haley_s.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=biwye_ecg_haley_s.jpg&lt;/a&gt;\n\nThis week's girl is a true pleaser, from her loud, real orgasms to her enthusiasm for anal sex to her ability to deep throat so completely that her nose pokes my abdomen she's the real deal. Hilariously, she confesses that she's a 'prude'. Go fig, if this girl is a prude I might have to rethink my love of sluts and nymphos because she's dynamite.\n\nI could make up a fake college for Haley, but I respect your intelligence enough to admit that while I try to find genuine college girls to exploit, on some occasions I am stuck with a college AGED girl to exploit. That's 22 year old Haley. And aside from her flirty latina looks, she's got an amazing booty to match.\n\nI get her settled on the bed and stripped down and start in with my fingers, which she was really not that hot on initially, explaining that all she really wanted was a whole lot of dick. Viewers will know that's not how it works, we have a process here and Haley's going to get on board with it. I grab a vibrator and get to work on her pussy and her attitude changes in a heartbeat when she feels those good vibrations on her clit. Barely any time passes before she's gasping and thrashing from a powerful, real orgasm. From then on, I have her. She's up for anything. I slip the vibrator inside her and fuck her to another orgasm with it, and then to test the waters I tease her ass. She's up for it, and in no time I have the whole vibrator in her ass as I rub her clit to another orgasm.\n\nThis is going really well.\n\nI'm a little worried when we get to oral. But in no time she's got my entire cock down her throat and her nose is poking my stomach. I'm beyond impressed. I'm so hard after that I get her up on the bed for what she's been craving all along: dick. She really does love cock as much as she claimed. As soon as I get inside her, she loses control and goes nuts. Within a few minutes she's orgasmed two more times and her pussy is just gooey with her cum. Haley is submissive and open minded, so anal is automatic. She loves it and takes it like a champ. Even when I go ass to pussy, she objects but doesn't pull away. I pin her down and fuck her ass again until she orgasms yet again and it's so great that I can't hold out and I drop a huge facial on her.\n\nSo, prude, Haley? Really? I think you might want to look the word up and see if you are 100% sure of the meaning because you are pretty amazing and of all the adjectives I can think of, prude ain't one of them.\t","torrent":{"xt":"urn:btih:12f2e1174a63457b7e32e555cee696063dbe8c6a","amp;dn":"EXPLOITED+COLLEGE+GIRLS+-+Haley+-+Amateur+Anal+Orgasm+SD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12f2e1174a63457b7e32e555cee696063dbe8c6a","infoHashBuffer":{"type":"Buffer","data":[18,242,225,23,74,99,69,123,126,50,229,85,206,230,150,6,61,190,140,106]},"announce":[],"urlList":[]}}