{"title":"Jimmy Smith - Six Views Of The Blues (1958)","uid":4197482,"size":68540366,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:145e571a93aac2e5fcfa746ac7aeeb8327fa6b50&amp;dn=Jimmy+Smith+-+Six+Views+Of+The+Blues+%281958%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"L_Hammond","files":-1,"time":1211309689,"description":"Jimmy Smith - Six Views Of The Blues\n\n1. St. Louis Blues (8:42)\n2. The Swingin' Shepherd Blues (3:59)\n3. Blues No. 1 (6:30)\n4. Blues No. 3 (7:13)\n5. Blues No. 4 (10:52)\n6. Blues No. 2 (9:06)\n\nRecorded 1958, remastered and released 1999.\n\nPersonnel: Jimmy Smith (Hammond B-3 organ), Cecil Payne (baritone saxophone), Kenny Burrell (guitar), Art Blakey, Donald Bailey (drums).\n\nEditorial review 1:\nIf you are a jazz organ fan and you have never heard of Jimmy Smith's SIX VIEWS OF THE BLUES, don't worry. This 1958 Blue Note session went unreleased for 40 years before reissue king Michael Cuscuna uncovered it. Why this sizzling disc waited so long to see the light of day is a mystery. Smith's powerful blues chops and the collective power of his guests warrant this disc be considered an immediate classic. No less than Cecil Payne, Kenny Burrell, and Art Blakey (also Donald Bailey) join Smith for one of the most down-home swinging blues sessions that Smith ever laid down. Included are the classic 'St. Louis Blues', here at a lazy shuffle pace, and The Swinging Shepherd Blues', which is taken as a light and airy bounce. The focus of the session is the blues tracks numbered 1-4 that range from a crisp jaunt (No. 1), a melancholy mope (No. 3), a sizzling burner (No. 4), and a swinging stomp (No. 2). No Smith fan should be without this one.\n\nEditorial review 2:\nThis previously unreleased album was recorded in 1958 at one of 31 sessions that the phenomenal and prolific organist Jimmy Smith participated in during his tenure at Blue Note. Credited with transforming the Hammond B-3 from a novelty item into one of the most popular instruments in jazz, Smith helped create the organ-trio sound and establish the soul-funk style so popular on jukeboxes across the U.S. in the late 1950s. An all-blues program with Cecil Payne wielding a rather cumbersome baritone saxophone, Six Views is hardly revolutionary--perhaps explaining why the album was originally kept in the can. Thankfully, today's criteria for what is release worthy differ from the standards in the late 1950s, allowing us to hear Smith with guitarist Kenny Burrell and drummer Art Blakey in what has become a rare recording. The grooves here are sublime--with a stellar St. Louis Blues--and Payne proves to be an unusually nimble soloist on the big baritone. Nota bene: The Swingin' Shepherd Blues was previously issued on the Blue Note single 45-1711.\n\nEditorial review 3:\nGreeeezy! Organist Jimmy Smith never made a bad record for Blue Note. A couple of his Verve recordings are stinkers, but still have some merit. But his Blue Note Recordings, well, they are the epitome of B-3 Hard Bop. That is why the revelation of previously unreleased Blue Note Sides is such a sunny event.\n\nSix Views of the Blues was recorded July 16, 1958 between the sessions that produced On the Sunny Side (Blue Note 1092?NA, recorded July 15th) and Home Cookin (Blue Note 53360A, recorded on July 17th). Jimmy Smith was a busy man in July 1958. This session finds Smith in the company of his two favorite drummers, Art Blakey and Donald Bailey, Kenny Burrell and oddly enough, Cecil Payne. Payne, a baritone saxophonist, had never previously recorded with Smith. This quartet with a baritone sax is somewhat unusual, perhaps causing these sides to not having been released until now.\n\nThe Blues - This disc documents a relaxed blowing session that surveys Handy's 'St. Louis Blues' and 'The Swinging Shepherd Blues' (the only previously released piece on the disc). The remainder of the disc is devoted to four unnamed blues, designated 'Blues No. 1?4'. Each is a vastly different setting, illustrating the breadth of Smith's talent. This disc is perhaps only for Smith completists. But, then again, there is something here for all. \n\n(MP3 variable bitrate 192 kbit/s)\n\n-------------\n\n","torrent":{"xt":"urn:btih:145e571a93aac2e5fcfa746ac7aeeb8327fa6b50","amp;dn":"Jimmy+Smith+-+Six+Views+Of+The+Blues+%281958%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"145e571a93aac2e5fcfa746ac7aeeb8327fa6b50","infoHashBuffer":{"type":"Buffer","data":[20,94,87,26,147,170,194,229,252,250,116,106,199,174,235,131,39,250,107,80]},"announce":[],"urlList":[]}}