{"title":"Teach-In - Festival (1975) [Ding-A-Dong (Eurovision Song)]","uid":4901991,"size":95987066,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:150db0592d0f784c61de55502768d44139180eec&amp;dn=Teach-In+-+Festival+%281975%29+%5BDing-A-Dong+%28Eurovision+Song%29%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Iron_Horse","files":17,"time":1242682972,"description":"Teach-In - Festival (1975) [Ding-A-Dong (Eurovision Song)]\nLP (1975) To Mp3 320 mbit/s\nIncluded: LP Cover and this Info\n\nTeach-In were a group who won the Eurovision Song Contest 1975, representing the Netherlands. Teach-In were Getty Kaspers, Chris de Wolde, Ard Weenink, Koos Versteeg, John Gaasbeek and Ruud Nijhuis. The band was formed in 1967, with a different line up in 1975. Singer Getty joined the band in 1971, when they got their first recording contract with producer and composer Eddy Ouwens. In 1974 the band had three top 15 hits, after which their Eurovision entry was recorded. &quot;Ding-A-Dong&quot; won, which resulted in a chart entry in nearly every European country.\n\nCareer\nThe group had been formed in 1969 in Enschede. The first lineup: Hilda Felix (vocals), Henk Westendorp (vocals, later in Superfly), John Snuverink (vocals, guitar), Frans Schaddelee (bass), leader Koos Versteeg (vocals &amp; keys) en Rudi Nijhuis (drums). One of the first songs ever recorded by the group was Spoke the Lord Creator (originally by Focus). In 1972, only Koos and Rudi remained in the group, and the rest of the band comprised this: Getty Kaspers (vocals, in 1976 solo as Getty), John Gaasbeek (bass, already in 1964 in the Stora Combo (later known as Orkest Freddie Golden), left in 1976 also), Chris de Wolde (guitar) and Ard Weeink (also until 1976).\n\nNew members in 1976: Hans Nijland (bass, in 1977 replaced by Nick de Vos), Betty Vermeulen (vocals), Marianne Wolsink (vocals, ex-Head). In 1975 Teach-In participated in the Eurovision Song Contest.\n\nTeach-In were Getty Kaspers, Chris de Wolde, Ard Weenink, Koos Versteeg, John Gaasbeek and Ruud Nijhuis. The band was formed in 1967, with a different line up as in 1975. Singer Getty joined the band in 1971, when they got their first recording contract with producer and composer Eddy Ouwens.\n\nIn 1974 the band had three top 15 hits, after which their Eurovision entry was recorded. &quot;Ding-A-Dong&quot; won, which resulted in a chart entry in nearly every European country. Teach-In toured Europe for the next two years, but the success took its toll when the band split up in 1978. In 1979 Ruud Nijhuis and Koos Versteeg reformed the band, this time with two new female singers. After three more hits the group split up again. In 1997, news came that the original line up (with Getty Kaspers) had re-recorded some of their old hits and had plans to tour again.\n\nGetty Kaspers' career after leaving Teach-In\nAfter Teach-In split up, two of the group, Getty and John Gaasbeek, joined by Wilma van Diepen, formed the Balloon trio. Later on, Getty tried a solo career recording a couple of discs including the Getty Album (features De Eerste Liefde is Een Feest, a song originally performed as The Queen of Hearts by Agneta Faltskog, then translated to Dutch and beautifully sung by Getty). Her vocals can also be heard on Rick van der Linden's Cum Laude album and on recordings made by Radio Veronica.\n\nReunion in 2007\nThe band reunited to sing Ding-a-Dong at a show in Maastricht on August 31 2007.\n\nTracklist:\n01. The Circus Show\n02. In the Summernight\n03. There Ain't No Time\n04. I'm Alone\n05. Let Me In\n06. It's a Beautiful Day\n07. Tennessee Town\n08. Ding-A-Dong\n09. Sing Your Song\n10. The Circus Is Coming to Town\n11. Old Friend Goodbye\n12. Doll\n13. You and Me\n14. Fly Away","torrent":{"xt":"urn:btih:150db0592d0f784c61de55502768d44139180eec","amp;dn":"Teach-In+-+Festival+%281975%29+%5BDing-A-Dong+%28Eurovision+Song%29%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"150db0592d0f784c61de55502768d44139180eec","infoHashBuffer":{"type":"Buffer","data":[21,13,176,89,45,15,120,76,97,222,85,80,39,104,212,65,57,24,14,236]},"announce":[],"urlList":[]}}