{"title":"Bosworth - Mussolini (2002).pdf","uid":4831078,"size":5403304,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:160f1750d9841bb61aed977063f7a2ea42c8fb12&amp;dn=Bosworth+-+Mussolini+%282002%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Djofullinn","files":1,"time":1239130180,"description":"From Library Journal\nBosworth (history, Univ. of West Australia; Italian Dictatorship) is an authority on 20th-century Italy, and his exhaustive study of Benito Mussolini, first published in London, leaves no stone unturned in trying to explain the complexities of Il Duce and his times. Bosworth includes copious footnotes and an impressive bibliography to authenticate his compelling interpretation of Italy's Fascist dictator. This portrait of Mussolini reveals the author's appreciation of the complex ingredients of Il Duce's legacy a legacy that still influences Italian politics. Mussolini was a &quot;man of image&quot; whose virile charisma unified a fractious nation, but the ideological underpinnings of fascism never sank very deeply into Italian society. Although his 22-year dictatorial reign brought misery to millions, Mussolini never bought into the racist fanaticism of his Nazi brethren. As Bosworth infers, Mussolini's inherent zest for life kept him from becoming the grim exterminator Hitler wanted him to be. Bosworth's biography easily supersedes Denis Mack Smith's 1982 Mussolini as the definitive study of the Italian dictator and belongs in every public and academic library with a strong European history collection. Jim Doyle, Sara Hightower Regional Lib., Rome, GA\nCopyright 2002 Reed Business Information, Inc.\n\nFrom Booklist\nRecently there has been a disturbing resurgence of interest in Mussolini and his political movement within Italy. Some of this can be attributed to the benign curiosity of a younger generation lacking any personal memory of the fascist era. However, revisionist TV documentaries and &quot;scholarly&quot; surveys of the period that combine nostalgia with willful glossing over of the outrages conducted by Il Duce are quite distressing. Bosworth, a professor of history at the University of Western Australia, has written extensively about Italian fascism, and fortunately this is not a revisionist tome. While Bosworth does not demonize Mussolini, he views him as an extreme example of an ego-driven personality incapable of divorcing his own self-gratifying impulses from the best interests of his people. However, the author also convincingly asserts that, as a political force, Mussolini was not an aberration; he and his movement grew out of and were linked to a supposedly &quot;respectable&quot; ultranational and intolerant strain in the Italian body politic, and that strain is still flourishing. A well-balanced examination. Jay Freeman\nCopyright Ã‚Â© American Library Association. All rights reserved\n","torrent":{"xt":"urn:btih:160f1750d9841bb61aed977063f7a2ea42c8fb12","amp;dn":"Bosworth+-+Mussolini+%282002%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"160f1750d9841bb61aed977063f7a2ea42c8fb12","infoHashBuffer":{"type":"Buffer","data":[22,15,23,80,217,132,27,182,26,237,151,112,99,247,162,234,66,200,251,18]},"announce":[],"urlList":[]}}