{"title":"The Glass Room by Simon Mawer (Request)","uid":10696315,"size":911732,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1622fba22efb1cd98e82f245d729da7f8d951602&amp;dn=The+Glass+Room+by+Simon+Mawer+%28Request%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ONLYMOBI","files":-1,"time":1407173515,"description":"A &quot;New York Times&quot; Best-Seller \nHoneymooners Viktor and Liesel Landauer are filled with the optimism and cultural vibrancy of central Europe of the 1920s when they meet modernist architect Rainer von Abt. He builds for them a home to embody their exuberant faith in the future, and the Landauer House becomes an instant masterpiece. Viktor and Liesel, a rich Jewish mogul married to a thoughtful, modern gentile, pour all of their hopes for their marriage and budding family into their stunning new home, filling it with children, friends, and a generation of artists and thinkers eager to abandon old-world European style in favor of the new and the avant-garde. But as life intervenes, their new home also brings out their most passionate desires and darkest secrets. As Viktor searches for a warmer, less challenging comfort in the arms of another woman, and Liesel turns to her wild, mischievous friend Hana for excitement, the marriage begins to show signs of strain. The radiant honesty and idealism of 1930 quickly evaporate beneath the storm clouds of World War II. As Nazi troops enter the country, the family must leave their old life behind and attempt to escape to America before Viktor's Jewish roots draw Nazi attention, and before the family itself dissolves. \nAs the Landauers struggle for survival abroad, their home slips from hand to hand, from Czech to Nazi to Soviet possession and finally back to the Czechoslovak state, with new inhabitants always falling under the fervent and unrelenting influence of the Glass Room. Its crystalline perfection exerts a gravitational pull on those who know it, inspiring them, freeing them, calling them back, until the Landauers themselves are finally drawn home to where their story began. \nBrimming with barely contained passion and cruelty, the precision of science, the wild variance of lust, the catharsis of confession, and the fear of failure - the Glass Room contains it all.\n","torrent":{"xt":"urn:btih:1622fba22efb1cd98e82f245d729da7f8d951602","amp;dn":"The+Glass+Room+by+Simon+Mawer+%28Request%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1622fba22efb1cd98e82f245d729da7f8d951602","infoHashBuffer":{"type":"Buffer","data":[22,34,251,162,46,251,28,217,142,130,242,69,215,41,218,127,141,149,22,2]},"announce":[],"urlList":[]}}