{"title":"Getting Started with OpenOffice (LibreOffice) Replacement for Mi","uid":8234105,"size":3847373,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:166390d2c200288501228397732a8e07a6385699&amp;dn=Getting+Started+with+OpenOffice+%28LibreOffice%29+Replacement+for+Mi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"James_WB","files":1,"time":1362801599,"description":" OpenOffice (LibreOffice) is a free open source suite of business programs comparable to the respective modules of Microsoft Office (Word, Excel, PowerPoint and more).\n\nIs Apache OpenOffice.org productivity software, or it's close cousin, LibreOffice, a good alternative to Microsoft Office? In this introduction to and how-to for OpenOffice, Rob addresses this question while exploring the suite of productivity programs: word processing, spreadsheet calculation, presentation, graphic page layout, database, and more.\n\nForeword by Jack Dunning, publisher of ComputorEdge: My Favorite Free Windows Office Productivity Software\n\nChapter One: Downloading and Installing OpenOffice.org\n\nRob has been a long time user and instructor for Microsoft Office. Now he takes a look at OpenOffice.org, a free alternative. In this chapter he introduces the free OpenOffice.org productivity software suite, instructing how to download it and install it onto your computer.\n\nChapter Two: Using OpenOffice.org Writer Word Processing\nRob starts exploring OpenOffice.org Writer while comparing it to Microsoft Word. The File Menu, Edit Menu, View Menu, Insert Menu and more are introduced.\n\nChapter Three: Creating the New Gazette with Writer\nLooking at something a little more complicated than a simple letter with a few paragraphs, Rob starts a project which creates a newspaper. This time Rob adds boxes, columns and pictures to his Gazette.\n\nChapter Four: Diving into OpenOffice.org Writer\nRob takes the plunge and starts using Writer for this chapter while comparing it to Microsoft Word. He explores different spacing after paragraphs, inserting pictures, spell checking and saving in Microsoft Word format.\n\nChapter Five: OpenOffice.org Calc, the Spreadsheet Competition for Microsoft Excel\nRob starts exploring OpenOffice.org Calc to see how it stacks up with Microsoft Excel. The File, Edit, View and other menus are reviewed.\n\nChapter Six: Importing Data into OpenOffice.org Calc\nRob tries a &quot;slice and dice&quot; test by importing data from a Web page into OpenOffice.org Calc. While he manages to get the result, it wasn't without some trials and tribulations.\n\nChapter Seven: Quirky Data Entry and Building Charts in OpenOffice.org Calc\nRob discovers some interesting features while entering data into Calc. He continues to build some charts with random data.\n\nChapter Eight: Building a Real Business App with OpenOffice.org Calc\nA diversion back to OpenOffice Writer image problems, then comments from a reader. Later learning more about Calc from grocery tracking.\n\nChapter Nine: Using Macros in OpenOffice.org Calc\nRob wraps up his comparison of OpenOffice.org with Microsoft Excel by taking a look at more advanced features of OpenOffice.org macros.\n\nChapter Ten: Getting Started with OpenOffice.org Database Base\nA quick introduction to databases and a look at the table creation wizard in OpenOffice.org Base. Creating your first database structure.\n\nChapter Eleven: Using the OpenOffice.org Base Database Tools\nRob explores how OpenOffice.org Base works with table while he discusses common database techniques such as setting up data entry fields.\n\nChapter Twelve: A Look at Database Queries in OpenOffice.org Base\nRob runs Queries in OpenOffice.org Base through its paces to find better ways to sort and view table data, plus an introduction to Forms.\n\nChapter Thirteen: Database Forms for Input and Reports for Output\nRob creates special inputs screens with Forms and outputs data with Reports.\n\nChapter Fourteen: OpenOffice.org Impress Presentation Program\nRob introduces and demonstrates OpenOffice.org Impress, the free competitor to Microsoft PowerPoint.\n\nChapter Fifteen: More Work on Our Impress Project\n\nChapter Sixteen: OpenOffice.org Draw Graphics Page Layout Program\nDraw is more than just a paint program. Do desktop publishing with Draw.\n\nChapter Seventeen: Wrapping Up Draw and OpenOffice.org","torrent":{"xt":"urn:btih:166390d2c200288501228397732a8e07a6385699","amp;dn":"Getting+Started+with+OpenOffice+%28LibreOffice%29+Replacement+for+Mi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"166390d2c200288501228397732a8e07a6385699","infoHashBuffer":{"type":"Buffer","data":[22,99,144,210,194,0,40,133,1,34,131,151,115,42,142,7,166,56,86,153]},"announce":[],"urlList":[]}}