{"title":"Cold War Jets -Royal Air Force Fighters and Bombers (2016)Gooner","uid":15130482,"size":50576076,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1684c63089053be786955c9ef3c07f5851d3df32&amp;dn=Cold+War+Jets+-Royal+Air+Force+Fighters+and+Bombers+%282016%29Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1467151974,"description":"Cold War Jets - Royal Air Force Fighters &amp; Bombers (2016).pdf Gooner\r\n\r\nPublisher: Mortons Media Group (2016)\r\nLanguage: English\r\nISBN: 9781909128996\r\n\r\nDuring the latter half of the 20th century Western Europe lived in perpetual fear of an attack from the East. Countering this threat meant the defences of NATO had to be continually reinforced with the latest technologies – resulting in the Cold War arms race.\r\n\r\nWhile any actual strike was thought likely to end in mutually\r\nassured destruction, the intervening period would see intense action\r\nas the two sides met. Air superiority would be essential, as had\r\nbeen proven during the Second World War, since it was vital for the\r\nbombers to get through with their nuclear payload.\r\n\r\nDespite the world teetering on the brink of war for many years, or perhaps because of it, the Royal Air Force and British aviation in general enjoyed a new golden age. The inventions of the 1939-45 war, the jet engine and radar, provided springboards for exciting new projects which were in constant development, the brand new aircraft\r\namazing crowds at the annual SBAC shows at Farnborough.\r\n\r\nGlamorous test pilots broke the sound barrier and futuristic aircraft\r\nsuch as the English Electric P.1 and the behemoth that was the Avro 698 mesmerised spectators. Both types went on to become iconic aircraft (the Lightning and Vulcan) that every schoolboy dreamed of one day flying.\r\n\r\nAs the threat from the USSR and Warsaw Pact nations continued to\r\nremain a presence in military planning, the roles required of aircraft\r\nevolved. Despite the RAF having proven the benefits of operating from temporary airstrips both during the Battle of Britain and as they\r\nleapfrogged from airfield to airfield after D-Day, the jets of the postwar years necessitated hard runways of increasing length to accommodate their greater weight and the distance they required to get airborne.\r\n\r\nIn later years, both the Jaguar and Harrier were designed to operate in the field should the worst come to the worst and the airfields were lost during a first strike. The Harrier could operate from literally anywhere and the Jaguar was capable of using the autobahns of West Germany.\r\n\r\nBombers which were looking obsolete in their primary role as a nuclear deterrent, due to the submarine fleet taking over that role, were converted to tankers, allowing the RAF to reach any part of the globe; the most famous example being the Black Buck raids when the Victor tanker fleet helped Vulcan bombers reach the Falkland Islands. While there was never a direct conflict between East and West there were many proxy wars where the RAF and British-designed aircraft were involved. The possibility of a ‘domino effect’, where one national after another fell to communism, was a constant worry in the Far East and while it was not involved in the Vietnam War the RAF had a presence in the region for many years","torrent":{"xt":"urn:btih:1684c63089053be786955c9ef3c07f5851d3df32","amp;dn":"Cold+War+Jets+-Royal+Air+Force+Fighters+and+Bombers+%282016%29Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1684c63089053be786955c9ef3c07f5851d3df32","infoHashBuffer":{"type":"Buffer","data":[22,132,198,48,137,5,59,231,134,149,92,158,243,192,127,88,81,211,223,50]},"announce":[],"urlList":[]}}