{"title":"Binyan-People or Monsters-China After Mao(1983)","uid":4535158,"size":916690,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1705956d8117cd94fd02efe1745fbe4a05abe219&amp;dn=Binyan-People+or+Monsters-China+After+Mao%281983%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"red_gonzo","files":1,"time":1227711730,"description":"This is Liu Binyan&amp;#039;s shocking book People or Monsters? - And Other Stories and Reportage from China After Mao (1983) which is detailed account of communist corruption rampant near author&amp;#039;s native industrial city of Changchun in northeastern China. Liu Binyan was an author who became one of China&amp;#039;s celebrated dissidents and whose investigations into corruption prompted his expulsion from the Communist Party and the country itself. After Mao Zedong and the communists were victorious against the U.S.-backed Nationalist government in 1949, Liu was selected by virtue of his charisma, literary flair and conviction to work on the China Youth Daily newspaper. To overcome mundane assignments, he began to show initiative in his articles and practice a form of &quot;literary reportage.&quot; This included a feature about a factory employee punished for suggesting a more productive approach to work. He said he wrote the story to show the error of factory officials, but instead, Liu himself was criticized for promoting a challenge to authority. He also published articles detailing corruption at a dam construction site and - a subject of daily experience - censorship at a newspaper. The forthright style of his criticism coincided with Mao&amp;#039;s &quot;hundred flowers&quot; campaign to foster more freedom of expression. But in practice, the author was denounced as a &quot;rightist&quot; and sent to a labor farm with thousands of others. At the time, he said he did not question the wisdom of the punishment, figuring the fault was indeed within him. After coming out he culminated his investigative work in one of the boldest book ever to come out of communist China which provided a striking expose of kickbacks and other underhand methods of business that could have been set in any region in the country. In People or Monsters he focuses on terrible injustices and the sufferings of ordinary people in China who have been forgotten by the communist regime. This capped a long career of infuriating the government with his critical and revelatory stories that also appeared in official Communist Party newspapers. 150 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:1705956d8117cd94fd02efe1745fbe4a05abe219","amp;dn":"Binyan-People+or+Monsters-China+After+Mao%281983%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1705956d8117cd94fd02efe1745fbe4a05abe219","infoHashBuffer":{"type":"Buffer","data":[23,5,149,109,129,23,205,148,253,2,239,225,116,95,190,74,5,171,226,25]},"announce":[],"urlList":[]}}