{"title":"Robert Fisk on Egypt: A Revolution Betrayed ^ azw3","uid":15310450,"size":452720,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:17248dcc8766e262c0499208e32443e7618b51f4&amp;dn=Robert+Fisk+on+Egypt%3A+A+Revolution+Betrayed+%5E+azw3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"heliiaruy","files":1,"time":1468576529,"description":"Robert Fisk on Egypt: A Revolution Betrayed: A powerful collection of reportage on Egypt's cycle of awakening and relapse ^ Robert Fisk ^ azw3\r\n\r\n\r\n\r\nMore than any other nation, Egypt epitomises the cruel disappointments of the Arab Spring. In less than four years, its people have come full circle. A sclerotic, cynical, seemingly immovable military regime, disguised by a fig-leaf of ostensible representation, was swept away on a joyous tsunami of popular idealism; a corrupt dictator was ousted, tried and jailed; free elections were held, a new president peacefully installed, and a new age of freedom and democracy seemed genuinely possible.\r\n\r\nThen, with tragic predictability, the new regime degenerated. Corruption, incompetence and repression provoked a counter-revolution; the elected president was ousted and jailed, his supporters massacred or rounded up. The old dictator was freed (for a while), the opposition was outlawed, the faceless men of the military resumed and tightened their grip on the reins of power – and thousands of ordinary Egyptians were left wondering what all their suffering and sacrifice had been for.\r\n\r\nNo commentator is better qualified to tell this tragic tale than Robert Fisk, unflinching critic of the Mubarak regime and acclaimed chronicler of Middle-Eastern affairs for The Independent for 25 years. This powerful anthology of his journalism describes the full cycle of Egypt’s awakening and relapse, episode by episode, as it happened – from the first stirrings of unrest to the glorious dawn of Tahrir Square, and the days of shame and atrocity that followed.\r\n\r\nTold with rare insight into both Egyptian culture and the hypocrisy of the West, this is history at its most compelling, written by one of the very greatest commentators on the Arab world.\r\n\r\n---------------\r\n\r\nazw3 can be converted in Calibre to whichever format you prefer, or can be directly placed in a Kindle file directory. Having been told I was uploading &quot;useless&quot; azw3 files, I hope you take the time to read this, learn about Calibre, or shut the fuck up. Cheers. Enjoy.\r\n\r\n\r\n\r\nBest\r\nLove\r\nPeace\r\nShare\r\nCare\r\nAwake","torrent":{"xt":"urn:btih:17248dcc8766e262c0499208e32443e7618b51f4","amp;dn":"Robert+Fisk+on+Egypt%3A+A+Revolution+Betrayed+%5E+azw3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17248dcc8766e262c0499208e32443e7618b51f4","infoHashBuffer":{"type":"Buffer","data":[23,36,141,204,135,102,226,98,192,73,146,8,227,36,67,231,97,139,81,244]},"announce":[],"urlList":[]}}