{"title":"1942 Casablanca DVD-5 [COLOR]","uid":7308402,"size":4053789572,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:174fc03e9c7bea8ca41e72e867fe051279306460&amp;dn=1942+Casablanca+DVD-5+%5BCOLOR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"cgculpepper","files":28,"time":1338271213,"description":"The menu is in Russian: with MPC-find English on menu\nwith VLC-use menu or player controls\n\nFROM WIKI:\nCasablanca was part of the film colorization controversy of the 1980s, when a colorized version aired on the television\nstation WTBS. In 1984, MGM-UA hired Color Systems Technology to colorize the film for $180,000. When Ted Turner of\nTurner Entertainment purchased MGM-UA's film library two years later, he canceled the request, before contracting American\nFilm Technologies in 1988. AFT completed the colorization in two months at a cost of $450,000. Turner later reacted\nto the criticism of the colorization, saying, &quot;[Casablanca] is one of a handful of films that really doesn't have to be\ncolorized. I did it because I wanted to. All I'm trying to do is protect my investment.&quot;\n\nThe Library of Congress deemed that the color change differed so much from the original film that it gave a new copyright to\nTurner Entertainment. When the colorized film debuted on WTBS, it was watched by three million viewers, not making the\ntop-ten viewed cable shows for the week. Although Jack Matthews of the Los Angeles Times called the finished product\n&quot;state of the art&quot;, it was mostly met with negative critical reception. It was briefly available on home video.\nGary Edgerton, writing for the Journal of Popular Film &amp; Television criticized the colorization, &quot;... Casablanca in color\nended up being much blander in appearance and, overall, much less visually interesting than its 1942 predecessor.&quot;\nBogart's son Stephen said, &quot;if you're going to colorize Casablanca, why not put arms on the Venus de Milo?&quot;\n\n\nFROM ME:\nFor a lot of people the first titles that come to mind when thinking old B&amp;W movies are &quot;Casablanca&quot; or &quot;The Maltese Falcon&quot;.\nI'm sure that there are millions who are glad Turner did not colorize The Maltese Falcon.\nRemember this was colorized on 25-year-old technology.","torrent":{"xt":"urn:btih:174fc03e9c7bea8ca41e72e867fe051279306460","amp;dn":"1942+Casablanca+DVD-5+%5BCOLOR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"174fc03e9c7bea8ca41e72e867fe051279306460","infoHashBuffer":{"type":"Buffer","data":[23,79,192,62,156,123,234,140,164,30,114,232,103,254,5,18,121,48,100,96]},"announce":[],"urlList":[]}}