{"title":"Northern Soul ~ Blackpool Mecca Highland Room and The Ritz Float","uid":4280199,"size":231516531,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:17d78469713316d643437c4f3cc26e0608da32ab&amp;dn=Northern+Soul+%7E+Blackpool+Mecca+Highland+Room+and+The+Ritz+Float&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"imunionjack","files":55,"time":1215380799,"description":"Northern Soul ~ Blackpool Mecca &amp; The Ritz Collection\nby unionjack \n\nBlackpool Mecca A brief history\nDjs Colin Curtis/Ian Levine/Kev Roberts\n\nNorthern soul is the term used in the United Kingdom for a type of mid-tempo and uptempo heavy-beat soul music (of mainly African American origin) that was popularized in Northern England from the mid 1960s onwards. The term also refers to the associated dance styles and fashions that emanated from the Twisted Wheel club in Manchester and spread to other dancehalls and nightclubs, such as the Golden Torch (in Stoke-upon-Trent), the Highland Rooms at the Blackpool Mecca and the Wigan Casino. Northern soul dancing was usually athletic, resembling the later dance styles of disco and break dancing. Featuring spins, flips, and backdrops, the northern soul dancing style was inspired by the stage performances of visiting American soul acts.\n\nBlackpool Mecca was opened in 1965 and at the time was at the cutting edge of night club entertainment. It could hold about three and a half thousand people, had a glitzy stage with a revolving bandstand and was capable of putting on a range of entertainments. In its heyday thousands used to flock to the Mecca from around the region, courtesy of the free coaches which the club provided. Unfortunately tastes in club entertainment began to change as smaller more intimate venues began to replace the massive dancehalls. By the early seventies its main hall was not opening to thousands but to dozens of punters. It was the same story in most other Tiffanies/Mecca buildings throughout the country. Blackpool however had one feature which the other clubs did not, a smaller dancehall known as the \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;Highland Room\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039; above its main arena. It was this secondary room, which was set up as a rare soul venue, which kept the Mecca going long after the main room had fallen into decline.\nThe Highland Room continued to operate as a Rare Soul Venue from 1971 to 1979. In 1981 the Mecca closed completely having fallen into a state of disrepair due to lack of investment. During its time it played host to several major Soul acts including Isaac Hayes, Edwin Starr, The Chi-Lites and the Miracles. In Colin Curtis the club had a very dedicated and knowledgeable soul exponent but the main reason why the club became so important as a soul haven was its other DJ Ian Levine. Ian was the son of a wealthy local businessman and as such made regular trips to America at a time when transatlantic travel was much rarer than it is today. Whilst he was there Ian would spend his time searching through warehouses, record and junk shops looking for soul obscurities. It was through this process that he was able to gain access to music which was not available to anyone else. As a consequence any aficionado wanting to hear these records had no alternative other than to attend the Mecca. But it was also possible to buy amonts of records from him also and I remember several occasions doing so, one memorable time was buying 100 copies of the Carstairs ~ It really Hurts Me Girl and taking them back down to London where they wasnt able to sell but a year or so later they were changing hands for much moore money\nUnfortunately for Ian and Colin they soon found themselves trying to compete with Wigan Casino which had opened its doors not many miles away. Wigan Casino always had one big advantage over the Mecca in that it had permission to remain open all night whilst the Mecca was restricted to normal club licensing hours. It was this attraction which probably wooed many punters away from the Mecca to its rival venue. They did attempt to fight the trend by holding \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;all-dayers\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039; which generally started at mid-day and continued through till midnight which, although moderately successful, never seemed to appeal in quite the same way that the \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;All-Nighters\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039; did. Alot of the Mecca Crew would turn up at the Casino straight after the Highland room finished and arrived en masse to dance the remainder of the night away. To say that Mecca and the Casino were direct rivals is in many ways true, but in others they were complementary. A major difference was the club\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s music policies. Whereas Wigan was firmly rooted in R&amp;B and predominantly from the Sixties the Mecca tried to keep abreast of newer releases which often included funkier influences. The clientele was also different both in the way they dressed and the way they danced. Many of the early die hard Soulies considered Mecca to have \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;sold out\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039; because of its courtship of funk whereas Mecca considered the Wigan faithful to be soul dinosaurs still living in the past. These arguments led to the two camps becoming increasingly polarised and much subsequent bad feeling. . But there was also alot of us that appreciated both camps ~ true soulies!\nIan\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s courtship of funk might have been forgiven had he restricted himself to that activity, but his next step was to start producing records himself which were tailor-made for the Northern Soul Market. Some of his productions were pleasant enough but if we accept that \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;Soul\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039; music is a cultural expression of the hardships, the poverty, the discrimination that Black Americans have suffered then the question has to be asked, what credentials has a millionaire\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s son from Blackpool got to intrude? Ian began using the Mecca as breaking ground for his own material which caused many soul devotees to believe that what had once been hallowed territory was copping out to \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;Disco Shite\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;. On the closure of Blackpool Mecca Ian Levine went on to produce \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;Hi-Energy\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039; music and even pop bands such as \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;Take That\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;. He also made several cover versions of original Soul records with White Artists.\nI have been on the Northern Soul scene for many years now as Promoter, Dj and total Freak and thought it was about time to give back a little of the sounds which has caused me so many sleepless nights. \nSo I have put together several torrents which were played at the different all ~ nighters around the countrty. And being smaller torrents are easier for you peeps to download. As well as my own tracks I have borrowed from several others to save the time of ripping them myself and painstakingly put together in these compillations. \n( Thanks so very much guys  ~ Keep The Faith!!)\nThese are several tracks which I personally associate with either the Highland Room at the Blackpool Mecca or The Ritz Ballrooms. But you may say \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039; I heard this track played at such n such a place\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039; , of course it was, but as this is a personal choice they are associated with these places to me. And as they are all totally brilliant anyway ~ stop moaning!\nSo all that really needs saying now is enjoy this collection and please seed it ~ we need to keep this torrent active!!!\n\nunionjack ( Soul ~ As Deep As You Like and Some )\n","torrent":{"xt":"urn:btih:17d78469713316d643437c4f3cc26e0608da32ab","amp;dn":"Northern+Soul+%7E+Blackpool+Mecca+Highland+Room+and+The+Ritz+Float","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17d78469713316d643437c4f3cc26e0608da32ab","infoHashBuffer":{"type":"Buffer","data":[23,215,132,105,113,51,22,214,67,67,124,79,60,194,110,6,8,218,50,171]},"announce":[],"urlList":[]}}