{"title":"Helen Berry - The Family in Early Modern England [2007][A]","uid":10440314,"size":1933826,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:188e4f9c1b9bbb1e6ccc58aeec5059e56e550e4c&amp;dn=Helen+Berry+-+The+Family+in+Early+Modern+England+%5B2007%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Anette14","files":-1,"time":1403880620,"description":"Description\nProduct Details\nBook Title: The Family in Early Modern England\t\nBook Author: Helen Berry (Editor), Elizabeth Foyster (Editor)\nHardcover: 269 pages\nPublisher: Cambridge University Press; 1 edition (January 14, 2008)\nLanguage: English\nISBN-10: 0521858763\nISBN-13: 978-0521858762\n\n===================================================================================\nBook Description\nPublication Date: January 14, 2008 | ISBN-10: 0521858763 | ISBN-13: 978-0521858762 | Edition: 1\nThis 2007 text was the first single volume in recent years to provide an overview and assessment of the most important research that has been published on the English family in the past three decades. Some of the most distinguished historians of family life, together with the next generation of historians working in the field, present previously unpublished archival research to shed light on family ideals and experiences in the early modern period. Contributions to this volume interrogate the definitions and meanings of the term 'family' in the past, showing how the family was a locus for power and authority, as well as personal or subjective identity, and exploring how expectations as well as realities of family behaviour could be shaped by ideas of childhood, youth, adulthood and old age. This pioneering collection of essays will appeal to scholars of early modern British history, social history, family history and gender studies.\n\n===================================================================================\nReviews\n&quot;...as a rounded treatment of some major themes and findings that point to where we now stand and what more might be gained, it is an important and illuminating collection, skillfully and thoughtfully implemented. It attests to the continued vigor of family cum gender history, and would benefit students and scholars working on family, gender, and the social history of Britain, the continent, or elsewhere.&quot; -H-Albion, Ilana Krausman Ben-Amos\n\n&quot;This exemplary volume serves as a provocative challenge to the vision of family constructed by Stone over three decades ago. It is important reading for anyone interested in early modern English familie and is an essential addition to university and college libraries.&quot; -Michelle White, The Historian\n\n===================================================================================\nAbout the Authors\nHelen Berry is Senior Lecturer in History at the School of Historical Studies, University of Newcastle. Her previous publications include Gender, Society and Print Culture in Late-Stuart England (2003) and, with Jeremy Gregory, Creating and Consuming Culture in North-East England, 1660-1830 (2004). Elizabeth Foyster is Lecturer in History and Fellow of Clare College, Cambridge. She is the author of Manhood in Early Modern England: Honour, Sex and Marriage (1999) and Marital Violence: An English Family History 1660-1857 (2005).\n===================================================================================","torrent":{"xt":"urn:btih:188e4f9c1b9bbb1e6ccc58aeec5059e56e550e4c","amp;dn":"Helen+Berry+-+The+Family+in+Early+Modern+England+%5B2007%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"188e4f9c1b9bbb1e6ccc58aeec5059e56e550e4c","infoHashBuffer":{"type":"Buffer","data":[24,142,79,156,27,155,187,30,108,204,88,174,236,80,89,229,110,85,14,76]},"announce":[],"urlList":[]}}