{"title":"Becoming Your Soul - Thaddeus Music by Sanaya Roman","uid":4190081,"size":168194430,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:189e13b0bced65b773845a2c8a06536e6bafbd72&amp;dn=Becoming+Your+Soul+-+Thaddeus+Music+by+Sanaya+Roman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"iloveabrahamhicks","files":4,"time":1210897260,"description":"Becoming Your Soul\n\nThaddeus music can assist you in moving into the higher vibrations of your soul.  In this set of musical journeys, Thaddeus uses music to bring the inner world of your soul into its outer expression in your daily life.   These musical journeys can assist you in developing soul awareness, and in using that awareness to transform your body, emotions, and mind.\n\nThis album contains melodic, reverential, soothing, and flowing music. This music has angelic voices, harp, strings, piano, and other sounds to expand you into your soul&amp;#039;s light, power, love, presence, and will. \n\nThis is very peaceful, relaxing, soothing music that will expand your consciousness and relax your body as you listen. Each album has approximately 2 hours of music and is ideal for meditation, healing, relaxation, and for pure listening enjoyment.\n\nSide 1 Blending With Your Soul\n\nFeel the power of your soul as you become one with it. Let your soul blend with your mind, emotions, and body. Allow your soul&amp;#039;s light to free you from all limitations. Deep, soothing, melodic, and uplifting music.\n\nSide 2 Strands of Light\n\nStrands of light are woven into your DNA as you listen to activate the next steps of your cellular evolution. Allow light to be woven into your etheric body, the aura of light that surrounds and vitalizes your physical body. Focus on your chakras and let these strands of light open and balance your chakras. Sparkling, twinkling, happy music.\n\nSide 3 Cellular Evolution\n\nThaddeus uses certain sounds and tones to assist your soul in sending its light into the cells and atoms of your body for cellular transformation. As you listen, imagine your soul is sending light into your cells, releasing old patterns and adding new ones of joy, abundance, and love.  Bring the light of your soul into your cells to build finer matter into your body as you add light at the subatomic, atomic, and cellular level. Soft, gentle, angelic music.\n\nSide 4 Healing Treatment\n\nThaddeus&amp;#039; music calls forth the healing devas from the angelic kingdom to work with your soul to heal and evolve your body, mind, and emotions. Focus on any area you want to heal and evolve-your physical body, heart, emotions, thoughts, and so on. These devas can work with your soul to raise whatever area you focus on up to the vibration of your soul&amp;#039;s light.  Calming, healing, and melodic. ","torrent":{"xt":"urn:btih:189e13b0bced65b773845a2c8a06536e6bafbd72","amp;dn":"Becoming+Your+Soul+-+Thaddeus+Music+by+Sanaya+Roman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"189e13b0bced65b773845a2c8a06536e6bafbd72","infoHashBuffer":{"type":"Buffer","data":[24,158,19,176,188,237,101,183,115,132,90,44,138,6,83,110,107,175,189,114]},"announce":[],"urlList":[]}}