{"title":"Mosby's Medical Encyclopedia (v.2.0)","uid":6040442,"size":439265280,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:18c63205cc4191538dc255919faef1efc1445f92&amp;dn=Mosby%5C%27s+Medical+Encyclopedia+%28v.2.0%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"footron","files":-1,"time":1292370535,"description":"*********************************************************\nMosby's Medical Encyclopedia\nVersion 2.0\n*********************************************************\n\nMosby's is one of the biggest names in American medical reference. For 75 years flu victims in Fresno, syphilitics in Seattle, plague carriers in Peoria, and hypochondriacs in Hackensack have been checking its authoritative pages for the right terms, drugs, and treatments to go with their conditions. And now it's been made even easier to scope out your symptoms with the one-disc Mosby's Medical Encyclopedia CD-ROM, containing just about all there is to know in the field of contemporary medical expertise.\n\nThe format is admirably clear. A column on the left of the screen indicates the various available sources on the disc. Click on each to access the subsection you want. Most useful is perhaps the encyclopedia itself, which gives plain, lucid, informative definitions of some 20,000 medically related terms. Below the encyclopedia is a very handy drug guide, affording the scientific background and uses of multifarious pills, medicines, and remedies, from ibuprofen to Intaferon, temazepam to Tixylix. Equally interesting is the human atlas, which diagrammatically maps nervous, lymphatic, muscular, and digestive systems, amongst others. The on-disc Internet guide, which links you to pertinent Web sites and apposite net addresses, is pretty cool too.\n\nIn fact, there's so much information here it might prove slightly overwhelming for the layman, and in some ways the CD-ROM is aimed as much at professional users as the needy family or inquisitive individual. But for those willing to swallow the odd technical term, it's still pretty hard to think of a better single-disc medical dictionary on the CD-ROM market. --Sean Thomas \n\n\n*********************************************************\n\nBurn or mount the .ISO, run setup.\n...may also work if files are extracted to HDD, but I haven't tried.\n\nThe cd said it would also run on Macs, however, this I cannot test.","torrent":{"xt":"urn:btih:18c63205cc4191538dc255919faef1efc1445f92","amp;dn":"Mosby%5C%27s+Medical+Encyclopedia+%28v.2.0%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18c63205cc4191538dc255919faef1efc1445f92","infoHashBuffer":{"type":"Buffer","data":[24,198,50,5,204,65,145,83,141,194,85,145,159,174,241,239,193,68,95,146]},"announce":[],"urlList":[]}}