{"title":"Stephen L. Dyson - In Pursuit of Ancient Pasts [2006][A]","uid":9973882,"size":2042478,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:18f85bddf7ef20d2d70a389e0acd6f31d6f9561a&amp;dn=Stephen+L.+Dyson+-+In+Pursuit+of+Ancient+Pasts+%5B2006%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Anette14","files":-1,"time":1397664736,"description":"Description\nProduct Details\nBook Title: In Pursuit of Ancient Pasts: A History of Classical Archaeology in the Nineteenth and Twentieth Centuries\t\nBook Author: Stephen L. Dyson (Author)\nHardcover: 336 pages\nPublisher: Yale University Press (October 26, 2006)\nLanguage: English\nISBN-10: 0300110979\nISBN-13: 978-0300110975\n\nBook description\nThe stories behind the acquisition of ancient antiquities are often as important as those that tell of their creation. This fascinating book provides a comprehensive account of the history and development of classical archaeology, explaining how and why artifacts have moved from foreign soil to collections around the world.\nAs archaeologist Stephen Dyson shows, Greek and Roman archaeological study was closely intertwined with ideas about class and social structure; the rise of nationalism and later political ideologies such as fascism; and the physical and cultural development of most of the important art museums in Europe and the United States, whose prestige depended on their creation of collections of classical art. Accompanied by a discussion of the history of each of the major national traditions and their significant figures, this lively book shows how classical archaeology has influenced attitudes about areas as wide-ranging as tourism, nationalism, the role of the museum, and historicism in nineteenth- and twentieth-century art.\n\nAbout the Author\nStephen L. Dyson is Park Professor of Classics at SUNY-Buffalo and a past president of the Archaeological Institute of America. His books include Community and Society in Roman Italy, Ancient Marbles to American Shores, and The Roman Countryside.\n","torrent":{"xt":"urn:btih:18f85bddf7ef20d2d70a389e0acd6f31d6f9561a","amp;dn":"Stephen+L.+Dyson+-+In+Pursuit+of+Ancient+Pasts+%5B2006%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18f85bddf7ef20d2d70a389e0acd6f31d6f9561a","infoHashBuffer":{"type":"Buffer","data":[24,248,91,221,247,239,32,210,215,10,56,158,10,205,111,49,214,249,86,26]},"announce":[],"urlList":[]}}