{"title":"Avid Pro Tools HD 9.0.4 (MACOSX2013)","uid":8096120,"size":8730234945,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:193e5aa4dd7a70e6ea5b1c59839ff386b0bbae6f&amp;dn=Avid+Pro+Tools+HD+9.0.4+%28MACOSX2013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"stalinncon","files":-1,"time":1359839079,"description":"Avid has announced a new version of its most popular in the professional field of digital recording studio Pro Tools at No. 9, different from the past a huge step forward - version 9 will not require any hardware for many hundreds of dollars for a comfortable work as Pro Tools can now use any hardware supports Core Audio on Mac, or ASIO on the PC.\n\nThe next big difference is that Pro Tools has more divisions in several versions, as it was before (LE / M-Powered / HD), and delivered a single program that can work as well as on the Mac, as well as on a PC. Owners of iron from Pro Tools HD sets have the opportunity to work with more tracks simultaneously, for comparison - Pro Tools interface 9 with any of the supported you to work with 96 tracks (both mono and stereo) Pro Tools 9 HD - 192 HD version also allows you to perform the mix down to 7.1, the remaining differences can be found in the table comparing the versions on the site of Avid.\n\nA separate item worth mentioning added after numerous requests compensation function of delays between tracks - Automatic Delay Compensation.\n\nThe delay may appear to many factors, most often a delay in the processing of audio interfaces audio recording after the fragment, or delay emerged after treatment with heavy-fragment effects, or a whole stack of effects.\n\nInstall Info:\n\nSelect allMust first be installed the basic package 9.0\n\nand then Complete Production Toolkit 2\n\nThen installed the official update to version 9.0.3\n\nThen installed the official update to version 9.0.4\n\nAnd only then broke the installer.","torrent":{"xt":"urn:btih:193e5aa4dd7a70e6ea5b1c59839ff386b0bbae6f","amp;dn":"Avid+Pro+Tools+HD+9.0.4+%28MACOSX2013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"193e5aa4dd7a70e6ea5b1c59839ff386b0bbae6f","infoHashBuffer":{"type":"Buffer","data":[25,62,90,164,221,122,112,230,234,91,28,89,131,159,243,134,176,187,174,111]},"announce":[],"urlList":[]}}