{"title":"Mechanical Properties of Polymers Measured through AFM Force-Dis","uid":15337082,"size":7239410,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:196e87cf1e34579fd3a01e80b56fbc69111857a7&amp;dn=Mechanical+Properties+of+Polymers+Measured+through+AFM+Force-Dis&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"clouderone","files":1,"time":1468792089,"description":"Mechanical Properties of Polymers Measured through AFM Force-Distance Curves - B. Cappella (Springer, 2016).pdf\r\n\r\nISBN 978-3-319-29457-5\r\n\r\nThis Springer Laboratory volume is a practical guide for scientists and students dealing with the measurement of mechanical properties of polymers at the nanoscale through AFM force-distance curves.\r\nIn the first part of the book the reader will find a theoretical introduction about atomic force microscopy, focused on force-distance curves, and mechanical properties of polymers. The discussion of several practical issues concerning the acquisition and the interpretation of force-distance curves will help scientists starting to employ this technique.\r\nThe second part of the book deals with the practical measurement of mechanical properties of polymers by means of AFM force-distance curves. Several &quot;hands-on&quot; examples are illustrated in a very detailed manner, with particular attention to the sample preparation, data analysis, and typical artefacts. This section gives a complete overview about the qualitative characterization and quantitative determination of the mechanical properties of homogeneous polymer samples, polymer brushes, polymer thin films, confined polymer samples, model blends and microstructured polymer blends through AFM force-distance curves.\r\nThe book also introduces to new approaches and measurement techniques, like creep compliance and force modulation measurements, pointing out approximations, limitations and issues requiring further confirmation","torrent":{"xt":"urn:btih:196e87cf1e34579fd3a01e80b56fbc69111857a7","amp;dn":"Mechanical+Properties+of+Polymers+Measured+through+AFM+Force-Dis","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"196e87cf1e34579fd3a01e80b56fbc69111857a7","infoHashBuffer":{"type":"Buffer","data":[25,110,135,207,30,52,87,159,211,160,30,128,181,111,188,105,17,24,87,167]},"announce":[],"urlList":[]}}