{"title":"Declassified NAZI and Air Force UFO S","uid":12242810,"size":8781827311,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:19787c0b82e9cea6bcad5a9b0fc40529d28b1196&amp;dn=Declassified+NAZI+and+Air+Force+UFO+S&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"POtHS11","files":110,"time":1439825711,"description":"Since 1950 (but you can predate them as early as 1947) there were many claims about alleged German developments of revolutionary saucer-shaped crafts able to fly with incredible performances, from a sort of &quot;supersonic helicopter&quot; to hard-to-believe interstellar spaceships.\n\nThese crafts were believed the same &quot;flying saucers&quot; (later named UFOs) sighted by many people all around the world since 1947. According to the many would-be &quot;inventors&quot; and enthusiasts of this theory, UFOs would not be of extraterrestrial origin but man-made. They were the ultimate result of the evil Nazi technology.\n\t\n\nMYTH OR REALITY?\n\nThe reality of the &quot;Nazi UFOs&quot; has been highly controversial. No really hard historical evidence about the undisputable existence of such advanced technology has been presented so far.\n\nThere are some clues and many fascinating rumours that have been creating a real myth about the so-called &quot;Nazi UFOs&quot;. One of the main scopes of this site is just the collection and deployment of documents able to evaluate the whole story better and under a critical point of view, emphasizing the presence of legends rather than verifiable facts.\n\nWHAT'S INSIDE\n\nWhen subscribing for Premium Access, you get a huge ever-growing selection of fascinating material you cannot find anywhere else: join now!\nThe most complete Bibliographies about the &quot;Nazi UFOs&quot; and the German &quot;Wonder Weapons&quot; topics: hundreds of entries! (updated)\n\nAn Image Library with tens of artworks and controversial pictures about the &quot;Nazi UFOs&quot;\n\nA very large collection of hard-to-find high resolution newsclippings and documents about the &quot;German saucers&quot; and the oddest &quot;wonder weapons&quot;\n\nThe main personages of the Nazi UFOs saga: learn more about Belluzzo, Schriever, Miethe, Epp, Vesco and others! See rare pictures, unpublished information and documents related to the story of each of them!\n\nA real Library of Books with great full color covers and comments, plus a section of books you may buy online at discounted prices!\n\nA collection of highly fascinating Rumours about reportedly advanced Nazi Technologies and Weapons!\n\nAn unprecedented collection of Articles in many languages\n\nAn ever-growing list of Links\n\nand much, much more!\n\t\n\nThe &quot;German saucers&quot; are often known also as the &quot;V-7 legend&quot;: this comes from a reportedly circular aircraft named &quot;V-7&quot; and claimed to have flown in Prague on February 14, 1945.\n\nLatest developments of the legend, including claims of German space journeys to the Moon, Mars and near stars will be also taken into consideration.\n\nAlso of interest are all those rumours about secret Allied developments of original German projects, Nazi underground bases and related stories, like Hitler's escape and mysterious U-Boats sighted after the end of WWII.\n\nBesides claims of would-be inventors and rumours, there are no original first-hand historical documents about the development of saucer-shaped aircrafts by the Germans. The supporters of the saucers' reality say that most but all documents and blueprints were destroyed by the Nazis before surrender or captured by the Allied and never released, due to their extreme strategic importance. In","torrent":{"xt":"urn:btih:19787c0b82e9cea6bcad5a9b0fc40529d28b1196","amp;dn":"Declassified+NAZI+and+Air+Force+UFO+S","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19787c0b82e9cea6bcad5a9b0fc40529d28b1196","infoHashBuffer":{"type":"Buffer","data":[25,120,124,11,130,233,206,166,188,173,90,155,15,196,5,41,210,139,17,150]},"announce":[],"urlList":[]}}