{"title":"LiveATC For Android By bobiras2009","uid":7658884,"size":285960,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:19b3d5d9edcbf6986ae564eabcda117fac3d92ee&amp;dn=LiveATC+For+Android+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1348249754,"description":"Follow my uploads here:                            &lt;a href=&quot;\nhttps://forum.suprbay.org/member.php?action=profile&amp;uid=311481&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/member.php?action=profile&amp;uid=311481&lt;/a&gt;    \n\nYou can make requests here:                             &lt;a href=&quot;\nhttps://forum.suprbay.org/forumdisplay.php?fid=4&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/forumdisplay.php?fid=4&lt;/a&gt;\n                 \n\n                                By bobiras2009\t\t\n\n\n\nIf you appreciate my work you can leave a commnent and seed this for as long you can to help me upload more.\n\nLiveATC for Android is brought to you by LiveATC.net - listen to live air traffic control!\n\n(PLEASE READ ***IMPORTANT NOTICE*** BELOW BEFORE PURCHASING)\n\nStuck in the airport terminal with endless delays?\nLive near an airport and want to find out what's going on?\nHave you always wondered what pilots talk to air traffic controllers about?\nNow you can stop wondering and tune in live!\n\nLiveATC for Android provides a quick and easy way to listen in on live conversations between pilots and air traffic controllers near many airports around the world. LiveATC for Android lets you browse by U.S. state or by country to find an airport and listen in to live air traffic conversations at or near a given airport. You can also use the &quot;Nearby&quot; feature to find an airport near you. You can then add any channel to your Favorites list for quick and easy access.\n\nThe LiveATC Network (http://liveatc.net) is the world's largest network of streaming audio feeds focused solely on aviation, currently covering over 400 airports around the world with over 550 different audio feeds and growing daily!\n\n*** IMPORTANT NOTICE ***\nPlease check to see if your country, city and/or airports of interest are covered by LiveATC *BEFORE PURCHASING* - check at: http://liveatc.net . Available airports are subject to change at any time - LiveATC owns and operates many of the receivers used in the network but most are provided by volunteers working in cooperation with LiveATC. Available airports can change, sometimes due to reasons beyond LiveATC's control. Also, there is no guarantee that all feeds will be up 24/7, though we make our best effort to do so and have a great track record of uptime.\n\nFollow LiveATC for feed updates and breaking aviation and ATC-related news:\nTwitter:\nFacebook:\n\nNote: The &quot;Read Phone State&quot; permission is needed by LiveATC for Android so it can detect when you're placing or receiving a phone call - then it can automatically stop the streaming of the air traffic audio so that it doesn't interfere with your phone call.\n\n                                By bobiras2009\t\t","torrent":{"xt":"urn:btih:19b3d5d9edcbf6986ae564eabcda117fac3d92ee","amp;dn":"LiveATC+For+Android+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19b3d5d9edcbf6986ae564eabcda117fac3d92ee","infoHashBuffer":{"type":"Buffer","data":[25,179,213,217,237,203,246,152,106,229,100,234,188,218,17,127,172,61,146,238]},"announce":[],"urlList":[]}}