{"title":"Bait(2000)DVDRip.AC3(ENG)-DROCK(Smaller File)","uid":7617387,"size":732422516,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:19cb0332df1df56c0e3de831edfce78d724a135e&amp;dn=Bait%282000%29DVDRip.AC3%28ENG%29-DROCK%28Smaller+File%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"drock232","files":-1,"time":1347238893,"description":"This is just a smaller sized file then the first one I uploaded. Same if not better quality. And it is the full movie nothing taken out.\n\nIn this action comedy, a crook trying to go straight finds himself lured back to crime by the police, without his even knowing it. When master criminals Jasper (Robert Pastorelli) and Bristol (Doug Hutchison) pull a heist that nets $40 million in gold but leaves behind several dead policemen, detective Edgar Clenteen (David Morse) pulls out all the stops to put the thief behind bars. Jasper is jailed and ends up sharing a cell with Alvin Sanders (Jamie Foxx), a habitual small-time criminal who was brought in after a bungled robbery of a seafood wholesaler. Jasper, who has a weak heart, suffers a heart attack in jail, and as he dies, he gives Alvin a message to pass along to his wife. Eager to track down Bristol, who still has the gold, Clenteen has Alvin secretly implanted with an experimental tracking device, and then lets him go free, while spreading the word on the street that Jasper told him where the gold was stashed shortly before his death. While Alvin makes an effort to start his life over and get a straight job, Clenteen and his staff are electronically following his every move, waiting for Bristol and his associates to track him down. Bait was directed by Antoine Fuqua, whose previous credit was the stylish crime thriller The Replacement Killers. \n\nRipped with Handbrake\n\nLength: 1 Hour 59 Minutes\n\nFile Type: MP4\n\nFrame Width: 720\n\nFrame Height: 304\n\nFrame Rate: 29fps\n\nAudio\n\nBit Rate: 159kbps","torrent":{"xt":"urn:btih:19cb0332df1df56c0e3de831edfce78d724a135e","amp;dn":"Bait%282000%29DVDRip.AC3%28ENG%29-DROCK%28Smaller+File%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19cb0332df1df56c0e3de831edfce78d724a135e","infoHashBuffer":{"type":"Buffer","data":[25,203,3,50,223,29,245,108,14,61,232,49,237,252,231,141,114,74,19,94]},"announce":[],"urlList":[]}}