{"title":"Wilco 24 Bit Vinyl Pack","uid":8834935,"size":7000711377,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1a7bd9e641dd50c4f4650e011d3eeac4b83da2cd&amp;dn=Wilco+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":6,"uploader":"politux","files":-1,"time":1377046357,"description":"\n  Wilco 24 Bit Vinyl Pack\n\n  Genre: Pop/Rock\n  Styles: Country-Rock, Indie Rock, Alternative, Experimental\n  Source: vinyl\n  Codec: FLAC\n  Bit Rates: ~ 2,600 - 3,100 kbps\n  Bit Depth: 24\n  Sampling Rate: 96,000 Hz\n\n  1995 A.M.\n  1999 Summerteeth\n  2002 Yankee Hotel Foxtrot\n  2007 Sky Blue Sky\n  2009 Wilco \n  2011 The Whole Love\n\n  (All rips by Dr. Robert from 180g Audiophile Pressings)\n\n    Wilco rose from the ashes of the seminal roots rock band Uncle Tupelo, which disbanded in 1994. While Jay Farrar, one of the group's two singer/songwriters, went on to form Son Volt, his ex-partner Jeff Tweedy established Wilco along with the remaining members of Tupelo's final incarnation, which included drummer Ken Coomer as well as part-time bandmates John Stirratt (bass) and Max Johnston (mandolin, banjo, fiddle, and lap steel). Guitarist Jay Bennett rounded out the group, which in 1995 issued its debut album, A.M., a collection of spry country-rock tunes that followed the course established in Tweedy's earlier work.\n\n  Wilco's sophomore effort, 1996's two-disc set Being There, marked a radical transformation in the group's sound; while remaining steeped in the style that earned Tweedy his reputation, the songs took unexpected detours into psychedelia, power pop, and soul, complete with orchestral touches and R&amp;B horn flourishes. Shortly after the release of Being There, which most critics judged to be among the year's best releases, Johnston left the group to play with his sister, singer Michelle Shocked, and was replaced by guitarist Bob Egan of the band Freakwater. At the same time, while remaining full-time members of Wilco, Stirratt, Bennett, and Coomer also began performing together in the pop side project Courtesy Move. In 1998, Wilco collaborated with singer/songwriter Billy Bragg on Mermaid Avenue, a collection of performances based on unreleased material originally written by Woody Guthrie.\n\n  Their stunningly lush third album, Summerteeth, followed in 1999 and met with critical acclaim but only average sales, initiating tensions with their label, Warner Bros. Mermaid Avenue, Vol. 2, which featured more selections from the band's collaborations with Bragg on Woody Guthrie's unfinished songs, was issued in 2000. Following this release, longtime drummer Ken Coomer decided to amicably leave the band and was replaced by the Chicago-based Glenn Kotche. Wilco then focused on recording their fourth album, Yankee Hotel Foxtrot, which ultimately led to the departure of guitarist Jay Bennett and further tensions with their label. Unwilling to change the album to make it more &quot;commercially viable,&quot; Wilco bought the finished studio tapes from Warner/Reprise for a reported $50,000 and left the label altogether.\n\n  Leaked tracks from the album surfaced on the Internet in late 2001, and the stripped-down lineup of Tweedy, Kotche, Stirratt, and multi-instrumentalist Leroy Bach embarked on a small tour to support -- or drum up support for -- the unreleased record. Nonesuch Records picked up the album and officially released it in early 2002 to widespread critical acclaim. Meanwhile, an independent film documenting the drama surrounding the album (I Am Trying to Break Your Heart) followed in the fall of 2002. During the down time after the album was recorded, Tweedy composed and recorded the film score to the Ethan Hawke film Chelsea Walls, which ended up being released around the same time as Yankee Hotel Foxtrot.\n\n  Wilco toured extensively following the release of Yankee Hotel Foxtrot, and in 2003 began work on their next album, A Ghost Is Born. While sessions went smoothly compared to Yankee Hotel Foxtrot, after the album was finished Leroy Bach left the band in a split that was described as mutual and amicable; guitarist Nels Cline, keyboardist Mike Jorgensen, and multi-instrumentalist Pat Sansone joined Wilco for their subsequent tour. Shortly before the album's release, Tweedy surprised many fans by announcing he had entered a drug rehabilitation facility to treat a dependency on painkillers, prescribed to treat a long history of migraine headaches aggravated by panic disorder. Tweedy discussed his health problems in depth, along with the often tangled history of Wilco and Uncle Tupelo, in Wilco: Learning How to Die, a biography of the group written by rock journalist Greg Kot, published to coincide with A Ghost Is Born's release in the spring of 2004.","torrent":{"xt":"urn:btih:1a7bd9e641dd50c4f4650e011d3eeac4b83da2cd","amp;dn":"Wilco+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a7bd9e641dd50c4f4650e011d3eeac4b83da2cd","infoHashBuffer":{"type":"Buffer","data":[26,123,217,230,65,221,80,196,244,101,14,1,29,62,234,196,184,61,162,205]},"announce":[],"urlList":[]}}