{"title":"Peter James - Doodsimpel (E-Book)NLT-Release","uid":5349234,"size":592479,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1a8961a5b55a7caa3c8f22275e552e3298185c7a&amp;dn=Peter+James+-+Doodsimpel+%28E-Book%29NLT-Release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"soap22","files":6,"time":1265735287,"description":"Peter James - Doodsimpel\n\nBeschrijving\nEen macabere grap loopt gruwelijk uit de hand... Michael Harrison gaat bijna trouwen. Zijn vrienden besluiten hem eens flink te grazen te nemen en verzinnen een sinistere grap. Op zijn vrijgezellenavond voeren ze hem dronken, waarna ze hem achterlaten in een doodskist met een fles whisky en een walkietalkie. Maar wanneer de vrienden wegrijden om hem een paar uur flink te laten zweten, krijgen ze een fataal ongeluk... Niemand weet waar Michael is, ook Michael zelf niet, die langzaam ontwaakt uit zijn roes... Met nog maar drie dagen te gaan voor de bruiloft, wordt inspecteur Roy Grace ingeschakeld door de bloedmooie en zeer bezorgde verloofde, Ashley Harper. Met maar bar weinig aanknopingspunten moet Grace aan de slag. Zelfs Mark Warren, Michaels beste vriend en zakenpartner, en bij uitstek degene die zou moeten weten waar Michael uithangt, kan hem niet verder helpen. Gaandeweg komt Grace erachter dat meerdere mensen baat zouden kunnen hebben bij de verdwijning van Michael - meer dan iedereen zich realiseert. Want de een zijn dood is de ander zijn brood... Doodsimpel...\n","torrent":{"xt":"urn:btih:1a8961a5b55a7caa3c8f22275e552e3298185c7a","amp;dn":"Peter+James+-+Doodsimpel+%28E-Book%29NLT-Release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a8961a5b55a7caa3c8f22275e552e3298185c7a","infoHashBuffer":{"type":"Buffer","data":[26,137,97,165,181,90,124,170,60,143,34,39,94,85,46,50,152,24,92,122]},"announce":[],"urlList":[]}}