{"title":"The Complete Stardust  Fox  1939  Fletcher Hanks","uid":9769347,"size":70188128,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:1b135f84469dbb9e50661527be3c9d70c7f7ab96&amp;dn=The+Complete+Stardust++Fox++1939++Fletcher+Hanks&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mothra67","files":-1,"time":1394934727,"description":"Golden Age Origin \nStardust the Super Wizard lived on a &quot;private star&quot; far out in space. He patrolled the cosmos fighting criminals, racketeers, spies, and terrorists, but comes to Earth after intercepting a radio signal from America. Upon his arrival, he stopped a group of terrorists secretly plotting the assassination of the President. Stardust stopped the crooks by taking their snipers to the police and destroying their bombers by turning their own bombs against them. The spies then tried to hit him with an atom smasher, but Stardust disarmed them by using his magnetic ray to take their weapons and his suspending ray to cause them to float in mid-air until the police could retrieve them.\n\nStardust faced numerous aliens and criminal masterminds including ones such as the Super Fiend who set fire to the planet Mars. The villain then tried to send the burning planet colliding straight into the Earth. Super Fiend was stopped by Stardust who exiled the fiend to planet Mars.\n\nStardust also battled the villainous Kaos who used an army of giant vultures from the planet Venus to attack the Earth and get him a bride. Stardust defeated Kaos' winged horde and saved the grateful girl who came to live on his private star. Kaos is turned into a worm and sent back to Venus as a treat for the birds.\n\nAnother villain was the Demon who created an earthquake machine capable of creating powerful tsunamis. The Demon planned on using his tidal waves to destroy New York, but Stardust threw the Demon into the wave and then disintegrated his body. Stardust then calmed the waves and, by using fiery skywriting, let the people of New York know they were safe.\n\nPowers and Abilities \nHe has a vast knowledge of interplanetary science and devotes his abilities to crime-busting. In practical terms, this gives him unlimited, virtually omnipotent powers. He can fly through space using his tubular spatial accelerated supersolar light waves. He was also immune to heat and cold from exposure to certain gases from stars. He had artificial lungs that allowed him to breathe in space or poison gas. Stardust wore flexible star-metal skin that rendered him invulnerable to chemical, electric, and physical attacks. Stardust could also teleport himself and others in a star-shaped flash of light. He was also known to write fiery messages in the sky using his powers.\n\nHe could also shoot a variety of rays including retarding, extinguishing, magic transforming, anti-gravity, suspending, magnetic, disintegrating, reversing arc, and reducing rays. His most common ones were his repulsor and attraction rays. Some unique rays was his spectral ray which could make him invisible or bright as a star and his secret ray which forced murders to see the skeletons of those they had killed.\n\n\nGolden Age Appearances \nBig 3 #2\nFantastic Comics #1-16\n\nReal Name\n\nUnknown\n\nFirst Appearance\n\nFantastic Comics #1 (1939)\n\nOriginal Publisher\n\nFox\n\nCreated by\n\nFletcher Hanks","torrent":{"xt":"urn:btih:1b135f84469dbb9e50661527be3c9d70c7f7ab96","amp;dn":"The+Complete+Stardust++Fox++1939++Fletcher+Hanks","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b135f84469dbb9e50661527be3c9d70c7f7ab96","infoHashBuffer":{"type":"Buffer","data":[27,19,95,132,70,157,187,158,80,102,21,39,190,60,157,112,199,247,171,150]},"announce":[],"urlList":[]}}