{"title":"Paths of Glory (1957) [DVD5][PAL][Eng-Spa-Fra-Ger-Ita]","uid":6160501,"size":4099340288,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:1b21af71cafa629462af6ccfd11c933006175ff3&amp;dn=Paths+of+Glory+%281957%29+%5BDVD5%5D%5BPAL%5D%5BEng-Spa-Fra-Ger-Ita%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"webchella","files":50,"time":1297197023,"description":"Senderos De Gloria (1957) [DVD5][PAL][Eng-Spa-Fra-Ger-Ita]\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0050825/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0050825/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.filmaffinity.com/es/film448956.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.filmaffinity.com/es/film448956.html&lt;/a&gt;\n\n===========\n::English::\n===========\nTitle: Paths of Glory (1957)\nGenre: Belize. Drama | World War I\nDirector: Stanley Kubrick\nLength: 86 min\nCast: Kirk Douglas, Ralph Meeker, Adolphe Menjou, Goerge MacReady, Wayne Morris, Richard Anderson, Joseph Turkel, Timothy Carey, Peter Capell\nMusic: Gerald Fried\nScreenplay: Stanley Kubrick, Calder Willingham and Jim Thompson (based on the novel Paths of Glory by Humphrey Cobb)\nPhoto: Georg Krause\nStudio: MGM presents a production Bryna Productions\n\nSynopsis:\nDuring the First World War, General Boulard ordered the taking of a German position. This instructs the task to the General Mireau orders Colonel Dax who head up the attack. The mission is a failure and the high command, angered by the defeat, he decides to teach a lesson to the soldiers.\n\nAnecdotes and trivia\n\n1 - For its premiere in Spain was not until 1986 when a retrospective of the director.\n2 - The film had problems when it was released in Europe.\n3 - The main fault that the project proceed was Kirk Douglas, who read the script and supported him. Then the United Artists studios awarded a small budget the film.\n4 - The film was shot in Germany at the difficulties of shooting the film in the U.S. or France.\n5 - The script was rejected by several producers in Hollywood.\n6 - His projection, in 1958, in Brussels, major incidents triggered by pressure from the French authorities and associations of former French and Belgian soldiers, who refused to accept the image that was projected in the French army. The pressures of the French consulate got to suspend the screening of the film, which in turn ignited the antiwar protests.\nFrench informal pressures that United Artists got called to the suspension of the projection to insert an explanatory note and the hymn of the Marseillaise at the beginning of the film. With this addition, the film re-designed in Brussels.\nSwitzerland, however, banned the showing, and the United Artists just do not dare to present the film in France until 1972. He was finally released in France during 1975.\n\n======================\nVideo: Pal 1.33:1, 4:3\nAudios: Mono: English, Spanish, French, German, Italian\nSubtitles: Spanish, French, Italian, Dutch, English for deaf people, German for deaf\nExtras: Interactive Menus, Scene Access, Original Film Trailer\n====================================================================================\n\n===========\n::Spanish::\n===========\nTitulo: Senderos de gloria (1957) \nTitulo Original: Paths of Glory \nGenero: BÃƒÂ©lico. Drama | I Guerra Mundial\nDirecciÃƒÂ³n: Stanley Kubrick\nDuracion: 86 Min.\nReparto: Kirk Douglas, Ralph Meeker, Adolphe Menjou, Goerge MacReady, Wayne Morris, Richard Anderson, Joseph Turkel, Timothy Carey, Peter Capell\nMÃƒÂºsica: Gerald Fried\nGuion: Stanley Kubrick, Calder Willingham y Jim Thompson (basado en la novela Paths of Glory de Humphrey Cobb)\nFotografÃƒÂ­a: Georg Krause\nProductora: MGM presenta una producciÃƒÂ³n Bryna Productions\n\nSinopsis: \nDurante la primera Guerra Mundial, el general Boulard ordena la toma de una posiciÃƒÂ³n alemana. Este encarga la tarea al General Mireau quien ordena al Coronel Dax que encabece el ataque. La misiÃƒÂ³n es un fracaso y el alto mando, indignado por la derrota, decide dar una lecciÃƒÂ³n a los soldados.\n\n\nAnÃƒÂ©cdotas y curiosidades\n\n1- Para su estreno en EspaÃƒÂ±a hubo que esperar hasta 1986 cuando se realiza una retrospectiva del director.\n2- El film tuvo problemas cuando fue estrenada en Europa.\n3- El principal culpable de que el proyecto siguiera adelante fue Kirk Douglas, quien leyÃƒÂ³ el guion y lo apoyÃƒÂ³. Luego, los estudios United Artists otorgo un pequeÃƒÂ±o presupuesto al film.\n4- La pelÃƒÂ­cula se rodÃƒÂ³ en Alemania ante las dificultades de rodar el film en USA o Francia.\n5- El guion fue rechazado por varios productores de Hollywood.\n6- Su proyecciÃƒÂ³n, en 1958, en Bruselas, desencadenÃƒÂ³ importantes incidentes por las presiones de las autoridades francesas y de las asociaciones de ex combatientes franceses y belgas, que se negaban a aceptar la imagen que se proyectaba del ejÃƒÂ©rcito francÃƒÂ©s. Las presiones del consulado francÃƒÂ©s consiguieron que se suspendiese la proyecciÃƒÂ³n de la pelÃƒÂ­cula, lo que a su vez encendiÃƒÂ³ las protestas antimilitaristas.\nLas presiones oficiosas francesas consiguieron que la United Artists llamara a la suspensiÃƒÂ³n de la proyecciÃƒÂ³n para insertar una nota explicativa y el himno de La Marsellesa al inicio del film. Con esta aÃƒÂ±adidura, la pelÃƒÂ­cula volviÃƒÂ³ a proyectarse en Bruselas.\nSin embargo, Suiza prohibiÃƒÂ³ su proyecciÃƒÂ³n, y la United Artists simplemente no se atreviÃƒÂ³ a presentar el film en Francia hasta 1972. Finalmente fue estrenado en el paÃƒÂ­s galo en 1975. \n\n=======================\nVideo: Pal 1.33:1, 4:3\nAudios: Mono: EspaÃƒÂ±ol, InglÃƒÂ©s, FrancÃƒÂ©s, AlemÃƒÂ¡n, Italiano\nSubtÃƒÂ­tulos: EspaÃƒÂ±ol, FrancÃƒÂ©s, Italiano, HolandÃƒÂ©s, Ingles para sordos, AlemÃƒÂ¡n para sordos\nExtras: MenÃƒÂºs interactivos, Acceso directo a escenas, Trailer original de cine\n===============================================================================\n\n","torrent":{"xt":"urn:btih:1b21af71cafa629462af6ccfd11c933006175ff3","amp;dn":"Paths+of+Glory+%281957%29+%5BDVD5%5D%5BPAL%5D%5BEng-Spa-Fra-Ger-Ita%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b21af71cafa629462af6ccfd11c933006175ff3","infoHashBuffer":{"type":"Buffer","data":[27,33,175,113,202,250,98,148,98,175,108,207,209,28,147,48,6,23,95,243]},"announce":[],"urlList":[]}}