{"title":"Expert Android Vol.1 - 2014","uid":10311788,"size":81143003,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1c2d95e5c8d3f81525b97b8f35ad9797fed65280&amp;dn=Expert+Android+Vol.1+-+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"sidmal","files":-1,"time":1402190810,"description":"Expert Android Vol.1 - 2014\n English | 180 Pages | HQ PDF | 77.40 Mb\n\nExpert Android Volume 1\n\nAdvanced techniques for adventurous users\n\nSo, you've had your Android device for a while now. You've really gotten to know it, and it's probably become indispensable to you. Are you getting the most out of it, though? This is a question that springs to everyone's mind sooner or later, as they realise that the immense computing power they have is barely being touched, and that they've had the same apps on their home screens since day one. Perhaps a better question to ask would be this: what do you want your device to do for you? Would you like to bring all your favourite feeds together into an easily accessible interface, or check them from the lock screen? Do you want to stream music from your desktop iTunes library, or be able to throw your device's videos onto a smart TV? Have you ever thought about having a go at making apps? Read on. Non-root innovations - Master your device with advanced techniques and ideas. Rooting fundamentals - From flashing ROMs to fixing bricks, learn how to hack Advanced modification - Theme Android with custom graphics and learn to develop Rom and app development - Follow workflows for cooking ROMs and building apps Live Android project - See under the hood of a fully extended project example","torrent":{"xt":"urn:btih:1c2d95e5c8d3f81525b97b8f35ad9797fed65280","amp;dn":"Expert+Android+Vol.1+-+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c2d95e5c8d3f81525b97b8f35ad9797fed65280","infoHashBuffer":{"type":"Buffer","data":[28,45,149,229,200,211,248,21,37,185,123,143,53,173,151,151,254,214,82,128]},"announce":[],"urlList":[]}}