{"title":"Manufacturing Engineering and Technology","uid":6160760,"size":131233655,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1c5849d65e6fda299dcda4193abea5273e5a9131&amp;dn=Manufacturing+Engineering+and+Technology&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"abuel-3bbas","files":79,"time":1297204608,"description":"Product Description\n Manufacturing, Engineering and Technology 5/e is intended for students of manufacturing in manufacturing , mechanical, or industrial engineering programs at both the Associate Degree or Bachelor Degree level.  The book emphasizes a mostly qualitative description of the science, mathematics and the technology and practice of manufacturing, including detailed descriptions of manufacturing processes and the manufacturing enterprise.\nThe book has been completely updated, and addresses issues essential to modern manufacturing, ranging from traditional topics such as casting, forming, machining, and joining processes, to advanced topics such as the fabrication of microelectronic devices and microelectromechanical systems (MEMS).\nWith a large number of case studies and examples, up to date and comprehensive coverage of all topics, and superior graphics, the book provides a good background for manufacturing students as well as professionals.\n\nAbout the Author\nProfessor Serope Kalpakjian has been teaching at the Illinois Institute of Technology since 1963. After graduating from Robert College (with High Honors), Harvard University, and the Massachusetts Institute of Technology, he joined Cincinnati Milacron, Inc., where he was a research supervisor in charge of advanced metal-forming processes. He has published numerous papers and is the author of several articles in encyclopedias and handbooks; he has also edited various volumes and serves on the editorial boards of several journals and the Encyclopedia Americana.\nDr. Steven R. Schmid is an Associate Professor in the Department of Aerospace and Mechanical Engineering at the University of Notre Dame, where he teaches and conducts research in manufacturing, machine design, and tribology. As the Director of the Manufacturing Tribology Laboratory at the university, he oversees industry and governmentally funded research on a wide variety of manufacturing topics, including tribological issues in rolling, forging and sheet metal forming, polymer processing, medical device design and manufacture, and nanomechanics.\n\nProduct Details\nHardcover: 1320 pages\nPublisher: Prentice Hall; 5 edition (August 13, 2005)\nLanguage: English\nISBN-10: 0131489658\nISBN-13: 978-0131489653","torrent":{"xt":"urn:btih:1c5849d65e6fda299dcda4193abea5273e5a9131","amp;dn":"Manufacturing+Engineering+and+Technology","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c5849d65e6fda299dcda4193abea5273e5a9131","infoHashBuffer":{"type":"Buffer","data":[28,88,73,214,94,111,218,41,157,205,164,25,58,190,165,39,62,90,145,49]},"announce":[],"urlList":[]}}