{"title":"Futurama - Season 5 - Audio Commentary - DVDRip - AAC","uid":7509366,"size":149398574,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:1c75c51a49b3c703ca8e60810269db5f493c6f46&amp;dn=Futurama+-+Season+5+-+Audio+Commentary+-+DVDRip+-+AAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"schleicher","files":14,"time":1344267360,"description":"A Clockwork Origin (6ACV09) (Audio Commentary by Matt Groening, David X. Cohen, Dwayne Carey-Hill, Dan Vebber, Billy West, John DiMaggio, Tress MacNeille, David Herman and Peter Avanzino)\n\nAttack of the Killer App (6ACV03) (Audio Commentary by Matt Groening, David X. Cohen, Stephen Sandoval, Dan Vebber, Billy West, John DiMaggio, Tress MacNeille, David Herman and Peter Avanzino)\n\nIn-A-Gadda-Da-Leela (6ACV02) (Audio Commentary by Matt Groening, David X. Cohen, Dwayne Carey-Hill, Billy West, John DiMaggio, David Herman, Peter Avanzino and Claudia Katz)\n\nLethal Inspection (6ACV06) (Audio Commentary by Matt Groening, David X. Cohen, Ray Claffey, Eric Horsted, Michael Rowe, Billy West, John DiMaggio, Lauren Tom and Lee Supercinski)\n\nLrrrenconcilable Ndndifferences (6ACV11) (Audio Commentary by Matt Groening, David X. Cohen, Crystal Chesney-Thompson, Patric M. Verrone, Billy West, John DiMaggio, Maurice LaMarche, Peter Avanzino and Lee Supercinski)\n\nProposition Infinity (6ACV04) (Audio Commentary by Matt Groening, David X. Cohen, Crystal Chesney-Thompson, Michael Rowe, Billy West, John DiMaggio, Lauren Tom, Lee Supercinski and Claudia Katz)\n\nRebirth (6ACV01) (Audio Commentary by Matt Groening, David X. Cohen, Frank Marino, Eric Horsted, Billy West, John DiMaggio, Peter Avanzino and Claudia Katz)\n\nThat Darn Katz! (6ACV08) (Audio Commentary by Matt Groening, David X. Cohen, Frank Marino, Patric M. Verrone, Billy West, John DiMaggio, Maurice LaMarche, Peter Avanzino and Lee Supercinski)\n\nThe Duh-Vinci Code (6ACV05) (Audio Commentary by Matt Groening, David X. Cohen, Raymie Muzquiz, Maiya Williams, Patric M. Verrone, Billy West, John DiMaggio, Maurice LaMarche and Peter Avanzino)\n\nThe Futurama Holiday Spectacular (6ACV13) (Audio Commentary by Matt Groening, David X. Cohen, Ray Claffey, Michael Rowe, Josh Weinstein, Billy West, John DiMaggio, Peter Avanzino and Lee Supercinski)\n\nThe Late Philip J. Fry (6ACV07) (Audio Commentary by Matt Groening, David X. Cohen, Peter Avanzino, Lewis Morton, Eric Horsted, Billy West, John DiMaggio, Lee Supercinski and Claudia Katz)\n\nThe Mutants Are Revolting (6ACV12) (Audio Commentary by Matt Groening, David X. Cohen, Raymie Muzquiz, Eric Horsted, Billy West, John DiMaggio, Peter Avanzino, Lee Supercinski and Claudia Katz)\n\nThe Prisoner of Benda (6ACV10) (Audio Commentary by Matt Groening, David X. Cohen, Stephen Sandoval, Michael Rowe, Josh Weinstein, Billy West, John DiMaggio, Lauren Tom and Lee Supercinski)","torrent":{"xt":"urn:btih:1c75c51a49b3c703ca8e60810269db5f493c6f46","amp;dn":"Futurama+-+Season+5+-+Audio+Commentary+-+DVDRip+-+AAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c75c51a49b3c703ca8e60810269db5f493c6f46","infoHashBuffer":{"type":"Buffer","data":[28,117,197,26,73,179,199,3,202,142,96,129,2,105,219,95,73,60,111,70]},"announce":[],"urlList":[]}}