{"title":"The Stone Roses War and Peace - Simon Spence.epub","uid":9015929,"size":2644073,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1ce8d10b97cffb5ea471c1b01923ecfaf3ef2521&amp;dn=The+Stone+Roses+War+and+Peace+-+Simon+Spence.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"420weedman","files":1,"time":1381192779,"description":"Format: mobi/epub\nPrint Length: 352 pages\nGenre: Music/Biography\nPublished: 2 April 2013\n\nThe Stone Roses captures the magic - and chaos - behind the UK band's rise, fall, and recent resurrection.\n\nThe iconic Brit pop band The Stone Roses became an overnight sensation when their 1989 eponymous album went double platinum. It was a recording that is still often listed as one of the best albums ever made. Its chiming guitar riffs, anthemic melodies, and Smiths-like pop sensibility elevated The Stone Roses to a cult-like status in the UK and put them on the map in the U.S. But theirs is a story of unfulfilled success: their star imploded as their sophomore effort took years to complete and the band broke up acrimoniously in 1996. Sixteen years later, they have reunited for a world tour, thrilling fans around the globe in one of the most successful reunion tours ever.\n\nWith one hundred interviews of key figures, forty rare photographs, and exclusive insider material including how they created their music, The Stone Roses charts the band's rise from the backwaters of Manchester to becoming the stars of the &quot;Madchester&quot; scene to their 2011 reunion. Going beyond the myths to depict a band that defined Brit pop, Simon Spence illustrates their incandescent talent and jaw-dropping success while contextualizing them in the 90s music scene. This is the definitive story of The Stone Roses.\n\nAuthor:\n\nSimon Spence collaborated with Rolling Stones manager Andrew Loog Oldham on the acclaimed memoirs Stoned and 2Stoned. He has written for the NME, i-D, Dazed &amp; Confused and the Independent. He was at the Stone Roses' legendary Blackpool and Alexandra Palace shows in 1989 and covered their era-defining Spike Island show for The Face. \n","torrent":{"xt":"urn:btih:1ce8d10b97cffb5ea471c1b01923ecfaf3ef2521","amp;dn":"The+Stone+Roses+War+and+Peace+-+Simon+Spence.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ce8d10b97cffb5ea471c1b01923ecfaf3ef2521","infoHashBuffer":{"type":"Buffer","data":[28,232,209,11,151,207,251,94,164,113,193,176,25,35,236,250,243,239,37,33]},"announce":[],"urlList":[]}}