{"title":"Schoolly D - Greatest Hits 1995 [FLAC] - Kitlope","uid":9433735,"size":431358907,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1d32d821029bc0908ed17548e46e1c19ca98bccc&amp;dn=Schoolly+D+-+Greatest+Hits+1995+%5BFLAC%5D+-+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"Kitlope","files":15,"time":1388853868,"description":"PC Software: Windows 8.1 Pro \nFile Type: FLAC Compression 6\nOptical Drive Hardware: Samsung SH-S223L\nOptical Drive Firmware: SB04\nCd Software: Exact Audio Copy V1.0 Beta 3 (Secure Mode)\nEAC Log: Yes\nEAC Cue Sheet: Yes\nM3U Playlist: Yes\nTracker(s): udp://tracker.openbittorrent.com:80, udp://tracker.publicbt.com:80, udp://tracker.istole.it:6969\nTorrent Hash: 1D32D821029BC0908ED17548E46E1C19CA98BCCC\nFile Size: 411.37 MB\nYear: 1995\nLabel: Zomba / Jive\nCatalog #: 01241-41567-2\n\n\nPlease help seed these FLACs! \n\n\nFrom Wiki:\n\n\n\nSchoolly D is the moniker of American rapper Jesse B. Weaver, Jr. from Philadelphia, Pennsylvania. He was a pioneer of hardcore rap and gangsta rap,[citation needed] being one of the first rappers to embrace an antisocial persona without explicit irony\n\nMusically, Schoolly D and his DJ Code Money came up with electronic hardcore beats. Later on, Schoolly embraced the afrocentric style, working together with KRS-One. He contributed songs and music to many Abel Ferrara films, and &quot;Signifying Rapper&quot; from Smoke Some Kill was used in Ferrara's film Bad Lieutenant. Because Led Zeppelin successfully sued due to an uncleared interpolation of their song &quot;Kashmir&quot; in &quot;Signifying Rapper,&quot; the song was omitted from the soundtrack of the film and indeed from subsequent releases of the Bad Lieutenant.\n\nSchoolly also wrote &quot;The Player&quot; for Ferrara's film The Blackout, as well as the score to Ferrara's R'Xmas. In addition he also contributed the title track to Ferrara's King of New York starring Christopher Walken. The film also contained the track &quot;Am I Black enough for you?&quot;. Most recently, Schoolly D co wrote the indie film sound track of the sci-fi thriller, &quot;Order of the Quest&quot; with Media Bureau, Chuck Treese and Benjamin Barnett. His last album, Funk 'N Pussy, features guest appearances by Public Enemy's Chuck D, Chuck Chillout, Lady B and a drum and bass remix of the classic Schoolly D track &quot;Mr. Big Dick&quot; (remixed by UK trip-hop crew The Sneaker Pimps).\n\nSchoolly also does the music and occasional narration for the cult animated series Aqua Teen Hunger Force on the Cartoon Network channel in its Adult Swim strand.\n\nRapper Ice-T, who is often given credit for the creation of gangster rap, credits Schoolly D.\n\n&quot;The first record that came out along those lines was Schoolly D's &quot;P.S.K.&quot; Then the syncopation of that rap was used by me when I made &quot;Six In The Morning&quot;. The vocal delivery was the same: '...P.S.K. is makin' that green', '...six in the morning, police at my door'. When I heard that record I was like &quot;Oh shit!&quot; and call it a bite or what you will but I dug that record. My record didn't sound like &quot;P.S.K.&quot;, but I liked the way he was flowing with it. &quot;P.S.K.&quot; was talking about Park Side Killers but it was very vague. That was the only difference, when Schoolly did it, it was '...one by one, I'm knockin' em out'. All he did was represent a gang on his record. I took that and wrote a record about guns, beating people down, and all that with &quot;Six In The Morning&quot;.\n\n\n\nSchoolly D - The Jive Collection / Volume 3 1995\n\n\n\n\n\nTracks:\n\n\n1. P.S.K. 'What Does It Mean' ? \n\n\n2. Gucci Time \n\n\n3. Put Your Filas On \n\n\n4. Saturday Night \n\n\n5. Dedication To All B-Boys \n\n\n6. Fat Gold Chain \n\n\n7. Parkside 5-2 \n\n\n8. B-Boy Rhyme And Riddle \n\n\n9. Smoke Some Kill \n\n\n10. Mr. Big Dick \n\n\n11. Coqui 900 \n\n\n12. Livin' In The Jungle \n\n\n\n\nEnjoy Schoolly D :)","torrent":{"xt":"urn:btih:1d32d821029bc0908ed17548e46e1c19ca98bccc","amp;dn":"Schoolly+D+-+Greatest+Hits+1995+%5BFLAC%5D+-+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d32d821029bc0908ed17548e46e1c19ca98bccc","infoHashBuffer":{"type":"Buffer","data":[29,50,216,33,2,155,192,144,142,209,117,72,228,110,28,25,202,152,188,204]},"announce":[],"urlList":[]}}