{"title":"Katalyst - 2009 - Death By Design","uid":6855302,"size":126940865,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1d3a824b083e554ecaa5209b3986efbbba48af35&amp;dn=Katalyst+-+2009+-+Death+By+Design&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"TorrentTracts","files":17,"time":1322678708,"description":"Katalyst - 2009 - Death By Design\n\n\nTRACK LISTING:\n\n01 - According To Plan\n02 - Death By Design\n03 - Thinkin Bout\n04 - I Need the Truth\n05 - U Kiddin Me feat Mimik\n06 - Come Back Home feat EMJ and Decipha\n07 - Traveling\n08 - Preach Christ feat Tyrone Andrews\n09 - Satisfied\n10 - Meaning of Death\n11 - Die If I Have To feat Paul Washington\n12 - Find A Way feat EMJ and Dwayne Tryumf\n13 - Ready To Die\n14 - I Got Proof feat Lecrae\n15 - Goodbye\n16 - I'm Saved\n17 - Outro \n\n\nAMAZON REVIEW:\n\nKatalyst Christian Hip-Hop/Rap artist, was born to die. Born to take breath until his body of flesh ceased to function and he would exist no more. He was born a sinner, an enemy of God and in need of a savior. But when he was born again and his old nature died, and he is now alive in Christ! Birthed in queens New York and living in 4 other states before his family settled into the ghetto s of Chicago IL when he was 8 years old. His father being a minister taught him through lessons and by his life how to study the word and be a man of God. At a young age at thanks to the gentle encouragement and teaching of his mother he gave his life to Jesus Christ making him LORD over it. Since then Katalyst has been consumed with spreading the message of the gospel to a dying world. Sharing the truth with the church is also an extreme passion of his. So many don t realize that as a believer we are still mandated to die, to ourselves, to our culture, and to our passions. He prays that God will be glorified by his life, his marriage, and his music. That while he can t make people change or even cause it; he can be that katalyst that compels you to Christ the master. At 22 Years old Katalyst only aim is to point people to the risen saviour Jesus Christ! katalyst : an agent that provokes or speeds significant change or action Thats all I intend to do. I am not the agent of change and I can not change anything. I strongly encourage people to see that agent of Change. Jesus Christ! The point of my album is dual parts. On one side you have God who created everything including us, knowing that we were going to sin. Knowing that he was going to have to die for us, and yet he still did it. Amazing! Two is the fact that for us to live as Christians we have to die to ourselves and our sinful nature. In order to live we have to die, don t you just love the irony. So the album follows the process of God setting it up, where he would have to die for us and what our lives should like in response. The album also follows our lives as we learn to die to ourselves to find life inside of Jesus Christ. I tried really hard to explore different sounds and themes on this album while still keeping it cohesive. I hope that you will be encouraged, challenged, and bobbing to the beat as you try to reach Death by Design. Featuring Lecrae, Dwayne Tryumf, Mimik, Decipha, EMJ, and others Production by T. Stone, K Drama, G Styles, EMJ, and Alex Medina\n\n\nTORRENTED BY:\n\nTorrentTracts, November 2011\n","torrent":{"xt":"urn:btih:1d3a824b083e554ecaa5209b3986efbbba48af35","amp;dn":"Katalyst+-+2009+-+Death+By+Design","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d3a824b083e554ecaa5209b3986efbbba48af35","infoHashBuffer":{"type":"Buffer","data":[29,58,130,75,8,62,85,78,202,165,32,155,57,134,239,187,186,72,175,53]},"announce":[],"urlList":[]}}