{"title":"Nightlands - Oak Island (2013) [FLAC]","uid":8075627,"size":204477727,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1d469fda573880681a7fee53b36787f987a1b0c5&amp;dn=Nightlands+-+Oak+Island+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"politux","files":-1,"time":1359380891,"description":"\n  Nightlands - Oak Island (2013) [FLAC]\n\n  Released: 2013\n  Duration: 33:02\n  Genre: Pop/Rock\n  Style: Dream Pop, Noise Rock, Indie\n  Codec: FLAC\n  Bit Rate: ~ 800 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n  Cover: Front\n\n  01 Time and Place\n  02 So Far So Long\n  03 You're My Baby\n  04 Nico\n  05 So it Goes\n  06 Born to Love\n  07 I Fell in Love with a Feeling\n  08 Rolling Down the Hill\n  09 Other People's Pockets\n  10 Looking for Rain\n\n  &quot;I'd like to invite you for just a little while/To a place I used to go when I was only 17,&quot; Dave Hartley sings near the beginning of his second Nightlands album, and that sense of nostalgia pervades the rest of Oak Island. Building on the epic yet intimate feel of his debut, Forget the Mantra, Hartley's project recalls other acts who wrap a fragile, wonderstruck voice in a cocoon of immense sounds, but Nightlands has a unique approach within that realm. Hartley applies as much science to his music as he can, resulting in dreamy, literally experimental pop. Oak Island's songs prominently feature major-seventh chords - the most nostalgic-sounding harmonic grouping - so it's no surprise that Hartley also has a fondness for '70s soft rock and its mellow euphoria. But by juxtaposing those breezy sounds with philosophical, even ambivalent lyrics on songs like &quot;Born to Love,&quot; Hartley gives Nightlands' idylls more depth. \n\n  Oak Island's poppier songs, such as the deceptively joyous &quot;So Far So Long,&quot; the brassy &quot;I Fell in Love with a Feeling,&quot; and the melancholy, Pink Floyd-esque &quot;So It Goes,&quot; are the gateway to the album's more free-form moments. Before building into some intricately jazzy guitars, &quot;You're My Baby&quot;'s syrupy guitars and blissed-out vocals sound as sappy -- and as meaningful -- as gazing into a sweetheart's eyes feels, while &quot;Rolling Down the Hill&quot; ventures into kinetic Afro-disco territory. Despite Nightlands' scientific approach, Oak Island doesn't sound sterile or too calculated; instead, Hartley revisits the innocence of the past with sophistication, like seeing the places you went when you were 17 with new eyes.","torrent":{"xt":"urn:btih:1d469fda573880681a7fee53b36787f987a1b0c5","amp;dn":"Nightlands+-+Oak+Island+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d469fda573880681a7fee53b36787f987a1b0c5","infoHashBuffer":{"type":"Buffer","data":[29,70,159,218,87,56,128,104,26,127,238,83,179,103,135,249,135,161,176,197]},"announce":[],"urlList":[]}}