{"title":"CompTIA A+ 220-701 and 220-702 Cert Guide (2009)","uid":5387116,"size":26528591,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1dad61d36a262e072c956afeee5eeb10a74d2182&amp;dn=CompTIA+A%2B+220-701+and+220-702+Cert+Guide+%282009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"gigitygigity","files":1,"time":1266930475,"description":"CompTIA A+ Certification Guide, from Pearson Certification, is a comprehensive guide to the new A+ exams from CompTIA. This book combines the learning and reference tools of the all-time best-selling PC repair book with comprehensive learning on all the A+ exams. This book will help any A+ candidate ace the new exams with guidance from two of the most prolific and talented authors in the PC hardware industry, Mark Edward Soper and Scott Mueller. Mark and Scott not only show you what you'll need to pass the tests, but also what you need to apply your learning in the real world. The book is rich with learning and exam preparation features. Hands-on lab exercises, real-world test preparation advice, and the CD accompanying the book allow for at-home practice using electronic test engines, lab exercises, and study notes! Each chapter takes on a ground-up approach - starting with the essentials and gradually building to larger, more complex concepts. Beginners will be at ease with this book. Loaded with informative illustrations, photos and screen captures that help you follow along, the book also includes a handy objectives index that maps each test objective to the section of the book in which that objective is covered. This invaluable tool will help you be certain that they are ready for test day! \n\n\n# Hardcover: 960 pages\n# Publisher: Pearson Certification; 3rd Revised edition edition (19 Nov 2009)\n# Language English\n# ISBN-10: 0789740478\n# ISBN-13: 978-0789740472\n\n\nEBOOK ONLY, NO DVD'S OR CD'S!","torrent":{"xt":"urn:btih:1dad61d36a262e072c956afeee5eeb10a74d2182","amp;dn":"CompTIA+A%2B+220-701+and+220-702+Cert+Guide+%282009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1dad61d36a262e072c956afeee5eeb10a74d2182","infoHashBuffer":{"type":"Buffer","data":[29,173,97,211,106,38,46,7,44,149,106,254,238,94,235,16,167,77,33,130]},"announce":[],"urlList":[]}}