{"title":"Todd Snider - Agnostic Hymns &amp; Stoner Fables [2012] [FLAC]","uid":8247685,"size":264388838,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1e088251ffec9ea1c45e317da24238ec278ec67e&amp;dn=Todd+Snider+-+Agnostic+Hymns+%26amp%3B+Stoner+Fables+%5B2012%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":12,"time":1363097213,"description":"one of Dicks Americana collection\n\n1\t In the Beginning\t-Snider\t4:23\n2\t New York Banker\t-Snider\t4:23\n3\t West Nashville Grand BallroomGown\t-Buffett\t4:26\n4\t Precious Little Miracles\t-Snider\t3:03\n5\t The Very Last Time\t-Kimbrough, Snider\t2:50\n6\t In Between Jobs\t-Hixx, Snider\t3:00\n7\t Brenda\t-Snider\t4:55\n8\t Too Soon to Tell\t-Snider\t5:12\n9\t Digger Dave's Crazy Woman Blues\t-Digger Dave, McConnell, Snider\t4:20\n10\t Big Finish\t-Snider\t5:53\n\nTodd Snider is usually described as a singer/songwriter, but that description seems a little too tidy for what he does. Snider is more of a guy who can sort of carry a tune with his craggy, weather-beaten voice while he spins tall tales of the many things he's seen while out on the road. Snider called one of his live albums The Storyteller for a good reason, and he's back to sharing his stories in the way that suits him best on 2012's Agnostic Hymns and Stoner Fables. The last time Snider released a record in an election year was 2008's Peace Queer, in which he pointedly addressed the state of the nation at the end of the Bush Administration, and Agnostic Hymns finds him exploring similar themes with just as much clarity and even more venom -- and with the cast of antagonists looking remarkably the same. A teacher finds out how his retirement fund was wiped out in &quot;New York Banker,&quot; early man uses faith to bilk the less fortunate into doing his bidding on &quot;In the Beginning,&quot; aimless kids with no prospects turn on the community (and dress badly while doing it) in &quot;Precious Little Miracles,&quot; and folks marginalized by the economy start running out of patience in &quot;In Between Jobs.&quot; Snider's usual snarky wit is in plentiful supply, and &quot;Digger Dave's Crazy Woman Blues&quot; and &quot;Brenda&quot; focus on the sort of colorful losers who usually dominate his lyrics, but as the economic divide in America grows greater, Snider doesn't make a secret of his distrust of the wealthy and powerful, and the rough but powerful, straightforward tone of these recordings reinforces the themes of the music, like a late-night electrified hootenanny fueled by cheap booze and class rage (and the strong, gusty guitar work from Snider and lean, forceful drumming from Paul Griffith are just what these tunes needed). Much like Peace Queer, Agnostic Hymns and Stoner Fables doesn't sound like an endorsement for Barack Obama, but he clearly doesn't have much use for the guys running against him, and if you're in the mood for a few laughs and some well-directed anger from a guy with something to say and a knack for saying it well, Todd Snider is just the man you've been looking for.","torrent":{"xt":"urn:btih:1e088251ffec9ea1c45e317da24238ec278ec67e","amp;dn":"Todd+Snider+-+Agnostic+Hymns+%26amp%3B+Stoner+Fables+%5B2012%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e088251ffec9ea1c45e317da24238ec278ec67e","infoHashBuffer":{"type":"Buffer","data":[30,8,130,81,255,236,158,161,196,94,49,125,162,66,56,236,39,142,198,126]},"announce":[],"urlList":[]}}