{"title":"Acharya - The Christ Conspiracy - The Greatest Story Ever Sold (","uid":4869251,"size":2604081,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1ed33247fdd72f49b47d9cc9b49a7938c3d40bcf&amp;dn=Acharya+-+The+Christ+Conspiracy+-+The+Greatest+Story+Ever+Sold+%28&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Djofullinn","files":1,"time":1240700339,"description":"This is Acharya S.'s amazing book The Christ Conspiracy - The Greatest Story Ever Sold (1999) which draws together an amazing amount of research and demolishes the facade of Christianity, showing that it is 100% mythology. Controversial and explosive, The Christ Conspiracy marshals an enormous amount of startling evidence that the religion of Christianity and Jesus Christ were created by members of various secret societies, mystery schools and religions in order to unify the Roman Empire under one state religion! This powerful book maintains that these groups drew upon a multitude of myths and rituals that already existed long before the Christian era and reworked them into the story the Christian religion presents today-known to most Westerners as the Bible. Author Acharya (actual name D. Murdock) makes the case that there was no actual person named Jesus, but that several characters were rolled into one mythic being inspired by the deities Mithras, Heracles/Hercules, Dionysus and many others of the Roman Empire. She demonstrates that the story of Jesus, as portrayed in the Gospels, is nearly identical in detail to those of the earlier savior-gods Krishna and Horus, and concludes that Jesus was certainly neither original nor unique, nor was he the divine revelation. Rather, he represents the very ancient body of knowledge derived from celestial observation and natural forces. A book that will initiate heated debate and inner struggle, it is intelligently written and referenced. The only book of its kind, it is destined for controversy. 325 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:1ed33247fdd72f49b47d9cc9b49a7938c3d40bcf","amp;dn":"Acharya+-+The+Christ+Conspiracy+-+The+Greatest+Story+Ever+Sold+%28","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ed33247fdd72f49b47d9cc9b49a7938c3d40bcf","infoHashBuffer":{"type":"Buffer","data":[30,211,50,71,253,215,47,73,180,125,156,201,180,154,121,56,195,212,11,207]},"announce":[],"urlList":[]}}