{"title":"Sexually Broken--BiB Katrina Jade straightjacketed 2 on 1, massi","uid":10308480,"size":1247771618,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:1f151204629b8e0e05f7f8e054c6318b599d51e6&amp;dn=Sexually+Broken--BiB+Katrina+Jade+straightjacketed+2+on+1%2C+massi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"merzedes","files":-1,"time":1402157711,"description":"Big breasted Katrina Jade gets manhandled while gagged and straightjacketed 2 on 1, massive orgasms! | Katrina Jade | Matt Williams | Jack Hammer\n\nJune 6, 2014\n\n\niPod, Low and High bitrate MP4 + Pics.\n\n\nKatrina Jade is back and brings her all natural DD tits to the table. This Daddy's girl is a relative newcumer to the industry, but if her smoking looks and huge tits are any indication, she will go far. She may come across as a little shy and reserved, but a generous serving of massive black cock will melt any shyness away right quick.\n\nBound in a leather straightjacket, the Bolero design from JT Stockroom with her all natural breasts hanging free and a big black ballgag wedged in between her juicy lips, Katrina Jade awaits her fate next to the legendary Sexuallybroken fuckbed. Today her fate goes by the name of Jack Hammer. He doesn't even both removing her ballgag, he has no interest in her mouth hole. It is straight to the main course with a fierce and unrelenting ugency. Katrina is getting her pussy reshaped and molded to fit Jack's massive tool like a glove. One after another the cocks make full use of her.\n\nWhat follows is an epic drilling down. Katrina is ragdoll fucked all over the bed in every possible position and angle. She can not move or escape in the leather straightjacket, all she can do is limply accept her fate. Jack tattoos his initials on her cunt with his dick. He owns every inch of her creamy flesh as her eyes roll into the back of her head.\n\nThrough her restraints and gag, you can see Katrina's eyes are glazed over, lost in a sexual bliss. Time to blast this sub into outer space. We throw in a vibrator and Katrina cums hard, shuddering in every fiber of her being, again and again. This fuck toy is a spent and well used puddle of flesh. We leave her bound and twitching on the bed. We will be back later when we want another go around... \n \nScreens &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2014/06_06kjade3/SexuallyBroken-Katrina-Jade-Matt-Williams-Jack-Hammer-Big-breasted-Katrina-Jade-gets-manhandled-while-gagged-and-straightjacketed-2-on-1-massive-orgasms.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2014/06_06kjade3/SexuallyBroken-Katrina-Jade-Matt-Williams-Jack-Hammer-Big-breasted-Katrina-Jade-gets-manhandled-while-gagged-and-straightjacketed-2-on-1-massive-orgasms.php&lt;/a&gt;\n\n14 000 down, but how much more to come ?? You decide ;) \n\nThe more you appreciate it, the more we want to do it. Can we get to 15k ??? \n\nWell, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:1f151204629b8e0e05f7f8e054c6318b599d51e6","amp;dn":"Sexually+Broken--BiB+Katrina+Jade+straightjacketed+2+on+1%2C+massi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f151204629b8e0e05f7f8e054c6318b599d51e6","infoHashBuffer":{"type":"Buffer","data":[31,21,18,4,98,155,142,14,5,247,248,224,84,198,49,139,89,157,81,230]},"announce":[],"urlList":[]}}