{"title":"Lift Every Voice: The History of African American Music (The Afr","uid":8226682,"size":1804378,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2033f9de1a2d2776376529f16d97a1b945b243cf&amp;dn=Lift+Every+Voice%3A+The+History+of+African+American+Music+%28The+Afr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"tmPhoneix","files":1,"time":1362617783,"description":"Publication Date: July 16, 2009 | ISBN-10: 0742558126 | ISBN-13: 978-0742558120 | Edition: First Edition\nSince their enslavement in West Africa and transport to plantations of the New World, black people have made music that has been deeply entwined with their religious, community, and individual identities. Music was one of the most important constant elements of African American culture in the centuries-long journey from slavery to freedom. It also continued to play this role in blacks' post-emancipation odyssey from second-class citizenship to full equality.\n\nLift Every Voice traces the roots of black music in Africa and slavery and its evolution in the United States from the end of slavery to the present day. The music's creators, consumers, and distributors are all part of the story. Musical genres such as spirituals, ragtime, the blues, jazz, gospel, rhythm and blues, rock, soul, and hip-hop-as well as black contributions to classical, country, and other American music forms-depict the continuities and innovations that mark both the music and the history of African Americans. A rich selection of documents help to define the place of music within African American communities and the nation as a whole.","torrent":{"xt":"urn:btih:2033f9de1a2d2776376529f16d97a1b945b243cf","amp;dn":"Lift+Every+Voice%3A+The+History+of+African+American+Music+%28The+Afr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2033f9de1a2d2776376529f16d97a1b945b243cf","infoHashBuffer":{"type":"Buffer","data":[32,51,249,222,26,45,39,118,55,101,41,241,109,151,161,185,69,178,67,207]},"announce":[],"urlList":[]}}