{"title":"Planet Earth Rock &amp; Roll Orchestra Sessions","uid":4806272,"size":466547027,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2094ecae1cb00208f3e6c8e3aad85720733f22b4&amp;dn=Planet+Earth+Rock+%26+Roll+Orchestra+Sessions&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"driekje","files":43,"time":1238209038,"description":"Planet Earth Rock and Roll Orchestra - 2 discs\n\nPERRO Related - 2 discs\n\nfrom: http://en.wikipedia.org/wiki/Planet_Earth_Rock_and_Roll_Orchestra\n\nThe Planet Earth Rock and Roll Orchestra is a nickname given to artists who recorded together in the early 1970s. They were predominantly members of Jefferson Airplane, The Grateful Dead, Quicksilver Messenger Service, and Crosby, Stills and Nash.[1] Their first album together was Blows Against the Empire, when they were known as Jefferson Starship. The name changed to Planet Earth Rock and Roll Orchestra for the next album, David Crosby's If I Could Only Remember My Name. During the sessions for Crosby's album at Wally Heider Studios, the musicians of each band were invited to the sessions and rehearsed hours of material, and everything was recorded. Material played during these recorded sessions in 1971 was used for Crosby's album (the &quot;PERRO Chorus&quot; is credited on the song, &quot;What Are Their Names&quot;) and several other solo albums after Crosby's (see discography). The name Jefferson Starship was later used for Paul Kantner and Grace Slick's new band formed in 1974. Paul Kantner recorded a solo album in 1983 as a tribute to this time, Planet Earth Rock and Roll Orchestra.\n[edit]Personnel\n\nThe rehearsal tapes made in 1971 featured David Crosby, Jerry Garcia, Phil Lesh, Graham Nash, Michael Shrieve, Paul Kantner, Grace Slick, David Freiberg, Bill Kreutzmann, Mickey Hart, Neil Young, Jorma Kaukonen, Joni Mitchell, Laura Allan, Jack Casady, and Gregg Rolie. [2] Appearing on Blows Against the Empire but not featured on the rehearsal tapes or most of the later solo albums were Peter Kaukonen, Joey Covington, Phil Sawyer, and Harvey Brooks.\n[edit]PERRO Discography\n\nBlows Against The Empire by Paul Kantner and Jefferson Starship (1970)\nIf I Could Only Remember My Name by David Crosby (1971)\nSongs for Beginners by Graham Nash (1971)\nSunfighter by Paul Kantner and Grace Slick (1971)\nGraham Nash David Crosby by Graham Nash and David Crosby (1972)\nRolling Thunder by Mickey Hart (1972)\nBaron von Tollbooth &amp; the Chrome Nun by Paul Kantner, Grace Slick, and David Freiberg (1973)","torrent":{"xt":"urn:btih:2094ecae1cb00208f3e6c8e3aad85720733f22b4","amp;dn":"Planet+Earth+Rock+%26+Roll+Orchestra+Sessions","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2094ecae1cb00208f3e6c8e3aad85720733f22b4","infoHashBuffer":{"type":"Buffer","data":[32,148,236,174,28,176,2,8,243,230,200,227,170,216,87,32,115,63,34,180]},"announce":[],"urlList":[]}}