{"title":"Scottsboro An American Tragedy (TV) [2001] PBS","uid":6991729,"size":1461869975,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:20ccbd313bb358942f3a55c0132229a7761f78ff&amp;dn=Scottsboro+An+American+Tragedy+%28TV%29+%5B2001%5D+PBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"ThorntonWilde","files":-1,"time":1327731906,"description":" &lt;a href=&quot;http://bayimg.com/namHHaADD&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/namHHaADD&lt;/a&gt;\n\nThe American Experience \n\nScottsboro: An American Tragedy \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1398469/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1398469/&lt;/a&gt;\n\nOriginal Air Date:2 April 2001 \n\nIn 1931, two white women stepped from a box car in Paint Rock, Alabama to make a shocking accusation: they had been raped by nine black teenagers on the train. So began one of the most significant legal fights of the twentieth century. The trial of the nine falsely accused teens would draw North and South into their sharpest conflict since the Civil War, yield two momentous Supreme Court decisions and give birth to the Civil Rights Movement. In addition to its historical significance, the Scottsboro story is a riveting drama about the struggles of nine innocent young men for their lives and and a cautionary tale about using human beings as fodder for political causes.\n\nIn March 1931, a freight train crowded with homeless and jobless hoboes left Chattanooga, Tennessee, bound for points west. A short time after it crossed into Alabama, a fight erupted between two groups of hoboes-one black and one white. The train was stopped by an armed posse in the tiny town of Paint Rock, Alabama. Before anyone knew what had happened, two white women stepped from the shadows of a boxcar to make a shocking accusation: they had been raped by nine black teenagers aboard the train.\n\nSo began one of the most significant legal fights of the twentieth century. Before it was over, the Scottsboro affair-so-named for the little Alabama town where the nine were put on trial for their lives-would divide Americans along racial, political, and geographic lines. It would draw North and South into their sharpest conflict since the Civil War, yield two momentous Supreme Court decisions, and give birth to the Civil Rights Movement.\n\nBut for all its historical significance, the Scottsboro story is at its core a riveting drama about the struggles of nine innocent young men for their lives-and a cautionary tale about using human beings as fodder for political causes. \n\nScottsboro: An American Tragedy tells this extraordinary lost story for the first time on film-from the points of view of both North and South. Viewers travel from the jails of Alabama to the salons of New York and meet a fascinating gallery of characters: the lead defendant-a defiant black man who refuses to lay down before the power of Alabama; the defense lawyer-who comes to see in the case echoes of the discrimination he has felt himself; the accuser-a poor white woman who finds in her lie a route to respectability; and the Southern judge-who risks the scorn of his beloved state to deliver justice.\n\nThe filmmakers spent five years making Scottsboro: An American Tragedy-weaving together interviews of the last surviving witnesses to the trials, and never-before-seen archival footage and photos from as far away as Russia, with letters, diaries, newspaper editorials, and trial transcripts. The voices of Andre Braugher, Frances McDormand, Stanley Tucci, and Harris Yulin and others, help bring the film to life.\n\n\n","torrent":{"xt":"urn:btih:20ccbd313bb358942f3a55c0132229a7761f78ff","amp;dn":"Scottsboro+An+American+Tragedy+%28TV%29+%5B2001%5D+PBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20ccbd313bb358942f3a55c0132229a7761f78ff","infoHashBuffer":{"type":"Buffer","data":[32,204,189,49,59,179,88,148,47,58,85,192,19,34,41,167,118,31,120,255]},"announce":[],"urlList":[]}}