{"title":"Sol Bianca - L EreditÃƒÂ  Perduta s1e01-03 [DVD9 ITA JAP][TNT Vill","uid":5195878,"size":6119856128,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:20dd7ce15b7ab87e49f46540c17a3bc2beb28550&amp;dn=Sol+Bianca+-+L+Eredit%C3%83%C2%A0+Perduta+s1e01-03+%5BDVD9+ITA+JAP%5D%5BTNT+Vill&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":null,"files":26,"time":1259926548,"description":"Sol Bianca - L EreditÃƒÂ  Perduta s1e01-03 [DVD9 ITA JAP][TNT Village] [Tntvillage.Scambioetico]\n\nRegia: Hiroyuki Ochi\nSceneggiatura: Hideki Mitsui\nCharacter design: Naoyuki Onda\nMecha design: Kenji Teraoka, Koji Watanabe\nMusiche: Seikou Nagaoka\nProduzione: AIC, Giappone, 1999\nDistribuito in Italia da: Yamato Video\nFormato e durata: OAV, 6 episodi, 30 minuti l'uno\n\nSol Bianca: L'EreditÃƒÂ  Perduta ÃƒÂ¨ una miniserie di fantascienza, composta da 6 episodi. La storia ÃƒÂ¨ basata su due OAV intitolati Sol Bianca, pubblicati nel 1990. Nonostante i personaggi e l'ambientazione siano gli stessi, non si tratta di un seguito, ma di una specie di remake che va considerato come un'opera a se stante. In Italia ÃƒÂ¨ distribuito da Yamato Video in 2 DVD.\n\nTrama\n\nIn un lontano futuro il mondo ha vissuto un periodo di grande felicitÃƒÂ ; si chiamava l'EtÃƒÂ  della Frontiera. Il genere umano si avventurava nel cosmo per espandere il proprio dominio oltre i confini della Terra. Con il procedere di questa avanzata, la Terra, il pianeta d'origine degli esseri umani, ÃƒÂ¨ stato dimenticato da tutti e ormai viene ricordato come un mito. In questo contesto ha inizio la nostra storia... Un gruppo di piratesse spaziali si spostano per la galassia a bordo della Sol Bianca, una nave spaziale molto avanzata conosciuta anche come la &quot;Nave del Sole&quot;. Di questo gruppo fanno parte April, il leader del gruppo che vede la vita da pirata come la realizzazione del suo sogno di completa libertÃƒÂ ; Jany, l'esperta di armi dall'aspetto mascolino; Jun, che sembra avere un legame particolare con la nave e Feb, che ha una predilezione per i tarocchi ed il buon vino. Mentre si trovano su un pianeta per recuperare una pistola antica, che ÃƒÂ¨ stata rubata ad April, trovano sul ponte della loro nave una ragazzina di nome Mayo, scappata di casa per andare alla ricerca dei genitori. Inizia cosÃƒÂ¬ un lungo viaggio verso la Terra, in cui scopriranno informazioni importanti sui genitori della ragazza. Durante questa loro ricerca si troveranno a scontrarsi con la Terra Force, un gruppo militare che custodisce un enorme segreto sulla patria dell'umanitÃƒÂ .\n\nDati Tecnici\n\nSchermo: 4/3 Colore PAL\nSistema: PAL\nAudio: Italiano Dolby Digital 5.1* - Italiano DTS 5.1* - Italiano Dolby Digital 2.0 Stereo - Giapponese Dolby Digital 2.0 Stereo - *Mix ricostruito da colonna musica ed effetti stereo\nSottotitoli: Italiano\nDurata: 180 minuti\nArea: 2\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:20dd7ce15b7ab87e49f46540c17a3bc2beb28550","amp;dn":"Sol+Bianca+-+L+Eredit%C3%83%C2%A0+Perduta+s1e01-03+%5BDVD9+ITA+JAP%5D%5BTNT+Vill","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20dd7ce15b7ab87e49f46540c17a3bc2beb28550","infoHashBuffer":{"type":"Buffer","data":[32,221,124,225,91,122,184,126,73,244,101,64,193,122,59,194,190,178,133,80]},"announce":[],"urlList":[]}}