{"title":"The Conjuring - L'Evocazione (2013) [DVD9 - Ita Eng Fra 5.1 - Mu","uid":10859389,"size":7000176640,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:20fa67d9e24960f25f29756c60249e1529fd5ce0&amp;dn=The+Conjuring+-+L%27Evocazione+%282013%29+%5BDVD9+-+Ita+Eng+Fra+5.1+-+Mu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"JackieALF","files":22,"time":1408876191,"description":"THE CONJURING - L'EVOCAZIONE\n\n\nThx to the Original Uploader\n\nInfo\n\nOriginal Title:The Conjuring\nCountry:Usa\nYear:2013\nGenres:Horror\nDirector:James Wan\nScreenplay:Chad e Carey Hayes\nProduction:Evergreen Media Group, New Line Cinema, Safran Company\nDistribution:Warner Bros\n\nCast\nPatrick Wilson -&gt; Ed Warren\nVera Farmiga -&gt; Lorraine Warren\nLili Taylor -&gt; Carolyn Perron\nRon Livingston -&gt; Roger Perron\nMackenzie Foy -&gt; Cynthia Perron\nJoey King -&gt; Christine Perron\nShannon Kook -&gt; Drew Thomas\nShanley Caswell -&gt; Andrea Perron\nHayley McFarland -&gt; Nancy Perron\nKyla Deaver -&gt; April Perron\nSterling Jerins -&gt; Judy Warren\nJoseph Bishara -&gt; Bathsheba\n\n\nPlot\n\nÂ« There is something horrible happening in my house. Â»\n[color=blue]Â« A casa mia sta succedendo qualcosa di orribile. Â»\n(Carolyn chiedendo aiuto ai Warren)\n\nIn 1971, Roger and Carolyn Perron move into a dilapidated farmhouse in Harrisville, Rhode Island with their five daughters Andrea, Nancy, Christine, Cindy, and April. During the first day, their move goes smoothly, though their dog Sadie refuses to enter the house and one of the daughters finds a boarded up entrance to a cellar.\n\nThe next morning, Carolyn wakes up with a mysterious bruise and Sadie is found lying dead outside the house by April, the youngest daughter, who also finds a strange music box. Over the next several days, various instances of paranormal disturbance occur, most notably when Christine and Nancy are attacked one night by an unseen figure behind their door; the activity culminates one night while Roger is away in Florida. After hearing various clapping and giggling noises, and seeing the picture frames shattered on the stairs, Carolyn is locked up in the cellar. Later Cindy, one of the daughters, is awakened after sleepwalking into her sister Andrea's room and she sees a spirit on top of a wardrobe in the room that leaps on and attacks Andrea.\n\nCarolyn contacts noted paranormal investigators Ed and Lorraine Warren to help her family. The Warrens conduct an initial investigation and conclude that the house may require an exorcism, but they needed authorization from the Catholic Church and further evidence before they can proceed.\n\nWhile researching the history of the house, Ed and Lorraine discover that the house once belonged to an accused witch, Bathsheba (a relative of Mary Eastey), who tried to sacrifice her week-old child to the devil and killed herself in 1863 after cursing all who would take her land. The property was once more than 200 acres but has since been divided up into smaller parcels. They find reports of numerous murders and suicides in houses that have since been built upon parcels that were once part of the property.\n\nEd and Lorraine return to the house to gather evidence to receive authorization for the exorcism. Cindy again sleepwalks into Andrea's room and reveals a secret passage behind the wardrobe. Lorraine enters the passage and falls through the floorboards into the cellar, where she sees the spirit of a woman whom Bathsheba had long ago possessed and used to kill her child. Another of the Perron children, Nancy, is violently dragged by her hair along the floor by an unseen force.\n\nThe Perron family decides to take refuge at a hotel while Ed and Lorraine take their evidence to the Church to arrange an exorcism. While the Warrens are on their way home, their daughter is attacked in their own home by the spirit of Bathsheba, though Ed arrives in time to prevent her from being harmed.\n\nCarolyn, now possessed by the spirit of Bathsheba, takes two of her daughters, Christine and April, and drives back to the house. Ed, Lorraine, Roger, and two assistants rush to the house where they find Carolyn trying to stab Christine with scissors. After subduing Carolyn and tying her to a chair, Ed decides to perform the exorcism himself. Though Carolyn escapes and attempts to kill April, who is hiding under the floorboards, Lorraine is able to temporarily distract the possessed Carolyn from killing her daughter by reminding her of a special memory she shared with her family, allowing Ed to complete the exorcism, saving Carolyn and her daughter.\n\nReturning home, Lorraine tells Ed that the priest who they sought for the exorcism had called back and left a message, saying that he had gained approval from the Catholic Church to perform it. In addition to this, he also has another case for them to investigate on Long Island. When they leave, the music box that April had found opens and plays music, revealing the Annabelle doll in the middle of the music box mirror.\n\n\nGeneral Info\n\nCompression: No\nMovie Quality:DVD9\nSize:6836 Mb\nLanguages:English, French, Italian 5.1\nColors\nRuntime:107 min\nSubtitles:English, French, Italian, Dutch\nMenu:Yes\nExtra:Behind the Scenes\n\nScreenshots\n\n","torrent":{"xt":"urn:btih:20fa67d9e24960f25f29756c60249e1529fd5ce0","amp;dn":"The+Conjuring+-+L%27Evocazione+%282013%29+%5BDVD9+-+Ita+Eng+Fra+5.1+-+Mu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20fa67d9e24960f25f29756c60249e1529fd5ce0","infoHashBuffer":{"type":"Buffer","data":[32,250,103,217,226,73,96,242,95,41,117,108,96,36,158,21,41,253,92,224]},"announce":[],"urlList":[]}}