{"title":"Super-Villain Team-Up (01 - 17 + extras &amp; M.O.D.O.K's 11 (01","uid":10271358,"size":368472341,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:219c6f66692e8a908878bb165716bd6e3d577f5d&amp;dn=Super-Villain+Team-Up+%2801+-+17+%2B+extras+%26amp%3B+M.O.D.O.K%27s+11+%2801&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"nemesis43","files":24,"time":1401589833,"description":"Super-Villain Team-Up (01 - 17 + extras &amp; M.O.D.O.K's 11 (01 - 05))\n\nMost of the series starred Dr. Doom teaming up with Namor, the Sub-Mariner, whom the Latverian monarch had bent to his service with promises of assistance for ailing Atlantean people. Von Doom's schemes brought him into conflict with several of Namor's foes, including the Tiger Shark and Attuma, but the Avengers, Circus of Crime, the debut of the Shroud, and the Red Skull also appeared to complicate Von Doom's megalomaniac plans for world domination. In later issues of the series, Von Doom and Magneto became embroiled in a bitter rivalry that led both into conflict with both the Avengers and the Champions of Los Angeles. The last issues of the series focused on the Red Skull's efforts to recreate the Cosmic Cube with the help of the original Hate-Monger and Arnim Zola.\n\nThe series had two special Giant-Size Super-Villain Team-Up issues.\n\nApparently, the title has been appropriated by comic book fans Chris Stewart and Rob Pickering for their Tumblr podcast, which they indicate is strictly for parody. Super-Villain Team-Up began in 2012, the show featuring the original Porcupine and the first Eel interviewing low tier Marvel super-villains to pay back the Tinkerer for services rendered. Stewart and Pickering's use of two inactive characters is apparently a dig at the frequent resurrections that occur in comics.","torrent":{"xt":"urn:btih:219c6f66692e8a908878bb165716bd6e3d577f5d","amp;dn":"Super-Villain+Team-Up+%2801+-+17+%2B+extras+%26amp%3B+M.O.D.O.K%27s+11+%2801","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"219c6f66692e8a908878bb165716bd6e3d577f5d","infoHashBuffer":{"type":"Buffer","data":[33,156,111,102,105,46,138,144,136,120,187,22,87,22,189,110,61,87,127,93]},"announce":[],"urlList":[]}}