{"title":"Thank You for Being Such a Pain (1999) [EPUB|PDF|MOBI|AZW3]","uid":10284674,"size":2867652,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:21f32d34ebf3a4f1d7ddd646e5b4a7c67c0394a8&amp;dn=Thank+You+for+Being+Such+a+Pain+%281999%29+%5BEPUB%7CPDF%7CMOBI%7CAZW3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1401760253,"description":"Title: Thank You for Being Such a Pain: Spiritual Guidance for Dealing with Difficult People\nAuthor: Mark Rosen\nCategory: Non-Fiction/Psychology\nPaperback: 286 pages\nPublisher: Harmony; 1 edition (April 27, 1999)\nLanguage: English\nISBN-10: 0609804146\nISBN-13: 978-0609804148\n\nFor a great friend to me, and together we form a little Group of Two that often likes to &quot;thank&quot; the losers who are such a daily pain in our lives. Our motto is simple - better than the best, and screw the rest. ;-)\n\nPromotional info/Publisher's summary - &quot;With wisdom and humor, Thank You for Being Such a Pain offers gentle and compassionate guidance for understanding and healing relationships with difficult people. By embracing four fundamental premises and putting into practice the author's many helpful and practical suggestions, you'll acquire the skills and insights necessary for turning around even the most troublesome relationship. What you need to keep in mind is that: (1) nothing in your life happens randomly and your difficulties have a deeper purpose; (2) frustration and even emotional pain are as necessary for your personal and spiritual growth as love and joy; (3) transforming enmity and completing unfinished business may be the most important skills you can learn in life; and (4) when you make an effort to work on your inner self, your outer relationships will be transformed.\n\nThis groundbreaking book draws upon state-of-the-art psychological principles and timeless spiritual practices from all traditions. Filled with enlightening exercises and entertaining stories, Thank You for Being Such a Pain will forever change the way you see the difficult people in your life . . . as well as the way you see yourself.&quot;\n\nExcerpt from the Publisher's Weekly Review - &quot;In a clear, conversational tone, Rosen covers seemingly every possible reason, response, interpretation and lesson that can be attached to unpleasant relationships. They can serve as mirrors, wake-up calls or chances to stand up for ourselves or to become more forgiving. They can help us develop &quot;latent qualities,&quot; rectify the past or prepare for the future. With quotes, summaries and exercises throughout this thoughtful book, Rosen thoroughly explores new ways to view personal conflicts and to use them for healing.&quot;\n\nThis torrent contains the original retail EPUB as well as conversions into AZW3, MOBI and large-print PDF done in Calibre. The softcover and hardcover images and generated metadata.opf file are also included. Please seed and enjoy!\n\nPlease visit and support my Suprbay release thread here, I would appreciate it:   &lt;a href=&quot;\nhttps://forum.suprbay.org/Thread-VikTSlick-s-Comics-Releases&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/Thread-VikTSlick-s-Comics-Releases&lt;/a&gt;","torrent":{"xt":"urn:btih:21f32d34ebf3a4f1d7ddd646e5b4a7c67c0394a8","amp;dn":"Thank+You+for+Being+Such+a+Pain+%281999%29+%5BEPUB%7CPDF%7CMOBI%7CAZW3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21f32d34ebf3a4f1d7ddd646e5b4a7c67c0394a8","infoHashBuffer":{"type":"Buffer","data":[33,243,45,52,235,243,164,241,215,221,214,70,229,180,167,198,124,3,148,168]},"announce":[],"urlList":[]}}