{"title":"[MomsTeachSex] Janet Mason, Tiff Bannister (How To Make A Sex Ta","uid":11737721,"size":291553206,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:23b32a8b62b466e57ac10aebe52fb060d42429c2&amp;dn=%5BMomsTeachSex%5D+Janet+Mason%2C+Tiff+Bannister+%28How+To+Make+A+Sex+Ta&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Upl0ad3rR","files":1,"time":1425625277,"description":"---:More From My Torrent's Here:---   &lt;a href=&quot;\nhttps://thepiratebay.se/user/Upl0ad3rR&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/user/Upl0ad3rR&lt;/a&gt;\n\n---:ScreeNshotS:---  &lt;a href=&quot;\nhttp://image-tpb.com/img-54f942ed1904b.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image-tpb.com/img-54f942ed1904b.html&lt;/a&gt; \n &lt;a href=&quot;\nhttp://image-tpb.com/img-54f942eda73a7.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image-tpb.com/img-54f942eda73a7.html&lt;/a&gt; \n &lt;a href=&quot;\nhttp://image-tpb.com/img-54f942ee08da0.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image-tpb.com/img-54f942ee08da0.html&lt;/a&gt; \n\nTiff Bannister and her boyfriend Van Wylde decide to make a naughty sex tape that goes all out, including a blowjob and a hot and heavy pussy pounding! Van's stepmom, janet Mason, decides to make a naughty tape of her own but when she reviews it instead of seeing her own pussy fingering she finds her stepson caught on tape.\n\nAfter calling Van and Tiff into her room, Janet explains that she's not upset about the tape; she's upset about his technique! She offers to show them how to make a better sex tape, and the young couple reluctantly accepts.\n\nAfter a brief chat about appropriate lighting, Janet coaxes Tiff to pull out Van's cock and demonstrate her blowjob skills. With Janet's help, Tiff is soon going at it like a champ and even introduces licking and sucking Van's balls to her repertoire.\n\nTiff gets a real treat next when she climbs up onto the bed so that her creamy bald pussy is hovering right above Van's mouth. While she's enjoying having her snatch eaten out, Janet takes advantage of Van's available stiffie and climbs aboard for a moan-inducing ride.\n\nVan gets up on his knees to take his stepmom doggy style, but not before Janet has buried her face in Tiff's cum hungry snatch to go to work with her magic tongue. When Janet is finally convinced that Van knows how to satisfy a woman she pulls Tiff to the edge of the bed so that Van can slide home in her tight twat and bring her to a bucking climax.\n\nLaying down next to Tiff, Janet presents Van with a pussy buffet so that he can choose which hole he wants to stick his dick in. Van loves the variety, switching between the two girls with slow and steady strokes that gradually bring him closer to his ultimate climax.\n\nWhen they know that Van is close, Janet helps Tiff get down on her knees with her boobs at cock level. She waits patiently while Janet jerks Van off until he explodes all over Tiff's full tits! Janet can't keep her mouth off of Van's cum, cleaning it up off the brunette and then snowballing with searing kisses that are the perfect conclusion to their threesome sex tape.\n\nSize: 291553206 bytes (278,05 MiB), duration: 00:34:38, avg.bitrate: 1122 kb/s\nAudio: aac, 44100 Hz, stereo, s16, 82 kb/s (eng)\nVideo: h264, yuv420p, 640x360, 1035 kb/s, 23,98 fps(r) (eng)","torrent":{"xt":"urn:btih:23b32a8b62b466e57ac10aebe52fb060d42429c2","amp;dn":"%5BMomsTeachSex%5D+Janet+Mason%2C+Tiff+Bannister+%28How+To+Make+A+Sex+Ta","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23b32a8b62b466e57ac10aebe52fb060d42429c2","infoHashBuffer":{"type":"Buffer","data":[35,179,42,139,98,180,102,229,122,193,10,235,229,47,176,96,212,36,41,194]},"announce":[],"urlList":[]}}