{"title":"Beethoven - Complete Piano Sonatas - Wilhelm Backhaus","uid":4560494,"size":2216817661,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:23b8b0b35eb37f43dc331bac69a9f7942e1d4f77&amp;dn=Beethoven+-+Complete+Piano+Sonatas+-+Wilhelm+Backhaus&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"eddie1969","files":21,"time":1228663137,"description":"Martha Agerich was once asked to recount inspiring pianists in her life. The interviewer put forward the name of Gieseking. She said, &quot;There are a lot of them and even Backhaus...&quot; Backhaus had certainly gone out of fashion by that time. G. Sandor, the greatest pupil of Bartok, professor in piano in Budapest once said, &quot;No modern pianists have the technique&quot; to play like Hofmann, Rachmaninov or Backhaus...&quot; Luganski confirmed that it's simply impossible to play in the way Rachmaninov did, however hard he tried.\n\nBackhaus' playing was close to Rachmaninov in the sense that they shared the same kind of depth, with same focus on the intensity of music that are apt to touch the the deepest part of the listeners's heart. Bartok who won the second prize in a competition after Backhaus, once attacked him of playing like a metronome. Not really. According to modern standard, Backhaus strayed too far way from the metronome.\n\nGulda was very close to Backhaus in pianism. But Backhaus had a gentle fullness of sound with beautiful unobstrusiveness which is never tiring. There is also a greater intensity of colour, illuminating almost all the harmonics. And even though he never get losed in details, the rhythmic differentiation and the unveiling of the motif was so amazing, making the nuances so audible and the whole piece so intelligible and as such, so pleasurable. It's sheer poetry like old cogniac that are apt to make people drunk. I certainly rank him above Arrau, however great an Arrau fan I am, as I rank Arrau above Gilels and Brendel.\n\nBut note that it was not a Steinway that was used and the recording is made in the 50 and 60's, however good that was. But the sound is very satisfying, and the sound and particularly the music, or the two together is simply unsurpassed.\n","torrent":{"xt":"urn:btih:23b8b0b35eb37f43dc331bac69a9f7942e1d4f77","amp;dn":"Beethoven+-+Complete+Piano+Sonatas+-+Wilhelm+Backhaus","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23b8b0b35eb37f43dc331bac69a9f7942e1d4f77","infoHashBuffer":{"type":"Buffer","data":[35,184,176,179,94,179,127,67,220,51,27,172,105,169,247,148,46,29,79,119]},"announce":[],"urlList":[]}}