{"title":"BIG JAVA, 3rd Edition by Cay Horstmann, Wiley 2008","uid":4686443,"size":13635585,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:23eff3936e56c389fe643a685b9e84c90883f2b5&amp;dn=BIG+JAVA%2C+3rd+Edition+by+Cay+Horstmann%2C+Wiley+2008&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"cooolway","files":-1,"time":1233250398,"description":"I would really appreciate it if someone comments on this file.\n\n\nBIG JAVA, 3rd Edition by Cay Horstmann, Wiley 2008\n\nNo one brews up a better Java guide than Cay Horstmann and in this Third Edition of Big Java he's perfected his recipe. Thoroughly updated to include Java 6, the Third Edition of Horstmann's bestselling text helps you absorb computing concepts and programming principles, develop strong problem-solving skills, and become a better programmer, all while exploring the elements of Java that are needed to write real-life programs. \n\nA top-notch introductory text for beginners, Big Java, Third Edition is also a thorough reference for students and professionals alike to Java technologies, Internet programming, database access, and many other areas of computer science. \n\nFeatures of the Third Edition: \nThe 'Objects Gradual' approach leads you into object-oriented thinking step-by-step, from using classes, implementing simple methods, all the way to designing your own object-oriented programs. \nA strong emphasis on test-driven development encourages you to consider outcomes as you write programming code so you design better, more usable programs \nHelpful &quot;Testing Track&quot; introduces techniques and tools step by step, ensuring that you master one before moving on to the next \nNew teaching and learning tools in WileyPLUS--including a unique assignment checker that enables you to test your programming problems online before you submit them for a grade \nGraphics topics are developed gradually throughout the text, conveniently highlighted in separate color-coded sections \nUpdated coverage is fully compatible with Java 5 and includes a discussion of the latest Java 6 features","torrent":{"xt":"urn:btih:23eff3936e56c389fe643a685b9e84c90883f2b5","amp;dn":"BIG+JAVA%2C+3rd+Edition+by+Cay+Horstmann%2C+Wiley+2008","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23eff3936e56c389fe643a685b9e84c90883f2b5","infoHashBuffer":{"type":"Buffer","data":[35,239,243,147,110,86,195,137,254,100,58,104,91,158,132,201,8,131,242,181]},"announce":[],"urlList":[]}}