{"title":"V de Vendetta (2005) [1080p][Dual 5.1 AC3][Castellano][Torrent].","uid":7006329,"size":4695748252,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:23f927e3e8d1c35a591ccd7ab87d5430fdcc2b66&amp;dn=V+de+Vendetta+%282005%29+%5B1080p%5D%5BDual+5.1+AC3%5D%5BCastellano%5D%5BTorrent%5D.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Kelebrah","files":1,"time":1328282923,"description":"[CENTER]DirecciÃƒÂ³n: James McTeigue.\nPaÃƒÂ­ses: USA, Reino Unido y Alemania.\nAÃƒÂ±o: 2005.\nDuraciÃƒÂ³n: 132 min.\nGÃƒÂ©nero: AcciÃƒÂ³n, drama, thriller.\nInterpretaciÃƒÂ³n: Natalie Portman (Evey), Hugo Weaving (V), Stephen Rea (Finch), Stephen Fry (Deitrich), John Hurt (Adam Sutler), Tim Pigott-Smith (Creedy), Rupert Graves (Dominic), Roger Allam (Lewis Prothero), Ben Miles (Dascomb), Valerie Berry (Bane), Sinead Cusack (Delia Surridge), Nathasha Wightman (Valerie), John Standing (Lilliman).\nGuiÃƒÂ³n: Los Hermanos Wachowski; basado en la novela grÃƒÂ¡fica creada por Alan Moore y David Lloyd.\nProducciÃƒÂ³n: Joel Silver, Grant Hill, Andy Wachowski y Larry Wachowski.\nMÃƒÂºsica: Dario Marianelli.\nFotografÃƒÂ­a: Adrian Biddle.\nMontaje: Martin Walsh.\nDiseÃƒÂ±o de producciÃƒÂ³n: Owen Paterson.\nDirecciÃƒÂ³n artÃƒÂ­stica: Marco Bittner Rosser, Sarah Horton y Sebastian T. Krawinkel.\nVestuario: Sammy Sheldon.\nEstreno en Reino Unido: 17 Marzo 2006.\nEstreno en EspaÃƒÂ±a: 7 Abril 2006.[/CENTER]\n\nTamaÃƒÂ±o: 4,37 Gb\nFormato: Mkv 1080p\n\n[CENTER][COLOR=&quot;#FF0000&quot;]SINOPSIS[/COLOR][/CENTER]\n\n&quot;V de Vendetta&quot; estÃƒÂ¡ ambientada en un futuro prÃƒÂ³ximo: Inglaterra se ha convertido en un es-tado totalitario y fascista. La pelÃƒÂ­cula narra la historia de Evey (Natalie Portman), una joven de la clase trabajadora que es rescatada de una situaciÃƒÂ³n de vida o muerte por un misterioso enmascarado co-nocido como V. V es un hombre sumamente complejo, instruido, extravagante, tierno e intelectual, que dedica su vida a liberar a los ciudadanos de las garras de aquellos que les someten mediante el terror. Pero al mismo tiempo es amargo, solitario y violento, y estÃƒÂ¡ obsesionado por la venganza personal. En su busca por libertar al pueblo de Inglaterra de la corrupciÃƒÂ³n y la crueldad con que su go-bierno la ha envenenado, V condenarÃƒÂ¡ el carÃƒÂ¡cter tirÃƒÂ¡nico de sus dirigentes e invitarÃƒÂ¡ a los ciudadanos a unirse a ÃƒÂ©l en las tinieblas del Parlamento el 5 de noviembre: el dÃƒÂ­a de Guy Fawkes. Un dÃƒÂ­a como ese del aÃƒÂ±o 1605 Guy Fawkes fue descubierto en un tÃƒÂºnel bajo el Parlamento con 36 barriles de pÃƒÂ³lvora. En compaÃƒÂ±ÃƒÂ­a de otros conspiradores habÃƒÂ­a planificado lo que mÃƒÂ¡s tarde se conoce-rÃƒÂ­a como Ã‚Â«la conspiraciÃƒÂ³n de la pÃƒÂ³lvoraÃ‚Â» en reacciÃƒÂ³n a la tiranÃƒÂ­a del gobierno de Jacobo I. Fawkes y el resto de saboteadores fueron ahorcados, destripados y descuartizados, y su plan para derrocar el gobierno jamÃƒÂ¡s llegÃƒÂ³ a perpetrarse. Retomando el espÃƒÂ­ritu de esa rebeliÃƒÂ³n y como conmemoraciÃƒÂ³n de aquel dÃƒÂ­a, V promete consumar la conspiraciÃƒÂ³n fallida del 5 de noviembre de 1605 por la que Faw-kes fue ejecutado: detonar el Parlamento. Cuando Evey descubre la verdad acerca del misterioso pasado de V, tambiÃƒÂ©n descubre su propia verdad, y se convierte en su leal aliada para ejecutar un plan que pretende encender la llama de una revoluciÃƒÂ³n, devolver la liber-tad y la justicia a una sociedad asfixiada por la crueldad y la co-rrupciÃƒÂ³n.","torrent":{"xt":"urn:btih:23f927e3e8d1c35a591ccd7ab87d5430fdcc2b66","amp;dn":"V+de+Vendetta+%282005%29+%5B1080p%5D%5BDual+5.1+AC3%5D%5BCastellano%5D%5BTorrent%5D.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23f927e3e8d1c35a591ccd7ab87d5430fdcc2b66","infoHashBuffer":{"type":"Buffer","data":[35,249,39,227,232,209,195,90,89,28,205,122,184,125,84,48,253,204,43,102]},"announce":[],"urlList":[]}}