{"title":"Submission Part I - Theo van Gogh - DVD PAL","uid":4057736,"size":129435648,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:24adbd98163d344bc20f9e9e9c1fab5e2d270984&amp;dn=Submission+Part+I+-+Theo+van+Gogh+-+DVD+PAL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"freedomofexpression","files":6,"time":1204458110,"description":"This is the movie that the Dutch movie maker Theo van Gogh got murdered for. The movie is a tragic story about one woman&amp;#039;s struggle with her faith (Islam), and little more than that. Nonetheless, this movie caused an uproar against freedom of expression in the Islamic world. Eventually, the maker, Theo van Gogh, got murdered by an Islamic extremist in broad daylight in a Dutch shopping street. A warning note to his filming partner (Ayaan Hirshi Ali) was affixed to his chest by stabbing a knife into it. The murderer is now serving a life sentence in a Dutch prison.\n\n\nWe are now one or two days away from yet another Dutch Islam movie; the Dutch politician Geert Wilders will release the movie Fitna. Even though nobody has ever seen a single part of this movie, the entire Islamic world has already condemned the film. However, what is much worse: Dutch politicians --the prime minister Jan-Peter Balkenende among them-- have publicly fought Geert Wilders to convince him to not broadcast the movie.\n\n\nTo Dutch politicians I say: We are now living 200 years after Enlightenment, and the Freedom of Expression we have in the Western world should NOT be up for any kind of discussion. Your behaviour in trying to keep a man from rightfully expressing his opinion, just because some other people may get angry, is worse than bowing to terrorism: it is Dhimmytude on a scale that is perfectly unacceptable. Hence, days before Fitna is released, this torrent is posted to make absolutely clear that we --the Dutch people-- will not bow to Jihad!\n\nInfo:\n\nFormat: DVD-video, PAL, 720x576, 25fps\n        Capture from Dutch channel &quot;Nederland 3&quot;.\nLength: 651.4 seconds.\nSpoken language: Arabic\nSubtitles: Dutch","torrent":{"xt":"urn:btih:24adbd98163d344bc20f9e9e9c1fab5e2d270984","amp;dn":"Submission+Part+I+-+Theo+van+Gogh+-+DVD+PAL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24adbd98163d344bc20f9e9e9c1fab5e2d270984","infoHashBuffer":{"type":"Buffer","data":[36,173,189,152,22,61,52,75,194,15,158,158,156,31,171,94,45,39,9,132]},"announce":[],"urlList":[]}}