{"title":"Chicago - Chicago III (2014) [Teichiku Records] FLAC Beolab1700","uid":10560625,"size":514066717,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2577d2d0e7f2a0209d0b4f67aadf97d4e7bba477&amp;dn=Chicago+-+Chicago+III+%282014%29+%5BTeichiku+Records%5D+FLAC+Beolab1700&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Beolab1700","files":22,"time":1405449226,"description":"[center]\n\n[size=5]Chicago - Chicago III (2014) [Teichiku Records] FLAC Beolab1700[/size]\n\n[IMG]http://i.imgur.com/FFymIw0.jpg[/IMG]\n\n---------------------------------------------------------------------\nChicago - Chicago At Carnegie Hall 1971\n---------------------------------------------------------------------\n\nArtist...............: Chicago\nAlbum................: Chicago III\nGenre................: Rock\nSource...............: CD\nYear.................: 2014\nRipper...............: EAC (Secure mode) / LAME 3.92 &amp; Asus CD-S520\nCodec................: Free Lossless Audio Codec (FLAC)\nVersion..............: reference libFLAC 1.2.1 20070917\nQuality..............: Lossless, (avg. compression: 60 %)\nChannels.............: Stereo / 44100 HZ / 16 Bit\nInformation..........: CD IMAGE - LOG - CUE - SCANS\n\nPosted by............: Beolab1700 on 13/07/2014\n\n---------------------------------------------------------------------\nTracklisting\n---------------------------------------------------------------------\n\n1. Sing A Mean Tune Kid - 9:17\n2. Loneliness Is Just A Word - 2:38\n3. What Else Can I Say - 3:13\n4. I Don't Want Your Money - 4:47\n\nTravel Suite:\n5. Flight 602 - 2:44\n6. Motorboat To Mars - 1:29\n7. Free - 2:15\n8. Free Country - 5:46\n9. At The Sunrise - 2:48\n10. Happy 'Cause I'm Going Home - 7:28\n11. Mother - 4:31\n12. Lowdown - 3:36\n\nAn Hour In The Shower:\n13. A Hard Risin' Morning Without Breakfast - 1:52\n14. Off To Work - 0:45\n15. Fallin' Out - 0:53\n16. Dreamin' Home - 0:49\n17. Morning Blues Again - 1:11\n18. When All The Laughter Dies In Sorrow - 1:03\n19. Canon - 1:05\n20. Once Upon A Time... - 2:34\n21. Progress? - 2:34\n22. The Approaching Storm - 6:26\n23. Man Vs. Man: The End - 1:34\n\n---------------------------------------------------------------------\n\nChicago's third effort, much like the preceding two, was initially issued as a double LP, and is packed with a combination of extended jams as well as progressive and equally challenging pop songs. Their innovative sound was the result of augmenting the powerful rock &amp; roll quartet with a three-piece brass section -- the members of whom are all consummate soloists. Once again, the group couples that with material worthy of its formidable skills. In the wake of the band's earlier powerhouse successes, Chicago III has perhaps been unrightfully overshadowed. The bulk of the release consists of three multi-movement works: Robert Lamm's (keyboards/vocals) &quot;Travel Suite,&quot; Terry Kath's (guitar/vocals) &quot;An Hour in the Shower,&quot; and James Pankow's (trombone) ambitious and classically influenced &quot;Elegy.&quot; While the long-player failed to produce any Top Ten hits, both Lamm's rocker &quot;Free&quot; -- extracted from &quot;Travel Suite&quot; -- as well as the infectious &quot;Lowdown&quot; respectively charted within the Top 40. &quot;Sing a Mean Tune Kid&quot; opens the album with a nine-plus minute jam highlighting the impressive wah-wah-driven fretwork from Terry Kath (guitar/vocals) and some decidedly rousing syncopated punctuation from the horns. Lamm's highly underrated jazzy keyboard contributions are notable throughout the tune as he maneuvers Peter Cetera's (bass/vocals) bouncy basslines and the equally limber percussion of Danny Seraphine (drums). &quot;What Else Can I Say&quot; reveals much more of the band's fusion beyond that of strictly pop/rock. The supple and liberated waltz bops around the playful melody line and is further bolstered by one of the LP's most elegant brass arrangements as well as some equally opulent backing vocal harmonies. &quot;I Don't Want Your Money&quot; is a hard-hittin' Kath/Lamm rocker that packs a bluesy wallop lying somewhere between Canned Heat and the Electric Flag. Again, Kath's remarkably funkified and sweet-toned electric guitar work hammers the track home.\n\nAlthough &quot;Travel Suite&quot; is primarily a Lamm composition, both Seraphine's &quot;Motorboat to Mars&quot; drum solo and the acoustic experimental &quot;Free Country&quot; balance out the relatively straightforward movements. These include the aggressive &quot;Free&quot; and the decidedly more laid-back &quot;At the Sunrise&quot; and &quot;Happy 'Cause I'm Going Home.&quot; Kath's &quot;An Hour in the Shower&quot; reveals the guitarist's under-utilized melodic sense and craftsmanship. His husky lead vocals perfectly complement the engaging arrangements, which blend his formidable electric axe-wielding with some equally tasty acoustic rhythm licks. In much the same way that the Beatles did on the B-side medley from Abbey Road (1969), Chicago reveals its rare and inimitable vocal blend during the short &quot;Dreaming Home&quot; bridge. Chicago III concludes with Pankow's six-part magnum opus, &quot;Elegy.&quot; Its beautiful complexity incorporates many of the same emotive elements as his &quot;Ballet for a Girl in Buchannon&quot; from their previous long-player. The ironically cacophonous and tongue-in-cheek &quot;Progress&quot; contains both comedic relief as well as an underlying social statement in the same vein as &quot;Prologue, August 29, 1968&quot; from Chicago Transit Authority (1969). The final two movements -- &quot;The Approaching Storm&quot; and &quot;Man vs. Man: The End&quot; -- are among the most involved, challenging, and definitive statements of jazz-rock fusion on the band's final double-disc studio effort. As pop music morphed into the mindless decadence that was the mid-'70s, Chicago abandoned its ambitiously arranged multifaceted epics, concentrating on more concise songcrafting.\n\n---------------------------------------------------------------------\n[/center]\n","torrent":{"xt":"urn:btih:2577d2d0e7f2a0209d0b4f67aadf97d4e7bba477","amp;dn":"Chicago+-+Chicago+III+%282014%29+%5BTeichiku+Records%5D+FLAC+Beolab1700","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2577d2d0e7f2a0209d0b4f67aadf97d4e7bba477","infoHashBuffer":{"type":"Buffer","data":[37,119,210,208,231,242,160,32,157,11,79,103,170,223,151,212,231,187,164,119]},"announce":[],"urlList":[]}}