{"title":"Philippi 42 BC: The Death of the Roman Republic","uid":11783048,"size":42367526,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:25ad5d1358ea15461dc5750414633278803dde2a&amp;dn=Philippi+42+BC%3A+The+Death+of+the+Roman+Republic&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1427667995,"description":"Immortalized in Shakespeare's play on the life and death of Julius Caesar, the battle of Philippi was the final battle between the forces of Mark Antony and Octavian against the forces of Caesar's assassins Brutus and Longinus during the Roman civil wars that took place in the 40s and 30s BC. Si Sheppard takes a detailed look at the campaign that was waged around the Macedonian city of Philipi. The first engagement on the 3rd of October was indecisive as Octavian's forces were routed by those of Brutus, but Cassius' camp was captured by Mark Antony's men; wrongly fearing that Brutus was dead and that all was lost for his cause, Cassius committed suicide - depriving the Republicans of their most gifted commander. In the meantime, the Republicans' naval forces had managed to intercept and destroy the supply ships of the Triumvirs in the Adriatic, a serious blow to Octavian and Mark Anthony. Expertly detailing the changing fates of the opposing sides, their successes and failures illustrated in a range of maps, the book then turns to the final stages of the campaign. As the Triumvirs' forces slowly moved their fieldworks towards their enemies' positions, Brutus, ignorant of the destruction of Calvinus's fleet and seeing few other options available to him, decided to give battle. In the bloody and close combat, legionary fought legionary amid great slaughter, until Brutus' forces were finally routed and his camp overrun. Brutus fled and committed suicide the following day. The Republican movement crushed, Rome now rested in the hands of the Second Triumvirate. This is the history of the Philippi campaign that sounded the final death knell for the Republican movement","torrent":{"xt":"urn:btih:25ad5d1358ea15461dc5750414633278803dde2a","amp;dn":"Philippi+42+BC%3A+The+Death+of+the+Roman+Republic","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25ad5d1358ea15461dc5750414633278803dde2a","infoHashBuffer":{"type":"Buffer","data":[37,173,93,19,88,234,21,70,29,197,117,4,20,99,50,120,128,61,222,42]},"announce":[],"urlList":[]}}