{"title":"AC/DC - Highway To Hell (Iron Man 2 Version) (Xvid-2nafish)1080p","uid":5571958,"size":193148922,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:25d5e039d1d1cf23166ebb21b62341f85a2e47d8&amp;dn=AC%2FDC+-+Highway+To+Hell+%28Iron+Man+2+Version%29+%28Xvid-2nafish%291080p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"2nafish","files":-1,"time":1274230307,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:03:14\n\n[Video]\nResolution : 1920x1080\nCodec : XviD MPEG-4 codec\nFPS : 23.98\nBitRate : 7623 Kbps\nQuality Factor : 0.16 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 48000 Hz\nBitRate : 320 Kbps\n\n\nThis video has no extra logos or titles.\n\n\n\n&quot;Highway to Hell&quot; is the opening track of AC/DC's 1979 album Highway to Hell  and the twelfth track on AC/DC Live. It was initially released as a single in 1979.\n\nThe song was written by Bon Scott, Angus Young and Malcolm Young while the main guitar riff was created by Angus Young. The track has become one of the most famous songs in rock history. AC/DC had made several studio albums before and was constantly supporting them by going on a grueling tour schedule. In 2009, &quot;Highway to Hell&quot; , won the 'Most Played Australian Work Overseas' category at the Australasian Performing Right Association (APRA) Awards.\n\nThe song and album's title supposedly came after a reporter asked band members if they could describe what life was like being constantly on tour. Angus replied that it was &quot;a f***ing highway to Hell&quot;. He stated in the magazine Guitar World that when you are out on the road on a bus sleeping with a guy's smelly sock in your face, it's like you're on the highway to hell. Rumours persisted that the band members were satanists, and this comment, and the album cover depicting Angus with devil horns and tail only added fuel to the fire. (The band has denied having anything to do with Satanism, Malcolm having even commented that &quot;me mum would kill me for that!&quot;) Nevertheless, this and other songs brought AC/DC its first million-copy-selling album, and sent Highway to Hell  to #17 on the charts. Scott would be found dead in the back of a friend's car just over six months later. In October 2009 Brian Johnson, who replaced Scott, explained to The Metro: &quot;It was written about being on the bus on Mt. Hood Highway in Oregon, USA. When the Sun's setting in the west and you're driving across it, it is like a fire ball. There is nothing to do, except have a quick one off the wrist or a game of cards, so that's where Bon came up with the lyrics.&quot; \n\nIn a driving interview in The Sydney Morning Herald on the day of AC/DC's first Black Ice concert in Sydney, Johnson again stated that Scott wrote the lyrics about the drive to Perth.\n\nThe success of the &quot;Highway to Hell&quot; song and album set AC/DC on track to record its most famous album and tribute to Bon, Back In Black, one year later.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:25d5e039d1d1cf23166ebb21b62341f85a2e47d8","amp;dn":"AC%2FDC+-+Highway+To+Hell+%28Iron+Man+2+Version%29+%28Xvid-2nafish%291080p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25d5e039d1d1cf23166ebb21b62341f85a2e47d8","infoHashBuffer":{"type":"Buffer","data":[37,213,224,57,209,209,207,35,22,110,187,33,182,35,65,248,90,46,71,216]},"announce":[],"urlList":[]}}