{"title":"Harley Quinn In Batman Arkham Unhinged","uid":9014398,"size":184691477,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:2644cca7b3bbd91074ab03d522917920c86901ff&amp;dn=Harley+Quinn+In+Batman+Arkham+Unhinged&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"harleyquinncomics","files":-1,"time":1381169323,"description":"Every appearance of Harley Quinn in Batman Arkham Unhinged\n\n\nIssue #7-9 (Ruffled Feathers Part 1-3):\nA look back at Gotham before there was an Arkham City, and to when Penguin made his grand splash in to high society with his swinging joint--the Iceberg Lounge! It's the opening night and Penguin's basking in his success...until two familiar faces show up to ruin the party and firmly create a &quot;No Clowns Policy&quot; in his life.\n\nIssue #11-13 (Separation Anxiety Part 1-3):\nLearn how the Abramovici conjoined twins made their way from a small Siberian village to a traveling freak show, and finally to the depraved insanity of ARKHAM CITY. What role did Joker have in their journey to Arkham City...and also their horrific separation?\n\nIssue #17 (Arkham City Sirens Part 1):\nFlash back to Gotham before Arkham City, to the last time Catwoman, Poison Ivy, and Harley Quinn worked together! The Sirens are hot on the case of an animal-killing criminal and everything should be running like clockwork, but once Batman arrives will his presence split the team?\n\nIssue #18 (Arkham City Sirens Part 2):\nBack in present-day Arkham City, the two Sirens in captivity have all the time they need to stew on past betrayals by their former teammate. But how far will they go to get back at her? And how does it involve Joker and Batman?\n\nIssue #19 (Arkham City Sirens Part 3):\nThe Sirens' allegiance falls even further into ruin as promises are broken and schemes are thwarted. And with Batman used as a lure, the situation is about to get even more complicated for Catwoman! Who will prevail in this splintered threesome?\n\nIssue #28 (Operation: Kill Joker Part 3):\nThey say that all's fair in love and war...and in the gang war between Penguin and Joker, you'll never believe how Deadshot is used to pull a fast one--but on who?!\n\nIssue #30 (Clown Court Part 2):\nThe case of the citizens of Arkham City versus Joker BEGINS! Judge Harvey Dent calls many witnesses for the prosecution to the stand to argue in favor of convicting Joker...but Joker has a key ally as his defense attorney. When it comes time to deliberate, the jury's interrupted by a surprise, last minute witness!\n\nIssue #31 (Clown Court Part 3):\nBatman crashes the trial of Joker and causes a full-scale riot! Juror versus juror, defendant versus Judge--and everyone versus Batman. But in this case, will anyone make it out alive?\n\nIssue #36 (Eviction Notice Part 2):\nBlack Mask just arrived inside Arkham City, and he's already making friends...and enemies. In the epic gang war between Joker and Penguin, which side will Black Mask choose? Or will he go rogue?\n\nIssue #38 (Beloved Part 1):\nBatman flashes back to an early encounter with Talia, and her father, Ra's al Ghul. When she and her father save Batman's life, will the three be able to forge a partnership to save the world?\n\n\nPlz Seed!!!","torrent":{"xt":"urn:btih:2644cca7b3bbd91074ab03d522917920c86901ff","amp;dn":"Harley+Quinn+In+Batman+Arkham+Unhinged","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2644cca7b3bbd91074ab03d522917920c86901ff","infoHashBuffer":{"type":"Buffer","data":[38,68,204,167,179,187,217,16,116,171,3,213,34,145,121,32,200,105,1,255]},"announce":[],"urlList":[]}}