{"title":"New York Times Best Sellers Paperback Mass-Market Fiction 4th Au","uid":8808808,"size":51071870,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2690a0800094bb92b85840af51205eef0485b51c&amp;dn=New+York+Times+Best+Sellers+Paperback+Mass-Market+Fiction+4th+Au&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"KaavaBoT","files":35,"time":1376409223,"description":"New York Times Best Sellers Paperback Mass-Market Fiction 4th August 2013 (epub &amp; Mobi)\n\n\nBooks List:\n1 ENDER'S GAME, by Orson Scott Card. (Tor.) To develop a secure defense against a hostile alien race's next attack, government agencies breed child geniuses and train them as soldiers.\n2 A GAME OF THRONES, by George R. R. Martin. (Bantam.) In the frozen wastes to the north of Winterfell, sinister and supernatural forces are mustering; Book 1 of &quot;A Song of Ice and Fire.&quot;\n3 FRIENDS FOREVER, by Danielle Steel. (Dell.) Five children - Gabby, Billy, Izzie, Andy and Sean - who meet in kindergarten maintain their bonds as they grow to adulthood.\n4 11TH HOUR, by James Patterson and Maxine Paetro. (Grand Central.) When a millionaire is gunned down, Detective Lindsay Boxer and the Women's Murder Club discover that the murder weapon is linked to the deaths of four of San Francisco's most untouchable criminals.\n5 A WANTED MAN, by Lee Child. (Dell.) A carload of people involved in a conspiracy pick up a disheveled hitchhiker, Child's vigilante hero Jack Reacher.\n6 BACKFIRE, by Catherine Coulter. (Jove.) The F.B.I. agents Dillon Savich and Lacey Sherlock investigate the murder of a judge.\n7 A CLASH OF KINGS, by George R. R. Martin. (Bantam.) From the citadel of Dragonstone to the shores of Winterfell, factions vie for control of a divided land; Book 2 of &quot;A Song of Ice and Fire.&quot;\n8 AT FIRST SIGHT, by Nicholas Sparks. (Grand Central.) In Boone Creek, N.C., Jeremy and Lexie are awaiting the birth of their daughter. But just as life seems to be settling into a blissful pattern, a mysterious message reopens old wounds.\n9 GOTCHA!, by Fern Michaels. (Zebra/Kensington.) A woman is convinced her daughter-in-law had something to do with her son's mysterious death, and turns to the Sisterhood for help.\n10 A FEAST FOR CROWS, by George R. R. Martin. (Bantam.) The seven powers dividing the land have reached an uneasy truce; Book 4 of &quot;A Song of Ice and Fire.&quot;\n11 A STORM OF SWORDS, by George R. R. Martin. (Bantam.) Wars continue to rage over the Iron Throne as alliances are made and broken; Book 3 of &quot;A Song of Ice and Fire.&quot;\n12 WORLD WAR Z, by Max Brooks. (Broadway.) An &quot;oral history&quot; of an imagined Zombie War that nearly destroys civilization.\n13 THE FALLEN ANGEL, by Daniel Silva. (Harper/HarperCollins.) Gabriel Allon, an art restorer and spy for the Israeli secret service, discovers a global criminal enterprise behind a murder at the Vatican.\n14 THE FAMILY CORLEONE, by Ed Falco. (Grand Central.) With New York in the depths of the Depression, Vito Corleone pushes his eldest child, Sonny, to be a businessman. But Sonny wants to follow in his father's footsteps; a prequel to &quot;The Godfather.&quot;\n15 THE ELEVENTH COMMANDMENT, by Jeffrey Archer. (St. Martin's.) Just as he's about to put his 28-year career at the C.I.A. behind him, Connor Fitzgerald comes up against the most dangerous enemy he's ever faced: his own boss.\n16 THE NEWCOMER, by Robyn Carr. (Harlequin Mira.) Mac McCain, a single father and Thunder Point's deputy sheriff, has finally found happiness with a longtime friend. But his life is thrown into chaos when his ex-wife returns.\n17 THE BEST OF ME, by Nicholas Sparks. (Grand Central.) Twenty-five years after their high school romance ended, a man and woman who have gone their separate ways return to their North Carolina town for the funeral of a friend.\n18 ONE SUMMER, by David Baldacci. (Vision.) After the death of his devoted wife, a father struggles to keep his family together, and in the process learns to love again.\n19 PACIFIC RIM, by Alex Irvine. (Titan Books.) A novelization of the movie directed by Guillermo del Toro. When legions of monstrous creatures start rising from the sea, massive robots stand as mankind's last hope.\n20 THE INNOCENT, by David Baldacci. (Vision.) When something about his latest mission seems wrong, the government assassin Will Robie refuses to kill. Now he's a target himself.\n\nPlease Rate and Comment\n\nPlease seed atleast upto 1:1 Ratio","torrent":{"xt":"urn:btih:2690a0800094bb92b85840af51205eef0485b51c","amp;dn":"New+York+Times+Best+Sellers+Paperback+Mass-Market+Fiction+4th+Au","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2690a0800094bb92b85840af51205eef0485b51c","infoHashBuffer":{"type":"Buffer","data":[38,144,160,128,0,148,187,146,184,88,64,175,81,32,94,239,4,133,181,28]},"announce":[],"urlList":[]}}