{"title":"Jervey Tervalon - Monster's Chef (retail).epub","uid":10753414,"size":226538,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:26aadda82dcb26c5d9e675ee6edb07116246f6d1&amp;dn=Jervey+Tervalon+-+Monster%27s+Chef+%28retail%29.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"gratefuldawg77","files":1,"time":1407899202,"description":"From award-winning, Los Angeles Times bestselling author Jervey Tervalon comes a highly clever, twisting tale of suspense involving drugs, perverse sex, and poisonous celebrity worship, in which a man trying to rebuild his life becomes entangled in dangerous and deadly circumstances.\n\nOnce upon a time, Gibson was a successful chef with a popular restaurant and a beautiful loving wife. He was also a drug addict with a habit that nearly destroyed him.\n\nFresh out of rehab, he's now using his skills to feed his fellow halfway house residents budget gourmet meals--a talent that attracts two shady women who offer him a job cooking for a music superstar named Monster. Though Gibson doesn't have a good feeling about his seeming good fortune, he needs a job.\n\nArriving on Monster's compound, Gibson senses that trouble is still on his tail. First, he's asked to sign a confidentiality agreement. Then he meets the compound's gardener, who warns him not to go outside at night--and tells him that to stay alive he must see nothing, hear nothing, say nothing.\n\nIt is advice that proves all too true when Gibson discovers a dead body near his bungalow a few nights later. Suddenly, all hell is breaking loose . . . and Gibson is at the center. Now he has to figure out how to escape this terrifying nightmare . . . and whether he can.","torrent":{"xt":"urn:btih:26aadda82dcb26c5d9e675ee6edb07116246f6d1","amp;dn":"Jervey+Tervalon+-+Monster%27s+Chef+%28retail%29.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26aadda82dcb26c5d9e675ee6edb07116246f6d1","infoHashBuffer":{"type":"Buffer","data":[38,170,221,168,45,203,38,197,217,230,117,238,110,219,7,17,98,70,246,209]},"announce":[],"urlList":[]}}