{"title":"Discovery Channel - From Beirut to Bosnia BANNED FROM DISCOVERY","uid":3731332,"size":1403069928,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:26cafd375b07a0130f102f962f9689247aa676aa&amp;dn=Discovery+Channel+-+From+Beirut+to+Bosnia+BANNED+FROM+DISCOVERY+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"derrida","files":3,"time":1183420956,"description":"An example of how advertising and lobbying groups censor American news, this three part documentary by the famous middle east war correspondent Robert Fisk was banned by the Discovery channel in 1993.  The films seek to explain the rise of anti-Western sentiment throughout the ?Muslim world? (from the Middle East to the Balkins, the range of the former Ottoman Empire) by highlighting the oppressiveness of Western-supported governments (Israel and Egypt, in particular) and the West\\&amp;#039;s broader anti-Muslim racism.  The Discovery channel pulled the films in response to a letter campaign by pro-Israel groups.  \n\nHere is Fisk\\&amp;#039;s summary of the incident from a speech at Concordia University in 2002:\nBack in 1993, I made a 3 part documentary film for the Discovery Channel in the United States, and also for Channel 4 in Britain. It was called Beirut to Bosnia and it attempted to find out why an increasing number of Muslims had come to hate the West. Indeed, the title was \\&quot;Why Muslims Have Come to Hate the West.\\&quot; We filmed in Beirut, Southern Lebanon, Israel, the occupied West Bank and Gaza, Egypt, Bosnia and Croatia. . . .\n\nIn due course, we discovered that Discovery was being sent American Express cards cut in half. American Express being one of the sponsors of the original series. Discovery rang me in Beirut to say they were receiving lots of letters condemning the films from various groups. Then director Mike Dutfield and I heard that Discovery had canceled the reshowing. In an imperishable letter to Dutfield, Bunting wrote - and I ask you not to laugh until the end - quote, \\&quot;Given the reaction to the series on its initial airing we never scheduled a subsequent airing. So there\\&amp;#039;s not really an issue as to any scheduled re-airing being canceled.\\&quot; When I read those words, ladies and gentlemen, I was ashamed to be a foreign correspondent.\n\nThere are examples of these lobbying efforts by pro-Israel groups (and correspondence with the Discovery channel) at the following: &lt;a href=&quot;\nhttp://primerct.org/index.php?content=unger/beyondbias&amp;title=Beyond%20Bias&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://primerct.org/index.php?content=unger/beyondbias&amp;title=Beyond%20Bias&lt;/a&gt; &lt;a href=&quot;\nhttp://world.std.com/~camera/docs/oncamera/ocdisc.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://world.std.com/~camera/docs/oncamera/ocdisc.html&lt;/a&gt;\n\nVHS rip but the quality is very good.\n\nPart I: The Martyr\\&amp;#039;s Smile::\nThis Films for the Humanities production focuses its capable eye on Lebanon\\&amp;#039;s guerilla war that aims to liberate southern Lebanon from Israeli control. The scope of this tragic conflict is brought into sharp focus in this documentary through the use of extensive interviews with participants from the Hezbollah and Islamic Jihad movements, views of civilian casualties caused by Israeli air attacks, and photographic evidence of the ongoing destruction of life and property in the region. The viewer should be advised that this video contains some disturbing scenes of this conflict.\n\nPart II: The Road to Palestine:\nAnother in the Beirut to Bosnia series from Films for the Humanities, The Road to Palestine provides the viewer with a glimpse into the ongoing conflict in the region around Jerusalem and the Gaza Strip. Through interviews with members of the militant Islamic group Hamas, as well as Zionist settlers and Jewish refugees, this documentary succeeds at revealing some of this tragic situation.\n\nPart III: To the Ends of the Earth:\nAnother in the compelling series Beirut to Bosnia from Films for the Humanities, To the Ends of the Earth compares the plight of Muslims in Egypt and Bosnia. Though separated by geography and the distinct cultures in which they live their lives, this video reveals the feeling of betrayal by the West experienced by these two Muslim communities. Interviews with Islamic freedom fighters and war casualties shed light on the dynamics of the ongoing struggle for the survival of these communities.\n\n\nAVI File Details\n========================================\nName.........: Part-I-The-Martyrs-Smile.avi\nFilesize.....: 446 MB (or 457,547 KB or 468,529,148 bytes)\nRuntime......: 00:50:35 (90,972 fr)\nVideo Codec..: XviD\nVideo Bitrate: 1103 kb/s\nAudio Codec..: 0x0055(MP3) ID\\&amp;#039;d as MPEG-1 Layer 3\nAudio Bitrate: 123 kb/s, monophonic VBR \nFrame Size...: 512x384 (1.33:1) [=4:3]\n\n------------\n","torrent":{"xt":"urn:btih:26cafd375b07a0130f102f962f9689247aa676aa","amp;dn":"Discovery+Channel+-+From+Beirut+to+Bosnia+BANNED+FROM+DISCOVERY+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26cafd375b07a0130f102f962f9689247aa676aa","infoHashBuffer":{"type":"Buffer","data":[38,202,253,55,91,7,160,19,15,16,47,150,47,150,137,36,122,166,118,170]},"announce":[],"urlList":[]}}