{"title":"The.Good.Wife.S07E06.HDTV.x264-LOL","uid":12730242,"size":217319936,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:27067eb889584249e790ef4081de2c026b7ea118&amp;dn=The.Good.Wife.S07E06.HDTV.x264-LOL&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Slocate","files":1,"time":1447102030,"description":"The Good Wife\r\n\r\nGenre: Drama, Family\r\nYear: 2013\r\nCountry: USA\r\nRuntime: 42 min\r\nProducer: Michelle King, Robert King\r\nCast: Julianna Margulies, Matt Czuchry, Archie Panjabi, Josh Charles, Christine Baranski, Chris Noth\r\n\r\n.: Plot :.\r\nThe Good Wife is a drama starring Emmy Award winner Julianna Margulies as a wife and mother who must assume full responsibility for her family and re-enter the workforce after her husband's very public sex and political corruption scandal lands him in jail. Pushing aside the betrayal and crushing public humiliation caused by her husband Peter (Chris Noth, Law &amp; Order, Sex &amp; the City), Alicia Florrick (Margulies, ER) starts over by pursuing her original career as a defense attorney. As a junior associate at a prestigious Chicago law firm, she joins her longtime friend, former law school classmate and firm partner Will Gardner (Josh Charles, Sports Night), who is interested to see how Alicia will perform after 13 years out of the courtroom. Alicia is grateful the firm's top litigator, Diane Lockhart (Christine Baranski, Mamma Mia!), offers to mentor her but discovers the offer has conditions and realizes she's going to need to succeed on her own merit. Alicia's main competition among the firm's 20-something new recruits is Cary (Matt Czuchry, Hack), a recent Harvard grad who is affable on the surface, but will use any means to ensure that he, not Alicia, secures the one full-time associate position that's available. Fortunately, Alicia finds an ally in Kalinda (Archie Panjabi, Bend It Like Beckham), the firm's tough in-house investigator. Gaining confidence every day, Alicia transforms herself from embarrassed politician's scorned wife to resilient career woman, especially for the sake of providing a stable home for her children, 14-year-old Zach (Graham Phillips, Evan Almighty) and 13-year-old Grace (Makenzie Vega, Saw). For the first time in years, Alicia trades in her identity as the &quot;good wife&quot; and takes charge of her own destiny","torrent":{"xt":"urn:btih:27067eb889584249e790ef4081de2c026b7ea118","amp;dn":"The.Good.Wife.S07E06.HDTV.x264-LOL","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27067eb889584249e790ef4081de2c026b7ea118","infoHashBuffer":{"type":"Buffer","data":[39,6,126,184,137,88,66,73,231,144,239,64,129,222,44,2,107,126,161,24]},"announce":[],"urlList":[]}}