{"title":"The Time Tunnel - Crack Of Doom Ep. 6","uid":11000942,"size":418639360,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2744d9090a2457a9757c471d15047e3d4730ded6&amp;dn=The+Time+Tunnel+-+Crack+Of+Doom+Ep.+6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mooseleg8","files":-1,"time":1410143277,"description":"Tony and Doug are transported to Krakatoa, a volcanic island between Java and Sumatra in great activity and the blowup seems to be imminent. The travelers in time are attacked by superstitious natives that believe that a sacrifice would appease the fire, but they are rescued by the British Dr. Everett Holland, who is research the volcano with his daughter Eve. They ask the date to Everett and Holland and Eve tells that it is 26 August 1883, the eve of the explosive eruption that destroyed the island and caused a tsunami that killed more than 36,000 people. Tony and Doug try to convince the Hollands to leave Krakatoa, but the distrustful Eve believe that they are America scientists interested in stealing the research of her father. Meanwhile, the Time Tunnel personnel brings Tony back to the facility, but a time warp suspend the passage of time and the personnel is frozen. Tony collects information about the blowup in Krakatoa and returns to the island, leaving a message to Dr. Raymond.","torrent":{"xt":"urn:btih:2744d9090a2457a9757c471d15047e3d4730ded6","amp;dn":"The+Time+Tunnel+-+Crack+Of+Doom+Ep.+6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2744d9090a2457a9757c471d15047e3d4730ded6","infoHashBuffer":{"type":"Buffer","data":[39,68,217,9,10,36,87,169,117,124,71,29,21,4,126,61,71,48,222,214]},"announce":[],"urlList":[]}}