{"title":"Yale H. Ferguson - Remapping Global Politics [2004][A]","uid":9973872,"size":3100857,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2747e215525504e1b13472f8d77f228f886e5218&amp;dn=Yale+H.+Ferguson+-+Remapping+Global+Politics+%5B2004%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Anette14","files":-1,"time":1397664528,"description":"Description\nProduct Details\nBook Title: Remapping Global Politics: History's Revenge and Future Shock (Cambridge Studies in International Relations)\t\nBook Author: Yale H. Ferguson , Richard W. Mansbach\nSeries: Cambridge Studies in International Relations (Book 97)\nPaperback: 384 pages\nPublisher: Cambridge University Press (December 6, 2004)\nLanguage: English\nISBN-10: 0521549914\nISBN-13: 978-0521549912\n\nBook Description\nPublication Date: December 6, 2004 | ISBN-10: 0521549914 | ISBN-13: 978-0521549912\nYale Ferguson and Richard Mansbach suggest that the state is losing its capacity, legitimacy and authority to remain the primary actor in world affairs and is being transformed into a more complex &quot;post-international universe&quot; characterized by diverse and overlapping polities. Ferguson and Mansbach, accordingly, revise the &quot;maps&quot; of global politics and explain the shifting and accelerating forces transforming them in an important contribution to the issues of globalization and the future of international relations theory.\n\nReview\n&quot;Of course to either remap global politics or explain the forces that shape change is a formidable task. It is thus impressive that they have managed to argue their case as successfully as they have, especially in such a lively and often delightfully irreverent way.&quot; - Janice Bially Mattern, Lehigh University\n\nBook Description\nThis book seeks to redraw our mental maps of global politics and to explain the shifting and accelerating forces that are shaping those maps. The authors suggest that the state is losing capacity, legitimacy and authority to remain the primary actor in world affairs and is giving way to a more complex 'post-international universe' characterized by diverse and overlapping polities. This book makes an important contribution to the literatures on globalization and the future of international relations theory.\n\nAbout the Author\nYale Ferguson is Professor of Political Science and Co-Director of the Center for Global Change and Governance, Rutgers University, Newark. He is the co-author with Richard W. Mansbach of The Web of World Politics: Nonstate Actors in the Global System (1976), The Elusive Quest: Theory and International Politics (1988), The State, Conceptual Chaos, and the Future of International Relations Theory (1989), Politics: Authority, Identities, and Change (1996) and The Elusive Quest Continues: Theory and Global Politics (2003).\n\nRichard Mansbach is Professor of Political Science, Iowa State University. He is the co-author and editor of many books including, with Yale H. Ferguson, The Web of World Politics: Nonstate Actors in the Global System (1976), The Elusive Quest: Theory and International Politics (1988), The State, Conceptual Chaos, and the Future of International Relations Theory (1989), Politics: Authority, Identities, and Change (1996) and The Elusive Quest Continues: Theory and Global Politics (2003).\n","torrent":{"xt":"urn:btih:2747e215525504e1b13472f8d77f228f886e5218","amp;dn":"Yale+H.+Ferguson+-+Remapping+Global+Politics+%5B2004%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2747e215525504e1b13472f8d77f228f886e5218","infoHashBuffer":{"type":"Buffer","data":[39,71,226,21,82,85,4,225,177,52,114,248,215,127,34,143,136,110,82,24]},"announce":[],"urlList":[]}}