{"title":"British Granny Fuck 8 [DVDRip]","uid":9672065,"size":692654859,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:278164154cf90b3f3f15197ac0afb64109e6f121&amp;dn=British+Granny+Fuck+8+%5BDVDRip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"chkm8te","files":1,"time":1393480003,"description":"British Granny Fuck 8 [DVDRip]\n\nWendy, Billy, Mel, Arabella, Karen, G.\n\nSubtitled Haunted Shaghouse, Freddie's British Granny Fuck 8 is another great addition to this amateur British mature lady series. A newspaper article challenges couples to endure a haunted house where a poltergeist has a perverse streak. G enters the house with sexy 40 plus Wendy. Finding her knickers anchored firmly to her ankles he feels obliged to give the old cunt a thorough knobbing, and he jams up her in every conceivable position before splattering her old titties with his hot creamy spunk. Billy and Mel have a raging row about staying in the house only get as far as the conservatory before the spirit strikes and he gives her the hardest of shaggings. Although she is well past 40 and plump, the old cunt can fuck like a slut as she shows how much she loves cock. Billy cums all over her face like a tin of rice pudding. Must be seen to be believed! G then persuades upper class Arabella to visit the house. Telling her he's called Mortimer he puts her at ease before seeing the ghost. She is so petrified, he has no trouble giving the rough fat old cunt one hell of a banging. She may be 50, but the pompous blubbery old bitch loves cock and he gives her big sagging old tits a good hosing with spunk. G is left in the house to pack up when 50 year old estate agent Karen calls at the house. G surprises her in more ways than one! She's really fat and old, so is up for a good rough knobbing by our hero. He shags her flabby old cunt remorselessly until he splatters her face. Super Freddie action once again!\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=1sqyjc5xgv1y7pm5h3m6.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=1sqyjc5xgv1y7pm5h3m6.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=h41ili02537jthe1umjq.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=h41ili02537jthe1umjq.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:278164154cf90b3f3f15197ac0afb64109e6f121","amp;dn":"British+Granny+Fuck+8+%5BDVDRip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"278164154cf90b3f3f15197ac0afb64109e6f121","infoHashBuffer":{"type":"Buffer","data":[39,129,100,21,76,249,11,63,63,21,25,122,192,175,182,65,9,230,241,33]},"announce":[],"urlList":[]}}