{"title":"The Black Packet - Tech Info - Volume 1 - Hacking Freedom and Sa","uid":5667458,"size":4684274907,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:2801fe3a5e874aa9745ecb3dce67a1d5f7bceebe&amp;dn=The+Black+Packet+-+Tech+Info+-+Volume+1+-+Hacking+Freedom+and+Sa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"brainphreak","files":44,"time":1278194272,"description":"The Black Packet - Tech Info - Volume 1 - Hacking Freedom and Safety\n\nNOTE: These videos are all recent, not OLD technology and most have great info that is timeless.\n\n\nThis torrent was created to introduce those in the truth community to various forms of hacking. I have hand\npicked only videos and tutorials which I think will apply to those preparing for tragedy, martial law, large\nEMP events, and overall survival. Many of the skills found on this DVD could save your life, be useful for \nhacktivism, or help you setup your own communications network. I focused mostly on talks which were not too\ntechnical for those who are not computer programmers, and many in fact do not need the use of a PC (my fav).\n\nTopics include, voting systems, electronic billboards, picking locks, HAM radio, keeping yourself self secure\non social networks, survival skills from a hacker perspective, hacking with just your eyes, creating ID's\nwill full security features, police procedure, how constitutional laws apply in the digital age and much more.\n\nSee below for complete listing.\n\nEnjoy, and feel free to ask questions if you have them!\n\n**brainphreak**\n\n---------------------------------------------------------\nDVD CONTENTS (most taken directly from Defcon's website)\n\n\n01 - Hackers Vs Disasters - Hacker Skills for the Wilderness and Disaster Survival\n- Explains the types of disasters you may need to prepare for, the importance of preparing BEFORE they\noccur. Everything from leaving your house in 5 minutes, to being stuck without electricity for more than\n5 hours. This video includes Fire, Shelter, Signaling, Water and more from a hackers perspective.\n\n\n02 - Personal Disaster Preparedness: Surviving mass EMP events.\n- Did you know a single warhead over the USA can take out ALL modern electronics? How do you get out of \nthe building? A giant EMP destroying all electronics and creating fires in some could be triggered by \nsolar flares, nuclear devices, EMP specific weapons etc. Avoid trampling, visibility, finding water, guns,\nmedicines, doctors, avoiding the panic and madness of others.\n\n\n03 - No Tech Hacking - Hacking without the use of as PC\n- You'll hear old familiar terms like &quot;dumpster diving&quot;, &quot;social engineering&quot;, and &quot;shoulder surfing&quot;. Gain info\nabout a person by looking at details such as the type of shoe and wear, taking photos of a PC screen or ID badge etc.\n\n\n04 - Physical Attacks: Beyond Social Engineering and Dumpster Diving\n- Techniques of industrial espionage and physical security, hacking without a computer, and collecting or \nrecording data both video and audio. Examples and methods covered include physically making your way through\nelectronic locks, numbered keypads, biometric locks, listening to keyboard strokes, listening with lasers, etc.\nAlso relationship based trust, including sex, fake resume's, and display of credentials. \n\n\n05 - Identification Card Security: Past, Present, Future\n- This great presentation covers the REAL ID Act, History of identification cards, Amateur ID Manufacturing, \nand other High Tech ID concepts. Our reliance on ID, fake ID's, privacy issues, magnetic strips, rfid, etc.\nComplete demonstration creating an ID with laminate, magstripe, hologram, UV, and where to purchase supplies.\n\n\n06 - Lockpicking Forensics - How Lockpicking and Locks Work\n- Learn the basics of how locks work on the inside. Detailed diagrams explaining how internal mechanisms are\ndesigned and how they are defeated. Includes the various tools and methos used to open locks. \n\n\n07 - Urban Exploration - A Hackers View\n- The art of finding entry points into secured or abandoned buildings. Going to floors or areas of buildings\nnobody else does. Preparing for the exploration of new areas which are possibly rotted, damaged, or otherwsie \nunsafe. Also some great stories and pictures of places these speakers have gone to in their ventures.\n\n\n08 - Keeping Secret Secrets Secret and Sharing Secret Secrets Secretly\n- What is a secret? Why protect a secret? Why sharing secrets may increase secrecy, using encryption, where to\nstore the encryption key, how to eliminate the encryption key, distributing secrets among groups. Hiding data\ninside images or audio (steganography), detecting hidden data, tools, physically hiding stuff at home and elsewhere.\n\n\n09 - Everything about Police Procedure in 50 Minutes\n- When can the police pull you over? When can they frisk you? How do they determine reasonable suspicion? This\ntalk explains how a cop decides to take interest in your activities. What miranda rights mean to you. when can \nthe police offer frisk you? when can they search your car? knock down your door? Speed traps etc.\n\n\n10 - Search and Seizure Explained - They Took My Laptop\n- A brief outline of the Constitutional laws, privacy, the ammendments and how they are applied to search and\nsiezure. Special focus on the 4th and 5th ammendments this talk describes various methods of search and seizure. \nSimply being pulled over, scanners and xrays that are found in airports, or confiscation of equipment at the border.\nShould you use a lock and key or a combination lock? How do emails, snail mail, and phone calls apply? Many examples.\n\n\n11 - Your Mind: Legal Status, Rights, and Securing Yourself\n- Some examples of how the laws are applied to you and your data. Data in various locations may be covered\nunder different laws. Use of encryption, and your level of education may put you in different categories. \nWhat if you hide your data in laptops? usb sticks in your pocket? cell phones? websites? computer clouds?\nWhat can be obtained by investigators if they look in your car computers? Prosthetic devices? Does your \ncomputer really belong to YOU? What is the best protection? Social Networking, GPS, and more...\n\n\n12 - Are You Socially Owned in the Cloud?\n- Covers social networking and other sites which store your personal data. Including facebook, myspace,\nAmazon, itunes, etc. Where does your info go? Who owns it? Can you delete it? What happens when the owner dies?\n\n\n13 - Social Zombies - Your Friends Want To Eat Your Brains\n- Social networks and blogs are the 4th most popular activity on the internet. How do these places make money\noff of your personal info? Fake profiles and spotting bots. Using facebook to steal personal information or even\nlearn passwords. This talk covers various attacks, disinformation, spam, bots, and other exploits in these websites.\n\n\n14 - How Can I Pwn Thee? Let Me Count The Ways\n- This talk covers several techniques to hack into a system. From wifi hot spots to social engineering random\npassengers on a flight. Also covers methods to keep yourself safe while travelling, and the most common security\nrisks observed in travellers, and hacking cell phones and bluetooth devices.\n\n\n15 - Hacking and Playing with Barcodes\n- How barcodes work. Learn about how they are used for routing in mail systems, transit systems, tagging of \nitems etc. This video also explains how to make or modify your own barcodes, methods to read them, and how to\nuse your own specially formatted barcodes to hack into systems that are not secure.\n\n\n16 - Hijacking the Outdoor Digital Billboard Network\n- Explains various types of digital billboards in use, the companies who create them. How these billboards work,\ntheir security flaws, and tools used to hack into them. Covers both survellience, electronic, physical security,\nand what not to do when hacking into these billboards. \n\n\n17 - Death Envelope - Midieval Solution to a 21st Century Problem\n- Covers the topic of a &quot;death envelope&quot;. What is a death envelope? Who should create one? What should it contain?\nThis covers how to create the envelope, how to update the envelope, combining computers with physical access etc. \nThis information can be as simple as personal account info and passwords, or financial secrets. \n\n\n18 - HAM for Hackers - Take Back the Airwaves\n- Who is experimenting with HAM radio? What frequencies can you use? What can be broadcast? This covers the use of encryption, profanity, licensing,\nwattage limits, amateur radio, and bandwidth. A great detailed intro into the technology in less than 20 minutes,\nhow to get started, how to utilize the frequencies for experimentation, and HAM radio users dying off.\n\n\n19 - Climbing Everest - An Insiders Look at One States Voting System\n- An insider hired to check the security of Ohios voting system explains how the entire system works, its flaws,\nand how the technical systems work. Also details of who owns the voting machines, who designed them, and the fact\nthat 80% of all votes are currently being counted on systems made by 2 brothers who own 2 companies?\n\n\n20 - Mobile Hacker Spaces\n- A mobile hacking space put simply is a Van, mobile home, or bus, turned into a meeting space and set up to be\nready for classes, talks, wardriving, or just to check email while on a trip/outing. This presentation includes\neverything you need to get a mobile hacker space up and running, the advantages and disadvantages are discussed.\n\n\n00 - The Secret History of Hacking\n- Explains the beginnings of hacking. Starting with phone hackers or 'phreaks' who could make free phone calls\nsoon taking complete control of the telephone systems. Covers the lives of Captain Crunch, Kevin Mitnick, Steve\nWozniak, and several other key hackers. Hackers were once embraced, due to bad press they are now feared. \n\n\n00 - Web Warriors\n- This documentary explains the differences between white hat and black hat hackers. Examples of hacks that have\nbeen in the wild including virii, power grid hacks, etc. Hear from professional hackers about how the community\nworks, the motivation for their hobby, and utilizing hacked computers to work as a team against another target.\n\n\n00 - Revolution OS\n- This documentary explains how the free software foundation and GNU was created to ensure users could share \nfree software and source code. This was done as a reaction to Bill Gates and others who were upset about software\nbeing shared freely between hackers and hobbiest. This program also explains the origins of the Linux Operating\nSystem, Apache Webserver, the Support model, .\n\n\nPainfully hand picked by **brainphreak** of www.theblackpacket.com for the good of the community! Enjoy!\n\n\nLearn all this and you too can be a ninja! mwahahaha   \n","torrent":{"xt":"urn:btih:2801fe3a5e874aa9745ecb3dce67a1d5f7bceebe","amp;dn":"The+Black+Packet+-+Tech+Info+-+Volume+1+-+Hacking+Freedom+and+Sa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2801fe3a5e874aa9745ecb3dce67a1d5f7bceebe","infoHashBuffer":{"type":"Buffer","data":[40,1,254,58,94,135,74,169,116,94,203,61,206,103,161,213,247,188,238,190]},"announce":[],"urlList":[]}}