{"title":"Sophie Milman - 2011 - In The Moonlight (24 88 hdtracks) FLAC","uid":8387716,"size":1225353321,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2830a90f3f4c46e6373e3c0575460daffe7ebc4a&amp;dn=Sophie+Milman+-+2011+-+In+The+Moonlight+%2824+88+hdtracks%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"eika256","files":-1,"time":1366327172,"description":"Sophie Milman - 2011 - In The Moonlight (24 88 hdtracks) FLAC\n\nWidely regarded as one of Canada's best jazz singers, Russian-born, Toronto-based vocalist Sophie Milman changes tact slightly for her fourth studio album, In the Moonlight. The twinkling piano chords, shuffling, brushed stroke rhythms, and gentle brass instrumentation which defined her previous output are still very much in evidence, but having traveled to New York to record with producer Matt Pierson (Jane Monheit, Michael Franks), the Juno Award winner has capitalized on the opportunity to expand her sound by inviting a string ensemble on board for the first time in her career. However, avoiding the temptation to smother the timeless, smoky, jazz bar arrangements in layers of bombastic layers of strings, the pair only use their newly recruited musicians sparingly and when needed, with only the Duke Ellington standards &quot;Prelude to a Kiss&quot; and &quot;Day Dream,&quot; and the Umbrellas of Cherbourg number &quot;Watch What Happens&quot; offering anything more than the occasional orchestral flourish. It's an approach which entirely befits Milman's intimate and understated cabaret tones, whose seductive French-language delivery of Serge Gainsbourg's &quot;Ces Petits Riens&quot; and expressive, timeless performance of the Gershwin classic &quot;Do It Again,&quot; belie her twenty-something years. The constant low-key, candlelight vibes inevitably begin to wear a little thin, but luckily, Milman occasionally shakes things up a little bit, whether it's the sensuous bossa nova reworking of the Billie Holiday favorite &quot;Speak Low,&quot; the toe-tapping swing jazz rendition of Jon Hendricks' &quot;No More Blues&quot; or, in a rare concession to the modern music scene, the yearning and heartfelt torch song treatment of Feist's folk-pop album track &quot;So Sorry.&quot; Indeed, it's the latter's convincing transition which makes you wish that Milman would tackle more contemporary material more often. Nevertheless, In the Moonlight is still a beautifully arranged selection of songs which, while nothing particularly revolutionary, unarguably provides one of the classiest Sunday morning soundtracks of the year. (AllMusic)\n\nTrack list:\n1 Do It Again 3:48\n2 Oh Look At Me Now 3:26\n3 Moonlight 5:29\n4 Speak Low 4:26\n5 Till There Was You 4:01\n6 Watch What Happens 4:41\n7 Prelude To A Kiss 4:36\n8 Ces Petits Riens 5:08\n9 So Sorry 4:07\n10 Detour Ahead 4:40\n11 Let Me Love You 3:32\n12 Day Dream 5:00\n13 No More Blues 4:20\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:2830a90f3f4c46e6373e3c0575460daffe7ebc4a","amp;dn":"Sophie+Milman+-+2011+-+In+The+Moonlight+%2824+88+hdtracks%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2830a90f3f4c46e6373e3c0575460daffe7ebc4a","infoHashBuffer":{"type":"Buffer","data":[40,48,169,15,63,76,70,230,55,62,60,5,117,70,13,175,254,126,188,74]},"announce":[],"urlList":[]}}