{"title":"Meredith Monk - 1993 - Atlas","uid":5293944,"size":535914216,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:28c8cab2b8834fd7477e65b6706e1a9f7a549827&amp;dn=Meredith+Monk+-+1993+-+Atlas&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ludenus","files":26,"time":1263994242,"description":"Format: lossless APE &lt;a href=&quot;\nhttp://www.amazon.com/Monk-Atlas-Opera-Three-Parts/dp/B00000E56I&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Monk-Atlas-Opera-Three-Parts/dp/B00000E56I&lt;/a&gt;\n\nThreading together Meredith Monk's various guises in the world of avant-garde performance art (from dance and mime to multimedia explorations) is her sensibility first and foremost as a composer, one who creates from the musical imagination's love of pattern and texture. And in Atlas, her full-length opera commissioned by Houston Grand Opera and premiered in 1991, Monk brings together several decades' worth of pioneering ways of expression. Yes, this is an opera involving almost no text and presenting a nonlinear, dreamlike collage in lieu of traditional narrative, but an opera all the same in the centrality of the human voice as the source and vehicle for conveying a dazzling multiplicity of states (Monk herself describes her use of the term &quot;opera&quot; to capture &quot;the multiperceptual, mosaic form that I was envisioning.&quot;) Based quite loosely on the travel writings of Victorian adventurer Alexandra David-Neel, Atlas involves the journey of an Everywoman as an analog for spiritual questing, for a movement from the outer world to an inner, lost, or forgotten dimension. Monk's trademark work in &quot;extended vocal technique&quot; (work that links her with such other mavericks as Laurie Anderson and Joan La Barbara) is the basis for the opera's sound world, and she's trained her fellow cast members (Monk herself performs one of the three stages in the life of Atlas's heroine) to attain the remarkable flexibility required for its strangely beautiful, magnificently ranging variety of vocalise--from complex, microtonal, birdlike imitations to Tibetan chanting and quivering ululation. The repetitive, always slightly changing patterns of the melodic cells might be pigeonholed as &quot;minimalism&quot; (a term Monk, like Steve Reich, abjures), but this would be an unnecessary reduction for the fantastically original and appealing, rhythmically subtle, and unexpected fabrics that Monk weaves--with spare accompaniments by a chamber-size orchestra and the exotic colorings of glass harmonica. The booklet contains color photos of the original production--but even without the theatrical experience, Atlas comes through as a haunting and uniquely beautiful vision of the untapped possibilities of the lyrical stage. --Thomas May","torrent":{"xt":"urn:btih:28c8cab2b8834fd7477e65b6706e1a9f7a549827","amp;dn":"Meredith+Monk+-+1993+-+Atlas","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28c8cab2b8834fd7477e65b6706e1a9f7a549827","infoHashBuffer":{"type":"Buffer","data":[40,200,202,178,184,131,79,215,71,126,101,182,112,110,26,159,122,84,152,39]},"announce":[],"urlList":[]}}