{"title":"From Here To Andromeda [DVD-2][XviD] 720p x 404 HDV","uid":3760752,"size":1422775012,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:28fd0f1a8801a7ad90115de26849a2782176c0c8&amp;dn=From+Here+To+Andromeda+%5BDVD-2%5D%5BXviD%5D+720p+x+404+HDV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Parallax_Coordinates","files":2,"time":1186070311,"description":"? Ben Rich, former head of Lockheed Skunkworks, said at a UCLA Alumni Speech in 1993, &quot;We already have the means to travel among the stars, but these technologies are locked up in black projects and it would take an Act of God to ever get them out to benefit humanity...Anything you can imagine, we already know how to do.&quot;\n\n? Boyd Bushman, a Lockheed Martin Senior Research Scientist, testifies about Anti Gravity, UFOs, Roswell, Wright Patterson AFB, UFOs and more, and demonstrates anti-gravity in the film.\n\n? Professor David Phillips (Santa Monica College) gives us an emergency plan to save us from global warming, and talks about his UFO experiences.\n\n? Professor Roger Weir shows us the ancient connection to Pythagoras and interstellar beings that may be here, in our skies, and among us today.\n\n? Professor Robert Thurman tells us the ancient Buddhist secrets of UFOs and invisible dimensions, cities and the legendary Shambhala!\n\n? The UFO Briefing Scene includes a round table debate with experts over the issue of extraterrestrials fighting over who gets earth next if we destroy it. Is our planet so valuable that a war may begin over its future?\n\n? The Space Shuttle Columbia disaster: what was really behind it? Did ETs shoot down the Columbia?\n\n? How can we engineer our own spacecraft and conquer the universe?\nWill we be able to do it before our destruction?\n\n? What happens to 6.5 billion souls if we lose planet earth?\n\nFrom Here to Andromeda tops all of David Sereda&amp;#039;s past films. The 2-DVD set includes four 1-hour segments and features analysis of mind-blowing UFO footage. The areas of Space Propulsion Theory, Sustainability, and Spirituality are also explored.\n\nFrom Here to Andromeda opens with the possibility that humanity may not survive due to Global Warming, an ensuing Ice Age or Mass Extinction. Al Gore&amp;#039;s movie, An Inconvenient Truth, has swept the world with the realization that Global Warming may destroy our civilization. The question is why doesn&amp;#039;t humanity have the will to live with Sustainable technologies like Solar, Wind, and Helium-3 Fusion to beat Global Warming? Why are the oil companies holding us hostage? Why hasn&amp;#039;t all of humanity awakened and taken measures to ensure our survival?\n\nDavid Sereda, his Fiance, Crystal, and their dog Nuala embark on a journey to find a way to travel to the Andromeda Galaxy 2.2 million light years away to find a new home for humanity. They explore the areas of Sustainability, UFOs, Space Propulsion Theory, Spirituality, and Human Ethics on their journey to solve the greatest riddle in the universe: How can you travel faster than the speed of light and go anywhere in the universe in minutes? Is it possible that Einstein was wrong? Find out why so many UFO&amp;#039;s are suddenly appearing all over the world. Are they here to teach us? Are they here to help humanity make a quantum leap? What do World Governments know about UFOs? Will humanity find a new home in the universe?\n\nFind out how to solve the greatest challenge facing humanity, and what the experts are saying.\n\n\nFrom Here to Andromeda features UFOlogist, ecologist and space scientist David Sereda, Crystal Elina Frost, Professors Roger Weir, Dr. David Phillips (Santa Monica College), Robert Thurman (author/translator, Tibetan Book of the Dead and many others), Boyd Bushman (Senior Research Scientist),Michael Luckman (author, Alien Rock), Rex Webb, Dr. Lynne D. Kitei (auithor and writer/director, Phoenix Lights), UFOlogists Jesse Marcel Jr. (Roswell), Rob Simone, Steven Bassett, Dr. Roger Lier, Preston Dennett, Jason Martell, Jordan Maxwell, skywatchers Michael Lee Hill, Jeff Willes, anti-gravity scientist John Hutchison, entertainers Joe Satriani (Grammy Award-winning musician), Dean Haglund (actor, X-Files &amp; Lone Gunmen), and Tony Tarantino.","torrent":{"xt":"urn:btih:28fd0f1a8801a7ad90115de26849a2782176c0c8","amp;dn":"From+Here+To+Andromeda+%5BDVD-2%5D%5BXviD%5D+720p+x+404+HDV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28fd0f1a8801a7ad90115de26849a2782176c0c8","infoHashBuffer":{"type":"Buffer","data":[40,253,15,26,136,1,167,173,144,17,93,226,104,73,162,120,33,118,192,200]},"announce":[],"urlList":[]}}