{"title":"The 30 Day MBA - Colin Barrow - Yeal","uid":9323131,"size":1767516,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:29244ea76a0a70a65ef9d6eeaf53a93b5cbe4741&amp;dn=The+30+Day+MBA+-+Colin+Barrow+-+Yeal&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"KhushSidhu","files":1,"time":1386585694,"description":"The 30 Day MBA: Your Fast Track Guide to Business Success\n\nBy Colin Barrow\n\n336 Pages - Publisher: Kogan Page - Epub\nYear - 2013 -  Third Edition - Language: English\nISBN-10: 0749469900 - ISBN-13: 978-0749469900\n\nThe 30 Day MBA covers the essential elements and core disciplines in a top MBA program. The subjects covered include accounting, business history, business law, economics, entrepreneurship, ethics and social responsibility, finance, marketing, operations, organizational behavior, personal development, quantitative and qualitative research and strategy. It includes thorough explanation and examples of the &quot;break even analysis,&quot; used by MBAs for making cost, volume, pricing and profit decisions, as well as analysis of the emergence of brands in developing countries.\n\nThis third edition contains a wealth of additions and enhancements including a table that illustrates which of the world's top business schools have been researched and drawn on for content; a Business Concepts Index that allows readers to quickly find the business tool or technique relevant to the area of business they are interested in exploring; coverage of four key optional modules that every MBA student should take; insights on the top 10 business gurus that every MBA student must know about such as Peter Drucker, Stephen Covey, Ken Blanchard and Tom Peters. It also incorporates external reading and resources, online library and information sources, case studies and links to online self-assessment tests.","torrent":{"xt":"urn:btih:29244ea76a0a70a65ef9d6eeaf53a93b5cbe4741","amp;dn":"The+30+Day+MBA+-+Colin+Barrow+-+Yeal","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29244ea76a0a70a65ef9d6eeaf53a93b5cbe4741","infoHashBuffer":{"type":"Buffer","data":[41,36,78,167,106,10,112,166,94,249,214,238,175,83,169,59,92,190,71,65]},"announce":[],"urlList":[]}}