{"title":"Dharma - How Things Exist [PDF][Kyabje Zopa Rinpoche]","uid":4028774,"size":729126,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2981eb407eaf6ffefe10e01fbae15d46df33296c&amp;dn=Dharma+-+How+Things+Exist+%5BPDF%5D%5BKyabje+Zopa+Rinpoche%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"lozory","files":1,"time":1203058876,"description":"     &quot;Sometimes you might think, &amp;#039;What&amp;#039;s the use of teachings on emptiness? How does this philosophy help me when I have problems in everyday life?&amp;#039; However, if you can think [about emptiness], it&amp;#039;s the most powerful meditation to shatter the hallucinations. It&amp;#039;s like an atomic bomb. Problems happen in your daily life because you believe the hallucinations to be real. The most powerful, immediate way to stop problems is to remember emptiness. You should especially remember emptiness when you are in situations where there&amp;#039;s a danger of giving rise to strong anger or uncontrolled desire and creating heavy negative karma and causing great harm to others.&quot;\n\n     In this small book Lama Zopa Rinpoche covers an incredible amount of ground. He starts by emphasizing the importance of compassion and universal responsibility and how to make life meaningful, then gives a brief explanation of the nature of the enlightened mind and how we can attain it, and finally offers an amazing and extensive explanation of emptiness, the ultimate nature of reality, analyzing the way various phenomena exist and teaching how to meditate on emptiness. Within these teachings, Rinpoche also touches on several of the other main points of the path to enlightenment, such as bodhicitta, the three scopes and impermanence. But, in the end, this wonderfully practical book is a manifestation of Rinpoche&amp;#039;s peerless wisdom realizing emptiness and a testament to the personal experience of this rare and precious teacher. \n\n(Uploaded through the kind permission of)          &lt;a href=&quot; http://www.lamayeshe.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.lamayeshe.com&lt;/a&gt;\n***********************************************************************************\n*                                                                                 *\n*  *LYWA      *LYWA*      *LYWA* *LYWA   *LYWA   *LYWA    *LYWA   *LYWA*          *\n*   LYWA        LYWA      LYWA    LYWA    LYWA    LYWA     LYWA    *LYWA*         *\n*   LYWA         LYWA    LYWA      LYWA    LYWA  LYWA     LYWA    *L.Y.WA*        *\n*   LYWA          LYWA  LYWA       LYWA     LYWA LYWA     LYWA    LYWALYWA        *\n*   LYWA           LYWALYWA         LYWA    LYWALYWA     LYWA    LYWA  LYWA       *\n*   LYWA            L.Y.WA          LYWA     L.Y.WA      LYWA    LYWA  LYWA       *\n*   LYWA             LYWA            LYWA     LYWA*     LYWA    LYWA    LYWA      *\n*   LYWA             LYWA            LYWA     LYWA*     LYWA    LYWALYWALYWA      *\n*   LYWA             LYWA             LYWA   L.Y.W.A   LYWA    LYWA      LYWA     *\n*   LYWA             LYWA             LYWA  LYWA LYWA *LYWA    LYWA      LYWA     *\n*   LYWA             LYWA              LYWALYWA   LYWALYWA    LYWA        LYWA    *\n*   LYWA             LYWA              L.Y.W.A    L.Y.W.A     LYWA        LYWA    *\n*   LYWA             LYWA               LYWA*      LYWA*     LYWA          LYWA   *\n*  ~LYWA*LYWA*LYWA* ~LYWA~              LYWA       LYWA     ~LYWA~        ~LYWA~  *\n*                                                                                 *\n*      ~LAMA~      *      ~YESHE~       *      ~WISDOM~      *      ~ARCHIVE~     *\n*                                                                                 *\n*        Bringing you the teachings of Lama Yeshe and Lama Zopa Rinpoche          *\n***********************************************************************************\n\nThe Lama Yeshe Wisdom Archive (LYWA) is the collected works of Lama Thubten Yeshe and Kyabje Lama Thubten Zopa Rinpoche. The Archive was founded in 1996 by Lama Zopa Rinpoche, its spiritual director, to make available in various ways the teachings it contains. Publication of books of edited teachings for free distribution is one of the ways.\n\nPlease visit www.lamayeshe.com for HEAPS of Dharma material\n\nLama Yeshe and Lama Zopa Rinpoche began teaching at Kopan Monastery, Nepal, in 1970. Since then, their teachings have been recorded and transcribed. At present we have more than 10,000 hours of digital audio and some 60,000 pages of raw transcript on our computers. Many recordings, mostly teachings by Lama Zopa Rinpoche, remain to be transcribed, and as Rinpoche continues to teach, the number of recordings in the Archive increases accordingly. Most of our transcripts have been neither checked nor edited.\n\nThe Lama Yeshe Wisdom Archive is a member of the Foundation for the Preservation of the Mahayana Tradition. We are a 501(c)(3) tax-deductible, non-profit corporation dedicated to the welfare of all sentient beings and totally dependent upon your donations for our continued existence. See our donations page for more information about how you can support our work. http://www.lamayeshe.com/about/donate.shtml\n\t\t\t\t","torrent":{"xt":"urn:btih:2981eb407eaf6ffefe10e01fbae15d46df33296c","amp;dn":"Dharma+-+How+Things+Exist+%5BPDF%5D%5BKyabje+Zopa+Rinpoche%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2981eb407eaf6ffefe10e01fbae15d46df33296c","infoHashBuffer":{"type":"Buffer","data":[41,129,235,64,126,175,111,254,254,16,224,31,186,225,93,70,223,51,41,108]},"announce":[],"urlList":[]}}