{"title":"ACDSee Pro 1.9.475","uid":7000708,"size":9656759,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:299a62df0148769ecccc59ed8088414ef42f509f&amp;dn=ACDSee+Pro+1.9.475&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"kodenho","files":2,"time":1328045621,"description":"O ACDSee ÃƒÂ© um dos mais antigos programas voltados para a organizaÃƒÂ§ÃƒÂ£o e visualizaÃƒÂ§ÃƒÂ£o de imagens tanto no Windows quanto no Mac.\n\nDiferente do que vocÃƒÂª pode estar pensando, ele nÃƒÂ£o ficou parado no tempo e evoluiu junto ao grande nÃƒÂºmero de concorrentes que surgiram com o passar do tempo.\n\nHoje, o ACDSee estÃƒÂ¡ em sua versÃƒÂ£o Pro BETA e promete estar cada dia melhor, trazendo para os usuÃƒÂ¡rios um programa ainda mais completo e intuitivo para o gerenciamento de imagens digitais. Com uma interface moderna e fÃƒÂ¡cil de usar, o programa suporta mais de 40 diferentes formatos de imagem permitindo que vocÃƒÂª gerencie um verdadeiro banco de imagens sem seu Mac.\n\n\n\nEconomize tempo\n\n\n\nMuitos programas do gÃƒÂªnero, exigem que vocÃƒÂª importe todas as suas imagens para um banco de dados ÃƒÂ  parte, a fim de que o programa tenha acesso a elas e possa realizar todas as alteraÃƒÂ§ÃƒÂµes necessÃƒÂ¡rias. Apesar de funcionar, na grande maioria das vezes, fazer isso exige muito tempo e paciÃƒÂªncia.\n\nO ACDSee Pro consegue identificar todas as imagens presentes em seu Mac e todos os dispostivos conectados a ele sem que vocÃƒÂª precise mover todos os seus arquivos para um local especÃƒÂ­fico. Desta forma, vocÃƒÂª economiza longos minutos e tem seus dispositivos e novos arquivos reconhecidos prontamente.\n\nFlexibilidade\n\nSe os arquivos gerenciados pelo ACDSee sÃƒÂ£o os mesmos presentes em seu disco rÃƒÂ­gido e pastas, fica fÃƒÂ¡cil alterÃƒÂ¡-lo, removÃƒÂª-los e movÃƒÂª-los de uma pasta ÃƒÂ  outra. Com simplicidade e tecnologia, o aplicativo oferece toda a flexibilidade que vocÃƒÂª precisa na hora de lidar com imagens.\n\nNa hora da organizaÃƒÂ§ÃƒÂ£o, o programa oferece uma ferramenta muito interessante que ÃƒÂ© a organizaÃƒÂ§ÃƒÂ£o hierÃƒÂ¡rquica virtual dos arquivos. Ou seja, vocÃƒÂª reorganiza todas as suas imagens dentro do programa mas sem alterar o modo como estÃƒÂ£o armazenadas nas pastas do Mac.\n\nAlÃƒÂ©m desta organizaÃƒÂ§ÃƒÂ£o, o usuÃƒÂ¡rio pode usufruir das tags (etiquetas), jÃƒÂ¡ presentes no dia-a-dia de todo usuÃƒÂ¡rio. Dessa forma, ÃƒÂ© mais fÃƒÂ¡cil colocar a mesma imagem em duas ou mais categorias ou pastas diferentes sem que ela seja duplicada.\n\nVisualizaÃƒÂ§ÃƒÂ£o\n\nAo procurar por determinadas imagens em uma coleÃƒÂ§ÃƒÂ£o de milhares de fotografias digitais, seu principal aliado, alÃƒÂ©m de um olho rÃƒÂ¡pido, ÃƒÂ© uma ferramenta que permita uma visualizaÃƒÂ§ÃƒÂ£o ÃƒÂ¡gil de todas as imagens. Neste quesito, o ACDSee tambÃƒÂ©m nÃƒÂ£o deixa a desejar.\n\nComo em uma espÃƒÂ©cie de slideshow, vocÃƒÂª pode passar por suas imagens rapidamente sem que elas travem e encontrar aquela fotografia que vocÃƒÂª tanto procura. A ferramenta QuickLook, que permite prÃƒÂ© visualizar arquivos com rapidez dentro do Mac tambÃƒÂ©m estÃƒÂ¡ presente no ACDSee: basta pressionar o ÃƒÂ­cone do olho para que sua imagem seja mostrada rapidamente em uma janelinha translÃƒÂºcida.","torrent":{"xt":"urn:btih:299a62df0148769ecccc59ed8088414ef42f509f","amp;dn":"ACDSee+Pro+1.9.475","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"299a62df0148769ecccc59ed8088414ef42f509f","infoHashBuffer":{"type":"Buffer","data":[41,154,98,223,1,72,118,158,204,204,89,237,128,136,65,78,244,47,80,159]},"announce":[],"urlList":[]}}