{"title":"Jack_Keane_2_The_Fire_Within-FLT","uid":8622970,"size":2283821725,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:29bfa6a7c7030aaa510d4a2884e425de6749d904&amp;dn=Jack_Keane_2_The_Fire_Within-FLT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Mr.Stifmeister","files":-1,"time":1372428741,"description":"\nANSiJEDACiD\n\nIn Their 26th Year Of Glory, FairLight Released #1101\n\nJack Keane 2 - The Fire Within (c) Nordic Games\n\n:   Supplied by: FAIRLIGHT            : : Release Date: 28-06-2013\nCracked by:  FAIRLIGHT              Game Type:    Adventure\nPackaged by: FAIRLIGHT              Image Format: ISO\n-----\nDISCS: 1 DVD                        Protection: none\n\nSystem Requirements : (S)-1-phenylpropan-2-amine\n\nGame information\n=================\n\nJack Keane is back And his newest adventure is even more fast-paced  than\never before\n\nSeveral years after his  last  adventure  with  Dr.  T,  the  hapless  but\nincorrigible hero, Jack Keane returns to experience the greatest adventure\nof his life alongside the beautiful Amanda. However he soon realises  once\nagain  that  nothing  goes  quite  as  smoothly  as  Jack  had   imagined\n\nShanghai,  1899  -The  mysterious  Chinese  city  is  the  epicentre   for\nadventurers of all kinds. Jack Keane, too, has been attracted to the place\nby rumours of a legendary treasure - or to be more  precise,  these  tales\nhave led him right inside the walls of the notorious Shanghai  prison.  It\nis within these walls that the  guardian  of  the  treasure,  a  secretive\nshaman, has been locked up for years. Unfortunately for our hero, Jack has\ncompletely disregarded the fact that it is a lot easier to get INTO prison\nthan out of it\n\nAnd this is only the beginning of Jack Keane's newest  bizarre  adventure\nmysterious treasures, ruthless villains, two distractingly beautiful women\nand tons of clever humour await the most lovable treasure hunter  to  have\never sailed the seven seas in a comical tour de force  around  the  globe\nDuring his travels,  Jack  will  not  only  meet  old  friends,  but  also\nencounter new faces such as the elegant city-lady Eve  and  the  brilliant\nGerman engineer Carl\n\nJack Keane 2 - The Fire Within is set to revolutionise the classic point\nclick  adventure  genre.  Never  has  an  adventure  been  as   cinematic,\nfast-paced and humorous, without breaking any of the iconic point &amp;  click\ngameplay rules\n\nState of the art 3D-graphics, gripping action-sequences  and  the  typical\nbizarre Jack Keanesque humour will be an absolute delight to all adventure\nfans\n\nFeatures\n=========\n\nControl your characters directly with WASD, or switch to the classic\nPoint &amp; Click-Style\nExperience the kind of love triangle we all know from everyday life\nmovies\nExplore your own mind (literally), chase zeppelins by car, and learn a\nwide array of fight-stances to counter your opponents' frantic moves\nCreated by the developers of adventure hits such as Ankh, Jack Keane and\nBlack Sails\nState of the art 3D-graphics based on Deck 13's revolutionary FLEDGE\nengine\nThe mix of fast-paced action sequences and iconic point &amp; click-gameplay\nmakes Jack Keane 2 - The Fire Within a truly 21st Century adventure\n\nInstallation Information\n=========================\n\nBurn or mount\nInstall\nPlay the game\n\nNOTE: As usual, block the game exe in your firewall\n\n/TEAM FAiRLIGHT\n\n-  QUALITY, TRADITION  AND PRIDE -\n\n","torrent":{"xt":"urn:btih:29bfa6a7c7030aaa510d4a2884e425de6749d904","amp;dn":"Jack_Keane_2_The_Fire_Within-FLT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29bfa6a7c7030aaa510d4a2884e425de6749d904","infoHashBuffer":{"type":"Buffer","data":[41,191,166,167,199,3,10,170,81,13,74,40,132,228,37,222,103,73,217,4]},"announce":[],"urlList":[]}}