{"title":"Marion Nestle - Safe Food (mobi, epub)","uid":9083014,"size":3837181,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:29f096cb0aeb71e097a76c1ff9815ad60d7db550&amp;dn=Marion+Nestle+-+Safe+Food+%28mobi%2C+epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":2,"time":1382412422,"description":"Safe Food: The Politics of Food Safety\n\nFood safety is a matter of intense public concern, and for good reason. Millions of annual cases of food &quot;poisonings&quot; raise alarm not only about the food served in restaurants and fast-food outlets but also about foods bought in supermarkets. The introduction of genetically modified foods--immediately dubbed &quot;Frankenfoods&quot;--only adds to the general sense of unease. Finally, the events of September 11, 2001, heightened fears by exposing the vulnerability of food and water supplies to attacks by bioterrorists. How concerned should we be about such problems? Who is responsible for preventing them? Who benefits from ignoring them? Who decides?\n\nMarion Nestle, author of the critically acclaimed Food Politics, argues that ensuring safe food involves more than washing hands or cooking food to higher temperatures. It involves politics. When it comes to food safety, billions of dollars are at stake, and industry, government, and consumers collide over issues of values, economics, and political power--and not always in the public interest. Although the debates may appear to be about science, Nestle maintains that they really are about control: Who decides when a food is safe?\n\nShe demonstrates how powerful food industries oppose safety regulations, deny accountability, and blame consumers when something goes wrong, and how century-old laws for ensuring food safety no longer protect our food supply. Accessible, informed, and even-handed, Safe Food is for anyone who cares how food is produced and wants to know more about the real issues underlying today's headlines.\n\nAuthor: Marion Nestle\nPublisher: University of California Press\nPublication: July 15, 2010\n\nFormats:\n.mobi (compatible with Amazon Kindle, etc.)\n.epub (compatible with Sony Reader, Cruz Reader, iPad, iPodTouch/iPhone, etc.)\n","torrent":{"xt":"urn:btih:29f096cb0aeb71e097a76c1ff9815ad60d7db550","amp;dn":"Marion+Nestle+-+Safe+Food+%28mobi%2C+epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29f096cb0aeb71e097a76c1ff9815ad60d7db550","infoHashBuffer":{"type":"Buffer","data":[41,240,150,203,10,235,113,224,151,167,108,31,249,129,90,214,13,125,181,80]},"announce":[],"urlList":[]}}