{"title":"Orcs.Must.Die-SKIDROW","uid":6731892,"size":2512892187,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2a49dfe969130e6ccd8934b1dfadf6b0f211d743&amp;dn=Orcs.Must.Die-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"ArkLum","files":-1,"time":1318190248,"description":"S K I D R O W\n.the leading force.\n\nproudly presents\nOrcs Must Die! (c) Robot Entertainment\n\n09-10-2011........Release Date &lt;-&gt; Protection...............Steam\nAction...............Game Type &lt;-&gt; Disk(s)..................1 DVD\n\nRELEASE NOTES\n\nSlice them, burn them, skewer them, and launch them - no matter how you\nget it done, orcs must die in this fantasy action-strategy game from\nRobot Entertainment.\n\nAs a powerful War Mage with dozens of deadly weapons, spells, and traps\nat your fingertips, defend twenty-four fortresses from a rampaging mob\nof beastly enemies, including ogres, hellbats, and of course, a whole\nbunch of ugly orcs. Battle your enemies through a story-based campaign\nacross multiple difficulty levels, including brutal Nightmare mode!\n\nWill you roast orcs in pits of lava, pound them flat with a ceiling\ntrap, or freeze and shatter them with a slash? No matter the weapons\nand traps you choose, you're sure to have an orc-killing blast!\n\nFeatures:\n\n24 Fortresses to Defend - Twisting passages, tall towers, and wide-open\nchambers all need a war mage to protect them\n\n6 Orc-Killing Weapons and Spells - From crossbow and bladestaff to the\nmagical power of the elements\n\n19 Deadly Traps and Fierce Minions - Choose from a wide variety of\ntraps including arrow walls, spike traps, spinning blades, and flaming\nbrimstone or call in allies to assist you in the destruction of the orc\nhorde\n\n11 Unique Enemies - Including ogres, flying hellbats, and of course, a\nwhole bunch of ugly orcs\n\nStory-based Campaign - Fend off orcs across three acts to discover the\nmysterious power behind their relentless assaults\n\nPersistent Upgrades - Unlock improved traps as you progress through the\ncampaign\n\nExtensive Replayability - Nightmare Mode and a skull ranking system\nprovide extended play\n\nScoring System and Leaderboard - Compete with your friends for the\ntitle of Best Orc Killer!\n\nINSTALL NOTES\n\n1. Unpack the release\n2. Mount or burn image\n3. Install\n4. Play the game\n5. Support the companies, which software you actually enjoy!\n\nADDITIONAL NOTES\n\nThe language you set at the beginning of install, will be the language\nyou have choosen to play with!\n\nLanguages:\n\nEnglish, Czech, German, French, Italian, Spanish, Russian, Japanese,\nPolish and Portuguese-Brazil are selectable during setup.\n\nGREETINGS\n\nTo all friends of the family and honorable rival groups!","torrent":{"xt":"urn:btih:2a49dfe969130e6ccd8934b1dfadf6b0f211d743","amp;dn":"Orcs.Must.Die-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a49dfe969130e6ccd8934b1dfadf6b0f211d743","infoHashBuffer":{"type":"Buffer","data":[42,73,223,233,105,19,14,108,205,137,52,177,223,173,246,176,242,17,215,67]},"announce":[],"urlList":[]}}