{"title":"Jim Thorpe, Original All-American (Audiobook)","uid":9616242,"size":185521012,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2acbbd935f50f9e437ebe35f8a64c3d7f1267311&amp;dn=Jim+Thorpe%2C+Original+All-American+%28Audiobook%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"sidmal","files":-1,"time":1392423511,"description":"\nJim Thorpe, Original All-American (Audiobook) By Joseph Bruchac, read by the author\n Unabridged edition 2007 | 6 hours and 26 mins | ISBN: 0739362291 | MP3 64 kbps | 185 MB\n\n\n\n\n Jim Thorpe was one of the greatest athletes who ever lived. He played professional football, major league baseball, and won Olympic gold medals in track and field. But his life wasn't an easy one. Born on the Sac and Fox Reservation in 1887, he encountered much family tragedy, and was sent as a young boy to various Indian boarding schools: strict, cold institutions that didn't allow their students to hold on to their Native American languages and traditions. Jim ran away from school many times, until he found his calling at Pennsylvania's Carlisle Indian School. There, the now-legendary coach Pop Warner recognized Jim's athletic excellence and welcomed him onto the football and track teams.\n Focusing on Jim Thorpe's years at Carlisle, this book brings his early athletic career, and especially his college football days, to life, while also dispelling some myths about him and movingly depicting the Native American experience at the turn of the 20th century. This is a book for history buffs as well as sports fans: an illuminating and lively listen about a truly great American.\n\n","torrent":{"xt":"urn:btih:2acbbd935f50f9e437ebe35f8a64c3d7f1267311","amp;dn":"Jim+Thorpe%2C+Original+All-American+%28Audiobook%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2acbbd935f50f9e437ebe35f8a64c3d7f1267311","infoHashBuffer":{"type":"Buffer","data":[42,203,189,147,95,80,249,228,55,235,227,95,138,100,195,215,241,38,115,17]},"announce":[],"urlList":[]}}