{"title":"Scandalous Highlanders Books .5 to 4 by Suzanne Enoch Highlander","uid":12640893,"size":6308954,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2b4774b64521d1edb0e3011946445cbe5a304f56&amp;dn=Scandalous+Highlanders+Books+.5+to+4+by+Suzanne+Enoch+Highlander&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"KiwiSue49","files":11,"time":1445986979,"description":"Please note that all epub files contained in this torrent have been tested in Calibre for PC, and the mobi files with Kindle for PC.\r\n\r\n\r\n\r\nTitle: One Hot Scot – Book .5\r\n\r\nWhile attending her aunt's wedding in Inverness, Julia Prentiss is literally swept off her feet by a man who kidnaps her for her fortune. Julia manages to escape from his estate in the Highlands, only to find herself alone, lost, and hunted in a strange land. When she stumbles across a naked man in a lake, she thinks her luck has gone from bad to worse…or has it?\r\n\r\nDuncan Lenox lives surrounded by enemies, a MacLawry in a land of Campbells. With three sisters at home who rely on him, he's become a very cautious man. But when an auburn-haired English beauty has nowhere else to turn, he feels obligated to help. When the two are forced to spend the night in an abandoned cottage while a storm rages and enemies circle, they find a mutual passion that could save -- or doom -- them both.\r\n\r\n\r\n\r\nTitle: The Devil Wears Kilts – Book 1\r\n\r\nThe Price of Passion…\r\nOn a mission to rescue his runaway sister from the lure of flowery compliments and a useless lot of satin-clad scalawags disguised by their snooty titles, Ranulf MacLawry, Marquis of Glengask, has roared into British society like a storm across the Scottish Highlands. But he's about to find out that satin has its appeal, especially when it covers the curves of Miss Lady Charlotte Hanover--whose tongue is as sharp as her skin is soft...\r\n\r\n…is Pure Pleasure\r\nLady Charlotte Hanover has had her fill of hot-headed men, having lost her fiancé in an utterly unnecessary duel. When did brawn ever triumph over brains? And yet there is something solid and appealing about the brash Highlander who's as dangerous in the ballroom as in battle. Sometimes bigger really is better…\r\n\r\n\r\n\r\nTitle: Rogue with a Brogue – Book 2\r\n\r\nA ROGUE FOR EVERY LADY\r\nLondon, 1817: Stuck in a Mayfair ballroom thanks to his lovestruck brother, highlander Arran MacLawry wants nothing but a bit of distraction from an arranged betrothal-and a clever auburn-haired lass in a vixen's mask promises just that...until he discovers that she's the granddaughter of the Campbell, chief of clan MacLawry's longtime rival. Despite their families' grudging truce, falling for fiery Mary Campbell is a notion too outlandish even for this Highlander...\r\n\r\nTHE THRILL OF THE FORBIDDEN\r\nRaised on tales of savage MacLawrys, Mary is stunned to realize the impressively strapping man in the fox's mask is one of them. Surely the enemy shouldn't have such a broad chest, and such a seductive brogue? Not that her curiosity matters-any dalliance between them is strictly forbidden, and she's promised to another. But with the crackling spark between them ready to ignite, love is worth every risk...\r\n\r\n\r\n\r\nTitle: Mad, Bad, and Dangerous in Plaid – Book 3\r\n\r\nShe used to be mad about him.\r\nHigh-spirited Rowena MacLawry has come to the Highlands after a spectacularly successful debut Season in London, and has made it painfully clear that she's outgrown her girlhood obsession with Lachlan MacTier. That's just fine with him, as he never had any intention of marrying the lass anyway! Yet how can he ignore the fact that the once rough and tumble Winnie has become a very fashionable-and incredibly desirable-young woman...\r\n\r\nAnd now he's got it bad...\r\nBrawny, rugged Lachlan is nothing like the aristocratic English gentlemen who pursued Winnie-with a passion-in London. Three months away was more than enough to show her a world infinitely more glamorous than the untamed Scottish Highlands-and her beloved childhood crush. But now that she's decided to find a prospective husband with a bit more polish, could Lachlan finally appreciate her charms? And is it remotely possible to ignore the wild attraction she feels for him?\r\n\r\n\r\n\r\nTitle: Some Like It Scot – Book 4\r\nCOLD FEET\r\n\r\nNineteenth-century, Scotland:\r\n\r\nWhen a mad lass in trousers shoots at him, Munro &quot;Bear&quot; MacLawry isn't sure what impresses him more-the girl's sure aim or her irresistibly tempting curves. Catriona MacColl has fled to the Highlands with her half-sister to escape an unwanted wedding, and wants no part of him, nor any man. But he can't abandon the flame-haired, sharp-tongued wildcat now that he's discovered her-not when she fits so perfectly in his arms...\r\n\r\nLOVING ARMS\r\n\r\nMunro has more than earned his nickname-he's a well-muscled, well-favored mountain of a man with an engaging bad-boy grin and a string of well-satisfied lasses behind him. Bringing Catriona food, blankets, candles, everything she needs to survive a winter in an abandoned abbey, Munro is an unexpected gift in her reckless bid for freedom-and an unexpected complication. Clan MacDonald has plans for her, and they don't include her falling for a MacLawry. But this man makes","torrent":{"xt":"urn:btih:2b4774b64521d1edb0e3011946445cbe5a304f56","amp;dn":"Scandalous+Highlanders+Books+.5+to+4+by+Suzanne+Enoch+Highlander","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b4774b64521d1edb0e3011946445cbe5a304f56","infoHashBuffer":{"type":"Buffer","data":[43,71,116,182,69,33,209,237,176,227,1,25,70,68,92,190,90,48,79,86]},"announce":[],"urlList":[]}}