{"title":"Playing to Win: 10 Steps to Achieving Your Goals","uid":4725876,"size":1730896,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2b48474acc3d3be91584a22257a04e74b3bf9fa5&amp;dn=Playing+to+Win%3A+10+Steps+to+Achieving+Your+Goals&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"VasiaZozulia","files":1,"time":1234742059,"description":"Playing to Win is a handbook for women who want to be successful. Karren Brady did it. At 23 she took over as Managing Director of Birmingham City Football Club, becoming the youngest ever female Managing Director of a UK PLC when it floated in 1997. Although the club was the &quot;football equivalent of a rubbish dump&quot; and women were barely even seen on the terraces in the early 90s, Karren Brady persuaded her backers to acquire the club and single-mindedly revolutionised it, clearing the debt, taking Birmingham City into the Premier League and transforming it into a viable business.\n\nHow did she do it? How did a 23-year-old woman with little previous experience at this level of management walk into a mans world and achieve such success? In Playing to Win, she reveals her secrets and shares with other women the techniques they can adopt to succeed in their own lives, on their own terms. Her ten motivational rules are self-help classics: ambition, determination, courage, charm, hard work, attitude, humour, confidence, focus and communication. Playing to Win shows women how to grow in each of these areas and achieve the success they dream of. And like all great self-help, her principles apply across all areas of experience - work and personal life. Playing to Win is a handbook for success in any situation.\n\nMoving from Karrens story, how she has transformed a business and maintained a full and stable personal life, to a chapter-by-chapter study of the ten principles successful women need to adopt, Playing to Win is essential reading for women who want to have it all.\n\n","torrent":{"xt":"urn:btih:2b48474acc3d3be91584a22257a04e74b3bf9fa5","amp;dn":"Playing+to+Win%3A+10+Steps+to+Achieving+Your+Goals","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b48474acc3d3be91584a22257a04e74b3bf9fa5","infoHashBuffer":{"type":"Buffer","data":[43,72,71,74,204,61,59,233,21,132,162,34,87,160,78,116,179,191,159,165]},"announce":[],"urlList":[]}}