{"title":"Elcomsoft Internet Password Breaker v2.0.306 Portable","uid":6429050,"size":2187635,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2bc71f6e8ea1bb569f0bc4442f5f5273aedacb6c&amp;dn=Elcomsoft+Internet+Password+Breaker+v2.0.306+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Anacondaz","files":-1,"time":1306578993,"description":"Elcomsoft Internet Password Breaker v2.0.306 Portable\n\nElcomsoft Internet Password Breaker instantly reveals Internet passwords, retrieves login and password information protecting a variety of Web resources and mailboxes in various email clients. The new password recovery tool supports instant password recovery for passwords, stored forms and AutoComplete information in Microsoft Internet Explorer, mailbox and identity passwords in all versions of Microsoft Outlook Express, passwords to all types of accounts and PST files in Microsoft Outlook, and passwords protecting email accounts in Windows Mail and Windows Live Mail. Apple Safari, Google Chrome, Mozilla Firefox * and Opera Web browsers are also supported.\n\nFeatures and Benefits\nInstant password recovery for a variety of applications\nSupports all versions of Microsoft Internet Explorer, including IE7 and IE8\nSupports all versions of Microsoft Outlook and Outlook Express\nSupports Windows Mail and Windows Live Mail passwords\nInstantly recovers passwords cached in Apple Safari, Google Chrome, Mozilla Firefox and Opera Web browsers\nReveals stored POP3, IMAP, SMTP and NNTP passwords for all supported applications\nRecognizes and works around enhanced security model of Internet Explorer 7 and 8\nReveals Microsoft Passport information in Windows Live Mail\nRetrieves Microsoft Outlook PST passwords\nRecovers login and password information to a variety of resources\nInstant Password Recovery\n\nElcomsoft Internet Password Breaker works instantly and automatically. The password recovery tool detects installed applications, locates all available user identities and accounts, and reveals all cached information such as AutoComplete forms, pre-filled forms, logins and passwords protecting mailboxes, identities and user accounts.\n\nRecover Passwords Cached by Internet Explorer\nElcomsoft Internet Password Breaker gives instant access to information cached by Internet Explorer, including auto-login forms, cached logins and passwords, and allows changing or resetting IE Content Advisor passwords. The tool provides access to logins and passwords protecting all types of webmail accounts, blogs, forums, Internet stores and auction sites, and a variety of social networks.\n\nReveal Firefox, Safari, Chrome, and Opera Passwords\nCached forms, login and password information stored in Apple Safari, Google Chrome, Mozilla Firefox * and Opera Web browsers can be instantly recovered with just a few clicks.\n\nInternet Explorer 7 and 8 Support\nInternet Explorer 7 and 8 improved the security model protecting cached passwords. Cached information is now encrypted with addresses of corresponding Web sites or resources to make access impossible without knowing the exact URL of a site. Elcomsoft Internet Password Breaker can still access protected information by retrieving the list of recently visited Web sites from browser history, and retrieving cached information for resources identified.\n\nReveal Email Passwords\nElcomsoft Internet Password Breaker instantly displays the original plain-text passwords protecting mailboxes, POP3, IMAP, SMTP and NNTP news accounts and user identities in a variety of Microsoft email clients. All versions of Microsoft Outlook, Outlook Express, Windows Mail and Windows Live Mail are supported, including Microsoft Passport passwords in Windows Live Mail. For all versions of Microsoft Outlook up to Office 2010, Elcomsoft Internet Password Breaker retrieves passwords protecting PST files.\n\n*If Mozilla Firefox has a master password set to protect password storage, the master password must be obtained before accessing cached information. Elcomsoft Distributed Password Recovery can be used to break Firefox master passwords.\n\nHome Page - http://www.elcomsoft.com/einpb.html\n\n\n","torrent":{"xt":"urn:btih:2bc71f6e8ea1bb569f0bc4442f5f5273aedacb6c","amp;dn":"Elcomsoft+Internet+Password+Breaker+v2.0.306+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2bc71f6e8ea1bb569f0bc4442f5f5273aedacb6c","infoHashBuffer":{"type":"Buffer","data":[43,199,31,110,142,161,187,86,159,11,196,68,47,95,82,115,174,218,203,108]},"announce":[],"urlList":[]}}