{"title":"Andre.Malraux.1945.L'Espoir.XviD.DVDRip.(Eng.Fra.Subs)","uid":6206087,"size":738036549,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2c00afd4b494fd9828837743b945df19197fb187&amp;dn=Andre.Malraux.1945.L%5C%27Espoir.XviD.DVDRip.%28Eng.Fra.Subs%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ibergman","files":3,"time":1298766627,"description":"L'espoir (1945)\n\nStoryline\n1937, during the spanish civil war, at Teruel. The fight of the Republicans (with very poor means but high commitment) against fascist army of General Franco. Can be seen as romanticized witness of director and writer Andre Malraux, who joined the Republicans in 1936. Written by Yepok   \n\nRuntime: 69\nLanguage: Spanish (English and French sub)\nCountry: Spain, France\nColor: Black and White\nIMDb Link: http://www.imdb.com/title/tt0037680/\n\nDirector: AndrÃƒÂ© Malraux, Boris Peskine\nCast:\nAndrÃƒÂ©s Mejuto ... Capitan Munoz\nNicolÃƒÂ¡s RodrÃƒÂ­guez ... Pilot Marquez\nJosÃƒÂ© Sempere ... Commandant Pena\nJulio PeÃƒÂ±a ... Attignies\nPedro Codina ... Schreiner\nJosÃƒÂ© MarÃƒÂ­a Lado ... Peasant\nSerafÃƒÂ­n Ferro ... Saidi\nMiguel Del Castillo ... GonzÃƒÂ¡lez\n\nDescription: The was the only film directed by Andre Malraux, the noted French author, critic, and political activist, and it was based on one of his novels, which was in turn inspired by his experiences fighting with the Loyalists against Franco during the Spanish Civil War. A Loyalist aerial squadron, whose enthusiasm and determination easily outstrip the weapons at their disposal, need to take control of a strategically crucial bridge. To achieve this goal, they must wipe out a Republican air field, but their reconnaissance teams have been unable to locate it. The Loyalist air aces meet a peasant who knows where the targeted airstrip can be found, but there's a catch: he's illiterate and can't use a map, so he has to be taken along on bombing raids to show the men their target.\n\nEspoir was actually filmed in Spain during the war, incorporating genuine combat footage. The completed takes were then smuggled to France, which was under Nazi occupation at the time. The completed picture was not shown publicly until after France was liberated, where it immediately received triumphant acclaim, earning the nation's highest cinematic honor, the Louis Delluc Award. ~ Mark Deming, All Movie Guide\n\nMalraux went to Spain in 1936 like thousand of others from all other the world, revolted by France and Great Britain's refusal to break the &quot;non-intervention&quot; pact and supply arms to the loyalists when both Hitler and Mussolini, in principle also bound by this pact, openly armed Franco's troops... Malraux began shooting his film in 1938 and finished it the following year when the loyalists' hope had definitely dwindled. Espoir is a requiem for republican Spain, a committed film without any references whatsoever to ideology. \n\nAlso Known As (AKA)\nA remÃƒÂ©ny - Hungary\nDays of Hope (undefined)\nEspoir - Italy\nEspoir - Sierra de Teruel (undefined)\nHoffnung - Germany\nMan's Hope (undefined)\nSierra de Teruel - Spain\nVingar ÃƒÂ¶ver Spanien - Sweden","torrent":{"xt":"urn:btih:2c00afd4b494fd9828837743b945df19197fb187","amp;dn":"Andre.Malraux.1945.L%5C%27Espoir.XviD.DVDRip.%28Eng.Fra.Subs%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c00afd4b494fd9828837743b945df19197fb187","infoHashBuffer":{"type":"Buffer","data":[44,0,175,212,180,148,253,152,40,131,119,67,185,69,223,25,25,127,177,135]},"announce":[],"urlList":[]}}