{"title":"DMT: The Spirit Molecule - Upcoming Documentary (2009)","uid":4083309,"size":109064134,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:2ca5aad5dadbf2eb6273614f8587eb06622d81f6&amp;dn=DMT%3A+The+Spirit+Molecule+-+Upcoming+Documentary+%282009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"geogaddi00","files":12,"time":1205675577,"description":"-----------------------------------------------------------------------------------\n\nRick Strassman, M.D. ( http://www.rickstrassman.com/ )\n\nRick Strassman was permitted to embark on the first human research with psychedelic, hallucinogenic, or entheogenic substances in the 1990s in the United States after 20 years' intermission in the field. In the intermission period it has only been legally possible to research on animals.\n\nStrassman's studies investigated the effects of N,N-dimethyltryptamine (DMT), a powerful entheogen, or psychedelic, that he theorizes is a substance produced by the human brain in the pineal gland (without any conclusive proof), and an active ingredient in ayahuasca. Ayahuasca is any of the various psychoactive infusions or decoctions prepared from the Banisteriopsis spp. vine, native to the Amazon Rainforest (which is also called ayahuasca). The resulting drinks are pharmacologically complex and used for shamanic, folk-medicinal, and religious purposes. Occidental ethno-biologists have noted a variety of 200-300 plants used in the different brews made by the Ayahuasceras. It is an open question whether Ayahuasca should be noted as one particular shamanic medicinal brew, or that it should be noted as an entire medicinal tradition alongside, for instance, Ayurveda or Tibetan Medicine.\n\nDuring the project's five years, he administered approximately 400 doses of DMT to 60 human volunteers. This research took place at the University of New Mexico's School of Medicine in Albuquerque, New Mexico where he was tenured Associate Professor of Psychiatry. Strassman has conjectured that when a person is approaching death, the pineal gland releases DMT, accounting for much of the imagery reported by survivors of near-death experiences.\n\nStrassan wrote about the research program in his book DMT: The Sprit Molecule. A documentary movie based on this book is currently in production.\n\n-----------------------------------------------------------------------------------\n\nCottonwood Research Foundation ( http://cottonwoodresearch.org/ )\n\nThe Cottonwood Research Foundation, Inc.  \nPO Box 1100, Taos, New Mexico, 87571\n\n&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;67040813130809100808032704081313080910080803150214020615040f49081500&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script data-cfhash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;data-cfhash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}t.parentNode.removeChild(t);}}catch(u){}}()/* ]]&gt; */&lt;/script&gt; \n \nRick Strassman MD, President\nSteve Barker PhD, Vice-President\nAndrew Stone, Treasurer\n   \n\nDear Friends: \n\nConsciousness is a subject of increasing scientific inquiry in the West. One particular aspect of this research involves how psychoactive medicines affect consciousness. We at the Cottonwood Research Foundation will begin to address some of the most perplexing mysteries of the human mind with the aid of plant-based psychoactive compounds. For example, What are the varieties of human consciousness, and their genetic, biochemical and physiological bases? What are the medical, social, and spiritual implications of these different states, and how can we best apply these states towards healing, creativity, and greater wisdom?\n\nFor thousands of years, historical and indigenous cultures have used plant medicines to reliably induce extraordinarily compelling non-ordinary and mystical states of consciousness. Western science has only begun to tap the vast resources of traditional knowledge regarding these plants and their effects. By bringing to bear multiple scientific, anthropological, and spiritual perspectives, we will pursue several important goals: 1) develop a more thorough understanding of these plantsÃƒÂ¢?? psychological and physical healing properties; 2) explore the states they elicit, in order to gain a deeper and broader understanding of the range of human consciousness; 3) determine how plant-based psychoactive medicines affect consciousness; and 4) clarify the role these compounds, found in our own bodies, play in dreams, mystical and near-death states, creativity, and mental illness.\n\nThe work I performed during the early-1990ÃƒÂ¢??s at the University of New Mexico with DMT, a naturally occurring psychoactive, was the first new clinical research with these compounds in the US in two decades. Our founding of Cottonwood is intended to help revitalize the lagging pace of American research with this and other classical psychoactive compounds since my studies were interrupted in 1995.\n\nWe have already started our first research project. Our vice-president Dr. Steven Barker at Louisiana State University is developing a new ultra-sensitive method of measuring naturally occurring DMT and related compounds in the body. By doing so, we will be able to compare normal levels with those found in naturally occurring highly altered states and clinical conditions. We also held our inaugural fund-raiser in Taos, in which Beatriz Labate, a noted Brazilian anthropologist, presented her field research concerning the burgeoning Brazilian ayahuasca religions movement.\n\nOur most enduring legacy will be the establishment of a thriving, independent research center in northern New Mexico structured in the manner of an institute of higher learning, with treatment, education, and research departments and activities. This campus will include living and dining accommodations, research, laboratory, and information technology facilities, a greenhouse, library, and classrooms. Integral to our vision is a vigorous exchange program with indigenous healers and teachers, which will inform our development of new models for the study and application of plant-based psychoactive medicines.\n\nWe invite you to help us build a strong foundation for a new model of consciousness studies in the West. It is only with your support and involvement that we can make this dream a reality.\n\nWe welcome any and all contributions, monetary or in-kind. All donations are tax deductible, as Cottonwood is a 501(c)3 tax-exempt organization. ( http://cottonwoodresearch.org/Donate.html )\n\nWith warm regards,\n\nRick Strassman MD\nPresident and Co-Founder \n\n-----------------------------------------------------------------------------------\n \nDMT: The Spirit Molecule, the documentary ( http://thespiritmolecule.com/ ) \n\nSYNOPSIS\n\nTHE SPIRIT MOLECULE weaves an account of Dr. Rick Strassman's groundbreaking DMT research through a multifaceted approach to this intriguing hallucinogen found in the human brain and hundreds of plants. Utilizing interviews with a variety of experts to explain their thoughts and experiences with DMT within their respective fields, and discussions with StrassmanÃƒÂ¢??s research volunteers brings to life the awesome effects of this compound, and far-reaching theories regarding its role in human consciousness . \n\nSeveral themes explored include possible roles for endogenous DMT; its theoretical role in near-death and birth experiences, alien-abduction experiences; and the uncanny similarities in Biblical prophetic texts describing DMT-like experiences. Our expert contributors offer a comprehensive collection of information, opinions, and speculation about indigenous use of DMT, the history and future of psychedelic research, and current DMT research. All this, to help us understand the nature of the DMT experience, and its role in human society and evolution. \n\nThe subtle combination of science, spirituality, and philosophy within the filmÃƒÂ¢??s approach sheds light on an array of ideas that could considerably alter the way humans understand the universe and their relationship to it.\n\nPARTICIPANTS: (in alphabetical order)\n\nABRAHAM PHD, RALPH\nBAKST, JOEL DAVI\nBARKER PHD, STEVEN\nDAVIS, ERIK \nDOBKIN DE RIOS PHD, MARLENE \nFRECKSA MD PHD, EDE\nGABLE, ROBERT\nGREY, ALEX \nGREY, ALLYSON\nGROB MD, CHARLES\nGROF MD, STANISLAV\nHANCOCK, GRAHAM\nHARRISON PHD, KATHLEEN\nMCKENNA PHD, DENNIS\nMETZNER PHD, RALPH\nNICHOLS PHD, DAVID \nPENDELL, DALE\nPINCHBECK, DANIEL\nRIBA PHD, JORDI\nRODRIGUEZ PHD, MARKO A.\nROGAN, JOE\nRUSHKOFF, DOUGLAS\nSHANON PHD, BENNY\nSMITH PHD, HUSTON\nSTANDISH ND PD, LEANNA\nSTRASSMAN, RICK\nWOJTOWICZ MD, SLAWEK\n        &amp;\nDMT Study Volunteers:\nPATRICIO DOMINGUEZ\nANDREW STONE \nDON WRIGHT\n\nFor more information, contact us at:\n\n&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;a8c1c6cec7e8dcc0cddbd8c1dac1dcc5c7c4cdcbddc4cd86cbc7c5&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script data-cfhash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;data-cfhash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}t.parentNode.removeChild(t);}}catch(u){}}()/* ]]&gt; */&lt;/script&gt;\n\nPS  If you know any investors please contact me ( Mitch Schultz: &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;c5a8acb1a6ad85b6b5a0a6b1b7a4a9a4a9a6ada0a8bceba6aaa8&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script data-cfhash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;data-cfhash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}t.parentNode.removeChild(t);}}catch(u){}}()/* ]]&gt; */&lt;/script&gt; ) as we continue to make our final funding push.  Please send any links to blogs, forums, or general websites that may be interested in announcing our film.  And finally, keep an eye out for our MySpace () and FaceBook pages launching soon.\n\n\n-----------------------------------------------------------------------------------\n\nThis torrent consists of 1 radio interview from March 3rd, 2007 on Whitley Strieber's Dreamland with Dr. Rick Strassman; a bonus Dreamland ( http://www.UnknownCountry.com/ ) discussion between William Henry and Rick Strassman on the same date; the revolutionary book 'DMT: The Spirit Molecule' in .pdf format; an interview from March 28th 2005 on RadiOrbit with Rick Strassman; an interview from October 1st 2007 on RadiOrbit with the director of 'DMT: The Spirit Molecule' &lt;the upcoming documentary&gt; Mitch Schultz from Spectral Alchemy ( http://www.SpectralAlchemy.com/ ); and 1 video clip from the 5th episode of the Magical Egypt series, Navigating the Afterlife, which features an interview with Rick Strassman.\n\n--------------------------------------\n\nTorrent compiled and uploaded by geogaddi00 ( &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;4f2c203d3c2e263d7f7f0f273a3c27222e2623612c2022&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script data-cfhash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;data-cfhash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}t.parentNode.removeChild(t);}}catch(u){}}()/* ]]&gt; */&lt;/script&gt; ) to:\n\nUtopiated - http://utopiated.net/ \nConspiracy Central - http://conspiracycentral.net:6969/\nThe Pirate Bay - http://thepiratebay.se/\nalt.binaries.paranormal - a.b.documentaries - a.b.ufo.files - a.b.multimedia\n\n-----------------------------------------------------------------------------------\n","torrent":{"xt":"urn:btih:2ca5aad5dadbf2eb6273614f8587eb06622d81f6","amp;dn":"DMT%3A+The+Spirit+Molecule+-+Upcoming+Documentary+%282009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ca5aad5dadbf2eb6273614f8587eb06622d81f6","infoHashBuffer":{"type":"Buffer","data":[44,165,170,213,218,219,242,235,98,115,97,79,133,135,235,6,98,45,129,246]},"announce":[],"urlList":[]}}