{"title":"Molly Hatchet Justice (rock) (mp3@320)[rogercc]","uid":5937009,"size":174195402,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2ce9e29087b4a0ed235d727111d580dd1dd4d5f1&amp;dn=Molly+Hatchet+Justice+%28rock%29+%28mp3%40320%29%5Brogercc%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rogercc1","files":12,"time":1289004184,"description":"MOLLY HATCHETT JUSTICE\nOriginal Release Date: 2010 \nLabel: Steamhammer Us\nFormat:Mp3@320\n\n\nMolly Hatchet is an American southern rock band formed in Jacksonville, Florida, in 1975. The band, founded by Dave Hlubek and Steve Holland, took its name from a prostitute who allegedly mutilated and decapitated her clients.\n\nTo Bobby Ingram, brain, guitarist and main songwriter of American Southern rock act Molly Hatchet, the term `justice' is more than just a word. To him, this basic concept expresses his whole philosophy of life. Justice, fairness, trust between friends, family members, parents and their children: what could be more important? Molly Hatchet live this maxim, to them this solemn promise applies not only within the international Southern rock community, but also to their music and its impact on their fans. A dozen haunting rock numbers prove that Molly Hatchet are justly considered to be on a par with legends such as Lynyrd Skynyrd and the Allman Brothers. Justice is marked by hot Southern rock that could hardly be more powerful and diverse. Almost every single track signals its musical and thematic direction. Producer Ingram is responsible for the awesome sound, supported by sound engineer Tommy Newton, who mixed the album. &quot;I wanted a warm, natural sound, which you only get with an analog mixing desk,&quot; Ingram explains his decision in favor of Newton and his Area 51 studio. And so Justice has turned into an album that impresses at all levels: earthy, dynamic, with a lot of love for detail and loads of energy. One could say it's Molly Hatchet at their best!\n\nTracklist\n1. Been To Heaven Been To Hell 4:35\n2. Safe In My Skin 4:33\n3. Deep Water 5:38\n4. American Pride 4:02\n5. I'm Gonna Live 'Til I Die 8:30\n6. Fly On Wings Of Angels (Somer's Song) 8:06\n7. As Heaven Is Forever 4:47\n8. Tomorrows And Forevers 5:23\n9. Vengeance 6:23\n10. In The Darkness Of The Night 5:05\n11. Justice 8:39\n","torrent":{"xt":"urn:btih:2ce9e29087b4a0ed235d727111d580dd1dd4d5f1","amp;dn":"Molly+Hatchet+Justice+%28rock%29+%28mp3%40320%29%5Brogercc%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ce9e29087b4a0ed235d727111d580dd1dd4d5f1","infoHashBuffer":{"type":"Buffer","data":[44,233,226,144,135,180,160,237,35,93,114,113,17,213,128,221,29,212,213,241]},"announce":[],"urlList":[]}}