{"title":"Robert Lacey - Inside the Kingdom [96] Unabridged","uid":7691643,"size":591969123,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2cf2861db68433e8b2cb181a0993459227154af5&amp;dn=Robert+Lacey+-+Inside+the+Kingdom+%5B96%5D+Unabridged&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rambam1776","files":-1,"time":1349265504,"description":"Robert Lacey - Inside the Kingdom: Kings, Clerics, Modernists, Terrorists, and the Struggle for Saudi Arabia\n\nUnabridged, 96 kbps, read by Read by Stephen Hoye\n\nOverview\nSaudi Arabia is a country defined by paradox: It sits atop some of the richest oil deposits in the world and yet its roiling disaffection produced fifteen of the nineteen 9/11 hijackers. It is a modern state, where wealthy princes and tycoons raise futuristic cities in the desert, and yet its powerful religious establishment would roll back its values fourteen hundred years to the time of the Prophet Mohammed. To fully understand our interdependent twenty-first-century world, we must understand Saudi Arabia.&quot; With Inside the Kingdom, author Robert Lacey gives readers a remarkable portrait in full of this most enigmatic of lands. More than twenty years after moving to Saudi Arabia during the oil boom to write his groundbreaking epic The Kingdom, Lacey returned to live once again among the princes and the paupers, the clerics and the progressives. What he found was a society slowly recovering from the past. In this recounting, which takes us from the bloody seizure of Mecca's Grand Mosque in 1979 to the deepening of U.S.-Saudi relations during the Gulf War of 1991 to the fostering of a new generation of Islamic holy warriors led by Osama bin Laden, Lacey shows how Saudi Arabia came to the precipice at which it now stands, struggling to learn how not to be at war with itself.\n\nProduct Details\nISBN-13: 9781400183371\nPublisher: Tantor Media, Inc.\nPublication date: 10/29/2009\nFormat: MP3\nEdition description: Unabridged\n\nMeet the Author\nRobert Lacey is a British historian noted for his original research, which gets him close to---and often living alongside---his subjects. He is the author of twenty books, including Majesty, The Year 1000, and the New York Times bestseller The Kingdom. He is currently living in Jeddah, Saudi Arabia. Stephen Hoye has won thirteen AudioFile Earphones Awards and two prestigious APA Audie Awards, including one for the New York Times bestseller Rich Dad, Poor Dad by Robert T. Kiyosaki. A graduate of London's Guildhall and a veteran of London's West End, Stephen has recorded many other notable titles, such as Every Second Counts by Lance Armstrong and The Google Story by David A. Vise and Mark Malseed.","torrent":{"xt":"urn:btih:2cf2861db68433e8b2cb181a0993459227154af5","amp;dn":"Robert+Lacey+-+Inside+the+Kingdom+%5B96%5D+Unabridged","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2cf2861db68433e8b2cb181a0993459227154af5","infoHashBuffer":{"type":"Buffer","data":[44,242,134,29,182,132,51,232,178,203,24,26,9,147,69,146,39,21,74,245]},"announce":[],"urlList":[]}}