{"title":"Reality Kings - Money Talks - Pump Service.mp4","uid":8419190,"size":1354124433,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:2e57d8179ff4c8d61d80b1b33237e337cbe1b6ea&amp;dn=Reality+Kings+-+Money+Talks+-+Pump+Service.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"Q88.","files":1,"time":1367131110,"description":"Release date: 27/11/2007\n\nRating: 6.5\n\n&quot;Nothing makes someone give thanks more than the almighty dollar. I think you guys will all be grateful for this weeks update. Guys love sports but the only thing that can make it better is hot, nude women. so we brought you some great footage from the nude world of sports featuring naked Roller Derby and naked volleyball. We also negotiated and got a girl to dress in a turkey costume and get stuffed from the rear by a hungry pilgrim. We also picked up a gas attendant who was servicing boats out on the ocean and convinced her to pump Josh hard and fast until he splattered his cum all over her face. We thought we had enough footage for this update until Tony came in with some tape he shot with his nerd buddy. They grew up together and he always had a soft spot for this geekazoid. Tony told him he would get him laid. All he had to do was play it cool and follow his lead. Tony proceeded to sweet talk a pizza parlor attendant once they saw how hot she was. She really wasnt into the super dweeb look but Tony knew how to grease her palm and eventually wet her pussy. Everyone has a price, even if it is to fuck an unfuckable schmuck for the bucks. He definitely had much to be thankful for this year.&quot;","torrent":{"xt":"urn:btih:2e57d8179ff4c8d61d80b1b33237e337cbe1b6ea","amp;dn":"Reality+Kings+-+Money+Talks+-+Pump+Service.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e57d8179ff4c8d61d80b1b33237e337cbe1b6ea","infoHashBuffer":{"type":"Buffer","data":[46,87,216,23,159,244,200,214,29,128,177,179,50,55,227,55,203,225,182,234]},"announce":[],"urlList":[]}}