{"title":"Bruce Cockburn...Small Source of Comfort(2011)[FLAC]","uid":6236809,"size":325548710,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:30055dcf554c57a32770bd207ea8984e6f6f72e2&amp;dn=Bruce+Cockburn...Small+Source+of+Comfort%282011%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":18,"time":1299905692,"description":"[img]http://image.allmusic.com/00/amg/cov200/drp600/p602/p60277l6j41.jpg[/img]\n[color=Orange]Mar 8, 2011 Small Source of Comfort True North RecordsTND536[/color]\n[img]http://i128.photobucket.com/albums/p180/SonAfterDark/tracklistlatest.png[/img]\n\n 1  The Iris of the World -Cockburn 3:22 \n  2  Call Me Rose -Cockburn 3:16 \n  3  Bohemian 3-Step -Cockburn 4:07 \n  4  Radiance -Cockburn 4:14 \n  5  Five Fifty-One -Cockburn 3:34 \n  6  Driving Away -Chvostek, Cockburn 4:34 \n  7  Lois on the Autobahn -Cockburn 4:45 \n  8  Boundless -Chvostek, Cockburn 4:45 \n  9  Called Me Back -Cockburn 2:41 \n  10  Comets of Kandahar -Cockburn 4:49 \n  11  Each One Lost -Cockburn 3:59 \n  12  Parnassus and Fog -Cockburn 3:28 \n  13  Ancestors -Cockburn 3:59 \n  14  Gifts -Cockburn 1:57 \n\nIn the notes to Small Source of Comfort, Bruce Cockburn's first studio recording in five years, he claims that after the musically ambitious Life Short Call Now, he wanted to make something very different: &quot;...music, electric and noisy, with gongs and jackhammers, and fiercely distorted guitars.&quot; (Perhaps he'd been listening to Scott Walker's The Drift.) It would have been compelling to hear that from Cockburn, because Small Source of Comfort is anything but. Instead, it is a small-scale, intimate collection of 14 acoustically based songs. Cockburn enlisted Colin Linden to produce and play occasional slide guitar, as well as his seasoned comrades John Dymond (bass) and Gary Craig (drums) as a rhythm section. In addition, he enlisted violinist and singer/songwriter Jenny Scheinman to adorn many of these tracks, while Annabelle Chvostek co-wrote two selections and appears on both. These songs are steeped in intimacy balanced by Cockburn's acute -- sometimes bitingly ironic and self-effacing -- observations on spiritual, emotional, and political questions and reflections on the natural world that surrounds them. &quot;The Iris of the World,&quot; with Scheinman's lilting violin and harmony vocal, languidly meditates on life in the process of being fully experienced -- past and present. &quot;Call Me Rose&quot; is a biting satire about Richard Nixon reincarnated in the body of a woman. He's no longer &quot;king of the world,&quot; but a mom on the skids. &quot;Driving Away,&quot; with Chvostek, is nearly a Buddhist meditation on transience and passage; the same feeling permeates their other collaboration, &quot;Boundless,&quot; which sets longing and confusion in a skittering poignant minor-key folk-blues. It observes that &quot;we love our blindness and we love our pain&quot; and that we &quot;look for stillness in the womb of space.&quot; Topics of forgiveness, empathy, and ego-puncturing range freely throughout this recording. Cockburn's words have always held keen insight when pointed at the world, but these cut away the outside and look in the mirror first. There are some fine instrumentals here, too. His jazz chops are juxtaposed with Scheinman's violin: they swing in &quot;Lois on the Autobahn,&quot; drive one another in &quot;Comets of Kandahar,&quot; and sway in &quot;Parnassus and Fog&quot; (with some knotty counterpoint). The set closes with &quot;Gifts,&quot; an old song and audience favorite finally recorded here. It is a brief expression of gratitude that borders on prayer. It is a fitting close to Small Source of Comfort, which -- for all its economy -- is abundant in wisdom, empathy, and acceptance; further, it is illuminated beautifully in a deeply personal, even iconic, musical language. \n\ncd ripped by dBpoweramp\n\nplease seed\n\n[url]http://dickthespic.org/2011/03/11/bruce-cockburn/[/url]","torrent":{"xt":"urn:btih:30055dcf554c57a32770bd207ea8984e6f6f72e2","amp;dn":"Bruce+Cockburn...Small+Source+of+Comfort%282011%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30055dcf554c57a32770bd207ea8984e6f6f72e2","infoHashBuffer":{"type":"Buffer","data":[48,5,93,207,85,76,87,163,39,112,189,32,126,168,152,78,111,111,114,226]},"announce":[],"urlList":[]}}