{"title":"Carmageddon (1997) (PC Game) (HereticXS)","uid":10833000,"size":625820656,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:30256c2078df972836bd640eaaf448d0fddc7099&amp;dn=Carmageddon+%281997%29+%28PC+Game%29+%28HereticXS%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"HeretiXS","files":2,"time":1408643553,"description":"--------------------------------------------------------------------------------\nCarmageddon (1997) (PC Game)\nReleased by HereticXS - specializing in authentic releases of old-school games.\n--------------------------------------------------------------------------------\n\nThis release was ripped from an authentic physical CD of the original MS-DOS\nmedia. It includes bin/cue CD image files of the original installation CD.\n\nThis release includes LaunchBox (and DOSBox) which will allow you to easily play\nthe game on modern Windows PCs. No configuration or installation is necessary.\nSimply run LaunchBox.exe and then double-click on the game to play.\n\nCarmageddon is a violent car racing game where the racing element can be equally\nimportant as wrecking opponents' cars or gathering kills by ramming into\npedestrians. At the beginning the player has only one car and is ranked at #99.\nThe overall objective is to race all the way to the top, collecting the\nopponents' cars on the way as trophies (and possibly replacements to one's\nvehicle). In the race itself the player tries to damage opponents by driving\ninto them, and can also kill pedestrians.\n\nDamage, kills and spectacular moves earn credits for upgrades and even making\nrepairs to the car at anytime during the race. If a specific opponent's car is\nwrecked multiple times in successive races, it is added to the choice of\navailable vehicles. There are many power-ups strewn around the courses that\nrange from useful (more speed, instant brake) to fun and downright absurd.\nThough the player can win by racing by finishing first, wrecking everything in\nsight is encouraged. The game offers open environments where exploration away\nfrom the racing course is encouraged.","torrent":{"xt":"urn:btih:30256c2078df972836bd640eaaf448d0fddc7099","amp;dn":"Carmageddon+%281997%29+%28PC+Game%29+%28HereticXS%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30256c2078df972836bd640eaaf448d0fddc7099","infoHashBuffer":{"type":"Buffer","data":[48,37,108,32,120,223,151,40,54,189,100,14,170,244,72,208,253,220,112,153]},"announce":[],"urlList":[]}}