{"title":"Beyond Band of Brothers by MAJ Dick Winters","uid":4215404,"size":573857792,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:308d7c15cbfa2bf9e78c96e411f8767b49009106&amp;dn=Beyond+Band+of+Brothers+by+MAJ+Dick+Winters&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"spanikopita","files":197,"time":1212314725,"description":"[This one goes out to my Army recruiter. He was a crazy Special Forces Soldier. Shot five times through the stomach and lived. He thought he could stand up at night during an ambush and take a leak. He&amp;#039;s dead now, but not cuz of the bullets. Can we dedicate torrents to people? If not, I would like to dedicate this to my can of spam and pack of Top Ramen noodles. They were very good to me.]\n\nStephen Ambrose&amp;#039;s Band of Brothers (1992) and the HBO miniseries based on it made Easy Company--the 506th Parachute Infantry Regiment, which fought from D-Day to the end of World War II, with 150 percent casualties--well known to more than -military-history buffs. After both publication and broadcast, Winters, Easy Company&amp;#039;s commanding officer, received many requests for more information. Feeling that much of the material Ambrose didn&amp;#039;t use deserved an audience, he chose to air it and satisfy all those requests in his memoirs. For those to whom the story is familiar, the major and his collaborator developed an excellent narrative voice to recount Winters&amp;#039; experiences, actions, and thoughts during everything from training to deployment to battle to subsequent occupation. Winters has been praised as an exemplar of leadership, and here he shows what he did to earn that praise and how he did it. Very well done, book as well as war service.","torrent":{"xt":"urn:btih:308d7c15cbfa2bf9e78c96e411f8767b49009106","amp;dn":"Beyond+Band+of+Brothers+by+MAJ+Dick+Winters","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"308d7c15cbfa2bf9e78c96e411f8767b49009106","infoHashBuffer":{"type":"Buffer","data":[48,141,124,21,203,250,43,249,231,140,150,228,17,248,118,123,73,0,145,6]},"announce":[],"urlList":[]}}