{"title":"Femina - 5 July 2016 (gnv64)","uid":15051904,"size":23439513,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:30b18c06bae6ced0c5150049e4cc94a7bce19f1b&amp;dn=Femina+-+5+July+2016+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"gnv65","files":4,"time":1466676594,"description":"Femina - 5 July 2016\r\nEnglish | 78 pages | True PDF | 22.3 mb\r\n\r\nALL ABOUT YOU\r\n16 Love GET THE MESSAGE No replies to your text messages? We help you decipher what that means\r\n17 Passion EROTICA OR PORN? The debate heats up\r\n18 Passion STUPID QUESTIONS ABOUT SEX There’s research to answer all your queries\r\n19 Relationships ARE YOU DIVORCE-PROOF? Even the world’s happiest couples have bad days\r\n20 Lifeline ‘GRAN’ ROMANC Words of wisdom from your elders to keep relationship alive\r\n21 Celeb cheat sheet HOW TO COME OUT OF THE CLOSET LIKE ELLEN DEGENERES The TV host broke stereotypes and made the journey easier for others\r\n22 Money CHEQUE, PLEASE! Don't let the bill leave you broke\r\n24 Career NETWORK TO GET WORK The science behind the chit-chat\r\n\r\nFASHION\r\n26 Front row FLARE FARE Skip your skinny jeans for the new cropped trouser shape\r\n27 Front row NEW HEIGHTS Raise the bar in a mini skirt\r\n28 Front row DARE TO BARE The off-shoulder top is not just a trend—it's an essential\r\n29 Fashion TRENDING All you need to know in fashion\r\n30 Conversation ISLAND STATE We meet the duo behind new lifestyle label Nicobar\r\n34 Fashion by numbers WEAR IT OUT Mandana Karimi models this season's most intimate trend\r\n\r\nBEAUTY\r\n42 Masterclass GETTHE LOOK Take sci-fi beauty to work in just 10 steps\r\n44 Trial-a-trend BRIGHT EYES Strike everyone down with a bolt of eyeshadow\r\n45 Makeup mantra GRECIAN ODE Be a goddess in white eyeliner\r\n46 Hair spotlight TOP BUN Nargis Fakhri knows how to work this sleek look\r\n47 Beauty HOT RIGHT NOW All you need on your beauty shelf\r\n48 Nail edit OH BURN! Smokey rust adds some fire to your nails\r\n52 Fitness Bulletin NECK'S BEST THING Don't bow your head to skin damage. These exercises will keep your neck toned\r\n53 Health documentary ACID TEST How changing your diet can alter the chemistry of your body\r\n\r\nREALITY\r\n58 Cover girl GOTH PRINCESS Shruti Haasan on her big 3-0, being a legend's daughter and her music\r\n64 First person HER OWN PERSON India's first transgender college principal Manabi Bandyopadhyay, is not looking for acceptance\r\n65 Femina event DIVA DOSSIER Your front row seat from the glamorous events—the VLCC Femina Style Diva 2016\r\n69 Man we love MEETTHE WINNERS It's getting hot in here! Watch out for the hunks from the Mr India 2016 pageant.\r\n\r\nLIVING\r\n74 Food COLD SMACK Cleanse your palate with these cool desserts\r\n78 The buzzmakers BEING ABHISHEK BACHCHAN The star of Housefull3 on dealing with Twitter trolls and turning producer\r\n\r\nIN EVERY ISSUE\r\n02 EDITOR'S LETTER\r\n03 TOMBSTONE 06 INBOX\r\n49 BEAUTY MANDATE\r\n \nhttps://s32.postimg.org/8zfdmtsv9/Femina_5_July_2016.jpg","torrent":{"xt":"urn:btih:30b18c06bae6ced0c5150049e4cc94a7bce19f1b","amp;dn":"Femina+-+5+July+2016+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30b18c06bae6ced0c5150049e4cc94a7bce19f1b","infoHashBuffer":{"type":"Buffer","data":[48,177,140,6,186,230,206,208,197,21,0,73,228,204,148,167,188,225,159,27]},"announce":[],"urlList":[]}}