{"title":"Invasionen - Saker som jag sagt till natten 2011","uid":6781547,"size":335112916,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:31641f9ca07c1e25668452d65db20e9cd9af0526&amp;dn=Invasionen+-+Saker+som+jag+sagt+till+natten+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"barber9","files":-1,"time":1319920747,"description":"Sven Olov Dennis Lyxzen, fÃƒÂ¶dd 19 juni 1972 i VÃƒÂ¤nnÃƒÂ¤s, VÃƒÂ¤sterbottens lÃƒÂ¤n, numera bosatt i Nordmaling, ÃƒÂ¤r en svensk sÃƒÂ¥ngare och lÃƒÂ¥tskrivare. Han ÃƒÂ¤r fÃƒÂ¶rknippad med sina stÃƒÂ¤llningstaganden som straight edge, vegan/vegetarian och marxist. Dock har han senare nyanserat betydelsen av sitt stÃƒÂ¤llningstagande och identifierar sig numera inte med straight edge. Lyxzen vÃƒÂ¤xte upp i VÃƒÂ¤nnÃƒÂ¤s strax utanfÃƒÂ¶r UmeÃƒÂ¥. FÃƒÂ¶rsta bandet Lyxzen figurerade i var Afro Jetz som sÃƒÂ¥ngare och basist. FÃƒÂ¶rsta slÃƒÂ¤ppet var en demokassett med hardcorebandet Step Forward, som sedan ombildades till det mycket mer inflytelse- och framgÃƒÂ¥ngsrika Refused. Under sin tid i Refused blev han bekant som fÃƒÂ¶retrÃƒÂ¤dare fÃƒÂ¶r bland annat veganism i svenska medier. Han drev dÃƒÂ¥ ocksÃƒÂ¥ skivbolaget Desperate Fight Records som helt koncentrerade sig pÃƒÂ¥ straight edge-hardcore. Sedan Refused splittrades 1998 sjunger han i banden The (International) Noise Conspiracy, Invasionen, som bÃƒÂ¶rjade som ett sidoprojekt under namnet The Lost Patrol, och AC4.\nDennis LyxzÃƒÂ©n har medverkat i TV-programmet Debatt dÃƒÂ¤r han argumenterade fÃƒÂ¶r piratkopiering av musik pÃƒÂ¥ internet. Han har ÃƒÂ¤ven suttit med i panelen till TV-programmet Studio Pop under en sÃƒÂ¤song. Tillsammans med bland annat Inge Johansson frÃƒÂ¥n The (International) Noise Conspiracy och Stefan Granberg frÃƒÂ¥n Randy driver Lyxzen skivbolaget Ny vÃƒÂ¥g Records, och en punkklubb med samma namn som brukar arrangeras pÃƒÂ¥ krogen Scharinska Villan i UmeÃƒÂ¥.\n\n- - -\n\nSom ett sidoprojekt till The (International) Noise Conspiracy, slÃƒÂ¤ppte Dennis Lyxzen 1999 soloskivan Songs in the Key of Resistance under pseudonymen The Lost Patrol. Skivan karaktÃƒÂ¤riseras av politiska budskap och ett singer/songwriter-sound. UppfÃƒÂ¶ljaren, Songs About Running Away, som kom 2003, har samma sound men istÃƒÂ¤llet fÃƒÂ¶r politik handlar texterna om olycklig kÃƒÂ¤rlek. Detta eftersom Lyxzen led av relationsproblem under perioden.\nInfÃƒÂ¶r tredje skivslÃƒÂ¤ppet hade soloprojektet vuxit till ett fullt bemannat band. FÃƒÂ¶r att markera detta fick bandet namnet The Lost Patrol Band. 2005 slÃƒÂ¤pptes de det tredje albumet Automatic. 2008 bytte bandet namn till Invasionen, denna gÃƒÂ¥ng pÃƒÂ¥ grund av hot om stÃƒÂ¤mning frÃƒÂ¥n det amerikanska bandet med samma namn som det tidigare. 2010 kom fjÃƒÂ¤rde albumet, Hela vÃƒÂ¤rlden brinner ut pÃƒÂ¥ Sony Music. Det markerar en helomvÃƒÂ¤ndning fÃƒÂ¶r Lyxzen och bandet. Texterna ÃƒÂ¤r pÃƒÂ¥ svenska, musiken mer poporienterad och lanseringen helt utanfÃƒÂ¶r de tidigare punkramarna. (wikipedia)\n\n- - -\n\nDennis Lyxzen och hans hantlangare i Invasionen har pÃƒÂ¥ nya skivan laddat om med ett ytterst passande postpunksound. Isiga klanger blandas med vÃƒÂ¤rmen i melodierna och musiken som redan i hÃƒÂ¶jd med fÃƒÂ¶rra albumet Hela vÃƒÂ¤rlden brinner var sprÃƒÂ¤ngfylld med smittande vass punkedge fÃƒÂ¥r en extra dimension och lyfter en bit till ÃƒÂ¶ver marken.\n\nLÃƒÂ¥tarna tillÃƒÂ¥ts strÃƒÂ¤ckas ut i smakfullt krautiga tonvandringar. Som pÃƒÂ¥manade av det grymma drivet i det pulserande kompet ÃƒÂ¤r det absoluta trumfkortet Dennis Lyxzens fina texter, som kÃƒÂ¤nns nÃƒÂ¤rmre hjÃƒÂ¤rtat ÃƒÂ¤n nÃƒÂ¥gonsin. Som i Linjerna, om att bli ÃƒÂ¤ldre och kÃƒÂ¤nna sig tryggare ÃƒÂ¤n nÃƒÂ¥gonsin, En annan slags gud, om att leva fullt ut nu istÃƒÂ¤llet fÃƒÂ¶r att sikta in sig pÃƒÂ¥ frÃƒÂ¤lsning lÃƒÂ¥ngt in i framtiden, den peppande uppgÃƒÂ¶relsen i Martyrskap och det genom hela skivan underliggande budskapet att aldrig ge upp kampen med sig sjÃƒÂ¤lv, mot apatin och destruktiva samhÃƒÂ¤llskrafter. Det ÃƒÂ¤r bara att konstatera att norrskenet ÃƒÂ¶ver UmeÃƒÂ¥ lyser starkare ÃƒÂ¤n nÃƒÂ¥gonsin ÃƒÂ¶ver Invasionen. \n(BjÃƒÂ¶rn SchagerstrÃƒÂ¶m, gaffa.se)\n\n- - -\n\nInvasionen - Saker som jag sagt till natten  2011\n(Stockholm Sony)\n\n 1. Arvegods\n 2. Himlen hÃƒÂ¤r uppe\n 3. Demonerna\n 4. FÃƒÂ¶rlorad\n 5. Martyrskap\n 6. Sanningsenligt\n 7. En annas slags gud\n 8. Linjerna\n 9. Norrsken\n10. 120 dB\n","torrent":{"xt":"urn:btih:31641f9ca07c1e25668452d65db20e9cd9af0526","amp;dn":"Invasionen+-+Saker+som+jag+sagt+till+natten+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31641f9ca07c1e25668452d65db20e9cd9af0526","infoHashBuffer":{"type":"Buffer","data":[49,100,31,156,160,124,30,37,102,132,82,214,93,178,14,156,217,175,5,38]},"announce":[],"urlList":[]}}