{"title":"Alex Preminger - The New Princeton Encyclopedia of Poetry and Po","uid":10223979,"size":28094409,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:31c0d42c5dd260a9057b3256d97f59076166b383&amp;dn=Alex+Preminger+-+The+New+Princeton+Encyclopedia+of+Poetry+and+Po&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Anette14","files":-1,"time":1401067853,"description":"Description\nProduct Details\nBook Title: The New Princeton Encyclopedia of Poetry and Poetics\t\nBook Author: Alex Preminger , Terry V.F. Brogan, Frank J. Warnke\nPaperback: 1434 pages\nPublisher: Princeton University Press; 3 edition (April 19, 1993)\nLanguage: English\nISBN-10: 0691021236\nISBN-13: 978-0691021232\n\n===================================================================================\nBook Description\nPublication Date: April 19, 1993 | ISBN-10: 0691021236 | ISBN-13: 978-0691021232 | Edition: 3\nThe New Princeton Encyclopedia of Poetry and Poetics is a comprehensive reference work dealing with all aspects of its subject: history, types, movements, prosody, and critical terminology. Prepared by recognized authorities, its articles treat their topics in sufficient depth and with enough lucidity to satisfy the scholar and the general reader alike. Entries vary in length from relatively brief notices to substantial articles of about 20,000 words.\nThe Princeton Encyclopedia of Poetry and Poetics, published in 1965, established itself as a standard work in the field. Among the 215 contributors were Northrop Frye writing on allegory, Murray Krieger on belief in poetry, Philip Wheelwright on myth, John Hollander on music, and William Carlos Williams on free verse. In 1974, the Enlarged Edition increased the entries with dozens of new subjects, including rock lyric, computer poetry, and black poetry, to name just a few.\nThe New Princeton Encyclopedia of Poetry and Poetics accounts for the extraordinary change and explosion of knowledge within literary and cultural studies since the 1970s. This edition, completely revised, preserves what was most valuable from previous editions, while subjecting each existing entry to revision. Over 90 percent of the entries have been extensively revised and most major ones entirely rewritten. Completely new entries number 162, including those by new contributors Camille Paglia, Barbara Herrnstein Smith, Elaine Showalter, Houston Baker, Andrew Ross, and many more. New entries include those on cultural criticism, discourse, feminist poetics, and Chicano poetry.\nImprovements cover several areas: All the recent developments in theory that bear on poetry are included; bibliographies of secondary sources are extended; cross-references among entries and through blind entries have been expanded for greater ease of use; and coverage of emergent and non-Western poetries is dramatically increased. Indeed, a hallmark of the encyclopedia is its world-wide orientation on the poetry of national and cultural groups.\n\n===================================================================================\nEditorial Reviews\nReview\nFrom abecedarius to zeugma, by way of cywydd, estribillo, Nibelungenstrophe, Tachtigers, and other poetic terms that sound like poetry, The New Princeton Encyclopedia of Poetry and Poetics is a gold mine for readers and writers of poetry alike. First published in 1965, this tome has evolved to reflect developments in critical thinking and an expanding knowledge of non-Western poetry (without, heaven forfend, being trendy: &quot;a reference work,&quot; the editors explain, &quot;must always distance itself from its time while it works to embrace that time&quot;). For this third edition, the editors write, nearly every entry has been changed significantly, and 162 entries have been added. The preface claims coverage of every poetic tradition in the world, and one doesn't doubt it. There's enough material here to keep one browsing well past Yeats's &quot;Second Coming.&quot; If that's not enough to quench your poetic thirst, fret not: a detailed bibliography concludes each entry.\n\nFrom Library Journal\nLarger than both the last edition (1965) and the &quot;enlarged&quot; edition that was published in 1974, this new edition of the indispensable Princeton Encyclopedia assesses 106 national poetries, with coverage of &quot;every significant poetry tradition in the world.&quot; Gone are such entries as &quot;Negro poetry. American&quot;; &quot;Afro-American poetry&quot; takes its place. Though many entries such as &quot;sonnet&quot; are virtually unchanged from the earlier edition, others, such as &quot;Feminist poetics,&quot; are brand-new. Some entries, e.g., &quot;cliche&quot; and &quot;compensation,&quot; have been deleted. This is an essential purchase for any library supporting the study of poetry; the only problem is that the print is tiny and hard to read.- Peter Dollard, Alma Coll. Lib., Mich.\nCopyright 1993 Reed Business Information, Inc.\n\nFrom Booklist\nStudents, scholars, and librarians will welcome this third edition of what has become the standard source for information on the history and criticism of poetry and poetic technique and theory. First published in 1965 as the Encyclopedia of Poetry and Poetics, the work was reissued in 1974 with an 84-page supplement as The Princeton Encyclopedia of Poetry and Poetics.\nAmong the approximately 380 international scholars who contributed to this first major revision of the encyclopedia are such eminent figures as M. H. Abrams, Cleanth Brooks, Alastair Fowler, and Elaine Showalter. The editors note that all entries have been revised to some degree and that more than 90 percent have received extensive revision. Moreover, of the 951 entries, 162 are new to this edition.\nVarying in length from a paragraph to approximately 20,000 words, the alphabetically arranged entries reflect the significant changes in literary criticism and the increased awareness of nonwestern cultures that have developed during the past two decades. Many of the new entries are devoted to contemporary literary theories and schools of criticism (e.g., Deconstruction, Feminist Poetics, Intertextuality, Reader-Response Criticism), while others expand the coverage of poetries of specific nationalities or ethnic groups (e.g., Chicano [Mexican-American] Poetry, Hispano-Arabic Poetry, Inuit Poetry). In addition, a number of the new articles treat types of poetry and poetic devices and techniques (e.g., Alcaic, Found Poem, Love Poetry, Political Verse). Some articles from the previous edition have been assimilated into broader entries, and others (Censorship, Neo-Thomism and Poetry, Verbless Poetry) appear to have been dropped altogether. Continuing the policy established in the first edition, individual poets and poems are not accorded entries.\nIn most cases, the number of bibliographic references that appear at the end of each entry has been substantially expanded, with many references citing publications as recent as 1991. In addition, the system of cross-references is much more extensive, and the editors have further improved access to the entries by adding a table of contents, which includes all article headers and see references.\nThe extent to which this volume has been revised is impressive, but it is not without flaws. The extremely small typeface will create difficulties for some users, and the space-saving practice of abbreviating approximately 80 general terms as well as the headword when it appears within the body of the entry may be confusing to the general reader. Furthermore, the lack of an index continues to detract from the encyclopedia's considerable value. None of these concerns, however, diminishes the excellence and authority of the articles themselves, and this impressive compendium continues to be an essential source for academic and large public libraries. --This text refers to an out of print or unavailable edition of this title.\n\n===================================================================================\nReviews\nAn extraordinarily helpful volume that will save untold hours of reference time for the student, the general reader, and the literary scholar. (The Modern Language Journal)\n\nA reference work of distinction which all who work in the field of literary studies will find extremely useful if not, indeed, indispensable. (Classical Journal)\n\nI consider this volume nearly as essential for any working poet as a good dictionary. (Judson Jerome, Writer's Digest)\n\nA work of scholarship, much humour and literary value. (The Times Literary Supplement)\n\nNo handier one-volume compendium is now available to provide so much useful, authoritative material on the history, theory, and craft of imaginative writing. (Books Abroad)\n===================================================================================","torrent":{"xt":"urn:btih:31c0d42c5dd260a9057b3256d97f59076166b383","amp;dn":"Alex+Preminger+-+The+New+Princeton+Encyclopedia+of+Poetry+and+Po","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31c0d42c5dd260a9057b3256d97f59076166b383","infoHashBuffer":{"type":"Buffer","data":[49,192,212,44,93,210,96,169,5,123,50,86,217,127,89,7,97,102,179,131]},"announce":[],"urlList":[]}}