{"title":"The Saddest Place on Earth The Art of Camille Rose Garcia","uid":8719752,"size":38158997,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:32afd36a806dfe60198aeaadcac9a988e8b60d5d&amp;dn=The+Saddest+Place+on+Earth+The+Art+of+Camille+Rose+Garcia&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"LeonardTSpock","files":-1,"time":1374401081,"description":"Camille Rose Garcia draws inspiration for her creepy distopias from her upbringing in the generic suburbs of Orange County. Her disenchantment with society brought her into a world of subversive art and music. Garcia's work has appeared in Juxtapoz, Paper, Flaunt, and Blab and is shown at galleries throughout the United States. \n\n-------------------------------------------------------------------------------------------\n\n'The Saddest Place on Earth: The Art of Camille Rose Garcia'\n\nGrand Central Press / Last Gasp, 2005, 110 pages\n\nBy Camille Rose Garcia\n\nThese works by Camille Rose Garcia examine ideas of decadence, deception, and denial explored within the context of Empire. It serves as a looking glass into the everyday violence that supports the current power structure and prescribes a glitter coated pill to ease the swallowing. The effect of the pill, once digested, depends upon the viewer. The Saddest Place on Earth is beautiful, the ballroom of an Empire, a forest of aquamarine jewels, a place where cream layered cakes, crystal castles, and opiate abundance serve to sedate the masses. But as the telescope retracts, the glossy veneer of privilege falls away to reveal another reality. Machine guns and machetes decorate the landscape alongside exploding poppies. Deer and Princesses hang suspensefully in a cloud of malaise, and disbelief becomes the ether of the living. The Saddest Place on Earth is opulent wallpaper of destruction that decorates our lives. Its surface is seductive, its layers complex, and its future uncertain.","torrent":{"xt":"urn:btih:32afd36a806dfe60198aeaadcac9a988e8b60d5d","amp;dn":"The+Saddest+Place+on+Earth+The+Art+of+Camille+Rose+Garcia","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32afd36a806dfe60198aeaadcac9a988e8b60d5d","infoHashBuffer":{"type":"Buffer","data":[50,175,211,106,128,109,254,96,25,138,234,173,202,201,169,136,232,182,13,93]},"announce":[],"urlList":[]}}