{"title":"HOMO SCHIZO I - Human and Cultural Hologenesis","uid":8178554,"size":549934,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:32b4ee7b8b6fd4823b7320031ef30437c36a563c&amp;dn=HOMO+SCHIZO+I+-+Human+and+Cultural+Hologenesis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":1,"time":1361577710,"description":"HOMO SCHIZO I\nHuman and Cultural Hologenesis\nby Alfred de Grazia\n\n\n\n\t\t\t\tFOREWORD\n\nMost scholars believe that man has progressed since his original appearance on earth. Probably so, but it has been a strange kind of progress, not well understood, and often showing a negative balance of the &quot;bad&quot; over the &quot;good.&quot;\n\nSome scholars believe that man is a rational animal. In limited ways he is, but, again, it is a strange kind of rationality, more ape-like than other traits of humans that are called &quot;non-rational.&quot; For, to preview an argument that comes later, man is continually seeking ways to reestablish the uninterrupted instinctive responses of his forebears, and this is the homologue of &quot;rationality.&quot; When Descartes wrote of animals as machines, he was obviously unaware that the precise &quot;rationality&quot; of man, which he, of all philosophers, elevated to awesome status, was just this homologue of the machine and animal.\n\nSo constrained and confused is whatever is called human rationality, that I prefer to call mankind by the name homo schizo, that is, homo sapiens schizotypus, rather than homo sapiens. Humans were created and are born schizotypical, with a set of traits to be distinguished in this book. They were from the first, and are now, more schizophrenic than otherwise. What is called &quot;rational&quot; is a derivation out of schizotypicality. This line of argument is also pursued in a companion volume, Homo schizo II: Human Nature and Behavior, which deals with today's people.\n\nHere we are concerned with the evolution of mankind, a field densely covered with literature, but with many a sprouting mystery and contradiction that has resisted the spray of evolutionary formulas. The field is surprisingly vulnerable to a variety of pests, if iconoclastic views may be termed such. It invited questions. And to these I attempt answers.\n\nBy what means did hominid become man? By electrochemical means, and suddenly. Was the change large or small? The change was substantially minute, but profound in its consequences. When did it happen? Recently -- about one thousand reproductive generations ago, which comes to about 260 memorial generations. What role did great natural forces play? They precipitated and perpetuated the change. Did culture spring up with, or did it lag behind, the human transformation? Culture sprang up with the gestalt of human creation. How many symptoms of mental illness are innate in man? All of them. How many cultures are &quot;sick&quot;? All of them, but the sickness is &quot;normal.&quot; Can homo schizo aspire to become homo sapiens? One can aspire to a fiction, but cannot achieve it. Occasionally, a person, or even a group, can reach a delicate equilibrium, which can be called &quot;reasonable,&quot; thus becoming homo sapiens schizotypus. Anything more than that is most uncertain.\n\nThe answers are tentative, as must be many scientific propositions. They may appear far-fetched, but rightly so, because they must be brought in from faraway fields. They would be more firm if only a few students of anthropology, linguistics, genetics, psychology, natural history, and early human behavior were disposed to drink deeply from their primeval fountain of self-doubt, and thereafter to re-examine their data.\n\nI regret not being able to credit the full literature and cannot pretend to have slighted nobody. Especially am I concerned about the lurking work which may have quite escaped research, the work that would have bolstered my strained defenses or, for that matter, penetrated them, and which will emerge later, in a recapitulation of the Mendelian scenario. I recall that Mendel's genetic work &quot;was published in 1865, in plenty of time for Darwin to amend his view in later editions of the Origin,&quot; or so says Julian Huxley. His evolutionary theory badly needed the evidence of mutations in biology. Others, the same Julian Huxley for one, have made excuses for Darwin, and I hope that someone will do the same for me.","torrent":{"xt":"urn:btih:32b4ee7b8b6fd4823b7320031ef30437c36a563c","amp;dn":"HOMO+SCHIZO+I+-+Human+and+Cultural+Hologenesis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32b4ee7b8b6fd4823b7320031ef30437c36a563c","infoHashBuffer":{"type":"Buffer","data":[50,180,238,123,139,111,212,130,59,115,32,3,30,243,4,55,195,106,86,60]},"announce":[],"urlList":[]}}