{"title":"Red Dragon(2002)DVDRip.AC3(ENG)-DROCK","uid":6652525,"size":734303921,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:33899941211dae006dae7e299ea4bb7bcdab5d95&amp;dn=Red+Dragon%282002%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"drock232","files":-1,"time":1315213936,"description":"Following the phenomenal success of The Silence of the Lambs and Hannibal, Anthony Hopkins returns as brilliant madman Hannibal Lecter in this thriller based on the novel in which author Thomas Harris introduced the character. Will Graham (Edward Norton) is an FBI agent with a rare gift for tracking serial killers who brought Hannibal Lecter to justice; however, his confrontation with Lecter proved to be a bloody, near-death experience, and afterward Graham retired from the Bureau, moving to Florida to spend his time with his wife, Molly (Mary-Louise Parker), and their son. However, a particularly grisly killer is on the loose, and Jack Crawford (Harvey Keitel), Graham\\'s one-time mentor at the Bureau, asks him to return to duty to find him. The \\&quot;Tooth Fairy\\&quot; is a vicious murderer who kills entire families at once, covering the eyes of his victims with bits of a shattered mirror. Graham finds he needs help putting together the pieces of the \\&quot;Tooth Fairy\\&quot; case, and he calls upon Lecter looking for advice. Lecter, at once vaguely helpful and self-serving, as usual, offers scraps of information to Graham which help him zero in on the killer. But Lecter knows more than he\\'s telling; the \\&quot;Tooth Fairy\\&quot; is actually Francis Dolarhyde (Ralph Fiennes), a troubled and withdrawn man who admires Lecter\\'s violent panache and corresponds with him. Dolarhyde works at a film processing lab, where one of his co-workers, a blind woman named Reba McClane (Emily Watson), seems to be quite attracted to him. As Dolarhyde wrestles with both his murderous impulses and his feelings for McClane, Lecter plays Graham and Dolarhyde against one another so that, as the FBI agent comes closer to catching \\&quot;the Tooth Fairy,\\&quot; Dolarhyde moves in on his next victim -- Graham\\'s family. Red Dragon marked the second time Harris\\' novel of the same name had been brought to the screen; five years prior to The Silence of the Lambs, Michael Mann adapted the book for the screen as Manhunter, which starred William Petersen as Graham and Brian Cox as Lecter. \n\nRipped with Handbrake.\n\nLength: 2 Hours 5 Minutes\n\nFile Type: MP4\n\nFrame Width: 720\n\nFrame Height: 400\n\nFrame Rate: 23fps\n\nAudio\n\nBit Rate: 159kbps","torrent":{"xt":"urn:btih:33899941211dae006dae7e299ea4bb7bcdab5d95","amp;dn":"Red+Dragon%282002%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33899941211dae006dae7e299ea4bb7bcdab5d95","infoHashBuffer":{"type":"Buffer","data":[51,137,153,65,33,29,174,0,109,174,126,41,158,164,187,123,205,171,93,149]},"announce":[],"urlList":[]}}