{"title":"Daphne Patai - Heterophobia (mobi, epub)","uid":6941557,"size":8343544,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:339269e6f333b6bd019696e2ac1caa3c76d2f57f&amp;dn=Daphne+Patai+-+Heterophobia+%28mobi%2C+epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":2,"time":1326057720,"description":"Heterophobia: Sexual Harassment and the Future of Feminism\n\nWhat does it mean to be a feminist today? Should women require special legislation to protect them from sexual harassment? Daphne Patai's controversial look at the nation's current epidemic of sexual harassment charges answers these questions and illuminates complex ideological struggles within contemporary feminism. By investigating the ongoing attempts to regulate sexual conduct, Heterophobia argues that women's pursuit of a &quot;comfortable&quot; environment has created a feminist-induced hostility toward men and heterosexuality. Patai identifies the origins and evolution of &quot;the sexual harassment industry,&quot; and she presents cases of those men and women whose lives were ruined by false or frivolous charges of harassment. A scathing criticism of political and sexual &quot;correctness,&quot; this thought-provoking and powerfully argued book is sure to incite debate among all Americans concerned with the legacy and future of women's rights.\n\n&quot;Patai shows in detail how women's reasonable desire for a 'hands-off' workplace has now been transformed into a witch-hunt, where men are the devils, and guilty until proven innocent. The book demonstrates how in universities today the postmodern approach to reality has affected (or infected) our bodies as well as our minds.&quot;--Mary Lefkowitz\n\n&quot;A devastating expose of the way academic feminists are driving their wedge between men and women. Professor Daphne Patai shows us the workings of the vast Sexual Harassment Industry (SHI) that now flourishes on the college campus. With humor, style, and persuasive analytic power, she demolishes its male-bashing arguments. And she does it all from a classical feminist point of view.&quot;--Christina Hoff Sommers\n\nAuthor: Daphne Patai\nPublisher: Rowman &amp; Littlefield Publishers, Inc.\nPublication Date: October 27, 1998\n\nFormats:\n.mobi (compatible with Amazon Kindle, etc.)\n.epub (compatible with Sony Reader, Cruz Reader, iPad, iPodTouch/iPhone, etc.)\n\nFree Calibre eBook reader: &lt;a href=&quot;\nhttp://calibre-ebook.com/download&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://calibre-ebook.com/download&lt;/a&gt;\n","torrent":{"xt":"urn:btih:339269e6f333b6bd019696e2ac1caa3c76d2f57f","amp;dn":"Daphne+Patai+-+Heterophobia+%28mobi%2C+epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"339269e6f333b6bd019696e2ac1caa3c76d2f57f","infoHashBuffer":{"type":"Buffer","data":[51,146,105,230,243,51,182,189,1,150,150,226,172,28,170,60,118,210,245,127]},"announce":[],"urlList":[]}}