{"title":"Loca Obsesion [dvdrip][spanish]","uid":5630851,"size":1258774528,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:341fefe625e6bea15f49662122884a2aea87cb20&amp;dn=Loca+Obsesion+%5Bdvdrip%5D%5Bspanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zurera","files":1,"time":1276672297,"description":"TÃƒÂ­tulo: Loca obsesiÃƒÂ³n\nPais: Usa\nAÃƒÂ±o: 2009\nGenero: Comedia\nDuracÃƒÂ­on: 98 Minutos\nDirector: Phil Traill\nReparto: Sandra Bullock, Thomas Haden Church, Bradley Cooper, Ken Jeong, DJ Qualls, Katy Mixon, Howard Hesseman\n\n\nMary Horowitz (Sandra Bullock) es una fanÃƒÂ¡tica de los crucigramas. Su cerebro gira a la velocidad de la luz manejando un inagotable e incomprensible caudal de informaciÃƒÂ³n. Se le puede ocurrir la palabra perfecta -y docenas con el mismo significado- espontÃƒÂ¡neamente, pero comportarse de modo &quot;normal&quot; no va con ella.\nTomemos por ejemplo el hecho de que Mary vive con sus excÃƒÂ©ntricos padres. O su incapacidad social para entablar una relaciÃƒÂ³n sin lanzar una letanÃƒÂ­a de palabras grandilocuentes y liberar un tsunami de cosas intrascendentes. DespuÃƒÂ©s, estÃƒÂ¡ el asunto de sus omnipresentes botas a gogÃƒÂ³ de color rojo bombero.\nPara Mary, nada es normal, sobre todo su relaciÃƒÂ³n con los demÃƒÂ¡s. Cuando le organizan una cita a ciegas con el apuesto operador de cÃƒÂ¡mara Steve (Bradley Cooper), Mary cree que la quÃƒÂ­mica entre ellos es evidente y que Steve es &quot;ÃƒÂ©l&quot;. Steve, por otro lado, piensa que Mary estÃƒÂ¡ loca. Mary, absolutamente segura de haber encontrado a su alma gemela, decide hacer lo que sea e ir adonde haga falta para estar con ÃƒÂ©l. Comienza a perseguirle sin descanso mientras Steve recorre el paÃƒÂ­s cubriendo las noticias de la actualidad.\nLa progresiva obsesiÃƒÂ³n de Mary con Steve es fomentada por la conducta egoÃƒÂ­sta del reportero Hartman Hughes (Thomas Haden Church), que disfruta torturando a su arrogante operador de cÃƒÂ¡mara cada vez que tiene ocasiÃƒÂ³n. Con Mary pisÃƒÂ¡ndole los talones y Hartman animÃƒÂ¡ndola a ello, Steve cada vez estÃƒÂ¡ mÃƒÂ¡s alterado.\nPero cuando Mary resulta implicada en la noticia del aÃƒÂ±o, Steve y Hartman empiezan a mirarla con otros ojos. Hartman se siente tremendamente culpable, consciente de que, por su rivalidad con Steve, la ha puesto claramente en peligro, a la vez que el propio Steve tambiÃƒÂ©n siente remordimiento por su insensible comportamiento. A pesar de la vorÃƒÂ¡gine de medios a su alrededor, Mary, con su actitud optimista y natural, logra hacerse con un pequeÃƒÂ±o grupo de nuevos amigos. Y todos los que conocen a Mary se dan cuenta de que a veces los que marginamos son realmente mejores que nosotros. ","torrent":{"xt":"urn:btih:341fefe625e6bea15f49662122884a2aea87cb20","amp;dn":"Loca+Obsesion+%5Bdvdrip%5D%5Bspanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"341fefe625e6bea15f49662122884a2aea87cb20","infoHashBuffer":{"type":"Buffer","data":[52,31,239,230,37,230,190,161,95,73,102,33,34,136,74,42,234,135,203,32]},"announce":[],"urlList":[]}}