{"title":"Kes (Loach, 1969)","uid":4441716,"size":727120995,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:34545c9cbe433b1cf76da1950b8f38d4c1c29385&amp;dn=Kes+%28Loach%2C+1969%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"ggoes","files":3,"time":1223843728,"description":"Kes (Loach, 1969)\n\n\tCast:\n\n\tDavid Bradley - Billy Casper\n\tFreddie Fletcher - Jud\n\tLynne Perrie - Mrs. Casper\n\tColin Welland - Mr. Farthing\n\tBrian Glover - Mr. Sugden\n\n\nBased on the novel &quot;A Kestrel for a Knave,&quot; by Barry Hines. \n\n***\nAMG Summary: \n\n\tIn this 1969 Ken Loach film, a 15-year-old named Billy Casper suffers abuse both at home and at school in Yorkshire, England. At his home in the working-class section of Barnsley, Billy's brother beats him and his family neglects him. At school, most of his teachers ridicule and reject him, especially sadistic Mr. Sugden. Like other downtrodden children in an outmoded social system favoring the ruling class, Billy appears headed for a menial job with no future. Consequently, he has no motivation and nothing to look forward to, until the day he finds a kestrel -- a European falcon with the ability to hover against strong wind. The bird, a fledgling, is akin to the boy, who must withstand winds of his own. It is not surprising, therefore, that Billy finds meaning in befriending and caring for the baby kestrel. He raises, nurtures, and trains the falcon, whom he calls &quot;Kes.&quot; Its development gives him hope that he too will one day develop, that he too will gain the skills to fly against the wind. Upon the urging of a sympathetic teacher, Mr. Farthing Colin Welland, Billy even summons the courage to take the falcon to school to educate his unfriendly classmates about falconry. Will Billy eventually rise above the repression and privation of his home life and social life? The answers to these questions appear to lie in the fate of the falcon.\n\n***\n\nName.........: Ken Loach - Kes (1969).avi\nFilesize.....: 693 MB (or 709,976 KB or 727,015,424 bytes)\nRuntime......: 01:46:35 (159,866 fr)\nVideo Codec..: XviD\nVideo Bitrate: 818 kb/s\nAudio Codec..: 0x0055(MP3) ID'd as MPEG-1 Layer 3\nAudio Bitrate: 83 kb/s, monophonic VBR \nFrame Size...: 544x320 (1.70:1) [=17:10]\nGiven the film's usage of realistic and pretty thick Mancunian accents, optional English subtitles are supplied in the folder.\n\nUploaded from a private tracker, with permission. &lt;a href=&quot;\nhttp://freakyflicks.proboards54.com/index.cgi?action=display&amp;board=6&amp;thread=2839&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://freakyflicks.proboards54.com/index.cgi?action=display&amp;board=6&amp;thread=2839&lt;/a&gt;\n\n\n***\nFreakyFlicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe FreakyFlicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde. \n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\n   &lt;a href=&quot; http://freakyflicks.proboards54.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://freakyflicks.proboards54.com/&lt;/a&gt;\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE'","torrent":{"xt":"urn:btih:34545c9cbe433b1cf76da1950b8f38d4c1c29385","amp;dn":"Kes+%28Loach%2C+1969%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34545c9cbe433b1cf76da1950b8f38d4c1c29385","infoHashBuffer":{"type":"Buffer","data":[52,84,92,156,190,67,59,28,247,109,161,149,11,143,56,212,193,194,147,133]},"announce":[],"urlList":[]}}