{"title":"Monsters.vs.Aliens.TS.XViD.Cakey [NORARS]","uid":4813413,"size":741413344,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:347024cabe7b0df09fbd8eb0330bff8ef1b3408f&amp;dn=Monsters.vs.Aliens.TS.XViD.Cakey+%5BNORARS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":".BONE.","files":7,"time":1238459187,"description":"Monster Vs Alien Cakey TS\n--------------------------------\nComplete name : Monster.Vs.Alien.Cakey.TS.avi\nFormat : AVI\n------\nVideo\n------\nCodec : XVID\nDuration : 1h 29mn\nBit rate : 960 Kbps\nWidth : 640 pixels\nHeight : 352 pixels\nFrame rate : 25.000 fps\nScan type : Progressive\nBits/(Pixel*Frame) : 0.170\n-----\nAudio\n-----\nFormat : MP3\nDuration : 1h 29mn\nBit rate mode : Variable\nBit rate : 125 Kbps\nMinimum bit rate : 136 Kbps\nChannel(s) : 2 channels\nSampling rate : 48.0 KHz\nResolution : 16 bits\nWriting library : LAME\nEncoding settings : ABR\n-------\nAbout\n-------\nIMDB: &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0892782/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0892782/&lt;/a&gt;\nPlot:\nWhen a meteorite from outer space hits a young girl and turns her into a giant monster,\nshe is taken to a secret government compound where she meets a ragtag group of\nmonsters also rounded up over the years.\n-------\nNotes\n-------\nFirstly a well done to PrisM for the first attempt and improvement, great work\nand very quickly re-encoded and uploaded. Most will be happy with the PrisM\nrelease im fussy and always like to try to go one better hehe ;)\nAGAIN this is a mVs Source re-encode, HOWEVER a lot of work has been done to\nimprove things, its easily (Atleast IMO and hopefully the quick screens and samples show it) the best version available thus far.\n-------------\nWork Done\n-------------\nSOUND: mVs sound was pretty good for a TS, I played with it for a very short while but not much could be done to improve things, so that was left alone.\n\nVIDEO: mVs video was another story entirely, firstly the black levels needed adjusting, white level were also adjusted. After that it was time to sort out the messy colour levels. It all had a washed out look to it along with a horrid yellow(ish) tinge, especially to the whites. Basically dull and faded like an old tape taking out of someones attic after 200 years.\nBlue was VASTLY under saturated so that was fixed, Red and Green Levels were then tweaked to balance them and get rid of that yellow tinge to make white look bright and crisp again and put some colour back into things. A quick touch of contrast adjustment and brightness very slightly increased and things were starting to look good. Picture was still kind of blurry like most cams and TS releases, so a slight edge sharpening mask was applied, id have liked to of made it sharper but any higher and artifacts started to become noticable.\nPrisMs release was a good improvement, but without sounding big headed i think this takes things a step further and probably makes the video overall look the best it can be from the Cam/TS source floating around.\nI hope everyone enjoys it :)\n-------------------\nQuick sound off\n-------------------\nBig Hellos and respect to other re-encoders, including PrisM, JamBo, Stuffies, Lynks, Kingben, FLAWL3SS and all those i missed that show you can polish turd into gold Keep up your great work.\n\nAny other re-encoders that also have ideas to make this even better, please go ahead, its fun to admire various encodes and any improvement tweaks people can make.\n\nDO NOT DOWNLOAD IF YOU DONT LIKE RE-ENCODES, DO NOT COMMENT IF YOU HAVE NOTHING CONSTRUCTIVE TO SAY,\n(WHO AM I KIDDING THERE WILL ALWAYS BE ONE IDIOT WITH A BIG GOB BUT EMPTY HEAD HEHE )\n\nYOU LIKE THE RELEASE, GREAT, GLAD I COULD HELP AND GLAD YOU LIKE IT.\nYOU DONT LIKE IT, THEN RUN ALONG AND FIX THINGS YOURSELF (NOT THAT WHINGERS EVER DO).","torrent":{"xt":"urn:btih:347024cabe7b0df09fbd8eb0330bff8ef1b3408f","amp;dn":"Monsters.vs.Aliens.TS.XViD.Cakey+%5BNORARS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"347024cabe7b0df09fbd8eb0330bff8ef1b3408f","infoHashBuffer":{"type":"Buffer","data":[52,112,36,202,190,123,13,240,159,189,142,176,51,11,255,142,241,179,64,143]},"announce":[],"urlList":[]}}