{"title":"Football Manager Handheld 2015 (v6.3)","uid":11968384,"size":32553539,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:34e287b34504d2b4c5403ec71c1f2765644627e5&amp;dn=Football+Manager+Handheld+2015+%28v6.3%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"-Virtus-","files":1,"time":1432755043,"description":"== About the game:\nFootball Manager Handheld 2015 is the latest release in the best-selling, award-winning series on mobile and tablet devices which allows you to live out the dream of managing your favourite real-life club.\n\nFootball Manager Handheld 2015 is the latest release in the best-selling, award-winning series on mobile and tablet devices which allows you to live out the dream of managing your favourite real-life club.\nYou're in the hot-seat, you make the decisions on transfers, tactics and you take charge from the touchline on match days. Do you have what it takes to become a legend in the high pressure, high emotion world of football management? \n\n\n== Features:\nBrand New Match Engine\nA completely new and more realistic 2D Match Engine allows you to better analyse your team's performance on the field to help you make those tough decisions.*\nScouting Agency\nA brand new Scouting Agency which allows you to look at, and monitor, a ranked list of the top 50 players within the game both for current ability and future potential.\nRankings and Dynamic League Reputation\nNew World Rankings, for international teams and national leagues, which will evolve over time based on performances in continental competitions.\nMore Detailed Club Stats\nA Club Stats page dedicated to showing you more detailed seasonal and historical information about all areas of your club.\nManager Achievements Page\nA Manager Achievements page so you can track all of your accolades and get a run-down on all trophies, awards and achievements won.\nImproved My Club Mode\nYou can now assign Player Roles to each of your squad members and also save any player from any career and use that player in your My Club squad.\nImproved Look and Feel\nMore improvements to the user interface to make your role as manager easier.\nPlus lots more, including a brand new purchasable in-game editor that allows you to change your game data throughout your career. Want more cash? Want your striker's stats to be better? Now you can do that and lots more besides.\n* New match engine available on all devices, some devices might run original match engine as default depending on processing and memory capabilities.\n\n\n== Version:\nFootball Manager Handheld 2015 v6.3 from May 26, 2015\nFull Release\n\n== Version changes:\n#6.3 Update 3\nTweaked match speeds\nImproved player role behaviours\nTuned condition effect from international matches\nPrevented issue where unlockables switched on incorrectly\nFixed auction response buttons greying out in some circumstances\nFixed clock skipping in match\nFixed rare issue where transfer happened outside window\nFixed discrepancy between player ratings on two screens\t\n\n\n== Instructions:\n1. Install .apk file on your Android, download data directly\nPlay &amp; enjoy!\n\n\n== System Requirements:\nAndroid 2.3 and up\n\nLinks:\nVisit Football Manager website at Footballmanager.com\n\n\n\n            If you enjoyed the game then share with others by seeding!\n                    Support game development and buy the game!\n\n\n\nGame developed by Sports Interactive and published by SEGA","torrent":{"xt":"urn:btih:34e287b34504d2b4c5403ec71c1f2765644627e5","amp;dn":"Football+Manager+Handheld+2015+%28v6.3%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34e287b34504d2b4c5403ec71c1f2765644627e5","infoHashBuffer":{"type":"Buffer","data":[52,226,135,179,69,4,210,180,197,64,62,199,28,31,39,101,100,70,39,229]},"announce":[],"urlList":[]}}