{"title":"Heroes Graphic Novels","uid":5066109,"size":2478294574,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:3576d28c6305a14672025f2d3b42d05ef5ff973e&amp;dn=Heroes+Graphic+Novels&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"koesherbacon","files":144,"time":1251022267,"description":"Sure, all the Heroes Graphic Novels are available online for free (http://www.nbc.com/Heroes/novels/), but I went to the Heroes Graphic Novel wiki (http://en.wikipedia.org/wiki/List_of_Heroes_graphic_novels) and downloaded them all into a folder.\n\nThen I put them all together into one cohesive torrent file for your easy viewing!\n\nNow, I know what you're thinking, &quot;Wow, this is awesome!  But, how do I know I'm getting all the HGNs to date?!&quot;  Well, I can answer that!\n\nThis torrent contains HGNs #1-#142, and are up to date as of Aug 23, 2009!  Wow, awesome!\n\nThere will probably be new HGNs released once Heroes, Season 4 premiers in just about 1 month from new.  I don't know how to add files to a torrent file, so you'll probably have to download those separately.  I know, I know.  I suck.  :(\n\nI also have no idea how to remove the first page from the individual PDFs (which is an ad for the Nissan Versa, of course).  You'll just have to deal with that.  Again, I'm well aware how much I suck.  There's no need to tell me in the comments.  :(\n\nBut, listen, you're getting all these HGNs, in one file!  So you don't have go to through the hastle of downloading them all individually, so don't bitch to me about how I have no idea how to add files to the torrent, nor know how to remove pages from PDFs.  You can keep those opinions to yourself and sit back and read some fun comics!  Wow!\n\nHope you all enjoy these comics as much as I do!  Don't worry = I was only kidding before.  I'm well aware how much I rule!  :D\n\nIf you have any (positive) input, please comment below.  Thanks ^^","torrent":{"xt":"urn:btih:3576d28c6305a14672025f2d3b42d05ef5ff973e","amp;dn":"Heroes+Graphic+Novels","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3576d28c6305a14672025f2d3b42d05ef5ff973e","infoHashBuffer":{"type":"Buffer","data":[53,118,210,140,99,5,161,70,114,2,95,45,59,66,208,94,245,255,151,62]},"announce":[],"urlList":[]}}