{"title":"Jimmy Giuffre - Free Fall (1962)","uid":10317157,"size":290869045,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:359c33ca4ea1da4d422da432d78bffa71d3be099&amp;dn=Jimmy+Giuffre+-+Free+Fall+%281962%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ArkieOkie","files":-1,"time":1402263408,"description":"eac secure cue log scans\n\nJimmy Giuffre - Free Fall (1962) [FLAC] {Columbia}\nUPC Code: 5099706544623\n\nReview by Thom Jurek\nJimmy Giuffre's 1962 recording for Columbia with his trio is one of the most revolutionary recordings to come out of the 1960s. While Coltrane and Coleman and Taylor were trying to tear music down from the inside out to discover what it really counted for, Giuffre was quietly creating his own microtonal revolution that was being overlooked by other avant-gardists in jazz. On Free Fall, Giuffre, pianist Paul Bley, and bassist Steve Swallow embarked on a voyage even farther-reaching than their previous two Verve albums, Fusion and Thesis (both recorded in 1961), in their search of pointillistic harmony, open-toned playing, and the power of the nuanced phrase to open new vistas for solo or group improvisation. The original album is comprised of five clarinet solos, two duets for clarinet and bass, and three trio pieces. The CD reissue adds five more clarinet solos to the bank and makes it a stunning view of Giuffre as a master of the idiom of not only jazz free improvisation but also a fine interpreter of the musical languages being discussed by classical composers Darius Milhaud, Stravinsky, Messiaen, and even Morton Feldman and Earle Brown. All of Giuffre's clarinet studies -- particularly &quot;Man Alone,&quot; &quot;Yggdrasill,&quot; and &quot;Present Motion&quot; -- are studies in tonal coloration, where phraseology opens onto second and third tonal ideas being layered atop one another to de-emphasize one or the other. Of the group interactions, &quot;Threewe&quot; and &quot;Spasmodic&quot; offer the view of intertwining chromatic pointillism as it shapes itself linguistically between one instrument and the next without concern for a dominant harmony, rhythm, or melody. Indeed, Free Fall was such radical music, no one, literally no one, was ready for it and the group disbanded shortly thereafter on a night when they made only 35 cents apiece for a set. Reissued in 1999, Free Fall predates all of the European microtonal studies and is indeed an inspiration to all who have embraced it.\n\nTracks\n01 - Propulsion\n02 - Threewe\n03 - Ornothoids\n04 - Dichotomy\n05 - Man Alone\n06 - Spasmodic\n07 - Yggdrasill\n08 - Divided Man\n09 - Primordial Call\n10 - The Five Ways\n11 - Present Notion\n12 - Motion Suspended\n13 - Future Plans\n14 - Past Mistakes\n15 - Time Will Tell\n16 - Let's See\n","torrent":{"xt":"urn:btih:359c33ca4ea1da4d422da432d78bffa71d3be099","amp;dn":"Jimmy+Giuffre+-+Free+Fall+%281962%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"359c33ca4ea1da4d422da432d78bffa71d3be099","infoHashBuffer":{"type":"Buffer","data":[53,156,51,202,78,161,218,77,66,45,164,50,215,139,255,167,29,59,224,153]},"announce":[],"urlList":[]}}