{"title":"Who Shot Johnny Rock? [NTSC] DVD-ROM Game","uid":10015616,"size":3609491766,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:35aa2506c846082ee6b383bfb817d71b65617234&amp;dn=Who+Shot+Johnny+Rock%3F+%5BNTSC%5D+DVD-ROM+Game&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"Big_dude","files":-1,"time":1398143377,"description":"Who Shot Johnny Rock? (DVD Game)                                   Rel. 1991\n\n\n\nFormat:           DVD5 NTSC-USA\nLang:             English\nDiscs:            1\nImage:            ISO\nGenre.:           Arcade/FMV\nRating:           Teen\nRequirements:     DVD Player\n\n\n\nCompressed with 7Zip, Game was tested and works.\n\n\n\nRelease Notes - This is the Standard Remastered DVD-ROM Game\n                From Digital Lesiure. This is an exact port \n                from the orginal Laser Disc Arcade Game. You \n                can play on your dvd player with remote. This\n                is also PS2 Compatible.\n\n\nGame Description:\n\nAs is the case with other American Laser Games releases, the format is from a first-person perspective of the player watching the full motion video, listening to the various characters and shooting the right enemies at the right time with a powerful Tommy gun. Most other games produced by the company - with minor exceptions such as The Last Bounty Hunter, where the player can use a shotgun for a limited amount of time - feature no more than a simple pistol, which must be used to eliminate successive foes. Also, the player narrates the story.\n\nUnlike previous games, such as Mad Dog McCree and Crime Patrol, the player's Tommy gun does not need to be reloaded, but one does need to buy extra ammunition. Also, when health is lost, the player needs to have enough money to be able to pay the city doctor to give him or her an extra life. If money runs out, the game is over. The player must also try to avoid hitting innocent bystanders, as doing so results in having to pay funeral expenses. The doctor also gives advice (usually fake) and criticizes the player's actions.\n\nAlong the way, clues have to be collected and it is them that will eventually allow the player to determine Johnny Rock's murderer. One of the final sequences takes place in Rock's mansion, where a final clue will point to the killer, who must be eliminated to end the game.\n\n\nFeatures:\n\n* First time ever released for DVD, from Digital Lesiure.\n\n* Incredible video quality.\n\n* Use your controller to aim and fire.\n\n* Real motion picture action.\n\n* Relive the Original Arcade laser disc game.\n\n-------------------------------------------------------------------------\n\n\nOnly use DVD Decrypter or Imgburn to burn with respected media.\n\nYou can also mount the Image and play on your computers\ndvd player software.\n\n\nAny questions or if this is working fine for you write a comment\nlet us know.\n\n\nPlease Support This Torrent, Seed and Enjoy!","torrent":{"xt":"urn:btih:35aa2506c846082ee6b383bfb817d71b65617234","amp;dn":"Who+Shot+Johnny+Rock%3F+%5BNTSC%5D+DVD-ROM+Game","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35aa2506c846082ee6b383bfb817d71b65617234","infoHashBuffer":{"type":"Buffer","data":[53,170,37,6,200,70,8,46,230,179,131,191,184,23,215,27,101,97,114,52]},"announce":[],"urlList":[]}}