{"title":"The Work - Wes Moore - Audiobook MP3","uid":11693681,"size":193759836,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:35be0117e249da22a2ce0cc3ef98f26b151be061&amp;dn=The+Work+-+Wes+Moore+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Squiddy82","files":7,"time":1423627548,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nThe Work: My Search for a Life That Matters\n\nWritten by: Wes Moore\nNarrated by: Wes Moore\nLength: 6 hrs and 32 mins\nUnabridged Audiobook\nRelease Date:01-13-15\n\nThe acclaimed author of The Other Wes Moore continues his inspirational quest for a meaningful life and shares the powerful lessons - about self-discovery, service, and risk-taking - that led him to a new definition of success for our times.\nThe Work is the story of how one young man traced a path through the world to find his life's purpose. Wes Moore graduated from a difficult childhood in the Bronx and Baltimore to an adult life that would find him at some of the most critical moments in our recent history: as a combat officer in Afghanistan; a White House fellow in a time of wars abroad and disasters at home; and a Wall Street banker during the financial crisis.\nIn this insightful audiobook, Moore shares the lessons he learned from people he met along the way - from the brave Afghan translator who taught him to find his fight, to the resilient young students in Katrina-ravaged Mississippi who showed him the true meaning of grit, to his late grandfather, who taught him to find grace in service.\nMoore also tells the stories of other 21st century change-makers who've inspired him in his search, from Daniel Lubetzky, the founder of KIND; to Esther Benjamin, a Sri Lankan immigrant who rose to help lead the Peace Corps. What their lives - and his own misadventures and moments of illumination - reveal is that our truest work happens when we serve others, at the intersection between our gifts and our broken world. That's where we find the work that lasts.\nAn intimate narrative about finding meaning in a volatile age, The Work will inspire readers to see how we can each find our own path to purpose and help create a better world","torrent":{"xt":"urn:btih:35be0117e249da22a2ce0cc3ef98f26b151be061","amp;dn":"The+Work+-+Wes+Moore+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35be0117e249da22a2ce0cc3ef98f26b151be061","infoHashBuffer":{"type":"Buffer","data":[53,190,1,23,226,73,218,34,162,206,12,195,239,152,242,107,21,27,224,97]},"announce":[],"urlList":[]}}