{"title":"Mr. Big - Lean Into It 1991 [FLAC] - Kitlope","uid":4925041,"size":331606138,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:36d007a406dc21f43a9a5d1224efe6982ec4152a&amp;dn=Mr.+Big+-+Lean+Into+It+1991+%5BFLAC%5D+-+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Kitlope","files":15,"time":1243810431,"description":"File Type: FLAC Compression 6\nCd recorder: Plextor PX-716SA\nCd Ripper: Exact Audio Copy V0.99 prebeta 4\nEAC Log: Yes\nEAC Cue Sheet: Yes\nTracker(s):http://tpb.tracker.thepiratebay.se:80/announce;\nTorrent Hash: 36D007A406DC21F43A9A5D1224EFE6982EC4152A\nFile Size: 316.24 Mb\nYear: 1991\nLabel: Warner / Atlantic\nCatalog #: CD 82209\n\n\nPlease help seed these FLACs! \n\n\n\n\nFrom Wiki:\n\n\nMr. Big is an internationally-acclaimed super-group that forged its place in rock history during the early 90s. The band is a quartet composed of Eric Martin (vocals), Paul Gilbert (guitar), Billy Sheehan (bass), and Pat Torpey (drums); Mr. Big also included Richie Kotzen, a reputable blues-based guitarist that replaced Paul in 1999 when Paul decided to focus on a solo career. The band is noted especially for their &quot;shred guitar&quot; musicianship, intense live performances, and well-crafted songs.[1]\n\nIdentified early on as a &quot;musicians' band&quot;, Mr. Big was able to produce numerous hit songs that ranged across a wide array of rock genres, be it ballad, heavy metal, or blues rock. Prior to the formation of the group, each of the members already had a reputation of being virtuosos as well as established song-writers/ composers.[2] Their songs were often marked with strong vocals and vocal harmonies, and a technical proficiency in all instruments. Their hits include &quot;To Be With You&quot; (Billboard Hot 100 number one single in 15 countries for weeks, in 1991), &quot;Wild World&quot;, &quot;Green-Tinted Sixties Mind&quot;, &quot;Just Take My Heart&quot;, other ballads, and a host of heavy metal songs that were played mostly during their live performances, such as &quot;Daddy, Brother, Lover, Little Boy&quot;, &quot;Addicted to that Rush&quot;, &quot;Colorado Bulldog&quot;, and &quot;Take Cover&quot;, among the rest.\n\nMr. Big's following and reputation remained strong for over two decades, despite the band being challenged by personal internal conflicts and the changing trends in mainstream music. Over the years, through the different heights of the band's career, the fan-base of the group has remained steadfast - even after the demise of the band in 2002. Fans have always asked for the band's reunion.[3]\n\nIn February 2009, as a result of fan-demand and also after several coincidences over the past couple of years that have gradually brought the group back together again, Eric, Pat, Paul, and Billy finally announced their decision to reunite. [4] This announcement was marked with celebration and excitement amongst fans all over the world, especially in Japan. The band members themselves are very happy to be together again as friends, and to perform once more for fans all over the world. Their first tour is in Japan in June 2009.\n\n\n\n\n\n\nLean Into It \n\n\nLean into It is an album by hard rock band Mr. Big, released in 1991. Known as the band's breakthrough release, it peaked at number 15 on the Billboard 200 charts, while the single &quot;To Be With You&quot; became the band's first and only song to hit number 1 on the Billboard Hot 100. The follow-up single, &quot;Just Take My Heart&quot;, was their only other Top 40 hit, peaking at number 16 on the Billboard Hot 100.\n\nThe cover image is a detail from L'accident de la gare Montparnasse (1895), Anon.\n\nThe CDFF part of the song Lucky This Time is the song Addicted To That Rush from the debut album Mr. Big played at a higher playback speed hence the CDFF for &quot;CD Fast Forward&quot;\n\n\n\nTracks: \n\n1.\t&quot;Daddy, Brother, Lover, Little Boy (The Electric Drill Song)&quot; (Sheehan/Gilbert/Pessis/Torpey/Martin ) - 3:54\n2.\t&quot;Alive and Kickin'&quot; (Gilbert/Martin/Pessis/Sheehan/Torpey) - 5:28\n3.\t&quot;Green-Tinted Sixties Mind&quot; (Gilbert) - 3:30\n4.\t&quot;CDFF-Lucky This Time&quot; (Paris) - 4:10\n5.\t&quot;Voodoo Kiss&quot; (Martin/Pessis) - 4:07\n6.\t&quot;Never Say Never&quot; (Martin/Vallance) - 3:48\n7.\t&quot;Just Take My Heart&quot; (Martin/Pessis) - 4:21\n8.\t&quot;My Kinda Woman&quot; (Gilbert/Martin/Sheehan) - 4:09\n9.\t&quot;A Little Too Loose&quot; (Gilbert) - 5:21\n10.\t&quot;Road to Ruin&quot; (Torpey/Paris/Gilbert/Sheehan) - 3:54\n11.\t&quot;To Be With You&quot; (Martin/Grahame) - 3:27\n\n\n\nEnjoy :)\n","torrent":{"xt":"urn:btih:36d007a406dc21f43a9a5d1224efe6982ec4152a","amp;dn":"Mr.+Big+-+Lean+Into+It+1991+%5BFLAC%5D+-+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36d007a406dc21f43a9a5d1224efe6982ec4152a","infoHashBuffer":{"type":"Buffer","data":[54,208,7,164,6,220,33,244,58,154,93,18,36,239,230,152,46,196,21,42]},"announce":[],"urlList":[]}}