{"title":"100 Grey Cups - This Is Our Game (2012).epub Gooner","uid":13097069,"size":31157540,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:375350cb72b6b086cd681ac29fdae212d0c6c662&amp;dn=100+Grey+Cups+-+This+Is+Our+Game+%282012%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1451142998,"description":"100 Grey Cups - This Is Our Game (2012).epub Gooner\r\n\r\nPublisher: McClelland &amp; Stewart (September 20, 2012)\r\nLanguage: English\r\nISBN-10: 0771017448\r\nISBN-13: 978-0771017445\r\n\r\nThis country and its people are made of the same hardy stuff that makes our game and our league. The Grey Cup has helped unite our country for 100 years now. And it has revealed us, built our pride and our sense of Canadianness in annual tributes to effort, sweat and toil. But what does 100 years of history and cultural relevance add up to? When we Canadians look at the Grey Cup, we see far more than a gleaming football trophy; we see a reflection of ourselves. After its first years as an amateur challenge cup, the Grey Cup would go on to be awarded to the best football team in Canada, with Western challengers traveling back east to fall at the hands of the more established Toronto teams. That is, until a group of frustrated Winnipeggers paid an enormous sum during the Depression to buy up star players and bring the cup west for the first time. Following this, the games became about the pride of the country, East versus West, the national identity fought over the gridiron, all chronicled dutifully by bestselling author Stephen Brunt. \r\n\r\nFrom the birth of the modern CFL in 1958, through the dynastic Edmonton Eskimos and into the nineties, attempted USA expansion, franchise re-birth in Montreal, 100 Grey Cups has it all: behind-the-scene anecdotes, never-before-seen photographs, and unprecedented access to the CFL archives. It is a must-have for all fans of this national tradition","torrent":{"xt":"urn:btih:375350cb72b6b086cd681ac29fdae212d0c6c662","amp;dn":"100+Grey+Cups+-+This+Is+Our+Game+%282012%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"375350cb72b6b086cd681ac29fdae212d0c6c662","infoHashBuffer":{"type":"Buffer","data":[55,83,80,203,114,182,176,134,205,104,26,194,159,218,226,18,208,198,198,98]},"announce":[],"urlList":[]}}