{"title":"Carbon Nanotubes and Nanosensors - Vibration, Buckling and Balis","uid":15417716,"size":6365253,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3759bf161d74a7301c8938f98b3efef476aa9c49&amp;dn=Carbon+Nanotubes+and+Nanosensors+-+Vibration%2C+Buckling+and+Balis&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1469602295,"description":"Carbon Nanotubes and Nanosensors - Vibration, Buckling and Balistic Impact - Isaac Elishakoff et al. (Wiley-ISTE, 2012).pdf\r\n\r\nThe main properties that make carbon nanotubes (CNTs) a promising technology for many future applications are: extremely high strength, low mass density, linear elastic behavior, almost perfect geometrical structure, and nanometer scale structure. Also, CNTs can conduct electricity better than copper and transmit heat better than diamonds. Therefore, they are bound to find a wide, and possibly revolutionary use in all fields of engineering.\r\nThe interest in CNTs and their potential use in a wide range of commercial applications; such as nanoelectronics, quantum wire interconnects, field emission devices, composites, chemical sensors, biosensors, detectors, etc.; have rapidly increased in the last two decades. However, the performance of any CNT-based nanostructure is dependent on the mechanical properties of constituent CNTs. Therefore, it is crucial to know the mechanical behavior of individual CNTs such as their vibration frequencies, buckling loads, and deformations under different loadings.\r\nThis title is dedicated to the vibration, buckling and impact behavior of CNTs, along with theory for carbon nanosensors, like the Bubnov-Galerkin and the Petrov-Galerkin methods, the Bresse-Timoshenko and the Donnell shell theory","torrent":{"xt":"urn:btih:3759bf161d74a7301c8938f98b3efef476aa9c49","amp;dn":"Carbon+Nanotubes+and+Nanosensors+-+Vibration%2C+Buckling+and+Balis","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3759bf161d74a7301c8938f98b3efef476aa9c49","infoHashBuffer":{"type":"Buffer","data":[55,89,191,22,29,116,167,48,28,137,56,249,139,62,254,244,118,170,156,73]},"announce":[],"urlList":[]}}