{"title":"Supergrass - In It for the Money [1997]","uid":9433215,"size":319987169,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:37fcf206a0506b4cc19aaf42d9916ac0760a5591&amp;dn=Supergrass+-+In+It+for+the+Money+%5B1997%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"GenXRock","files":-1,"time":1388843506,"description":"Review by Stephen Thomas Erlewine  [-]\nSupergrass' debut album, I Should Coco, rushed by at such a blinding speed that some listeners didn't notice the melodic complexity of its best songs. On its second album, the cleverly titled In It for the Money, Supergrass brought the songs to the forefront, slowing the tempos considerably and constructing a varied, textured album that makes the band's ambition and skill abundantly clear. From the droning mantra of the opening title track, it's clear that the band has delved deeply into psychedelia, and hints of Magical Mystery Tour are evident throughout the album, from swirling organs and gurgling wah-wahs to punchy horn charts and human beatboxes. In fact, Supergrass has substituted the punky rush of I Should Coco for such sonic details, and while that means the band only occasionally touches upon the breakneck pace of its debut (the hard-driving &quot;Richard III&quot;), it also deepens its joyful exuberance with subtle songs and remarkably accomplished musicianship. There might not be a &quot;Caught by the Fuzz&quot; or &quot;Alright&quot; on In It for the Money, but that's not a problem, since the bright explosion of &quot;Sun Hits the Sky&quot; and the nervy &quot;Tonight&quot; are just as energetic, and the album features introspective numbers like the gorgeous &quot;Late in the Day&quot; and &quot;It's Not Me&quot; that give it substantial weight. And even with all this musical maturity, Supergrass hasn't sacrificed its good-natured humor, as the detailed production and the bizarre closer, &quot;Sometimes I Make You Sad,&quot; make abundantly clear. Sometimes, maturity turns out to be everything it's supposed to be. (4.5/5)","torrent":{"xt":"urn:btih:37fcf206a0506b4cc19aaf42d9916ac0760a5591","amp;dn":"Supergrass+-+In+It+for+the+Money+%5B1997%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37fcf206a0506b4cc19aaf42d9916ac0760a5591","infoHashBuffer":{"type":"Buffer","data":[55,252,242,6,160,80,107,76,193,154,175,66,217,145,106,192,118,10,85,145]},"announce":[],"urlList":[]}}