{"title":"Rival Schools - Found (2013) [MP3 320]","uid":8379006,"size":97057384,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:393d581c9cd3d83da2cea869ffab100c5d59b2a8&amp;dn=Rival+Schools+-+Found+%282013%29+%5BMP3+320%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"politux","files":-1,"time":1366072552,"description":"\n  Rival Schools - Found (2013) [MP3 320]\n \n  Released: 2013\n  Genre: Pop/Rock\n  Style: Alternative, Post-Hardcore, Indie Rock\n  Codec: MP3\n  Bit Rate: 320 CBR\n\n  01 Dreamlife Avenger \n  02 Reaching Out \n  03 Indisposable Heroes \n  04 Paranoid Detectives \n  05 On The Fray \n  06 The Soft Skin \n  07 Tell It All to Me \n  08 Missing Glider \n  09 Big Waves \n  10 Sofia Loren \n  11 Why Can't I Touch It\n  \n  After the band made it big with United by Fate, Rival Schools were hit by two big blows. First guitarist Ian Love left, then after replacing him and spending a year recording songs for their second album, they were faced with the classic &quot;we don't hear a single....keep trying or else&quot; line from the A&amp;R people at Island. Before they could be dropped, Walter Schreifels left the band and it was all over for them. While the songs from those sessions leaked out in one form or another, it wasn't until 2013 (with the band re-formed and releasing new music) that the record saw official release as Found. The record shows that the band was beginning to move away from the pummeling metallic core of its sound on United and into something more subtle and melodic. \n\n  This is probably what scared off the A&amp;R flunkies at Island, who surely wanted to hear United by Fate again. Instead, they heard a band stripping back the guitar attack in favor of more angular, Fugazi-inspired riffing, songs that bore traces of time spent listening to shoegaze, and most of all a more melodic songwriting and vocal approach from Schreifels. His singing is more nuanced and at times even a little sensitive, which isn't to say it wasn't powerful. Because it was. And so was the music. There are songs here that hit just as hard as anything on United, songs that have huge hooks and probably wouldn't have stormed the charts exactly, but would have made Rival Schools fans pretty happy. Basically what the release of Found all these years later proves is that those A&amp;R guys were completely wrong, and their meddling killed off a band that was on a path to become great. You can't turn the clock back and change what might have been, but at least now you can hear what almost was.","torrent":{"xt":"urn:btih:393d581c9cd3d83da2cea869ffab100c5d59b2a8","amp;dn":"Rival+Schools+-+Found+%282013%29+%5BMP3+320%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"393d581c9cd3d83da2cea869ffab100c5d59b2a8","infoHashBuffer":{"type":"Buffer","data":[57,61,88,28,156,211,216,61,162,206,168,105,255,171,16,12,93,89,178,168]},"announce":[],"urlList":[]}}