{"title":"Bandulet - The Secret Knowledge of Gold Investors (2007)","uid":7017352,"size":5390572,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:39f60d4845c6651a150e41b415cebe3d5090909e&amp;dn=Bandulet+-+The+Secret+Knowledge+of+Gold+Investors+%282007%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"red_gonzo","files":1,"time":1328708993,"description":"For english-only speaking:\nThis book is in german language. English title would be: The Secret Knowledge of Gold Investors (2007). Bruno Bandulet, an insider of gold markets, writes the story of money and power. Written for gold investors that either already have or would like to have gold and would like to know all the important things about it. At the same time the author connects the dots between currencies and financial systems with plenty of behind-the-scenes stories about money and gold. For many gold is a mystery but for Bandulet it's his home. 280 pages.\n\nFur Deutschsprachige:\nDas geheime Wissen der Goldanleger ist mehr als ein Buch ÃƒÂ¼ber die ÃƒÂ¤lteste und sicherste Anlage der Welt: ein spannender Wirtschaftskrimi, eine Schilderung des DreiecksverhÃƒÂ¤ltnisses zwischen Dollar, Gold und Euro, eine Geschichte ÃƒÂ¼ber Geld und Macht und eine kritische Analyse unseres Papiergeldsystems und seiner Risiken. Das Buch wurde geschrieben fÃƒÂ¼r Anleger, die schon Gold besitzen und alles Wichtige ÃƒÂ¼ber das geheimnisvolle Metall wissen wollen - und fÃƒÂ¼r solche, die schon einmal daran gedacht haben, in Gold zu investieren, aber bisher zÃƒÂ¶gerten. Zugleich wendet sich das Buch an Leser, die sich von den ZusammenhÃƒÂ¤ngen des globalen Finanzkapitalismus faszinieren lassen, die sich um die Zukunft unseres WÃƒÂ¤hrungssystems sorgen und Rat suchen, wie sie ihr VermÃƒÂ¶gen durch schwierige Zeiten retten und krisenfest machen kÃƒÂ¶nnen. Jenseits der Tagesnachrichten erfahren Sie Unbekanntes, wenig Bekanntes und HintergrÃƒÂ¼nde aus der Welt von Gold und Geld. Und Sie profitieren von der Erfahrung und dem Insider-Wissen eines Autors, der seit drei Jahrzehnten auf den Edelmetall- und DevisenmÃƒÂ¤rkten zu Hause ist. 280 Seiten.\n","torrent":{"xt":"urn:btih:39f60d4845c6651a150e41b415cebe3d5090909e","amp;dn":"Bandulet+-+The+Secret+Knowledge+of+Gold+Investors+%282007%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39f60d4845c6651a150e41b415cebe3d5090909e","infoHashBuffer":{"type":"Buffer","data":[57,246,13,72,69,198,101,26,21,14,65,180,21,206,190,61,80,144,144,158]},"announce":[],"urlList":[]}}