{"title":"Zac Brown Band &amp; Alan Jackson-As She's Walking Away(2nafish)","uid":5875075,"size":138278916,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:3a1f626e6fc229ab0ff7a85d526490ed544d92a6&amp;dn=Zac+Brown+Band+%26+Alan+Jackson-As+She%5C%27s+Walking+Away%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"2nafish","files":-1,"time":1286607283,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nZac Brown Band with Alan Jackson - As She's Walking Away (2nafish)\n\n\n&quot;As She's Walking Away&quot; is the title of a song performed by the Zac Brown Band, an American country music band. It features guest vocals from country singer Alan Jackson. The song is the sixth single release by the band, and the first from its album You Get What You Give.\n\nDarren Doane directed the song's music video.\n\nC.M. Wilcox of The 9513 gave the song a thumbs-up, praising the song's &quot;driving, organic arrangement&quot; as well as the interplay between Brown and Jackson. On the AOL Radio Blog, Amar Toor also described Brown's and Jackson's vocals favorably.\n\nThe song is the first release from the band's album You Get What You Give, which was released on September 21. John Driskell Hopkins, who plays bass guitar in the band, suggested that Jackson be included as a duet partner on it, because he thought that &quot;it would get a great, different kind of fan base for us.&quot; Both Zac Brown Band and Jackson are produced by Keith Stegall. On August 24, 2010, an exclusive CD single was released at Target featuring &quot;As She's Walking Away&quot; along with the studio version of &quot;Colder Weather&quot; for the first time.\n\nYou Get What You Give is the second major-label studio album by the Zac Brown Band. It was released on September 21, 2010. The album's titles comes from a line in the song &quot;Martin&quot;.\n\nZac Brown wrote or co-wrote all songs on the album. The tracks &quot;Let It Go,&quot; &quot;Who Knows,&quot; &quot;Whiskey's Gone,&quot; &quot;Colder Weather,&quot; and &quot;Make This Day&quot; were previously live versions on their album Pass the Jar. The live versions of &quot;Let It Go&quot; and &quot;Martin&quot; were previously bonus tracks on the deluxe edition of their album The Foundation. The live version of &quot;Whiskey's Gone&quot; also appeared on the soundtrack to True Blood, in 2008. &quot;As She's Walking Away&quot; and &quot;Knee Deep&quot; contain guest vocals from Alan Jackson and Jimmy Buffett respectively.\n\nZac Brown Band is an American country music band based in Atlanta, Georgia. The lineup consists of Zac Brown (lead vocals, guitar), Jimmy De Martini (fiddle, vocals), John Driskell Hopkins (bass guitar, vocals), Coy Bowles (guitar, keyboards), Chris Fryar (drums) and Clay Cook (guitar, keyboards, mandolin, steel guitar, vocals). The band has toured throughout the United States, including a slot on the 2009 and 2010 Bonnaroo Music Festival. They have also recorded four studio albums, and charted four Number One singles on the Billboard country charts: &quot;Chicken Fried&quot;, &quot;Toes&quot;, &quot;Highway 20 Ride&quot;, and &quot;Free,&quot; in addition to the single &quot;Whatever It Is,&quot; which peaked at No. 2 on the same chart.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:3a1f626e6fc229ab0ff7a85d526490ed544d92a6","amp;dn":"Zac+Brown+Band+%26+Alan+Jackson-As+She%5C%27s+Walking+Away%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a1f626e6fc229ab0ff7a85d526490ed544d92a6","infoHashBuffer":{"type":"Buffer","data":[58,31,98,110,111,194,41,171,15,247,168,93,82,100,144,237,84,77,146,166]},"announce":[],"urlList":[]}}