{"title":"Kate Mosse - I Codici Del Labirinto [LIT ITA] TNT Village","uid":6187374,"size":659975,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3aaeae11b8307e9b5be465d4c6d0596d53889229&amp;dn=Kate+Mosse+-+I+Codici+Del+Labirinto+%5BLIT+ITA%5D+TNT+Village&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"l.diliberto","files":1,"time":1298156160,"description":"Kate Mosse - I Codici Del Labirinto [LIT ITA] TNT Village\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=52904&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=52904&lt;/a&gt;\n\n.: Trama :.\n\nQuando Alice Tanner scopre due scheletri durante uno scavo archeologico nel sud della Francia, sente riemergere con forza un passato di violenza e di brutalitÃƒÂ . Non ÃƒÂ¨ solo la vista delle ossa perfettamente conservate a farla rabbrividire, ma la percezione di un elemento di mistero, di un'incombente sensazione di pericolo da cui fatica a liberarsi. Turbata dalle parole e dai simboli incisi nelle pareti della grotta, Alice ha il presentimento di aver riportato alla luce qualcosa che doveva restare nascosto per sempre.\nOtto secoli prima, mentre in Linguadoca si era appena scatenata la crociata contro i Catari, la giovane Alais riceve dal padre, perchÃƒÂ© lo metta in salvo, uno dei tre libri che compongono i Codici del Labirinto, fondamento della dottrina catara, che lui stesso aveva riportato dalla Terra Santa dopo la prima crociata. Anche se non riesce a decifrare i simboli che il libro contiene, Alais sa che il suo destino ÃƒÂ¨ quello di proteggerne il segreto a tutti i costi.\nTre libri smarriti, due donne, un segreto racchiuso in un labirinto, una storia sul Graal ambientata fra i paesaggi senza tempo della Francia sud-occidentale. \n\n.: Cover :.\n &lt;a href=&quot;\nhttp://www.bookrepublic.it/static/covers/r_medium/9788858500019.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bookrepublic.it/static/covers/r_medium/9788858500019.jpg&lt;/a&gt;\n\n.: Biografia dell'autore :.\n\nKate Mosse, scrittrice inglese dalle lontanissime origini francesi. E proprio la Francia ÃƒÂ¨ diventata la sua patria d'adozione da quando, sedici anni fa, Kate e la sua famiglia hanno scoperto la Languedoc, terra di bellezze paesaggistiche e misteri, di eresie, sole, nuvole e montagne.\nNulla di strano, quindi, se la scrittrice ambienta il suo primo romanzo pubblicato in Italia (ma ne aveva scritti precedentemente altri quattro, di vario genere), nel sudovest della Francia.\nI codici del labirinto ci racconta la storia di Alice ed Alais, due donne separate da ottocento anni di storia, ma legate da un mistero: segni, simboli, un codice segreto; sullo sfondo, l'epopea dei Catari (o albigesi), setta medievale accusata di eresia e perseguitata, cancellata dalla storia. L'ennesimo thriller esoterico, sÃƒÂ¬, ma declinato al femminile; e, come ci racconta la scrittrice, c'ÃƒÂ¨ la volontÃƒÂ  di dare voce a una cultura dimenticata, che avrebbe potuto rendere diversa anche la &quot;nostra&quot; Europa.","torrent":{"xt":"urn:btih:3aaeae11b8307e9b5be465d4c6d0596d53889229","amp;dn":"Kate+Mosse+-+I+Codici+Del+Labirinto+%5BLIT+ITA%5D+TNT+Village","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3aaeae11b8307e9b5be465d4c6d0596d53889229","infoHashBuffer":{"type":"Buffer","data":[58,174,174,17,184,48,126,155,91,228,101,212,198,208,89,109,83,136,146,41]},"announce":[],"urlList":[]}}