{"title":"Innovations in Swarm  Intelligence","uid":6525053,"size":7017485,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3ad52433c32fb3f1039efd5f5ff0578817931bc5&amp;dn=Innovations+in+Swarm++Intelligence&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"_F1_","files":-1,"time":1310130315,"description":"Chee Peng Lim, Lakhmi C. Jain, Satchidananda Dehuri, &quot;Innovations in Swarm Intelligence (Studies in Computational Intelligence, Volume 248)&quot;\n Publisher: Springer | ISBN 10: 3642042244 | 2009 | PDF | 256 pages | 8.4 MB\n\n Over the past two decades, swarm intelligence has emerged as a powerful approach to solving optimization as well as other complex problems. Swarm intelligence models are inspired by social behaviours of simple agents interacting among themselves as well as with the environment, e.g., flocking of birds, schooling of fish, foraging of bees and ants. The collective behaviours that emerge out of the interactions at the colony level are useful in achieving complex goals.\n\n The main aim of this research book is to present a sample of recent innovations and advances in techniques and applications of swarm intelligence. Among the topics covered in this book include: particle swarm optimization and hybrid methods, ant colony optimization and hybrid methods, bee colony optimization, glowworm swarm optimization, and complex social swarms, application of various swarm intelligence models to operational planning of energy plants, modeling and control of nanorobots, classification of documents, identification of disease biomarkers, and prediction of gene signals.","torrent":{"xt":"urn:btih:3ad52433c32fb3f1039efd5f5ff0578817931bc5","amp;dn":"Innovations+in+Swarm++Intelligence","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ad52433c32fb3f1039efd5f5ff0578817931bc5","infoHashBuffer":{"type":"Buffer","data":[58,213,36,51,195,47,179,241,3,158,253,95,95,240,87,136,23,147,27,197]},"announce":[],"urlList":[]}}