{"title":"Japan 1941 Countdown To Infamy (2013) By Eri Hotta (epub,mobi,az","uid":9556099,"size":15758886,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3af67cd1ff27ea522318d47f7e8a4d86615921f2&amp;dn=Japan+1941+Countdown+To+Infamy+%282013%29+By+Eri+Hotta+%28epub%2Cmobi%2Caz&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"GoonerTPB","files":3,"time":1391362398,"description":"Format: mobi/epub/azw3\nLength: 352 pages\nGenre: History\nDate: 29 October 2013\n\nA groundbreaking history that considers the attack on Pearl Harbor from the Japanese perspective and is certain to revolutionize how we think of the war in the Pacific. \n\nWhen Japan launched hostilities against the United States in 1941, argues Eri Hotta, its leaders, in large part, understood they were entering a war they were almost certain to lose. Drawing on material little known to Western readers, and barely explored in depth in Japan itself, Hotta poses an essential question: Why did these men-military men, civilian politicians, diplomats, the emperor - put their country and its citizens so unnecessarily in harm's way? \n\nIntroducing us to the doubters, schemers, and would-be patriots who led their nation into this conflagration, Hotta brilliantly shows us a Japan rarely glimpsed - eager to avoid war but fraught with tensions with the West, blinded by reckless militarism couched in traditional notions of pride and honor, tempted by the gambler's dream of scoring the biggest win against impossible odds and nearly escaping disaster before it finally proved inevitable.\n\nThis compelling reassessment will forever change the way we remember those days of infamy.\n\nAuthor:\n\nEri Hotta, born in Tokyo and educated in Japan, the United States, and the United Kingdom, has taught at Oxford and at the Hebrew University in Jerusalem, specializing in international relations. She was also a research fellow at the National Graduate Institute for Policy Studies in Tokyo. Ms. Hotta lives in New York.","torrent":{"xt":"urn:btih:3af67cd1ff27ea522318d47f7e8a4d86615921f2","amp;dn":"Japan+1941+Countdown+To+Infamy+%282013%29+By+Eri+Hotta+%28epub%2Cmobi%2Caz","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3af67cd1ff27ea522318d47f7e8a4d86615921f2","infoHashBuffer":{"type":"Buffer","data":[58,246,124,209,255,39,234,82,35,24,212,127,126,138,77,134,97,89,33,242]},"announce":[],"urlList":[]}}