{"title":"Smart Card Handbook","uid":9614465,"size":25263975,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3afe01b5e826ec48841ed6247237946b2e0901b9&amp;dn=Smart+Card+Handbook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"iv0live","files":-1,"time":1392393902,"description":"Smart Card Handbook, 4th Edition\n\nWolfgang Rankl, Wolfgang Effing\nWiley\n2010\nPDF\n\n\nThe most comprehensive book on state-of-the-art smart card technology available\n\nUpdated with new international standards and specifications, this essential fourth edition now covers all aspects of smart card in a completely revised structure. Its enlarged coverage now includes smart cards for passports and ID cards, health care cards, smart cards for public transport, and Java Card 3.0.\n\nNew sub-chapters cover near field communication (NFC), single wire protocol (SWP), and multi megabyte smart cards (microcontroller with NAND-Flash). There are also extensive revisions to chapters on smart card production, the security of smart cards (including coverage of new attacks and protection methods), and contactless card data transmission (ISO/IEC 10536, ISO/IEC 14443, ISO/IEC 15693).\n\nThis edition also features:\n\n    -additional views to the future development of smart cards, such as USB, MMU, SWP, HCI, Flash memory and their usage;\n    -new internet technologies for smart cards; smart card web server, HTTP-Protocol, TCP/IP, SSL/TSL;\n    -integration of the new flash-based microcontrollers for smart cards (until now the usual ROM-based microcontrollers), and;\n    -a completely revised glossary with explanations of all important smart card subjects (600 glossary terms).\n\nSmart Card Handbook is firmly established as the definitive reference to every aspect of smart card technology, proving an invaluable resource for security systems development engineers. Professionals and microchip designers working in the smart card industry will continue to benefit from this essential guide. This book is also ideal for newcomers to the field.","torrent":{"xt":"urn:btih:3afe01b5e826ec48841ed6247237946b2e0901b9","amp;dn":"Smart+Card+Handbook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3afe01b5e826ec48841ed6247237946b2e0901b9","infoHashBuffer":{"type":"Buffer","data":[58,254,1,181,232,38,236,72,132,30,214,36,114,55,148,107,46,9,1,185]},"announce":[],"urlList":[]}}