{"title":"20130321-Stossel-[Back to College].Fox Business.CF.avi","uid":8289398,"size":278701922,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3beae90c4fd509aee564771ae7f6c26ecf126b0c&amp;dn=20130321-Stossel-%5BBack+to+College%5D.Fox+Business.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"skJGZV6z","files":-1,"time":1364006149,"description":"----------\n\nSTOSSEL - [Back to College] - Fox Business Network\n2013, March 21, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\nTonight, students from around the world at the &quot;Students for Liberty&quot; conference discuss liberty, and specific issues that affect students.\n\nMany say they benefited from internships---but Ross Perlin, the author of &quot;Intern Nation,&quot; says &quot;unpaid internships are a form of mass exploitation.&quot; Obama's Labor Dept takes his side, and I say, that's absurd. Terry Michael, who works to find students internships in DC, explains why internships are a great way to get experience.\n\nPoliticians like Governor Chris Christie say, &quot;We need to...get you to college and get you graduated from college&quot; --- but why? A third of college graduates now work at jobs that only require a high school degree. 16% of bartenders have college degrees. Dale Stephens' founded uncollege.org. He offers students ways to get ahead...without college.\n\nThen, Bob Dane, from The Federation for American Immigration Reform (FAIR) and economist Veronique de Rugy debate immigration. Dane worries that more people will move to the U.S. - just to freeload. But De Rugy says it should be easier for immigrants to come to America.\n\nJohn Mackey, the author of &quot;Conscious Capitalism&quot; and co-founder of Whole Foods, says business is &quot;the most powerful system for social cooperation.&quot; He says business is noble and people need to understand that.\n\nFinally, we talk to students about drugs and alcohol. They say regulations don't work---they have no problem buying booze or weed. So why the rules? Our special correspondent, Kennedy, says one reason they persist is because the young people are less likely to vote.","torrent":{"xt":"urn:btih:3beae90c4fd509aee564771ae7f6c26ecf126b0c","amp;dn":"20130321-Stossel-%5BBack+to+College%5D.Fox+Business.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3beae90c4fd509aee564771ae7f6c26ecf126b0c","infoHashBuffer":{"type":"Buffer","data":[59,234,233,12,79,213,9,174,229,100,119,26,231,246,194,110,207,18,107,12]},"announce":[],"urlList":[]}}