{"title":"Zomerhitte (2008) Dutch Nederlands Xvid","uid":4094567,"size":725407315,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3c687b16ebddcded070a95bbf718ad6eb6ee8caf&amp;dn=Zomerhitte+%282008%29+Dutch+Nederlands+Xvid&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"classpool","files":2,"time":1206238630,"description":"Zomerhitte (2008) Dutch Nederlands Xvid\n\nPitch:\nRomantisch drama naar het boek van Jan Wolkers over een fotograaf die tijdens een broeierige zomer op Texel in de ban raakt van een beeldschone vrouw.\n\nPlot:\nTijdens een broeierige zomer op Texel ontmoet fotograaf Bob (Waldemar Torenstra) de beeldschone geschiedenisstudente Kathleen (Sophie Hilbrand), die een zomerbaantje heeft in de disco. \nOok maakt Bob kennis met Federici, die net als hij onder de indruk is van de mooie Kathleen. \nIn de daaropvolgende dagen ontstaat er een geheimzinnige band tussen de twee mannen. \nBob raakt in de ban van Kathleen en volgt nauwgezet haar ontmoetingen met een oudere man, die bekend staat als De Mummy en die niet helemaal betrouwbaar lijkt. \nWanneer Bob met de hulp van Federici de raadsels rond De Mummy en Kathleen ontrafelen, stuiten ze op een levensgevaarlijk en ingewikkeld complot. \nIs de prille liefde tussen Bob en Kathleen hier tegen bestand ?\n\nPlus:\nHet romantische Nederlandse drama &amp;#039;Zomerhitte&amp;#039; is gebaseerd op het gelijknamige boekenweekgeschenk van schrijver Jan Wolkers (&quot;Turks Fruit&quot;). \nActrice Monique van de Ven nam de regie voor haar rekening en haar man, acteur Edwin de Vries, bewerkte het boek tot een filmscript, wat hij eerder deed voor films als &amp;#039;Left Luggage&amp;#039; en &amp;#039;The Discovery of Heaven&amp;#039;. \nDe hoofdrollen worden gespeeld door tv-presentatrice Sophie Hilbrand (&quot;Spuiten en slikken&quot;) en haar vriend Waldemar Torenstra, onder meer bekend van de serie &quot;De band&quot;. \nAndere rollen zijn voor Johan Leysen, Cees Geel, Jelka van Houten, Jeroen Willems en Jochum ten Haaf.\n\nDit is een NL gesproken film van KNaL !!! \n\nHet is duidelijk CAM audio, en ook de video source is CAM !!\n\nHet is de Xvid-uitvoering, de dvd-uitvoering vind ik zelf niet echt interresant omdat bij een cam de kwaliteit van de dvd-versie niet beter is.\nDat komt nog wel bij latere versies maar voor zo snel vind ik het een hele mooie kwaliteit :-) \n","torrent":{"xt":"urn:btih:3c687b16ebddcded070a95bbf718ad6eb6ee8caf","amp;dn":"Zomerhitte+%282008%29+Dutch+Nederlands+Xvid","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c687b16ebddcded070a95bbf718ad6eb6ee8caf","infoHashBuffer":{"type":"Buffer","data":[60,104,123,22,235,221,205,237,7,10,149,187,247,24,173,110,182,238,140,175]},"announce":[],"urlList":[]}}