{"title":"Buddhism of the Monks and Nuns - The Vinaya","uid":6482566,"size":1236418,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3c81da225dcc4abc202955d819aeb18a56a7a562&amp;dn=Buddhism+of+the+Monks+and+Nuns+-+The+Vinaya&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"timnehguy","files":23,"time":1308584602,"description":"The Vinaya is the code of rules for the Buddhist monastic community, or sangha. The teachings of the Buddha (Buddhadharma) can be divided into two broad categories: &quot;Dharma&quot; or doctrine, and &quot;Vinaya,&quot; or discipline.  \n\nOf course, originally, the monastic community pretty much was the Buddhist community.  Only in modern times has the word &quot;sangha&quot; been used in reference to a community of lay people (more or less like a congregation).\n\nAs the sangha became bigger, it became necessary to have rules.  Initially these were flexible, adapted to the situation. By the time of the Buddha's death there would have been a body of rules monastics were expected to follow. \n\nIn his last teaching, the Buddha tells the monastics that they can abandon some minor rules, but that they should stick to the major ones, but there appears to have been some confusion over which was which. It was therefore decided that they would keep all of the rules. \n\nThat has, of course, let to problems, as Buddhism has spread far beyond its area or origin.  A particular problem, for instance, is caused by the Vinaya's rules about clothing, because there are now Buddhist monks living in regions with much colder climates.  Another problem involves the prohibition of any intoxicants, which, most strictly interpreted, could prohibit everything from cough sirup and melatonin to antidepressants and tranquilizers.\n\nThis is the Theravada Vinaya.  There are other Vinayas for the monastics of the Mahayana and Tibetan traditions. \n\nThis version of the Vinaya is in twenty-two .txt documents. \n\nPlease seed, and please check my torrents for other collections of Buddhist texts.\n","torrent":{"xt":"urn:btih:3c81da225dcc4abc202955d819aeb18a56a7a562","amp;dn":"Buddhism+of+the+Monks+and+Nuns+-+The+Vinaya","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c81da225dcc4abc202955d819aeb18a56a7a562","infoHashBuffer":{"type":"Buffer","data":[60,129,218,34,93,204,74,188,32,41,85,216,25,174,177,138,86,167,165,98]},"announce":[],"urlList":[]}}