{"title":"Bridge Construction Set PC Game","uid":3962488,"size":20334304,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3ca25839fa83ca9ad5841e50fc23c688c0af15e5&amp;dn=Bridge+Construction+Set+PC+Game&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"depiratenbaai","files":1,"time":1199541246,"description":"Bridge Construction Set is about building a bridge that doesn\\&amp;#039;t break, although watching your bridge creation break and plunge a train into the watery depths below can be half the fun. In Bridge Construction Set you design and build bridges and then stress test them to see how your creations hold up under pressure. When test vehicles pass over your bridge and make it safely across you know you\\&amp;#039;ve succeeded. If they plummet into the river you know you need to go back to the drawing board.\n\nThe robust physics deployed in Bridge Construction Set let you build a unlimited variety of bridges. Try your hand at giant suspension bridges, complex drawbridges, multi-level train and automobile bridges and everything in between. The 3D graphics allow you to view your bridge from any angle including a first person view - it\\&amp;#039;s like being strapped to the front of the train when your bridge is first tested...\n\nBridge Construction Set includes many types of bridge building levels in varying degrees of difficulty from simple to complex with a tutorial to get you started building bridges. A Level Editor is also included so you can create your own levels and trade them with others.","torrent":{"xt":"urn:btih:3ca25839fa83ca9ad5841e50fc23c688c0af15e5","amp;dn":"Bridge+Construction+Set+PC+Game","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ca25839fa83ca9ad5841e50fc23c688c0af15e5","infoHashBuffer":{"type":"Buffer","data":[60,162,88,57,250,131,202,154,213,132,30,80,252,35,198,136,192,175,21,229]},"announce":[],"urlList":[]}}