{"title":"Several well known Solaris and RedHat study guides","uid":3460227,"size":27278160,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3cca1cfd33e36b76fb1d7a40bf8448682031a3b2&amp;dn=Several+well+known+Solaris+and+RedHat+study+guides&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"glebk9","files":4,"time":1142890892,"description":"- Solaris 10 System Administration Exam Prep By Bill Calkins \nThe Solaris 10 System Administrator Certification Exam Prep 2 is the ideal book for both new and seasoned system administrators. This book will give you the insight you need into the newest certification exams for system administrators, the 310-200 and the 310-202. It offers classroom-style training by one of the best and well-known authors in the Solaris world, Bill Calkins.\n- SOLARIS INTERNALS\n  Core Kernel Components\n  Jim Mauro and Richard McDougall\nThis book is about the internals of Sun?s Solaris Operating Environment. The\nrapid growth of Solaris has created a large number of users, software developers,\nsystems administrators, performance analysts, and other members of the technical\ncommunity, all of whom require in-depth knowledge about the environment in\nwhich they work.\n- RHCE Red Hat Certified Engineer Linux Study Guide (Exam RH302), Fourth Edition by Michael Jang \nThis comprehensive, hands-on study guide gives you complete coverage of all objectives for the Red Hat Certified Linux Engineer exam (RH302), hundreds of review questions, and hands-on lab exercises.\n- Red Hat: The Complete Reference Enterprise Linux &amp; Fedora Edition: The Complete Reference by Richard L. Petersen\nUse this comprehensive guide to maximize the powerful capabilities of Red Hat Enterprise and Fedora Linux. Coverage includes Bluecurve, KDE, GNOME, deploying and managing servers and users, the 2.6 kernel, system and network security, and more.\n  \n","torrent":{"xt":"urn:btih:3cca1cfd33e36b76fb1d7a40bf8448682031a3b2","amp;dn":"Several+well+known+Solaris+and+RedHat+study+guides","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3cca1cfd33e36b76fb1d7a40bf8448682031a3b2","infoHashBuffer":{"type":"Buffer","data":[60,202,28,253,51,227,107,118,251,29,122,64,191,132,72,104,32,49,163,178]},"announce":[],"urlList":[]}}