{"title":"Fitness MILFs (2013) [DvdRip].mp4","uid":9337202,"size":1760556060,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:3d09a1b5c87c2ff08ecd65991e1e67b5e944c43e&amp;dn=Fitness+MILFs+%282013%29+%5BDvdRip%5D.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"FluxXxu","files":1,"time":1386873832,"description":"\nFitness MILFs (2013) [DvdRip].mp4\n\n\nPosters and Screenshots\n &lt;a href=&quot;\nhttp://postimg.net/viewerr1.php?file=21997023044829442532.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.net/viewerr1.php?file=21997023044829442532.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://postimg.net/viewerr1.php?file=80592437900788052854.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.net/viewerr1.php?file=80592437900788052854.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://postimg.net/viewerr1.php?file=49226964633872560300.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.net/viewerr1.php?file=49226964633872560300.jpg&lt;/a&gt;\n\n\nCast\n\nAlana Evans, Anthony Rosano, Austin Taylor, Kendra Lust, Maya Hills, Mellanie Monroe \n\n\nDescription\n\n&quot;I've shot more than 200 porno movies in my career and if there is one thing I've learned along the way, it's to listen closely to what the fans want. And I'm here to report that the fans have spoken again. Due to popular demand, I have completed my very first MILF niche DVD, and I've titled it 'Fitness MILFs.'\nMy vision for this was simple. It seems like the new normal is seeing these insanely hot, mature women walking the streets in their skin-tight, workout attire, pushing their baby strollers or just jogging through the neighborhood with their big titties bouncing and their big booties shaking. There's nothing sexier than a beautiful MILF with camel-toe creeping through her crotch if you know what I mean. So without further delay, I present to you 'Fitness MILFS,' and I guarantee these moms love to fuck.\nThe bubbly, blond Austin Taylor makes some free time to be alone with her hubby and reminds him of how she became a MILF by taking him down memory lane. She starts to refresh his memory by squatting on his face and making him munch her dripping, wet pussy. Then Austin deep-throats his cock until there are tears rolling down her cheeks. Of course after that she insists on mounting his shaft, riding it and making that thick booty shake before taking a hot load on her big booty and tight pussy.\nSuper MILF Kendra Lust has been stalking Mellanie Monroe on Twitter. Kendra wants to eat Mellanie's pussy so badly that she asked me to film them together in a girl/girl scene. So they meet for the first time on camera and immediately get into the spread-eagle position, taking turns licking and fingering each other's MILF holes. Then Mellanie shows Kendra her specialty position called the scissors, where both MILFs lock their legs for some pussy-to-pussy grinding action. But wait, there's more. You didn't really think I'd let them get away without taking some cock, did you? Alex Gonz walks onto the set and shows them his hefty meat, and both of them take turns licking, sucking and gagging on it. Alex stacks Kendra and Mellanie's big asses on top of each other and alternates his deep thrusts in their sloppy holes. Finally, their pussies are too much for his cock and he shoots his man sauce into their MILF mouths.\nI first filmed Maya Hills when she was 18 years old, and then I filmed her again when she was in her early 20's. Now Maya has returned to porn again, but this time as an official MILF. Everyone loves a comeback, right? Maya tells us that when she first returned as a MILF she did not like being labeled as such, but over time she has accepted the title. Maya has a new set of boobs, and I mean big, soft mommy boobs that only add to her slutty sexual prowess. Like fine wine, Maya has gotten better with age. That's evident after watching some of her new cock sucking and fucking talents. Maya decides that being a mommy is so much fun she wants her porn stud to blow his load inside her pussy for a MILF cream pie.\nAlana Evans is no stranger to squeezing the cum out of several porn cocks at the same time. In fact, she has been getting ass-fucked on film for 14 years. I was there in the early days of her career, personally drilling her perfect round, deep and tight asshole. Alana is now in mega MILF status and still has the big, round booty in the back. But now Alana also has big set of mommy boobs to add to her porn whore arsenal. Alana takes on an industry pro and a new male performer for some two-on-one, anal action and begs for a double facial. &quot;\n\n\nTags \n\nHardcore, XxX, Hot, Facial, Blowjob, MILF, Anal, Threesome\n\n\nResolution  \n\n720x404\n\n\nDuration  \n\t\n03:28:41\n\n\nSize      \n\n1.64 GB\n\n\n\n","torrent":{"xt":"urn:btih:3d09a1b5c87c2ff08ecd65991e1e67b5e944c43e","amp;dn":"Fitness+MILFs+%282013%29+%5BDvdRip%5D.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d09a1b5c87c2ff08ecd65991e1e67b5e944c43e","infoHashBuffer":{"type":"Buffer","data":[61,9,161,181,200,124,47,240,142,205,101,153,30,30,103,181,233,68,196,62]},"announce":[],"urlList":[]}}