{"title":"Angry.Birds.Star.Wars.No-Patch-Needed.Cracked-ALI213","uid":7806074,"size":60707302,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3dbb16d30deac4f5d5d679df80be394ae186c260&amp;dn=Angry.Birds.Star.Wars.No-Patch-Needed.Cracked-ALI213&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":".BONE.","files":1,"time":1352403666,"description":"Angry Birds Star Wars Cracked-ALI213\n\nA long time ago in a galaxy far, far away... a group of desperate rebel birds faced off against a galactic menace: the Empires evil Pigtroopers Rebel birds, striking from a hidden base, have won their first victory against the evil Imperial Pigs. During the battle, Rebel spies managed to steal secret plans to the Empires ultimate weapon, the PIG STAR, and are racing to deliver the plans to the Rebel Birds. Now they need your help Join an epic adventure with the Angry Birds in the legendary Star Wars universe Use the Force, wield your lightsaber, and blast away Pigtroopers on an intergalactic journey from the deserts of Tatooine to the depths of the Pig Star -- where youll face off against the terrifying Darth Vader, Dark Lord of the Pigs Can you become a Jedi Master and restore freedom to the galaxy? Time to grab your lightsaber and join the adventure May the birds be with you\n\nHOURS AND HOURS OF ENGAGING GAMEPLAY - Explore more than 80 levels in iconic locations like Tatooine and the Pig Star. Can you dodge Imperial pigs, laser turrets, Tusken Raider pigs, and the dark side of the Force to get all three stars?\n\nNEW GAMEPLAY MECHANICS - Use lightsabers, Blasters and Jedi powers to wreak havoc on the Imperial Pigs\n\nLEVEL UP YOUR BIRDS - Keep playing and level up your birds to improve their skills\n\nSECRETS AND HIDDEN GOODIES - Can you unlock all the R2-D2 and C-3PO bonus levels? May the birds be with you!\n\n\nOS Windows XP SP2/Vista/7 CPU 1.0GHz RAM 512MB Hard Drive 60MB Graphics Any OpenGL 1.3 compatible device Internet connection required for activation and updates\n\nINSTALL NOTES\n\n1. Unrar to whatever directory you want\n2. Click to play\n\nIn-Game Notes\n\n1. Click FULL ACTIVATION\n2. Register with key provided","torrent":{"xt":"urn:btih:3dbb16d30deac4f5d5d679df80be394ae186c260","amp;dn":"Angry.Birds.Star.Wars.No-Patch-Needed.Cracked-ALI213","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3dbb16d30deac4f5d5d679df80be394ae186c260","infoHashBuffer":{"type":"Buffer","data":[61,187,22,211,13,234,196,245,213,214,121,223,128,190,57,74,225,134,194,96]},"announce":[],"urlList":[]}}