{"title":"Various - 2013 - Piratebay Christian Music Mixtape, Vol 2","uid":9164902,"size":173979735,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3df043aef2d94b4c8efcaa9f29e61d8ff3e52f71&amp;dn=Various+-+2013+-+Piratebay+Christian+Music+Mixtape%2C+Vol+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"TorrentTracts","files":-1,"time":1383952357,"description":"-----------------------------------------------------------------------\nVarious - 2013 - Piratebay Christian Music Mixtape, Vol 2\n-----------------------------------------------------------------------\n\n01 - Hold Me Jesus - Rich Mullins\n02 - Everybody Praise The Lord - Lincoln Brewster\n03 - DC-10 - Audio Adrenaline\n04 - Everybody Wants to Go to Heaven - Larry Howard\n05 - Born Again - Sherwin Gardner\n06 - At the Sound - Kingdom\n07 - Go Off - KB\n08 - Step By Step - The Insyderz\n09 - Blessed Assurance - Ricky Skaggs\n10 - Forgiven And Loved - Jimmy Needham\n11 - Breathe - Marie Barnett\n12 - Take Me Away - 4th Avenue Jones\n13 - Trading My Sorrows - Darrell Evans\n14 - Lay 'Em Down - Needtobreathe\n15 - Amazing Grace - Rhema Blues Band\n16 - Down The River To Pray - Alison Krauss\n17 - Let's Come Together - Kevin LeVar\n18 - Saved By Grace - Israel Houghton\n19 - The Old Rugged Cross - Go Fish\n20 - Stickz N Stonez - AzarelStar\n21 - Let's Go - KJ-52\n22 - Victory In Jesus - Bart Millard\n23 - Word Of God Speak - MercyMe\n24 - John The Revelator - Brixtonboogie\n25 - Rain Down - B Reith\n26 - Redeemer - Nicole C Mullen\n27 - In Christ Alone - Owl City\n28 - There Is A Way - NewWorldSon\n29 - Name Droppin' - T-Bone\n30 - Walk With Me Jesus - Darrell Mansfield\n\nI've long believed that in Christian Music, the lyrical message has always been far more important to me than the instrumental presentation of the song.  And if we're listening to a song merely for it's catchy beat, then we, as Christian Believers, are really missing out on the intended opportunity to praise God almighty through that song.  True, some people value the musical presentation far greater than the Biblical message within.  But that's just never been my thing.  I'd rather listen to crappy music that is spiritually motivated and sung from the heart, no matter how raw it sounds, rather than mainstream so-called &quot;Christian Music&quot; that is just a breath away from being secular.  And written for all of the wrong reasons.\n\nIf any of you have Sirius XM satellite radio, and listen to the Christian channel, you'll know what a &quot;changing track&quot; is.  For those of you without satellite radio, a changing track is a song that has, in some way, changed a person's life.  I've always sort of chuckled at that.  God changes people's lives.  God inspires.  God motivates.  God cleans us up.  God gives us purpose.  God.  God.  God.  Music doesn't do any of that.  Music just leaves us with an emotion.\n\nYet I know what they're getting at with these changing tracks.  And I know the music is sometimes just an introduction for the listener to pick up his/her Bible.  So in a similar way, whenever I hear a song that speaks to me through scripture which I might be currently studying, or if I feel a connection in some way to the song, I write down its name.  And I try to find the time to go back and listen to those songs a second and third time, in hopes of seeing where their Biblical motivation is derived from.\n\nSometimes these songs become favorites of mine.  Performers like Rich Mullins, Darrell Mansfield, NewWorldSon, etc.  Sometimes the mood passes, and I don't listen to the songs again.  But just the same, with all of that said, here is a collection of 30 &quot;changing tracks&quot; of my own.  Songs that spoke to me the first time I heard them.  Songs you might not ever hear on the radio.  Maybe even by Artists you haven't heard before.  But if just 1 of these 30 songs introduces you to a new Christian Music performer, than Vol 2 of this mixtape will have been worth the effort.\n\nGlory To God,\nTorrentTracts - November 2013","torrent":{"xt":"urn:btih:3df043aef2d94b4c8efcaa9f29e61d8ff3e52f71","amp;dn":"Various+-+2013+-+Piratebay+Christian+Music+Mixtape%2C+Vol+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3df043aef2d94b4c8efcaa9f29e61d8ff3e52f71","infoHashBuffer":{"type":"Buffer","data":[61,240,67,174,242,217,75,76,142,252,170,159,41,230,29,143,243,229,47,113]},"announce":[],"urlList":[]}}