{"title":"Zoo.Quest.w.David.Attenborough--BBC-1955-1961-w.subs-468p","uid":13639301,"size":4261028247,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3dfd734752a6607d4751fb95b9cd47bbec103ea6&amp;dn=Zoo.Quest.w.David.Attenborough--BBC-1955-1961-w.subs-468p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"uggauga","files":24,"time":1456116196,"description":"\nZoo Quest\r\n\r\nDavid Attenborough and a team from London Zoo travel in search of exotic animals.\r\nTheir aim is to capture them and bring them back to the UK for exhibit in the zoo.\r\n\r\nBBC (1955 - 1961) - 12 Episodes\r\n \nhttp://www.bbc.co.uk/programmes/p00db1jf\r\n_______________________________________\r\n\r\n832x468 resolution\r\n\r\nVideo Codec h.264\r\nAudio Codec AAC\r\n\r\nWith subtitles - enjoy !!\r\n_______________________________________\r\n\r\nZoo Quest for a Dragon - 6 Episodes\r\nSix-part series in which David Attenborough searches for the Komodo dragon.\r\nDavid Attenborough and cameraman Charles Lagus begin their quest in Borneo, the first in the chain of islands they must cross in order to reach Komodo. There they trek through jungle to a village belonging to the Dayak tribe, where they are given a warm welcome.\r\nThe Zoo Quest team are hoping to find an orangutan and, with guidance from the Dayaks, they discover and film one in the wild. However, it is an orphaned orangutan held captive by a hunter that Attenborough falls for in the end.\r\n\r\nZoo Quest to Madagascar - 5 Episodes\r\nFirst transmitted in 1961, this series captures the four months David Attenborough, cameraman Geoffrey Mulligan and Malagasy ornithologist Georges Randrianasolo spent travelling several thousand miles throughout the island of Madagascar.\r\nThey set out to meet the people of Madagascar and study their local customs as well as film some of the remarkable animals which occur nowhere else in the world.\r\nStarting in the south of Madagascar, David Attenborough hopes to find an Aepyornis egg. The Aepyornis, or elephant bird, may have given rise to the legend of the gigantic bird known as the rukh or roc. Attenborough reconstructs an Aepyornis egg from fragments, and also sees tortoises and sifakas.\r\n\r\nZoo Quest to West Africa\r\nFirst transmitted in 1955, David Attenborough chronicles events during a sponsored nature expedition on tour of West Africa.In September 1954 David Attenborough, cameraman Charles Lagus, Jack Lester and Alf Woods, both from the Zoological Society of London, set out for Sierra Leone. They spent three months intently surveying the landscapes of Sierra Leone in search of nature’s rarest animals. Although predominantly searching for Picathartes gymnocephalus (the White-necked Rockfowl) they hoped to take back to London a representative collection of the whole of animal life in this part of Africa","torrent":{"xt":"urn:btih:3dfd734752a6607d4751fb95b9cd47bbec103ea6","amp;dn":"Zoo.Quest.w.David.Attenborough--BBC-1955-1961-w.subs-468p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3dfd734752a6607d4751fb95b9cd47bbec103ea6","infoHashBuffer":{"type":"Buffer","data":[61,253,115,71,82,166,96,125,71,81,251,149,185,205,71,187,236,16,62,166]},"announce":[],"urlList":[]}}