{"title":"Atlantic City (1980 Malle-Lancaster-Sarandon).avi","uid":4013954,"size":807950336,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3ec7ff4174c9e90679e5ca1dda46a0a4d3421fbb&amp;dn=Atlantic+City+%281980+Malle-Lancaster-Sarandon%29.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"gromit1948","files":1,"time":1202246820,"description":"&amp;#039;Atlantic City&amp;#039; Notes\n---------------------\n\nThis is an AVI ripped version of the larger VOB format torrent: http://thepiratebay.se/tor/3733997/Atlantic_City\n\nVideo: 592 x 336 pixels\n       25 fps\n       132 kbps\n       12 sample rate\n       XVID compression\n\nAudio: 256 kbps\n\nIMDB: http://www.imdb.com/title/tt0080388/\n\nfrom Wikipedia: http://en.wikipedia.org/wiki/Atlantic_City_(film)\n\nAtlantic City is a film directed by Louis Malle. Filmed in late 1979, it was released in France and Germany in 1980 and in the United States in 1981. The script was written by John Guare. It stars Burt Lancaster, Susan Sarandon, Kate Reid, Robert Joy, Hollis McClaren, Michel Piccoli, and Al Waxman.\n\nThe film tells the story of a Canadian woman, Sally Matthews (Sarandon), who has come to Atlantic City to pursue a better life in the gambling business. She lands a job in the Oyster Bar at the newly-opened Resorts International Casino, and studies to be a blackjack dealer. Her ex-husband Dave has followed her to Atlantic City, along with Sally&amp;#039;s flower child sister Chrissie (who is pregnant with Dave&amp;#039;s child). He is in town to sell drugs that he stole from a couple of Philadelphia gangsters. Horrified to see them or to even be associated with them due to Dave&amp;#039;s criminal past, which cost her a chance to obtain employment in Las Vegas, Sally reluctantly puts them up for the evening.\n\nLiving next door to Sally is Lou Pasco (Lancaster), an aging numbers runner who is left with the responsibility of caring for Grace (Kate Reid), the widow of his old boss, gangster Cookie Pinza. Lou is a romantic who lives in the past of Atlantic City&amp;#039;s glory days as a premiere ocean resort. He likes to think that he was a tough gangster, yet for the most part Lou was an errand boy, a numbers runner for the mob, and never really mattered in the world of organized crime that infiltrated Atlantic City. Grace is a miserable woman who breaks Lou down every chance she gets, but Lou is dependent on her for his livelihood, especially since the recently legalized gambling is pushing the illegal numbers rackets to the margins. His mundane life consists of taking care of Grace&amp;#039;s needs and wandering through the poorest Atlantic City neighborhoods, trying to drum up any business for his local bookie, Fred.\n\n","torrent":{"xt":"urn:btih:3ec7ff4174c9e90679e5ca1dda46a0a4d3421fbb","amp;dn":"Atlantic+City+%281980+Malle-Lancaster-Sarandon%29.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ec7ff4174c9e90679e5ca1dda46a0a4d3421fbb","infoHashBuffer":{"type":"Buffer","data":[62,199,255,65,116,201,233,6,121,229,202,29,218,70,160,164,211,66,31,187]},"announce":[],"urlList":[]}}