{"title":"Anal Hook For Asian Maket Meat","uid":14826351,"size":400167897,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:3ece893635040751658cde617b391b3abf244332&amp;dn=Anal+Hook+For+Asian+Maket+Meat&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"sarah.jensen","files":1,"time":1465300568,"description":"I saw a girl being fucked up against the wall down a dark ally way, some slim girl taking it from behind while standing up, and some big fat greasy foreigner giving it to her. So I walked up close. The guy fucking her could not care less if I saw. And the girl saw me too, and grinned, while he slammed into her. It was Wanton. Nothing too dirty for Wanton. I left them to it. Ten minutes later in the street, Wanton rushed up to me, grabbed my arm and said hello. I looked at her, her slim tight leggings smeared with grease, and she smelled like stale sex. He was not the first guy to have fucked you today was he, I asked. No, she said, I have had a few. She did not ask if I wanted to fuck her too, she just held onto my arm, till we got back to my apartment. Then I showed her the meat hook. She knew what to do with it. She enjoyed it in her ass while I was fucking her cunt and mouth. Still, I had to take it out to fuck her bum. No lubrication needed for anal sex with Wanton. Her sphincter is always open, and all you need do is spit in it. She really has an incredible fit figure and a dirty slut face. And she fucks anyone, does not care who, but prefers dirty sex, public sex and anal sex. Fuck her once you pay a lot, fuck her twice and she is cheaper. Fuck her often and introduce new customers and she does not even expect money. You need not expect her to remember your name. Just remember when your cock is up one of her delightful fuck passages, plenty of other guys have also shoved the cocks and tongues up there. Fuck her, fuck her on a bus. She has done that before. Don't put her down for being a slut, you don't even know the half of it. Watch the high definition meat hook on this greasy video","torrent":{"xt":"urn:btih:3ece893635040751658cde617b391b3abf244332","amp;dn":"Anal+Hook+For+Asian+Maket+Meat","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ece893635040751658cde617b391b3abf244332","infoHashBuffer":{"type":"Buffer","data":[62,206,137,54,53,4,7,81,101,140,222,97,123,57,27,58,191,36,67,50]},"announce":[],"urlList":[]}}