{"title":"Resource Tuner 2.04","uid":12246408,"size":4927747,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3f4553e1d5dd88ea47570cd44fb3f8ca827390ab&amp;dn=Resource+Tuner+2.04&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ZarkBit","files":1,"time":1439919154,"description":"Resource Tuner 2.04 - Visual Resource Editor\n\n1. Install Resource Tuner\n2. Copy the patch to the installed folder\n3. Apply patch\n\nResource Tuner lets anyone view, edit, extract, and replace strings, bitmaps, logos and icons... All that make up the visual part of your Windows program.\n\nIn fact, it allows you to view and edit almost any aspect of a compiled Windows program, from the menus to the dialog boxes to the icons and beyond. Resource Tuner offers exciting possibilities even if you aren't a programmer. It's perfect for translators, tweakers, and anyone else who wants a different look and feel for an application.\n\n\nWith Resource Tuner You Can\n\nHave a fast Resource Viewer to browse resources of all types\nRebrand your applications by replacing icons and logos\nCustomize GUI elements of your favorite Windows programs\nTranslate third-party applications\nScan the directories and drives on your computer for hidden resources\nExtract images, icons, sounds, animations\nMake legacy applications use the new look of Windows XP, Vista, 7 and 8\nTell Windows to run your application with administrative privileges\nOpen UPX-compressed files seamlessly in Resource Editor, without long\nworkarounds\n\n\nDiscover the unique features of this Resource Editor, including how to open problem executable files and edit the hidden data which the other editors simply cannot see, wide range of resource types, UPX unpacker, and more. You will learn the industry standard program for translating and customizing the user interface","torrent":{"xt":"urn:btih:3f4553e1d5dd88ea47570cd44fb3f8ca827390ab","amp;dn":"Resource+Tuner+2.04","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f4553e1d5dd88ea47570cd44fb3f8ca827390ab","infoHashBuffer":{"type":"Buffer","data":[63,69,83,225,213,221,136,234,71,87,12,212,79,179,248,202,130,115,144,171]},"announce":[],"urlList":[]}}