{"title":"The Judgment Seat Of Christ - Dr. Peter S. Ruckman","uid":10345837,"size":287273,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3fb074c872aa52e0c97478ce8ed48b6ac3da9f7c&amp;dn=The+Judgment+Seat+Of+Christ+-+Dr.+Peter+S.+Ruckman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"starxteel","files":2,"time":1402601685,"description":"According to the Scriptures, every believer in Jesus Christ is headed for the Judgment Seat of Christ. In this booklet, Dr. Ruckman tells you exactly what the Christian faces at that judgment and the rewards he will receive from his Lord for faithful service. This should provide wonderful motivation from the word of God for the believer to live for his Saviour.\n\nAbout the author:\nDr. Peter S. Ruckman received his Bachelor of Arts degree from the University of Alabama and finished his formal education with six years of training at Bob Jones University (four full years and two accelerated summer sessions), completing requirements for the Master of Arts and Doctor of Philosophy degree.\nReading at a rate of seven hundred words per minute, Dr. Ruckman had managed to read about 6,500 books before receiving his doctorate, and he still reads an average of a book each day.\nDr. Ruckman stands for the absolute authority of the Authorized Version and offers no apology to any recognized scholar anywhere for his stand. In addition to preaching the gospel and teaching the Bible, Dr. Ruckman has produced a comprehensive collection of apologetic and polemic literature and resources supporting the authority of the Authorized Version of the Holy Scriptures.\n","torrent":{"xt":"urn:btih:3fb074c872aa52e0c97478ce8ed48b6ac3da9f7c","amp;dn":"The+Judgment+Seat+Of+Christ+-+Dr.+Peter+S.+Ruckman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3fb074c872aa52e0c97478ce8ed48b6ac3da9f7c","infoHashBuffer":{"type":"Buffer","data":[63,176,116,200,114,170,82,224,201,116,120,206,142,212,139,106,195,218,159,124]},"announce":[],"urlList":[]}}