{"title":"Plastilina Mosh - Pervert Pop Song","uid":5158783,"size":147279876,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:3fce5c99065c0f223136dc7c15ff0ff3c739e359&amp;dn=Plastilina+Mosh+-+Pervert+Pop+Song&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"2nafish","files":-1,"time":1258014930,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video is in Spanish.\n\n\nAll U Need Is Mosh is an album released by Plastilina Mosh on August 5 2008.\n\nThe reviews of the album were generally positive, including a four star rating by Tijana Ilich from About.com, who liked the fusion of different styles including rap, pop, punk, dance and metal.\n\nPlastilina Mosh is a Mexican alternative rock group from Monterrey, MÃƒÂ©xico. JonÃƒÂ¡s is the lead singer and guitar player. Alejandro Rosso is more involved with the creative process, providing most of the instrumentation and occasional background vocals.\n\nAs of 2008 they have released four studio records. The band has achieved, since the release of their 1997 single-debut 'NiÃƒÂ±o Bomba', both critical and commercial success. The group often mixes several music styles like rap, dance and rock while often switching between English, Spanish and several other languages in the same song.\n\nThe band was formed in 1996 by JonÃƒÂ¡s Gonzalez and Alejandro Rosso. They met in Monterrey while playing Super Nintendo at a Wal-Mart.\n\nTheir previous musical experiences were very opposite: GonzÃƒÂ¡lez came from a thrash-metal band called Koervoz de Malta, and Rosso from an avant-garde group called Acarnienses. Jonas liked Sepultura, Soda Stereo, and Mano Negra; whereas Rosso liked Antonio Carlos Jobim, John Coltrane and a varied assortment of classical music.\n\nBack in early 1997, Plastilina traveled to Mexico City, where they recorded the video and the single of NiÃƒÂ±o Bomba, released under the independent label TÃƒÂ³mbola! Recordings, which sold 5000 copies. Then, they started to get attention from the public and the press with their performances. Shortly thereafter, the video started being played on music video channels and radio stations.\n\nThey received nominations for Best New Artist in many local awards, and then, the American MTV played their video, making them one of the first rock en espaÃƒÂ±ol bands video to make a crossover.\n\nOn their first visit to Los Angeles, they got the attention of producers like Money Mark (Beastie Boys), The Dust Brothers and Butthole Surfers. As a result, they began to record a complete album.\n\nThe recording was an extravagant and complex experience. It was recorded in three stages, each in a different city. The first one was in Los Angeles, with Sukia, a group that had worked previously with the Dust Brothers. From these sessions came the tracks Aquamosh and Monster Truck. The second session was with Jason Roberts, (producer of Cypress Hill's songs). Here, their most famous song: Mr. P. Mosh was recorded. The third one was with the Mexican group CafÃƒÂ© Tacuba. The production was completed in Arcata, California, with Tom Rothrock and Rob Schnapf.\n\nAquamosh was finally released in 1998. The first single promoted was Mr. P. Mosh, and it became their most famous song. The '70s actress Lyn May appeared in the video and it peaked at number #1 on the Latin MTV. Other singles promoted were Afroman and Monster Truck. It was recognized as the Record of the Year in Mexico and many other countries, selling 150,000 copies.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:3fce5c99065c0f223136dc7c15ff0ff3c739e359","amp;dn":"Plastilina+Mosh+-+Pervert+Pop+Song","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3fce5c99065c0f223136dc7c15ff0ff3c739e359","infoHashBuffer":{"type":"Buffer","data":[63,206,92,153,6,92,15,34,49,54,220,124,21,255,15,243,199,57,227,89]},"announce":[],"urlList":[]}}