{"title":"August 1914 - Aleksandr Solzhenitsyn","uid":8758914,"size":9617053,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3fdc4cd48464fb66739301ec6c7c7f3e99c8ee60&amp;dn=August+1914+-+Aleksandr+Solzhenitsyn&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Enkhsaikhan","files":-1,"time":1375206407,"description":"The plot primarily follows Colonel Vorotyntsev, a General Staff officer sent by the Grand Duke's (supreme commander, Russian Army) headquarters to the Russian Second Army invading East Prussia under command of General Alexander Samsonov. Vorotyntsev has been sent to find out exactly what is happening with the Second Army; a second General Staff colonel has been sent to the First Army with the same mission. Distances were so great, communications so poor, and the Russian Army so badly prepared for war, Voroyntsev was sent to find out all he could about conditions at the front and then report back to the Grand Duke. By August 26, the opening day of the 4-day Battle of Tannenberg, Vorotyntsev comes to realize that he cannot return to his headquarters in time to make any difference in the outcome of the battle, and stays with the Second Army to help out where he is able to. Numerous side plots involving other characters, both on the battlefield and elsewhere, fill out this great historical novel. The unprepared army's failures mirror those of the Tsarist regime. A famous episode in the earlier version of the novel narrates the state of mind and suicide of General Samsonov, the Russian commander.","torrent":{"xt":"urn:btih:3fdc4cd48464fb66739301ec6c7c7f3e99c8ee60","amp;dn":"August+1914+-+Aleksandr+Solzhenitsyn","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3fdc4cd48464fb66739301ec6c7c7f3e99c8ee60","infoHashBuffer":{"type":"Buffer","data":[63,220,76,212,132,100,251,102,115,147,1,236,108,124,127,62,153,200,238,96]},"announce":[],"urlList":[]}}