{"title":"Warbird Tech Complete Series","uid":7954540,"size":3150059301,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3ff81ea80479bcc7dbcabeea9be14e1e98c2c0b4&amp;dn=Warbird+Tech+Complete+Series+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"theaviator69","files":45,"time":1356374760,"description":"Warbird Tech is a series of books designed for the layman, looking at various military aircraft from a technical point of view. Special emphasis is placed on the design and performance aspects of the aircraft and detailed technical specifications are included. Relatively little space is devoted to operational or combat use of the subject aircraft. However, much use is made of excerpts from official technical manuals for the aircraft.\n\nThe text is written in a clear and informative manner. The history of the aircraft is described with a strong emphasis on the technical aspects. Modifications, variants and experimental prototypes are well covered. Aircraft systems, the cockpit or crew positions, the undercarriage, engines, weapons etc. are fully described and illustrated.\n\nEach book is generously illustrated with black and white photographs and line drawings of each variant. Also included are cutaways, exploded views and technical-manual drawings. The photographs are not just of in-service aircraft, but also include aircraft on the production line, and during depot-level repair, revealing the internal structure of the aircraft.\n\n\nReq: \n\nFamous Russian Aircraft Tupolev Tu-95/Tu-142.\n\nFamous Russian Aircraft MiG-15.\n\n\nMerry Xmas everyone :)","torrent":{"xt":"urn:btih:3ff81ea80479bcc7dbcabeea9be14e1e98c2c0b4","amp;dn":"Warbird+Tech+Complete+Series+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ff81ea80479bcc7dbcabeea9be14e1e98c2c0b4","infoHashBuffer":{"type":"Buffer","data":[63,248,30,168,4,121,188,199,219,202,190,234,155,225,78,30,152,194,192,180]},"announce":[],"urlList":[]}}