{"title":"eXXXtreme_Unusual(Lesbian-Mature-BigTit-Milk-Toys-Fists-Shifter)","uid":3575417,"size":635696790,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:402350f99b7d3227e28a8d7d40491eb5c761938a&amp;dn=eXXXtreme_Unusual%28Lesbian-Mature-BigTit-Milk-Toys-Fists-Shifter%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"usrxxx","files":8,"time":1165934771,"description":"Update 2009-04-03 Screenshots/Synopsis/Review:  &lt;a href=&quot;\nhttp://www.motherless.com/74C9E4&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.motherless.com/74C9E4&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.motherless.com/74C9E4?full&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.motherless.com/74C9E4?full&lt;/a&gt;\n\n\nScreenshots also Included in the torrent.\n\neXXXtreme_Unusual(Lesbian-Mature-BigTit-Milk-Toys-Fists-Shifter)Fetish\nContents: Three Video Clips\nTotal File Size: 603 MB\nDuration: 01:40:00 (approx)\nLanguage: English (All)\n\nFtv Girl Violet On A Stick shift\nFile Name: 01-Ftv_girl-Violet_on_Stickshift.avi\nFile Size: 24 MB \nResolution: 352x256\nDuration: 00:05:03\nScreens/Synopsis/Review: userx\nFtv girl Violet, and her camera man, find a bit of off-road seclusion where she can perform the interesting and unusual  task of abusing their vehicle, by impaling herself on the the console stick shift, quite possibly voiding the warranty in the process. She's already learned to drive a stick, now she wants to learn to ride one. Giggling the whole time as she does, she manages to polish this one-lucky-shifter to a fine glossy glaze, with her pretty little girl's, gooey, fuck-hole-shellac.\nWarning: For those tempted to try this at home. Power-shifting immediately following an activity such as this, is NOT recommended. You might well bloody your knuckles on the dash-board, when your hand slips off, as your shoving it into third gear. You will want to clean and dry the stick thoroughly FIRST! Or, get her to finish the job by giving it an appropriate head-job too.\n\nDenni-O-Amazing Penetrations 10\nFile Name: 02-Denni_O_Presents_Amazing_Penetrations_10.AVI\nFile Size: 524 MB\nResolution: 640x480\nDuration: 01:10:41\nScreens/Synopsis/Review: userx\nWhile not meaning to slight Ftv girl -Violet's Stick-Shift exploits in any way. Alysha of Amazing Penetrations 10's pussy, would have no problem hiding the Hurst (T-handle) shifter in the (Classic) Corvette I used to own. With plenty of room left over for the jack, a set of jumper cables, the spare tire, a car cover, and a flowery bouquet of a dozen or so (lighted!) road-flares shoved in at the edges, just to add some dainty feminine charm, and a festive dazzle to the whole spectacle.\n\nNot a lot of what could be called particularly provocative or sexy about this very clinical, matter-of-fact (Dr. Ruth, on the joys of Big--Vagina's) style of adult video. Alysha does seem to cum a couple of quick times on a massive black rubber horse-cock (see screens) that Denni-O manages to shove into her while they are engaged in a conversation lamenting the fact that the manufacturer no longer makes rubber horse-cocks of that larger size anymore, and that Alysha will just have to continue to make--do with the (currently available) smaller version she has at home. Quite possibly, they have forgone the manufacture of the massive &quot;Clydesdale&quot; line of rubber horse-cocks, to pursue making cervix stretchers, so Alysha, and others like her, after extending their cervix's out of their pussy's (see screens), would then have something/a-hole that mere mortals could make use of to fuck them. Alysha, after all, is still a fetchingly attractive, hot-looking (fuckable) babe!\n\nAlysha's pussy does apparently have its limits though. The head of the huge black dildo seen during this videos opening sequence, doesn't actually get fully into Alysha's pussy, even after much time, and many attempts by Denni-O, using all of her strength. The pussy was willing to take it, but Denni-O was too weak to get-it-done. Further, a Walmart auto-oil-change kit, a huge funnel, or even a small child's wading pool, would have been a far more appropriate method to catch-and-measure Alysha's pussy-squirt deluge, than trying to keep up with the multiple-intermittent-gushing streams by pointing a single draft-beer glass, that was hastily grabbed from behind the home bar, at her pussy. Some logical preparation and planning just might have gone a  long way here. No?\n\nAll said, however, this video was quite educational for myself, and (horrified) lady friends. We didn't know that a woman could simultaneously get fucked in her pussy, and her ass, with one dildo. No, not anything as obvious as a double-dildo. One dildo! Apparently (demonstrated on the video), she can shove a stiff dildo into her pussy, point it back toward her ass-hole, then push it, the inner wall of her vagina, and the outer wall of her colon, out of her ass-hole. Alysha doesn't do it to the point where it is protruding to any great degree, but her ass pucker (sphincter) was spread opened (easily) a couple of inches. Who knows what further kind of  Vaginal/Anal--Carnage is yet in store for Amazing Penetrations number 11? Yikes!!\n\nLesbian Trio-Huge Toys-Triple Fists-Breast Milk\nFile Name: 03-Lesbian_Trio-Huge_Toys-Triple_Fist_Breast-Milk.wmv\nFile Size: 55 MB\nResolution: 320x240\nDuration: 00:25:54\nScreens/Synopsis/Review: userx\nMore BIG Toys, and many hands make light work. In this video, a trio of attractive, shapely, and as yet unidentified ladies, ranging from mature to quite young (teenish--?? Christy Wild ??), engage in various sexual activities, using their fists, and again, various huge objects (toys). The most mature member (?? Samantha Luvcox ??) in pink, gets most of the attention. And also performs the most amazing feats of fanny stretching. She takes, and apparently, judging by her obviously powerful orgasms, enjoys these huge objects and toys in her pussy, very much. At the videos end, her pussy also manages to accommodate three full fists (nearly four). Of further noteworthy acts earlier in this video, the other mature blond in black (?? Karenxxx ??) squeezes breast-milk from her gorgeous, big firm tits...\n\nConclusion:\nAs with other EXTREME Adult videos, it's a good bet that they are all curiously interesting, and most are worth a look-see. In the end, they all invariably seem to raise more questions of incredulity (Holy--Shit!!/Why?/WTF?), than body temperatures or erections. But for some, however, this kind of adult content is their &quot;baby-bears-porridge&quot;. It's just--right...\n\nEnjoy!\n\nMember: http://bmtorrents.net\nPlease support the tracker where you got this .torrent file.\n","torrent":{"xt":"urn:btih:402350f99b7d3227e28a8d7d40491eb5c761938a","amp;dn":"eXXXtreme_Unusual%28Lesbian-Mature-BigTit-Milk-Toys-Fists-Shifter%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"402350f99b7d3227e28a8d7d40491eb5c761938a","infoHashBuffer":{"type":"Buffer","data":[64,35,80,249,155,125,50,39,226,138,141,125,64,73,30,181,199,97,147,138]},"announce":[],"urlList":[]}}