{"title":"Surfing the Menu - Next Generation (gnv64)","uid":14582398,"size":66617748,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4049125b39fb2a6626628f7fe3c948b0ca8940ec&amp;dn=Surfing+the+Menu+-+Next+Generation+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"gnv65","files":5,"time":1462888995,"description":"Surfing the Menu: Next Generation\r\nBy Dan Churchill and Hayden Quinn\r\nSimon &amp; Schuster Australia | April 2016 | ISBN 9781925368352 | ePUB | 61.8 mb\r\n\r\nEscape on an epic adventure around Australia with Dan Churchill and Hayden Quinn, as seen on ABC TV\r\nDiscover the spectacular natural diversity of the north of Australia, from Broome to Byron, with two of Australia's favourite food lovers and cooks, and enjoy 80 amazing recipes inspired by local growers and food producers.\r\nAlong with Gigi, an intrepid vintage VW Beetle, MasterChef stars Dan Churchill and Hayden Quinn travel from the west coast, to the north, and then to the east coast of Australia to explore what's cooking and the incredible produce of each spectacular region -- and being surfer dudes, to catch some waves too!\r\n\r\nIn this full colour, 240-page cooking and travel extravaganza, cook with Dan and Hayden's inspiring recipes and enjoy the colour, life and tastes that the west, north and east of our great country has to offer. From Shark Bay thorugh to Wooramel, Carnarvon, Exmouth and Broome in Western Australia, to Kununurra and Katherine in the Northern Territory, to Cairns and Townsville, The Whitsundays and Bundaberg in Queensland, and finally Noosa Toowoomba and Bryon Bay in New South Wales, their journey is showcased with stunning photography of each lush location and the mouthwatering produce and recipes they discover and cook with along the way.\r\n\r\nIn association with the ABC, the television series of Surfing the Menuwill be aired in early 2016. The first two series introduced us to Curtis Stone and Ben O’Donoghue, and now it’s time to hit the surfing trail again with a new generation of food lovers and cooks – Dan Churchill and Hayden Quinn.\r\n\r\nAbout the Authors\r\nDan Churchill is a cook, author, physical trainer, and speaker. In 2013, he appeared on MasterChef Australia, which aired in more than ninety countries. His recipes have been featured in publications worldwide, and he has appeared on several television shows.\r\nHayden Quinn is a cook, author, surfer, and presenter. As a young Sydney born surf lifeguard with an old-school passion for food, travel, and a balanced lifestyle, Hayden hit the cooking scene in 2011 on MasterChef Australia. He is the author of three books, a YouTube channel and regularly presents on television cooking programs.\r\n \nhttps://s32.postimg.org/6kgbw7q9x/Surfing_the_Menu.jpg","torrent":{"xt":"urn:btih:4049125b39fb2a6626628f7fe3c948b0ca8940ec","amp;dn":"Surfing+the+Menu+-+Next+Generation+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4049125b39fb2a6626628f7fe3c948b0ca8940ec","infoHashBuffer":{"type":"Buffer","data":[64,73,18,91,57,251,42,102,38,98,143,127,227,201,72,176,202,137,64,236]},"announce":[],"urlList":[]}}