{"title":"Curtis Harding - Soul Power (2014) 2015 _Qobuz 24-88,2","uid":11762568,"size":845586802,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:407c578643f3355114ee931f58dcd75ad72556c9&amp;dn=Curtis+Harding+-+Soul+Power+%282014%29+2015+_Qobuz+24-88%2C2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"sidmal","files":15,"time":1426627669,"description":"Curtis Harding - Soul Power (2014)\n FLAC (tracks) 24-bit/88,2 kHz | Time - 40:30 minutes | 848 MB\nStudio Master, Official Digital Download | Artwork: Front cover\n\n Curtis Harding says that soul music, and his music, speak for themselves. It's selfevident on the Atlanta artist's debut, Soul Power. The driving sound of his electrified Stratocaster, the foot-stomping backbeat and the lyrics swimming in reverb -- with something this flourishing, it's almost reductive to just dig around the roots.\n\n\nAt a time when indie-leaning music fans have discovered retro-soul and make records that capture all the sounds and practically none of the feeling of vintage R&amp;B, Curtis Harding is a breath of fresh air: an artist with a real gift for classic soul music stylings but little obvious interest in nostalgia. Harding's solo debut, Soul Power, shows the man is one of the best new R&amp;B singers extant, but even though the sound of these tunes certainly harkens back to vintage soul (mostly of the southern variety), Harding doesn't suggest he's slavishly trying to replicate the past. Instead, this music fuses the sounds of the '60s and early '70s while injecting them with an edgy energy that's solidly contemporary. Harding's phrasing is warm, flexible, and expressive without sinking into the frantic melisma that passes for R&amp;B vocalizing in the 21st century, and on these songs, he sings with the band, not over them; his interplay with the musicians is smart and full of fire, and whether the music suggests the Rolling Stones (&quot;Surf&quot;) or the Spinners (&quot;Keep on Shining&quot;), he sounds well-focused and respectful of his accompanists, who perform with a lean, determined authority on these sessions. Soul may be Harding's strong suit, but he's not afraid to rock out on &quot;The Drive&quot; and &quot;I Don't Wanna Go Home&quot; (guitars do dominate these arrangements), and the engineering and production gives these tracks a natural, spacious sound that flatters Harding and the band equally. Having worked with OutKast and Cee Lo Green, Curtis Harding knows something about soul music in the present as well as the past tense, and Soul Power is music that honors the rich traditions of classic R&amp;B while keeping its head and heart in the here and now; some folks say you can't have it both ways, but Curtis Harding is here to show that's a lie.  \n\n\nTracklist:\n\n 01 - Next Time\n 02 - Castaway\n 03 - Keep On Shining\n 04 - Freedom\n 05 - Surf\n 06 - I Don't Wanna Go Home\n 07 - Beautiful People\n 08 - The Drive\n 09 - Heaven's On The Other Side\n 10 - Drive My Car\n 11 - I Need A Friend\n 12 - Cruel World","torrent":{"xt":"urn:btih:407c578643f3355114ee931f58dcd75ad72556c9","amp;dn":"Curtis+Harding+-+Soul+Power+%282014%29+2015+_Qobuz+24-88%2C2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"407c578643f3355114ee931f58dcd75ad72556c9","infoHashBuffer":{"type":"Buffer","data":[64,124,87,134,67,243,53,81,20,238,147,31,88,220,215,90,215,37,86,201]},"announce":[],"urlList":[]}}