{"title":"Knits at Home: Rustic Designs for the Modern Nest","uid":9151360,"size":48894563,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:413cee2d1ffee6b5110e209ab36a670c9cb270d3&amp;dn=Knits+at+Home%3A+Rustic+Designs+for+the+Modern+Nest&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"KnitLady","files":-1,"time":1383698713,"description":"Dive into a must-have for handknitting and interior design enthusiasts. Makes a perfect gift, too!\nAdd personality and interest to any room with beautifully designed and handcrafted knitted pieces from Ruth Cross's Knits at Home. You'll enjoy exploring different handknit patterns--from throws to fitted covers, elegant wall hangings to floor rugs that have a beautiful, organic feel. Starting with the very basics of simple knitting and purling and progressing to add further texture and embellishment, Ruth guides you through a range of stitch patterns and techniques that can be adapted to different shapes and sizes.\n\nRuth not only offers elegant and appealing home decor projects; she also gives you the techniques to design organic and freeform home items of your own. Taking an experimental approach, Ruth combines traditional stitches with new stitches she has devised herself, with unexpected and striking results. With help from Knits at Home, you'll create completely personal pieces that will light up any room.","torrent":{"xt":"urn:btih:413cee2d1ffee6b5110e209ab36a670c9cb270d3","amp;dn":"Knits+at+Home%3A+Rustic+Designs+for+the+Modern+Nest","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"413cee2d1ffee6b5110e209ab36a670c9cb270d3","infoHashBuffer":{"type":"Buffer","data":[65,60,238,45,31,254,230,181,17,14,32,154,179,106,103,12,156,178,112,211]},"announce":[],"urlList":[]}}