{"title":"James en Suzanne Pool - Wie Financierde Hitler?","uid":7922040,"size":447257,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:41443be68140c5ccda78de14740e2ff7705ae467&amp;dn=James+en+Suzanne+Pool+-+Wie+Financierde+Hitler%3F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Stepherd","files":-1,"time":1355497387,"description":"Nieuwe en onthullende feiten over de geheime geldschieters van het Derde\nRijk\n\nOver Hitler en het nazi-tijdperk is al onnoemelijk veel geschreven, maar\naan een aspect van Hitlers activiteiten - een van de werkelijke sleutels\nvoor zijn succes - is nog weinig aandacht geschonken: hoe kwam Hitler in\nde woelige jaren na de Eerste Wereldoorlog aan de geldmiddelen die de\ngeboorte van het Derde Rijk (1933) mogelijk maakten?  Dit opzienbarende\nboek doet voor het eerst uitvoerig verslag van al die mensen - mannen en\nvrouwen, aristocraten en industrielen, arbeiders, Duitsers en\nniet-Duitsers - die het geld bijeen brachten waardoor Hitler zijn\nverderfelijke plannen in daden kon omzetten.\n\nDe geldschieters van Hitler komen uit de meest onverwachte hoeken:\njoodse zakenlieden die de illusie hadden op deze wijze enige invloed op\nde nazi's te kunnen uitoefenen; leden van een geheim Duits genootschap\ndat Hitler als politiek leider wilde lanceren; Duitse adel, verbitterd\nna het vertrek van Der Kaiser; Witrussische emigres, op de vlucht voor\nde Revolutie; captains of industry uit binnen- en buitenland die in de\nnazi leider een man zagen met wie je zaken kon doen... \n\nHitler ontving geld uit Engeland, Finland, Frankrijk, Hongarije, Italie,\nNederland (Henri Deterding van de Koninklijke Shell), Oostenrijk,\nZweden, Zwitserland en de Verenigde Staten (Henry Ford!). Al degenen die\nHitler financierden, zowel de Duitsers als de buitenlanders, zijn net zo\nverantwoordelijk voor zijn opkomst als de actieve nazi's die\nantisemitische propaganda verspreidden of de straten onveilig maakten.\nToch werden, wegens hun invloed en de macht van het geld, slechts\nweinigen van hen in Neurenberg vervolgd. Velen worden in dit boek voor\nde eerste keer aan de kaak gesteld.\n\n--\n\nVertaling van: Who financed Hitler? - New York: Dial Press, 1978. \n\nOpenOffice .odt file met de ge-ocr-de tekst.\nMoet nog verder bewerkt worden.","torrent":{"xt":"urn:btih:41443be68140c5ccda78de14740e2ff7705ae467","amp;dn":"James+en+Suzanne+Pool+-+Wie+Financierde+Hitler%3F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41443be68140c5ccda78de14740e2ff7705ae467","infoHashBuffer":{"type":"Buffer","data":[65,68,59,230,129,64,197,204,218,120,222,20,116,14,47,247,112,90,228,103]},"announce":[],"urlList":[]}}