{"title":"2009 Tour of Ireland - Stage 3 (Cycling)","uid":5069682,"size":1180203055,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4261458619293220cbb3b0e8b88a26999682d5a4&amp;dn=2009+Tour+of+Ireland+-+Stage+3+%28Cycling%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Bumpcityfunk","files":2,"time":1251244923,"description":"TV Show: Stage 3 of the 2009 Tour of Ireland\nAir Date: Sunday, August 23, 2009\nNetwork: Versus (Highlight Coverage)\nAnnouncers: Phil Liggett &amp; Paul Sherwen\nFiles: 2009 Tour of Ireland - Stage 3.mpg (1.09GB)\n\nSPECIAL NOTE: These races were not compressed. They are in their original MPEG quality. If someone wishes to compress them and upload the compressions, you are welcome to do so.\n\nSTAGE 3 DETAILS:\n[img]http://www.tourofireland.ie/images/stages/stage3.jpg[/img]\nDate: Sunday, August 23, 2009\nStart And Finish: Bantry &gt; Cork\nDistance: 185 km (114.95 Miles)\n\nStage Profile: Starting with beautiful scenery and ending with a lung-bursting city circuit. The race rolls out on Sunday morning, from the pretty market town and port of Bantry, leaving the town square named after the famous Irish revolutionary leader, Wolfe Tone.\n\nThe race heads south to Skibbereen, Rosscarberry and through the pretty town of Clonakilty before heading past the Abbey in Timoleague. Next comes Ballinspittle and onto the thriving port town of Kinsale, famous for its restaurants and fine cuisine, where the riders will contest one of the last An Post sprints in the town centre.\n\nThe race then heads north to Cork and swings around to the west of the City where the climbing begins. Those who have not ridden on the finishing circuit before will get a small taste of what is to come when they turn onto Bakers Road where Marco Pinotti (Team Columbia-HTC) launched his race winning attack in 2008 on the 23% gradient.\n\nThe route turns downhill onto Cathedral Road where the race is now on the first of three circuits which take in the famous city centre climb of St. Patrick's Hill, with the finish line on MacCurtain Street. Many riders will fancy their chances, no doubt spurred on by thousands of fans lining the route and tightly packed onto St. Patrick's Hill.","torrent":{"xt":"urn:btih:4261458619293220cbb3b0e8b88a26999682d5a4","amp;dn":"2009+Tour+of+Ireland+-+Stage+3+%28Cycling%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4261458619293220cbb3b0e8b88a26999682d5a4","infoHashBuffer":{"type":"Buffer","data":[66,97,69,134,25,41,50,32,203,179,176,232,184,138,38,153,150,130,213,164]},"announce":[],"urlList":[]}}