{"title":"Nairn.Across.Britain--BBC-1972-w.subs-468p","uid":13835621,"size":1056244888,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4278a6d64027adaa2e13afda182d2f131894733a&amp;dn=Nairn.Across.Britain--BBC-1972-w.subs-468p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"uggauga","files":6,"time":1457753304,"description":"\nBBC Four Collections - Nairn Across Britain\r\n\r\nIan Nairn travels through Britain and takes a critical look at the townscapes and landscapes in which we live\r\n\r\nBBC (1972) - 3 Episodes\r\n \nhttp://www.bbc.co.uk/programmes/p01q1km2\r\n_______________________________________\r\n\r\n832x468 resolution\r\n\r\nVideo Codec h.264\r\nAudio Codec AAC\r\n\r\nWith subtitles - enjoy !!\r\n_______________________________________\r\n\r\nFrom London to Lancashire\r\nFirst transmitted in 1972, writer and journalist Ian Nairn takes the first of three journeys north through the British Isles to look at the land we live in. Following an imaginary straight line between London and Manchester, and ignoring the motorways, Nairn finds it to be a journey of surprises.\r\nNairn bemoans the pulling down of Northampton's Emporium Arcade and decries the bleakness of the M1 motorway experience. But he is heartened by the preservation of Staunton Harold Hall and church, and by a Stockport shopping precinct.\r\n\r\nTrans-Pennine Canal\r\nFirst transmitted in 1972, Ian Nairn travels by boat along the canal across the Pennines looking at the industrial area of the North\r\nThe canal journey begins at Worsley and continues through Leigh, Wigan Chorley, Blackburn, Burnley, through the Foulridge tunnel, past Skipton, Bingley, Saltaire, and into Leeds. The canal-side towns fall under Nairn's critical eye and he asks 'why ignore the canals when they could revitalise a whole slice of the industrial North?'\r\n\r\nFrom Leeds into Scotland\r\nFirst transmitted in 1972, Ian Nairn travels by rail to complete his series of journeys, contemplating the mix of architectural triumphs and calamities as he passes dramatic landscapes and deserted stations on the way to Edinburgh.\r\nThe final journey follows the railway out of Leeds on the Settle-Carlisle rail link. Nairn branches off along the now abandoned rail route to Edinburgh to look at areas that may well have had their lifeline severed","torrent":{"xt":"urn:btih:4278a6d64027adaa2e13afda182d2f131894733a","amp;dn":"Nairn.Across.Britain--BBC-1972-w.subs-468p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4278a6d64027adaa2e13afda182d2f131894733a","infoHashBuffer":{"type":"Buffer","data":[66,120,166,214,64,39,173,170,46,19,175,218,24,45,47,19,24,148,115,58]},"announce":[],"urlList":[]}}