{"title":"Toppers in Concert 2011 - Dubbel DVD9 - Retail - DVD 1-2 TBS","uid":6844008,"size":7210086734,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:434074bfeae2d05aedd97269dad1c7c3b42c9134&amp;dn=Toppers+in+Concert+2011+-+Dubbel+DVD9+-+Retail+-+DVD+1-2+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Marjanb","files":-1,"time":1322292481,"description":"Toppers in Concert 2011 - Dubbel DVD9 - Retail - DVD 1 / 2 TBS\n\n\n\nDe langverwachte concertregistratie van Toppers in Concert 2011 ligt op 25 november a.s. in de winkel. Dit laat platenmaatschappij EMI bij monde van Managing Director Erwin Goegebeur weten. In mei van dit jaar gaven de Toppers drie totaal uitverkochte concerten in de Amsterdam ArenA. Ruim 200.000 bezoekers, volledig gekleed in het thema 'The Royal Party for Kings &amp; Queens', vierden samen het grootste meezingfeest van het jaar.\n\nOok dit jaar waren er weer fantastische gasten zoals K3, Leonie Meijer, Los Angeles The Voices, de beste zangeres van Nederland Glennis Grace en Jan Smit. De saamhorigheid van het publiek was van het begin tot het einde voelbaar en de uitzinnige reacties:X-XML: na afloop zorgde ervoor dat editie 2011 toch weer voelt als de beste editie ooit. Mooi en bijzonder was het afscheid van Gordon, die vanaf het begin in 2005 deel uit heeft gemaakt van de Toppers.\n\n'Wij zijn zo trots dat we met Toppers in Concert al 22(!) keer de Amsterdam ArenA hebben weten te vullen. Toppers in Concert is het grootste en meest succesvolle muziekevenement dat Nederland kent en daar zijn wij dan ook ons publiek enorm dankbaar voor. Vanaf 25 november kunt u dus weer genieten van die prachtige avonden in mei. Ervaar nog ÃƒÂ©ÃƒÂ©n keer Toppers in Concert 2011; 'The Royal Party for Kings &amp; Queens'. Zing lekker mee, geniet en we zien jullie graag weer terug in 2012!' aldus de Toppers.\n\nBron: Retail DVD\nGeluid: Dobly Digital 2.0 | Dolby Digital 5.1 | DTS 5.1\nCovers: Bijgesloten\n\nLet op: Dit is DVD 1 van 2 ! \n\n\n\t\nTracklist\n\t\t\nDisc 1:\n1 :Ouverture higher 2011: Wilhelmus van Nassaue - Higher - Toppers\t\n2 :Dancing queen remix 2011 - Toppers\t\n3 :Inhaken en meedeinen 2001: Een Nederlandse Amerikaan - Vino, waar blijft die wijn - The second waltz - Kleine Greetje ui - Toppers\t\n4 :Elton John medley: Sorry seems to be the hardest word - Nikita - Don't go breaking my heart - Can you feel the love toni - Toppers\t\n5 :Hits for kids medley : Op een onbewoond eiland - Ik heb zo waanzinnig gedroomd - Met z'n allen - Toppers\t\n6 :K3 medley: Mamas? - Hehe mama - Alle kleuren - Oya lele - K3\t\n7 :Los Angeles The Voices medley: Blijf veilig bij mij - Ware liefde - Jij geeft mij vleugels - L.A. The Voices\t\n8 :The voice of Paradise: Werd de tijd maar teruggedraaid - Los van de grond - Paradise by the dashboardlight - Toppers - Leonie Meijer\t\n9 :This is the moment - Toppers\t\n10 :Gerard Joling hitmedley 2011: Laat me alleen - Ik hou d'r zo van - Maak me gek - Toppers\t\n11 :Tropical hitmix: Hooray, hooray, i't's a holi-holiday - (You got to walk) don't look back - Sweat - Now that we found lo - Toppers - Danny Nicolay - Judith Peters\t\n12 :Ren? en Jeroen hitmedley: Calling out your name - Weer geloven - Crazy way about you - Een wereld - Are you ready for lo - Toppers\t\n13 :Foxtrot medley: Foxy foxtrot - Daar bij de waterkant - Zeven brieven - Ome Jan - Toppers\t\n14 :Disco medley 2011: Rock the boat - Never knew love- If you could read my lips - Que sera mi vida - Toppers\n\nEnjoy the Movie/Music\n\n************************************\n\nKom ook eens kijken :\n &lt;a href=&quot;\nhttp://www.black-sam.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.black-sam.org&lt;/a&gt;\n\nEnjoy\n\n\n*************************************\n\n","torrent":{"xt":"urn:btih:434074bfeae2d05aedd97269dad1c7c3b42c9134","amp;dn":"Toppers+in+Concert+2011+-+Dubbel+DVD9+-+Retail+-+DVD+1-2+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"434074bfeae2d05aedd97269dad1c7c3b42c9134","infoHashBuffer":{"type":"Buffer","data":[67,64,116,191,234,226,208,90,237,217,114,105,218,209,199,195,180,44,145,52]},"announce":[],"urlList":[]}}