{"title":"Drugs Collection - HC - Illegal Drugs - LSD Ecstasy and the rave","uid":7458181,"size":1656395776,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:43d0510ca1ab5157d26f33facf6cde906669e0ef&amp;dn=Drugs+Collection+-+HC+-+Illegal+Drugs+-+LSD+Ecstasy+and+the+rave&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"GRNS3","files":-1,"time":1342727412,"description":"\n\nThe Drugs Collection - a series of educative and entertaining info dvd's\n\nPlease enjoy, share with friends and seed :)\n\n\nHistory Channel - Hooked - Illegal Drugs - LSD, Ecstasy ant the raves\n\nThere has been a &quot;drug culture&quot; since the dawn of civilization. Sumerian cuneiform tablets from 3000 BC show a poppy harvest, as do ancient Egyptian scripts and Greek statues adorned with poppy crowns. Far more recently, Freud sung the praises of cocaine, which was included in the original recipe for Coca-Cola. But since the industrial revolution, drug use has changed dramatically, and society's response to this--particularly in America--has been to demonize users and make drugs illegal.\nHOOKED explores the world of illegal drugs, meeting with pharmacologists and scientists to learn exactly what effect they have on us and exploring the social and legislative changes that have transformed (and, some would argue, created) the drug culture of the 20th century. Outspoken advocates on both sides of the &quot;war on drugs&quot; illuminate this polarizing issue, and fascinating accounts and artifacts illustrate the role of drugs throughout history. \nLSD, Ecstasy and the Raves\nHow did the psychedelic drugs LSD and Ecstasy journey from a scientific discovery to a popular recreation to banned drugs? Mental health professionals once believed that LSD could treat schizophrenia or alcoholism. Meanwhile, Ecstasy, the &quot;penicillin for the soul&quot;, was used in marriage counseling. Now, continuing the cycle of the hallucinogen, some of the latest derivatives in this category of drugs, the &quot;rave&quot; drugs such as GHB and Ketamine, are about to be banned. \n\n\nCheck this account for updates regularly :)\n\nThanks to the peers all over the globe seeding in this collection.\n\n\t\t","torrent":{"xt":"urn:btih:43d0510ca1ab5157d26f33facf6cde906669e0ef","amp;dn":"Drugs+Collection+-+HC+-+Illegal+Drugs+-+LSD+Ecstasy+and+the+rave","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43d0510ca1ab5157d26f33facf6cde906669e0ef","infoHashBuffer":{"type":"Buffer","data":[67,208,81,12,161,171,81,87,210,111,51,250,207,108,222,144,102,105,224,239]},"announce":[],"urlList":[]}}