{"title":"CPUID HWMonitor Pro v1 22 Incl Keymaker-CORE","uid":11712369,"size":1532842,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:44484682a88855c045b28596a406847ad8b936b1&amp;dn=CPUID+HWMonitor+Pro+v1+22+Incl+Keymaker-CORE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"jibbajabbax","files":3,"time":1424386279,"description":"t h e c r a c k e r s o f [rAD!s]\n\np r e s e n t t h e 3 0 k - c o l l e c t i o n\n\nCPUID HWMonitor Pro v1.22 *INCL.KEYMAKER*\n\nCracked by: KaiZer SoZe Release-Name: CR-JAAA8.ZIP\nSupplied: CORE Release-Date: 2015/02/18\nPackaged: Neurotika Release-Type: Util\nProtection: Serial OS: Windows\nCrack/SN: Keymaker Language: English\nRating: [You decide!] Disks: 1\n: DESCRiPTiON: HWMonitor Pro is a simple, yet powerful hardware monitoring\nsoftware solution that displays in the main window the system\ntemperature, voltage, fan speed and many other important factors\nand variables of your computer\n\nBecause of its expanded tree view, you can easily monitor each\nparameter. For example, you have the possibility to view and track\nthe CPU core temperatures, while analyzing other details such as\nthe assembly temperatures of the main hard drive\n\nOne special feature that makes the application to get outside the\nbox is the ability to add monitored values to the system tray\nwhich can be performed from the right-click menu. Therefore, each\ntime a value will change, you will surely get notified\n\nWhat's more interesting about HWMonitor Pro is that you can easily\nconnect to a specific IP address or another network through a\nsimple TCP / IP connection, so you can watch the sensors of one or\nseveral distant computers\n\nHWMonitor Pro comes with a user-friendly interface and enables you\nto automatically create graphs for each logged session and save\nthem as bitmap files, as well as to save the monitoring and the\nSMBus data\n\nThe application handles the most common sensor chips and tracks\nonly the components that have compatible sensors, depending on\nyour brand and model of motherboard, processor, keyboard etc\n\nIn addition, it can read modern CPU core thermal sensors and\naccess the main health sensors on your system\n\nAs it would be expected from this utility, it uses few resources\nso it doesn't burden the overall performance of the computer, nor\ninterfere with other programs' functionality\n\nAll things considered, HWMonitor Pro provides users with the\nability of monitoring remote machines with ease, as well as to\nanalyze system temperature, voltage and fan speed variables: iNSTALL/REGiSTER NOTES: Use our keymaker to register the application\n\nThanks for choosing\n(C)hallenge (O)f (R)everse (E)ngineering!: CORE NEWS AND iNFOS: We are hiring! Contact us if you are a supplier/cracker\n\n&quot;CORE - elite but boring!&quot;\n\nlAYOUt &amp; hEADER bY. [rAD!s]\nnfO UPdATED ON [2014/12/06]\n(c) C.O.R.E. 2 0 1 5\n\n------------\n\nit's a keygen, so it'll get some hits on AV software.  most will say stuff like 'crack, 'keygen', 'possible malware'.  ikarus is my favorite with 'not-a-virus.Keygen.CPUID'. \n\nanyway, if it bothers you, run it in a sandbox.  sandboxie.com","torrent":{"xt":"urn:btih:44484682a88855c045b28596a406847ad8b936b1","amp;dn":"CPUID+HWMonitor+Pro+v1+22+Incl+Keymaker-CORE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44484682a88855c045b28596a406847ad8b936b1","infoHashBuffer":{"type":"Buffer","data":[68,72,70,130,168,136,85,192,69,178,133,150,164,6,132,122,216,185,54,177]},"announce":[],"urlList":[]}}