{"title":"California Dreamin' Jazz Exotica - Impulse Records","uid":8884838,"size":183436256,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:44e945b9ce9553807c7510a0ce3ecc92d989b7de&amp;dn=California+Dreamin%27+Jazz+Exotica+-+Impulse+Records&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":17,"time":1378426365,"description":"California Dreamin' Jazz Exotica \n\n\nThis is another thematic Impulse compilation assembled by Patrick Forge and Kerstan Mackness. Like its sister project, Transcendence: Impulse in the Spiritual Groove, this one centers around the wild sonic textures in the slinky, exotic music being produced in California from the late '50s through the mid-'60s for the label. Where Transcendence centered itself around contributions from Alice Coltrane and Pharoah Sanders, California Dreamin': Jazz Exotica does the same with Bill Plummer and Gabor Szabo. Both men issued incredibly experimental music that, while firmly in the jazz camp, flirted dangerously with lounge and pop sounds -- often going over the edge. Both were great innovators, particularly Szabo, whose Sorcerer album is an Impulse classic. Szabo utilized Indian and other Far Eastern instrumentation in his tunes, covering the pop hits of the day and writing in that vernacular, but always leaving plenty of room in his multi-textured compositions for unexpected improvisation. The tracks &quot;Sophisticated Wheels&quot; from Jazz Raga, from which two tracks are taken; the title track from Spellbinder; and &quot;Gypsy Queen&quot; from the same album illustrate this well with their use of tablas, sitars, and fuzzed-out Tibetan temple bells. Another classically wack track comes in the form of &quot;Bliss&quot; from Emil Richards and the Microtonal Blues Band. The dueling marimbas are almost too much to bear, but they move so fluidly and intricately that it is difficult not to be overcome with awe for the playing. Other musicians who appear are somewhat unexpected: Chico Hamilton, Dave Mackay and Vicky Hamilton, Gary McFarland, and Tom Scott round out the collection. Scott and Szabo end up on lots of other tracks as well: Scott was part of Plummer's The Cosmic Brotherhood and Szabo was a member of the Chico Hamilton Quintet. While not as overwhelmingly consistent as Transcendence, there is plenty here to recommend. This is another well-realized project for the Forge/Mackness team.\n\n01 Honeysuckle Breeze - Tom Scott &amp; The California Dreamers\n02 Sophisticated Wheels - Gabor Szabo\n03 Song Plum - Bill Plummer &amp; The Cosmic Brotherhood\n04 Bliss - Emil Richards\n05 Conquistadores - Chico Hamilton\n06 Blues for Hari - Vicky Hamilton &amp; Dave MacKay\n07 Today - Tom Scott &amp; The California Dreamers\n08 Gypsy Queen - Gabor Szabo\n09 Journey to the East - Bill Plummer &amp; The Cosmic Brotherhood\n10 Raga Doll - Gabor Szabo\n11 Sandpiper - Gary McFarland\n12 The Look of Love - Bill Plummer &amp; The Cosmic Brotherhood\n13 Spellbinder - Gabor Szabo\n14 El Toro - Chico Hamilton\n15 North - Tom Scott &amp; The California Dreamers\n","torrent":{"xt":"urn:btih:44e945b9ce9553807c7510a0ce3ecc92d989b7de","amp;dn":"California+Dreamin%27+Jazz+Exotica+-+Impulse+Records","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44e945b9ce9553807c7510a0ce3ecc92d989b7de","infoHashBuffer":{"type":"Buffer","data":[68,233,69,185,206,149,83,128,124,117,16,160,206,62,204,146,217,137,183,222]},"announce":[],"urlList":[]}}