{"title":"Blue Mountain - Dog Days [1995][EAC,log,cue. FLAC]","uid":8887164,"size":369809160,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4582d5183b4e7132beb1dbb91bb20fff3e34e959&amp;dn=Blue+Mountain+-+Dog+Days+%5B1995%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"dickspic","files":17,"time":1378488889,"description":"Artist: Blue Mountain\nRelease: Dog Days\nReleased: 1995\nLabel: Roadrunner\nCatalog#: RR8940-2\nFormat: FLAC / Lossless / Log (100%) / Cue\n[color=blue]Country: USA\nStyle: americana\n\n1. Mountain Girl\n2. Let's Ride\n3. Blue Canoe\n4. Soul Sister\n5. Wink\n6. Slow Suicide\n7. A Band Called Bud\n8. Epitaph\n9. ZZQ\n10. The Eyes of a Child\n11. Jimmy Carter\n12. Let's Go Runnin'\n13. Hippy Hotel\n14. Special Rider Blues\n\nDog Days wasn't Blue Mountain's first album, but it was the first one that gave a clear picture of just how good the group could really be. Unlike their self-titled and self-released debut, Dog Days paired Blue Mountain with a sympathetic producer, and Eric &quot;Roscoe&quot; Ambel beefed up the band's sound in the studio without cluttering up their style; Cary Hudson's guitar now roared with the sweet thunder it deserved, and the simple but muscular support from bassist Laurie Stirratt and drummer Frank Coutch pushes the songs forward with just the right degree of insistence. If Hudson's guitar work at this point showed a very clear Neil Young influence, it fit his songs like a glove, and as a tunesmith he had a knack for telling stories that was all his own, from the populist rabble-rousing of &quot;Jimmy Carter&quot; and the rough-and-ready exploits of &quot;A Band Called Bud&quot; to the beatific wanderer's tale of &quot;Blue Canoe&quot; and the sweet-and-sour romance of &quot;Wink.&quot; And while Dog Days connects like a Louisville Slugger when the band cranks up on the album's rockers, the acoustic-based numbers have an emotional strength that keeps them from sounding like the band is taking a breather. While Blue Mountain never gained the same degree of semi-fame as their alt-country contemporaries like the Jayhawks, Uncle Tupelo, and Whiskeytown, they were regarded by many educated observers as one of the best acts on the scene, and Dog Days shows why -- they could write, sing, and play with passion and street smarts, and every song on this album hits its target dead on. It's a minor masterpiece of the genre.","torrent":{"xt":"urn:btih:4582d5183b4e7132beb1dbb91bb20fff3e34e959","amp;dn":"Blue+Mountain+-+Dog+Days+%5B1995%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4582d5183b4e7132beb1dbb91bb20fff3e34e959","infoHashBuffer":{"type":"Buffer","data":[69,130,213,24,59,78,113,50,190,177,219,185,27,178,15,255,62,52,233,89]},"announce":[],"urlList":[]}}