{"title":"Laibach - (1996) - Jesus Christ Superstars - [eac-flac]","uid":4162919,"size":341509196,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:45dcce5fc53a8440b769fefa5da4a60bbc76b453&amp;dn=Laibach+-+%281996%29+-+Jesus+Christ+Superstars+-+%5Beac-flac%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"kislithepothead","files":12,"time":1209466748,"description":"Laibach: Jesus Christ Superstars\n\n\n&quot;Let everyone submit themselves to the Higher Authority.&quot; (Laibach, Romans)\n\nHistory, Marx said, repeats itself first as tragedy, then as farce. Having replaced religion as the world's moral force, Hollywood and the culture industry have been priming the apocalyptic tone dominating the approach to the Millennium. In this new gospel according to Hollywood, the Second Coming will not be God made flesh and blood, but God as a cyborg man-machine -Deus ex machina indeed - Jesus as Robocop or Judge Dred setting up every day as Judgement Day and dispensing instant justice in the process.\n\nAs their inception in 1980, Laibach set out to expose the true workings of control systems, be they political or cultural. Now with their eighth official album - not counting live sets and compilations - called &quot;Jesus Christ Superstars&quot;, Laibach tackle the role of religion, its uses and misuses at the tail-end of the 20th century. Musically, Laibach's &quot;Jesus...&quot; fulfils its religious calling with a cyborg mix of machine rhythm and heavy metal, bound together with Laibachised arrangements and choruses. Heavy metal is an article of faith, Laibach say. It is the closest rock has come to establishing itself as an ethical force. Further, it as done so by ignoring the scorn heaped on it by the novelty-obsessed media, and by remaining true to itself through its 25-year existence.\n\nThe album features eight songs and the instrumental coda &quot;Deus Ex Machina&quot;, among them original Laibach takes of Juno Reactor's as-yet-unreleased &quot;God Is God&quot;, the Lloyd Webber musical hit &quot;Jesus Christ Superstar&quot; and the Artist Formerly Known as Prince's &quot;The Cross&quot;. The other tracks are Laibach's own &quot;Kingdom Of God&quot;, &quot;Abuse And Confession&quot;, &quot;Declaration Of Freedom&quot;, &quot;Message From The Black Star&quot; and &quot;To The New Light&quot;.\n\nBecause the original Laibach covers serve as the coordinates to the album, an understanding of their sources can only enhance your enjoyment and understanding of them. &quot;Jesus Christ Superstar&quot; is taken from the rock musical that echoed John Lennon's claim of the Beatles being more popular than Jesus. It cast a clean-cut Jim Morrison type as Christ and played out his story against the peace concerns the Vietnam war period. That its social impact outweighed its musical value could be ascribed to its meeting the religious needs of an audience unsatisfied by conventional religions. Laibach use it today as a vehicle to explore the way rock had absorbed Hollywood's idea of Christian values. TAFKAP's &quot;The Cross&quot; marks rock's fusion of religious sexuality, metal guitar and its gospel roots.\n\nThe Laibach originals analyse the search for spiritual solace in an a world that has either pronounced God dead or persists in using religion to cynically seek forgiveness for its sins without being prepared to give them up.\n\nWith &quot;Jesus Christ Superstars&quot;, they continue God's work, begun on earlier albums like &quot;Opus Dei&quot;.\n\n&quot;Only God can subdue Laibach. People and things, never.&quot;\n\nProduction notes\n\nLaibach's examining of control and belief systems eventually brought them to religion, when it became apparent to them that the post-marxist world lacks any moral and ethical restraints on its rampant consumerism. The more it becomes apparent that man's laws are not strong enough to constrain his worst impulses, the greater the desire for a Higher Authority.\n\nBlooded in the battles that led the collapse of the formerly communist republic of Yugoslavia into myriad nationalist factions battling each other in the name of their respective Gods, they found it difficult to rejoice along with the rest of the world in the fall of the Berlin wall that came to symbolise the end of communism in Europe. The reluctance of the West to risk its own security or business interests by intervening on humane grounds in the post-communist Bosnia or Chechnia conflicts, or in Rwanda or Burundi or myriad other warzones, revealed the victors' lack of moral courage. With no opposing belief system to act as a moral constraint on it, Western capitalism has given up any pretence at humanism in its cynical pursuit of pleasure and profit. Meanwhile, it deploys Hollywood and the popular culture industry to create new gods to fill the spiritual void left by the absence of God, simultaneously drawing on and promoting the fears of a world rapidly using of resolving its conflicts. All these feelings are combined, condensed and accelerated by the sense of time running out as the seconds tick away towards the Millennium.\n\nOddly, considering the fact that these are supposedly more enlightened and logical times, this millennial period is characterised by a feverish search for spiritual solace, which is either satisfied by a return to fundamental Christian or Islamic beliefs, or it finds an outlet in the bizarre apocalyptic outpourings of thwarted rock guitarist David Koresh and his like, who seek to speed up the Second Coming by taking themselves and the world out both at once, and bringing on the Day of Judgement.\n\nOf course, Laibach's &quot;Jesus Christ Superstars&quot; doesn't profess to have any answers. But in posing the questions, it exposes the terrors of a world without a moral authority, be that authority the totalitarian belief systems earlier Laibach music examined, fear of God or fear of Death.\n\nOnce asked whether they believed in God, Laibach answered, &quot;Yes, we believe in God, but unlike Americans we do not trust him.&quot;\n\n\n\nTracklist:\n#01 God Is God\n#02 Jesus Christ Superstar\n#03 Kingdom of God\n#04 Abuse And Confession\n#05 Declaration Of Freedom\n#06 Message From The Black Star\n#07 The Cross\n#08]To The New Light\n#09 Deus Ex Machina\n\nEnjoy.","torrent":{"xt":"urn:btih:45dcce5fc53a8440b769fefa5da4a60bbc76b453","amp;dn":"Laibach+-+%281996%29+-+Jesus+Christ+Superstars+-+%5Beac-flac%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45dcce5fc53a8440b769fefa5da4a60bbc76b453","infoHashBuffer":{"type":"Buffer","data":[69,220,206,95,197,58,132,64,183,105,254,250,93,164,166,11,188,118,180,83]},"announce":[],"urlList":[]}}