{"title":"Assassins Creed +Multilanguage","uid":8556668,"size":4459911570,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:45fa1401006a8751782ab84530200ef577562445&amp;dn=Assassins+Creed+%2BMultilanguage&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bruss.aka.durka9","files":-1,"time":1370784524,"description":"Overview:\n=========\n\nAssassin's Creedâ„¢ is the next-gen game developed by Ubisoft Montreal that redefines the action genre. While other games claim to be next-gen with impressive graphics and physics, Assassin's Creed merges technology, game design, theme and emotions into a world where you instigate chaos and become a vulnerable, yet powerful, agent of change.\n\nThe setting is 1191 AD. The Third Crusade is tearing the Holy Land apart. You, Altair, intend to stop the hostilities by suppressing both sides of the conflict.\n\nYou are an Assassin, a warrior shrouded in secrecy and feared for your ruthlessness. Your actions can throw your immediate environment into chaos, and your existence will shape events during this pivotal moment in history.\nBe an Assassin - Master the skills, tactics and weapons of history's deadliest and most secretive clan of warriors. Plan your attacks, strike without mercy and fight your way to escape.\nExperience exclusive PC content - Four PC-exclusive investigation missions make the game an even better experience than its console predecessors, including the Rooftop Race Challenge, a race to a specified location and the Archer Stealth Assassination Challenge, where the player must assassinate all archers in a certain zone to help out fellow Assassins.\nRealistic and responsive environments - Experience a living, breathing world in which all your actions have consequences. Crowds react to your moves and will either help or hinder you on your quests.\nAction with a new dimension-total freedom - Eliminate your targets wherever, whenever and however. Stalk your prey through richly detailed, historically accurate, open-ended environments. Scale buildings, mount horses, blend in with crowds. Do whatever it takes to achieve your objectives.\nRelive the epic times of the Crusades - Assassin's Creed immerses you in the realistic and historical Holy Land of the 12th century, featuring life-like graphics, ambience and the subtle, yet detailed nuances of a living world.\nIntense action rooted in reality - Experience heavy action blended with fluid and precise animations. Use a wide range of medieval weapons, and face your enemies in realistic swordfight duels.\nNext-gen gameplay - The proprietary engine developed from the ground up for the next-gen console allows organic game design featuring open gameplay, intuitive control scheme, realistic interaction with environment and a fluid, yet sharp, combat mechanic.\n\nSystem Requirements:\n====================\n\nSupported OS: Windows XP/Windows Vista (only)\nProcessor: Dual core processor 2.6 GHz Intel Pentium D or AMD Athlon 64 X2 3800+ (Intel Core 2 Duo 2.2 GHz or AMD Athlon 64 X2 4400+ or better recommended)\nSystem Memory: Windows XP: 1 GB RAM / Windows Vista: 2 GB RAM\nVideo Card: 256 MB DirectX 10.0-compliant video card or DirectX 9.0-compliant card with Shader Model 3.0 or higher (*see supported list)\nSound Card: DirectX 9.0 or 10.0-compliant sound card (5.1 sound card recommended)\nDirectX Version: Direct X 9.0 (Windows XP) or 10.0 (Windows Vista) libraries \nHard Disk: 8 GB available hard disk space\nSupported Peripherals: Keyboard, mouse, optional controller (Xbox 360 Controller for Windows recommended)\n*Supported video cards at time of release: ATI RADEON X1600** /1650**- 1950/ HD 2000/3000 series, NVIDIA GeForce 6800**/7/8/9 series. **PCI Express only supported. Laptop versions of these cards may work but are NOT supported. These chipsets are the only ones that will run this game. For the most up-to-date requirements, please visit the FAQ for this game at:\n\nMultilanguage Support:\n======================\n\nEnglish (Full localization)\nFrench (Full localization)\nGerman (Full localization)\nItalian (Full localization)\nSpanish (Full localization)\n\nLanguage choosing in installation process !!!\n\nInstallation:\n=============\n\nTo install game use: Setup.exe","torrent":{"xt":"urn:btih:45fa1401006a8751782ab84530200ef577562445","amp;dn":"Assassins+Creed+%2BMultilanguage","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45fa1401006a8751782ab84530200ef577562445","infoHashBuffer":{"type":"Buffer","data":[69,250,20,1,0,106,135,81,120,42,184,69,48,32,14,245,119,86,36,69]},"announce":[],"urlList":[]}}