{"title":"[Joey_Lott,_Darron_Schall,_Keith_Peters]ActionScript 3.0 Cookboo","uid":11048038,"size":2946345,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:46156aad5dad9c1823de51360b464ee78e6a1d09&amp;dn=%5BJoey_Lott%2C_Darron_Schall%2C_Keith_Peters%5DActionScript+3.0+Cookboo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zombie_rox","files":2,"time":1410976323,"description":"Book Description\nPublication Date: October 11, 2006\n\nWell before Ajax and Microsoft's Windows Presentation Foundation hit the scene, Macromedia offered the first method for building web pages with the responsiveness and functionality of desktop programs with its Flash-based &quot;Rich Internet Applications&quot;. Now, new owner Adobe is taking Flash and its powerful capabilities beyond the Web and making it a full-fledged development environment.\n\nRather than focus on theory, the ActionScript 3.0 Cookbook concentrates on the practical application of ActionScript, with more than 300 solutions you can use to solve a wide range of common coding dilemmas. You'll find recipes that show you how to:\n\n    Detect the user's Flash Player version or their operating system\n    Build custom classes\n    Format dates and currency types\n    Work with strings\n    Build user interface components\n    Work with audio and video\n    Make remote procedure calls using Flash Remoting and web services\n    Load, send, and search XML data\n    And much, much more ...\n\nEach code recipe presents the Problem, Solution, and Discussion of how you can use it in other ways or personalize it for your own needs, and why it works. You can quickly locate the recipe that most closely matches your situation and get the solution without reading the whole book to understand the underlying code. Solutions progress from short recipes for small problems to more complex scripts for thornier riddles, and the discussions offer a deeper analysis for resolving similar issues in the future, along with possible design choices and ramifications. You'll even learn how to link modular ActionScript pieces together to create rock-solid solutions for Flex 2 and Flash applications.\n\nWhen you're not sure how ActionScript 3.0 works or how to approach a specific programming dilemma, you can simply pick up the book, flip to the relevant recipe(s), and quickly find the solution you're looking for.\n\nAdobe Developer Library is a co-publishing partnership between O'Reilly Media and Adobe Systems, Inc. and is designed to produce the number one information resources for developers who use Adobe technologies. Created in 2006, the Adobe Developer Library is the official source for comprehensive learning solutions to help developers create expressive and interactive web applications that can reach virtually anyone on any platform. With top-notch books and innovative online resources covering the latest in rich Internet application development, the Adobe Developer Library offers expert training and in-depth resources, straight from the source.\n\n\nEditorial Reviews\nAbout the Author\n\nJoey Lott is the author of several O'Reilly books on Macromedia technology, including Flash 8 Cookbook, Programming Flash Communication Server, and the ActionScript Cookbook. He is also the author of Flash 8 ActionScript Bible (Wiley) and Advanced ActionScript with Design Patterns (Adobe Press, October 2006). Joey has been teaching Flash and ActionScript since 1999. His professional experience in the Internet industry includes co-founding RightSpring, Inc., as well as consulting for YourMobile/Premium Wireless Services (J2EE B2C application) and Ads.com (leading the development of a J2EE B2B application).\n\nDarron Schall is an independent consultant specializing in the Flash Platform, with a Bachelor's Degree in Computer Science from Lehigh University. He has been using ActionScript since the early days and is a prominent voice in the Flash and Flex communities. He is actively involved in the Open Source Flash movement with projects ranging from software development tools to a Commodore 64 emulator. Darron has spoken at various conferences about ActionScript, and has contributed to books and magazines. You can find his Flash Platform related weblog at http://www.darronschall.com.\n\nKeith Peters is a Flash developer in the Boston area. He has been working with Flash since 1999 and is currently a Senior Flash Developer at Brightcove (http://www.brightcove.com). Keith has been a contributing author to nine other books on Flash and ActionScript. His personal website, http://www.bit-101.com, features an active blog, over 700 open source Flash experiments, and lots of other random Flash-related stuff.\n\nPublisher: Adobe Developer Library; 1 edition (December 17, 2008)\nSold by: Amazon Digital Services, Inc.\nLanguage: English\nASIN: B002TWIVPS\n\n","torrent":{"xt":"urn:btih:46156aad5dad9c1823de51360b464ee78e6a1d09","amp;dn":"%5BJoey_Lott%2C_Darron_Schall%2C_Keith_Peters%5DActionScript+3.0+Cookboo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46156aad5dad9c1823de51360b464ee78e6a1d09","infoHashBuffer":{"type":"Buffer","data":[70,21,106,173,93,173,156,24,35,222,81,54,11,70,78,231,142,106,29,9]},"announce":[],"urlList":[]}}