{"title":"Def Leppard - Vault Greatest Hits 1980-1995 (1995) WMA320","uid":6063494,"size":188131528,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:4687c6b43348526eb6a8dba362ebf3fec7ab2cbe&amp;dn=Def+Leppard+-+Vault+Greatest+Hits+1980-1995+%281995%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1293224994,"description":"Def Leppard was one of the most successful bands out of the '80s and one of my very favorite from the decade. They scored 15 top 40 singles from 1983-1993 and had quite a few radio and MTV favorites that missed the top 40; most of them are represented here. There has been some complaints about certain songs not being hits, but I've found the chart stats and will show how high they charted. \n\n&quot;Pour Some Sugar on Me&quot; (video edit)--the most popular Lep song leads off this collection. A great singalong, heart-pounding rocker This is also an alternate version to the one on HYSTERIA: it is the video edit which is longer and, IMHO, superior. (peaked at #2) \n\n&quot;Photograph&quot;--one of their breakthrough PYROMANIA hits: another great rocker with an unforgettable riff written &quot;all about Marilyn Monroe&quot; as Joe would say. (peaked at #12) \n\n&quot;Love Bites&quot;--the collection's first ballad is a great one from HYSTERIA. (the band's only #1 single) \n\n&quot;Let's Get Rocked&quot;--first of two ADRENALIZE tracks is a fun little rocker inspired by THE SIMPSONS (or so Joe says). (peaked at #15) \n\n&quot;Two Steps Behind&quot;--a standout ballad from THE LAST ACTION HERO soundtrack is an acoustic based track that originally appeared on a B-side! (peaked at #12) \n\n&quot;Animal&quot;--mid-tempo HYSTERIA rocker that is a rock radio staple even today. (peaked at #19) \n\n&quot;Foolin'&quot;--second PYROMANIA track is a mysterious ballad/rocker with lots of atmosphere and a great guitar solo (peaked at #28) \n\n&quot;Rocket&quot; (video edit)--tounge-in-cheek rocker from HYSTERIA which basically lists off titles of great classic rock songs. Unfortunately it is presented in a shorter edit than the album version. (peaked at #12) \n\n&quot;When Love and Hate Collide&quot;--new song for the album is a pretty good ballad that could've used an electric solo, but it's fine as it is. (sadly, peaked only at #58) \n\n&quot;Armageddon It&quot;--rip-roaring rocker from HYSTERIA and a good one at that. (peaked at #3) \n\n&quot;Have You Ever Needed Someone So Bad&quot;--the other ADRENALIZE track, this one an average ballad. (peaked at #12) \n\n&quot;Rock of Ages&quot;--last PYROMANIA track is a memorable bombastic rocker which actually steals it's chorus from the Bible! (peaked at #16) \n\n&quot;Hysteria&quot;--last song from the album of the same name. A sort-of ballad performed well. (peaked at #10) \n\n&quot;Miss You In a Heartbeat&quot;--an okay ballad from RETROACTIVE was a bigger hit in Canada (#4) than America (#39) and that is why it is included. \n\n&quot;Bringing on the Heartbreak&quot;--only track from HIGH 'N' DRY surprising only peaked at #61, but became a classic rock radio staple due to heavy exposure on early MTV. There is no &quot;Switch 625&quot; because it's not played on the radio with it. Great song anyway. \n\nWell that's it, all the hits. There are problems: HYSTERIA is over-emphasized (though all were chart hits and it still misses one of those!), nothing from ON THROUGH THE NIGHT (though no songs were chart hits), and misses the other two top 40 tracks from ADRENALIZE (&quot;Make Love Like a Man,&quot; #36; &quot;Stand Up,&quot; #34). But overall, this is a great collection for newcomers and casual fans (and the only place to get the PSSOM video edit on CD). \n\nby S. J. West\n\nTRACKLIST:\n\n01 - Pour Some Sugar On Me.wma                                   \n02 - Photograph.wma                                              \n03 - Love Bites.wma                                              \n04 - Let's Get Rocked.wma                                        \n05 - Two Steps Behind (Acoustic Version).wma                     \n06 - Animal.wma                                                  \n07 - Foolin'.wma                                                 \n08 - Rocket.wma                                                  \n09 - When Love &amp; Hate Collide.wma                                \n10 - Armageddon It.wma                                           \n11 - Have You Ever Needed Someone So Bad.wma                     \n12 - Rock Of Ages.wma                                            \n13 - Hysteria.wma                                                \n14 - Miss You In A Heartbeat (Acoustic Version).wma              \n15 - Bringin' On The Heartbreak.wma    \n\nWMA 320Kbps 44100Hz STEREO","torrent":{"xt":"urn:btih:4687c6b43348526eb6a8dba362ebf3fec7ab2cbe","amp;dn":"Def+Leppard+-+Vault+Greatest+Hits+1980-1995+%281995%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4687c6b43348526eb6a8dba362ebf3fec7ab2cbe","infoHashBuffer":{"type":"Buffer","data":[70,135,198,180,51,72,82,110,182,168,219,163,98,235,243,254,199,171,44,190]},"announce":[],"urlList":[]}}