{"title":"[Boris A. Trofimov , Al'bina I. Mikhaleva , Elena Yu Schmidt]Che","uid":11193965,"size":4803054,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:469e26701d49e49cbe97201256e2057f12a88a7a&amp;dn=%5BBoris+A.+Trofimov+%2C+Al%27bina+I.+Mikhaleva+%2C+Elena+Yu+Schmidt%5DChe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zombie_rox","files":1,"time":1413050899,"description":"During the last 30 years, knowledge of the essential role that pyrrole structures play in the chemistry of living organisms, drug design, and the development of advanced materials has increased. Correspondingly, research on the diverse issues of synthetic, theoretical, and applied chemistry has snowballed. Devoted to the latest achievements of this field, Chemistry of Pyrroles covers the discovery and development of a novel, facile, and highly effective method for the construction of the pyrrole ring from ketones (ketoximes) and acetylene in superbase catalytic systems (Trofimov reaction). It provides cutting-edge details on the preparation of valuable but previously inaccessible pyrrole compounds. It includes approximately 1,000 structures of novel pyrrole compounds, their yields, and physical-chemical characteristics.\n\nThe authors analyze conditions of typical syntheses, limitations of their applicability, and possibility of vinyl chloride or dichloroethane application instead of acetylene. They examine chemical engineering aspects of the first synthesis of tetrahydroindole and indole from commercially available oxime of cyclohexanone and acetylene. In addition, the book discusses new facets of pyrroles and N-vinyl pyrroles reactivity in the reactions with the participation of both the pyrrole ring and N-vinyl groups.\n\nThe book provides condensed, clear-cut information on novel syntheses of substituted pyrroles as key structural units of living matter (chlorophyll and hemoglobin), pharmaceuticals, and monomers for optoelectronic materials. It includes tables that provide references to original works, forming a guide to a variety of the reactions and synthesized compounds discussed. With coverage of the broad range of pyrrole chemistry and methods for their synthesis, it provides both a theoretical and an experimental basis for drug design.\n\n\nPublisher: CRC Press (13 October 2014)\nLanguage: English\nISBN-10: 1482232421\nISBN-13: 978-1482232424\n\n","torrent":{"xt":"urn:btih:469e26701d49e49cbe97201256e2057f12a88a7a","amp;dn":"%5BBoris+A.+Trofimov+%2C+Al%27bina+I.+Mikhaleva+%2C+Elena+Yu+Schmidt%5DChe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"469e26701d49e49cbe97201256e2057f12a88a7a","infoHashBuffer":{"type":"Buffer","data":[70,158,38,112,29,73,228,156,190,151,32,18,86,226,5,127,18,168,138,122]},"announce":[],"urlList":[]}}