{"title":"Ultimate armbars of Russian sambo by Igor Yakimov","uid":10595688,"size":3781932411,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:46fd9ae6de94b9618b3b865c0c5174fafbd10148&amp;dn=Ultimate+armbars+of+Russian+sambo+by+Igor+Yakimov&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"T1T","files":463,"time":1405815891,"description":"Igor Yakimov, the worlds leading authority on Russian Sambo returns to video with his most explosive series ever, Ultimate Armbars! In his famous Ultimate Leglocks series, Igor wrote the book on using leglocks in competition and street situations. In this new series, Igor covers hundreds of armbars and combinations including shoulder locks, wrist locks and elbow locks, from every possible position imaginable. Learn to immediately place your opponent into the most brutal armbars possible from takedowns, side-control, guard, mount, turtle position and more! This new DVD Video Series will forever be considered the armbar bible for grapplers and is a must have for all fighters regardless of style. If you think you have seen every way to submit someone with an armbar, you will be more then impressed with this new series. Another World Martial Arts exclusive now digitally remastered for sound and video quality and available on DVD!\n\nVOLUME 1: Takedowns into Armbars\nOn this DVD Video, Igor Yakimov teaches how to take an opponent from the standing position into an immediate submission. Russian Sambo is well known for its creative armbar techniques from the standing position and Igor does not let us down in this DVD Video. Igor teaches how to nail armbars from all takedowns including sweeps, throws and trips. Many of these Igor has used in international competition himself and are quite effective. This is a great DVD Video for those who are looking for a new twist to their takedown game.\n\nVOLUME 2: Armbars from the Crossbody\nThis DVD Video will teach you how to totally attack the arms from the crossbody and scarf hold position. Igor starts off with teaching how to prepare yourself in the crossbody position and then go on the offensive. Learn every way possible to submit the arms including wrist locks, shoulder locks and elbow locks. This is a phenomenal video because it shows how to obtain these submissions from your opponent's own attempts to escape or counter you. Igor combines these moves into the knee on stomach and mount position as he goes on showing many different options. Igor then moves to the scarf hold or front headlock hold as many call it. Igor teaches countless submissions from this position and leaves out nothing covering even the smallest details. The absolute best work on armbars from this position ever.\n\nVOLUME 3: Armbars from the Mount Position\nIgor Yakimov reveals on this DVD Video the most devastating arm submissions that can be obtained when you are mounted on your opponent. Igor covers the basics as well as the most advanced\nstrategies possible. Learn elbow, shoulder and wrist locks from the mount when your opponent tries to escape your position. Learn to fake your opponent into believing that he is escaping only to ten, fighters can hide in the turtle position in many forms of grappling competition. This video opens up a whole new arsenal for you if your opponent does this. Igor Yakimov will show you how to attack the arms of those in this position and hit every possible combination of armbar imaginable. Even if your opponent lays on his stomach, Igor will show how to submit them with no problem. This is an excellent video if you grapple with judo players and wrestlers who love to use this position. Over 50 minutes of video instruction.\n\nVOLUME 4: Armbars from the Turtle &amp; Back\nQuite often, fighters can hide in the turtle position in many forms of grappling competition. This video opens up a whole new arsenal for you if your opponent does this. Igor Yakimov will show you how to attack the arms of those in this position and hit every possible combination of armbar imaginable. Even if your opponent lays on his stomach, Igor will show how to submit them with no problem. This is an excellent video if you grapple with judo players and wrestlers who love to use this position. Over 50 minutes of video instruction.\n\nVOLUME 5: Armbars from the Guard Position\nThis video is the most complete work ever on armbars from the guard position. Igor Yakimov not only covers the more common guard armbars, he moves into the most advanced armbar attacks ever developed.. Learn shoulder locks, elbow locks and sweeps into armbars that will amaze even the most advanced students. Igor also covers how to obtain armbars if you get caught in the turtle position yourself! A great video, over 50 minutes of techniques.\n\nVOLUME 6: Armbar Counter Attacks\nQuite often when attacking an opponents arm, they will counter by protecting the attacked arm and preventing you from getting the submission. This is a very big problem for even experienced grapplers who often waste valuable energy trying to finish the arm bar only to lose it and have to start again. Igor believes that a great majority of fighters today cannot finish the armbar properly. In this video Igor Yakimov covers this problem in unbelievable depth, teaching every little trick and tactic known to finish the armbar. Igor teaches how to use combination after combinations to break the opponents grip and finish the job. Learn to use your legs, body, kimono and arms in union to defeat any counter your opponent may try. This is a much needed video for all grapplers and contains over 50 minutes of techniques!","torrent":{"xt":"urn:btih:46fd9ae6de94b9618b3b865c0c5174fafbd10148","amp;dn":"Ultimate+armbars+of+Russian+sambo+by+Igor+Yakimov","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46fd9ae6de94b9618b3b865c0c5174fafbd10148","infoHashBuffer":{"type":"Buffer","data":[70,253,154,230,222,148,185,97,139,59,134,92,12,81,116,250,251,209,1,72]},"announce":[],"urlList":[]}}