{"title":"2D Graphics Programming for Games","uid":8992648,"size":42136374,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:475697a6995973d320ea82916be782b5c95e3ac8&amp;dn=2D+Graphics+Programming+for+Games&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dzadel67","files":-1,"time":1380824239,"description":"From the author:\n\nThe goal of this book is to provide a deep introduction to the topics of graphics programming. The material was developed over a period of three years (while teaching a course on the subject to 2nd and 3rd year college students). I have drawn on my experiences in the game industry to provide both theory and solid examples of the most relevant topics in 2d graphics programming.\n\nThe chapters are designed to step the reader through the topics, each building on the previous. By the end of the book you will:\n* gain knowledge to create ANY 2D graphical effect on any platform (mobile, game console, or PC)\n* gain ideas and inspiration for new graphical effects\n* have an appreciation for graphical expectations in professional games\n* learn the techniques and terminology used by game industry professionals\n\nIn order to follow along with the code, the book expects the reader to have basic programming experience in C++, C#, or Java\n\nThe book would be a great text for a semester-long university (or year-long high school) course in which the students already have basic programming background. It is also an excellent primer to 3D graphics programming, in that it introduces GPU programming (pixel shaders) without the added complexity of matrix multiplication, lighting algorithms, or importing 3D models. \n\n===================================\n\nReview by John Murphy\n\nThis book presents a overview of the use of 2D graphics in XNA (C#) game programming. It begins with some basics on computer graphics, then covers sprites, animation, tile mapping, and 2D cameras. Then it goes on to a nice explanation of the various ways to simulate perspective with 2D graphics (&quot;the 2.5D effect&quot;).\n\nNext it covers fonts and menus, particles and special effects, and concludes with a chapter on the use of shaders (GPU programs) in 2D games and finally a chapter on achieving a polished look for your game.\n\nIt also contains the standard appendices on math that no one reads. \n\n===================================\n\nUploaded Anomyously","torrent":{"xt":"urn:btih:475697a6995973d320ea82916be782b5c95e3ac8","amp;dn":"2D+Graphics+Programming+for+Games","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"475697a6995973d320ea82916be782b5c95e3ac8","infoHashBuffer":{"type":"Buffer","data":[71,86,151,166,153,89,115,211,32,234,130,145,107,231,130,181,201,94,58,200]},"announce":[],"urlList":[]}}