{"title":"On the Origin of Planets: By Means of Natural Simple Processes ","uid":6803066,"size":4516798,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:478922544058b75774f5d0c9afc8687f0a171496&amp;dn=On+the+Origin+of+Planets%3A+By+Means+of+Natural+Simple+Processes+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1320759199,"description":"The book begins with a historical review of four major theories for the origin of the Solar System in particular, or of planets in general, which highlight the major problems that need to be solved by any plausible theory. In many theories, including that which form the major theme of this book, the formation of planets and stars is intimately linked, so four chapters are devoted to the processes that can be described as the birth, life and death of stars.\n\nRecent observations that have revealed the existence of planets around many Sun-like stars are described in detail, followed by a clear exposition of the Capture Theory for the origin of planets. Many aspects of this theory are illustrated with sophisticated computer modelling that convincingly demonstrates the plausibility of the theory. The Capture Theory is in complete accord with all observations, including the estimate it gives for the proportion of Sun-like stars with planets. It is the only theory that sits comfortably with all present observational and theoretical constraints.\n\nThe general theory of planet formation does not explain the detailed structure of the Solar System. An early postulated collision of two major planets is shown to explain many disparate features of the Solar System - the nature of the terrestrial planets, surface features of the Moon and its relationship with Earth, asteroids, comets and dwarf planets, the relationship between Neptune, Triton and Pluto and the characteristics of meteorites, including the isotopic anomalies found in them. The postulate of a planetary collision is given support by a 2009 NASA observation of the residue of such an event around a distant young star.\n\n\n# Paperback: 500 pages\n# Publisher: Imperial College Press (September 23, 2010)\n# Language: English\n# ISBN-10: 1848165994\n# ISBN-13: 978-1848165991","torrent":{"xt":"urn:btih:478922544058b75774f5d0c9afc8687f0a171496","amp;dn":"On+the+Origin+of+Planets%3A+By+Means+of+Natural+Simple+Processes+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"478922544058b75774f5d0c9afc8687f0a171496","infoHashBuffer":{"type":"Buffer","data":[71,137,34,84,64,88,183,87,116,245,208,201,175,200,104,127,10,23,20,150]},"announce":[],"urlList":[]}}