{"title":"The Limits of Dream - A Scientific Exploration of the Mind (Male","uid":4708986,"size":2007842,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:47add79f9bfaf91ad2228789399ef8730ab0c58d&amp;dn=The+Limits+of+Dream+-+A+Scientific+Exploration+of+the+Mind+%28Male&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1233952015,"description":" &lt;a href=&quot;http://www.image-upload.net/images/zbaa11uee41vfu1q1gj.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/zbaa11uee41vfu1q1gj.jpeg&lt;/a&gt;\n\nJim Pagel, &quot;The Limits of Dream: A Scientific Exploration of the Mind / Brain Interface&quot;\nAcademic Press | 2008-03-03 | ISBN: 0123742153 | 250 pages | PDF\n\nThe Limits of Dream focuses on what we currently know of the human central nervous system (CNS), examining the basic sciences of neurochemisty, neuroanatomy, and CNS electrophysiology as these sciences apply to dream, then reaching beyond basic science to examine the cognitive science of dreaming including the processes of memory, the perceptual interface, and visual imagery. Building on what is known of intrapersonal CNS processing, the book steps outside the physical body to explore artificially created dreams and their use in filmmaking, art and story, as well as the role of dreaming in creative process and creative madness. The limits of our scientific knowledge of dream frame this window that can be used to explore the border between body and mind. What is known scientifically of the cognitive process of dreaming will lead the neuroscientist, the student of cognitive science, and the general reader down different paths than expected into an exploration of the fuzzy and complex horizon between mind and brain.\n\n* The clearest presentation of research and philosophy currently available relating to the mind/brain interface\n* Discusses the cognitive processes of dreaming utilized in film and artificial intelligence\n* Describes the functioning of dream in creative process ","torrent":{"xt":"urn:btih:47add79f9bfaf91ad2228789399ef8730ab0c58d","amp;dn":"The+Limits+of+Dream+-+A+Scientific+Exploration+of+the+Mind+%28Male","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47add79f9bfaf91ad2228789399ef8730ab0c58d","infoHashBuffer":{"type":"Buffer","data":[71,173,215,159,155,250,249,26,210,34,135,137,57,158,248,115,10,176,197,141]},"announce":[],"urlList":[]}}