{"title":"Frank Zappa - 2007 - Buffalo FLAC","uid":8556661,"size":1129205431,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:47ccda5e9b8a79292308a09453785a6275eca5a6&amp;dn=Frank+Zappa+-+2007+-+Buffalo+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"eika256","files":-1,"time":1370784475,"description":"Frank Zappa - 2007 - Buffalo\n\nOfficial Release #80. Buffalo is a two-hour-and-20-minute, two-CD set chronicling Zappa's appearance at the Memorial Auditorium in Buffalo, NY, on October 25, 1980. At that time, the 39-year-old composer/guitarist/singer had assembled a particularly adept band including &quot;stunt&quot; guitarist Steve Vai and virtuoso drummer Vinnie Colaiuta and, freed from record company restrictions, was preparing a lot of new material for his new Barking Pumpkin Records label. The concert reflects that, looking forward to the upcoming Tinseltown Rebellion live album to be issued in May 1981 by presenting the title song, &quot;Pick Me, I'm Clean,&quot; and &quot;Easy Meat.&quot; You Are What You Is, Zappa's second double LP of 1981, was anticipated by the inclusion of its title song, &quot;Mudd Club,&quot; and &quot;The Meek Shall Inherit Nothing.&quot;\nAnd there was even an improvisation, &quot;Buffalo Drowning Witch,&quot; that presaged the 1982 album Ship Arriving Too Late to Save a Drowning Witch. When Zappa wasn't introducing new material, he was, for the most part, reprising recent songs such as &quot;City of Tiny Lites,&quot; &quot;Broken Hearts Are for Assholes,&quot; &quot;I'm So Cute,&quot; &quot;Dancing Fool,&quot; and &quot;Bobby Brown&quot; from Sheik Yerbouti, &quot;Joe's Garage&quot; from Joe's Garage, Act I, and &quot;Keep It Greasy&quot; and &quot;Stick It Out&quot; from Joe's Garage, Acts II &amp; III, all released in 1979, and his 1980 one-off single, &quot;I Don't Wanna Get Drafted.&quot; Only &quot;Ain't Got No Heart&quot; (also to be featured on Tinseltown Rebellion) dated from the '60s. The technical abilities of Zappa's band allowed for the rhythmic complexity and sudden shifts from one song to another in which he delighted, as the group suddenly changed from rapid-fire improvisatory playing to subtle vamping behind one of his comic monologues.\nThe Buffalo show was not one of Zappa's great performances; in fact, his repeated stumbling on the lyrics to &quot;Honey, Don't You Want a Man Like Me?&quot; might have condemned it to remain in the vaults. But it was a good one, and representative one of the 1980 tour, which should make it valuable to Zappa fans, particularly because it provides a true audio record of a full performance without the kinds of edits and overdubs Zappa was wont to employ on the live recordings he issued during his lifetime.\n\nTrack list:\nCD 1\n01. Chunga's Revenge 8:34\n02. You Are What You Is 4:12\n03. Mudd Club 3:02\n04. The Meek Shall Inherit Nothing 3:21\n05. Cosmik Debris 3:50\n06. Keep It Greasy 2:58\n07. Tinsel Town Rebellion 4:19\n08. Buffalo Drowning Witch 2:44\n09. Honey, Don't You Want A Man Like Me? 4:36\n10. Pick Me, I'm Clean 10:15\n11. Dead Girls Of London (FZ/Shankar) 3:02\n12. Shall We Take Ourselves Seriously? 1:36\n13. City Of Tiny Lites 9:58\nCD 2\n01. Easy Meat 9:26\n02. Ain't Got No Heart 2:00\n03. The Torture Never Stops 23:36\n04. Broken Hearts Are For Assholes 3:39\n05. I'm So Cute 1:38\n06. Andy 8:14\n07. Joe's Garage 2:12\n08. Dancing Fool 3:36\n09. The &quot;Real World&quot; Thematic Extrapolations 8:53\n10. Stick It Out 5:36\n11. I Don't Wanna Get Drafted 2:48\n12. Bobby Brown 2:42\n13. Ms Pinky 3:48\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:47ccda5e9b8a79292308a09453785a6275eca5a6","amp;dn":"Frank+Zappa+-+2007+-+Buffalo+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47ccda5e9b8a79292308a09453785a6275eca5a6","infoHashBuffer":{"type":"Buffer","data":[71,204,218,94,155,138,121,41,35,8,160,148,83,120,90,98,117,236,165,166]},"announce":[],"urlList":[]}}