{"title":"Hedningarna - Karelia Visa 1999","uid":6560633,"size":280500443,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:48cf053ab7979c82ee41bfce2e76cd5d6e6e83c9&amp;dn=Hedningarna+-+Karelia+Visa+1999&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"barber9","files":-1,"time":1311451557,"description":"Hedningarna ÃƒÂ¤r en svensk folkmusikgrupp. Gruppen bildades 1987. Den dÃƒÂ¥varande sÃƒÂ¤ttningen utgjordes av HÃƒÂ¥llbus Totte Mattson, Anders Norudde (dÃƒÂ¥ Stake) och BjÃƒÂ¶rn Tollin. De ville med sin musik utforska den ursprungliga nordiska folkmusiken. Gruppen anvÃƒÂ¤nder sig av mÃƒÂ¥nga olika sorters moraharpor, de svenska varianterna av sÃƒÂ¤ckpipan och vevliran samt fiol, Hardingfela, sÃƒÂ¤lgflÃƒÂ¶jter, ramtrummor, tamburin och ÃƒÂ¶vrigt slagverk, sÃƒÂ¥vÃƒÂ¤l som modern samplingteknik. Hedningarna var musiker i den uppmÃƒÂ¤rksammade teaterfÃƒÂ¶restÃƒÂ¤llningen Den stora vreden, och delar av den musik som anvÃƒÂ¤nts i fÃƒÂ¶restÃƒÂ¤llningen kom senare att ingÃƒÂ¥ i debutskivan. (wikipedia)\n\n- - -\n\nHedningarna's world is a place where primitive, brutal folk music collides with sampling and programming, forging a new direction. Hedningarna, the heathens in English, drive ancient Nordic music into the modern era paying no attention to the rules of the road. If ancient folk music is a dragon and it has an appetite for new ideas and technology, then Hedningarna have made a career of nurturing the beast. Their newly created tunes are an extension of the living tradition inspired by the melodies of their forebears. The intensity of modern technology mixed with the flavor of ancient instruments and tunes creates the explosive, intense sound of Hedningarna.\n\nAt the wheel of this freight train are the three founding members of the band, Anders Norudde, HÃƒÂ¥llbus Totte Mattsson, and BjÃƒÂ¶rn Tollin, who started the band in 1987. All three had affairs with rock and flirtations with other world music, but they came back home to Nordic music. In 1987 the band played together for the first time, Totte relates, When we joined together at the beginning Anders had his drone instruments, BjÃƒÂ¶rn had his tambourine and I had my lute, and, like an accident, we started to play together and these instruments, they loved each other. We're not interested in trying to be authentic or historical; we don't mind how it was done years ago, but we mind what wonderful instruments they had then. He adds Because we know the tradition, we write a lot of new stuff that is based on traditional ideas, scales, modes, rhythms and so on.\n \nAnders continues, We seek folk music with harsh melodies, twisted rhythms and percussive bass notes, the kind that was played in a lonely glade somewhere in the northern parts hundreds of years ago. No other music reaches so far down to our collective roots. There is so much power in the old music.\n \nThrough all the modern technology, Hedningarna remains true to the polska, an addictive three-beat rhythm unique to Sweden, a derivation of a dance from elsewhere in Europe in the 18th century. The polska is rhythmically complex and has many regional variations both musically and in dance forms. In modern day terms, the polska was the party music of that time, Anders explains People danced themselves into ecstasy to these compelling rhythms. This was not tolerated at all. The religious 'revival' movement killed much of the Swedish folk music tradition. The fiddle was regarded as the devil's instrument and was burned. As industrialization crowded out village life, this form of music nearly died out completely. The folk music that survived was 'refined' and 'respectable' not sweaty and ecstatic.\n \nHedningarna have a truly unique sound; they have taken old, forgotten melodies and created their own new folk mutation. It's nothing we've conciously thought out, it just happens. We were longing to arrange music in a different way, and this is what came out, says Anders with a shrug.\n\n- - -\n\nIn 1989 Hedningarna recorded their first release Hedningarna as the core trio. After hearing female Finnish voices wafting through the halls of the Sibelius Academy in Helsinki, Hedningarna invited Sanna Kurki-Suonio and Tellu Paulasto to join the band. With this lineup they recorded Kaksi! in 1992 and TrÃƒÂ¤ in 1994. For 1997's mostly instrumental Hippjokk, they returned to the core trio with some collaborations with Sami yoiker (or chanter) Wimme Saari who also has two solo recordings on NorthSide.\n \nFor 1999's emotionally potent Karelia Visa, the core trio was again joined by two Finnish singers, Sanna Kurki-Suonio and Anita Lehtola of Loituma, singing in the traditional Finnish runo-song style. Anita replaced Tellu Paulasto after she left the band to continue her studies in Finland. In 1999, when Sanna left to pursue her promising solo career, Liisa Matveinen replaced her.\n \nIn 1999, Hedningarna added Magnus Stinnerbom on octave violin to their line up. Magnus has his own band, Harv, with their first U.S. release Must released September 2000. (noside.com)\n\n- - -\n\nHedningarna - Karelia Visa 1999\n(Koppom Silence)\n\n 1. Veli\n 2. MitÃƒÂ¤ MinÃƒÂ¤\n 3. Alkusanat\n 4. Neidon Laulu\n 5. Ukkonen\n 6. Metsyn TyttÃƒÂ¶\n 7. StÃƒÂ¥pÃƒÂ¤ls\n 8. Viima\n 9. Heila\n10. Vispolska\n","torrent":{"xt":"urn:btih:48cf053ab7979c82ee41bfce2e76cd5d6e6e83c9","amp;dn":"Hedningarna+-+Karelia+Visa+1999","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48cf053ab7979c82ee41bfce2e76cd5d6e6e83c9","infoHashBuffer":{"type":"Buffer","data":[72,207,5,58,183,151,156,130,238,65,191,206,46,118,205,93,110,110,131,201]},"announce":[],"urlList":[]}}