{"title":"Cold Chisel ~ Very Best of","uid":4089463,"size":175430286,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:48d2c04c80eb8a2f37ab551a91567df0cd9a97c8&amp;dn=Cold+Chisel+%7E+Very+Best+of&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"gazzjazz","files":22,"time":1205994790,"description":"ok I can understand if the rest the world hasn&amp;#039;t heard of southern legends such as Split Enz, Crowded House &amp; Cold Chisel, but this is this possibly due to lack of communication\ncheck out this review from a American that moved to Australia:-\n\n5 stars Aussie&amp;#039;s best kept secret...you MUST get this CD!, April 6, 2000\nBy \tMichael J Harrington (Phoenix, Arizona USA) - See all my reviews\nI lived in Australia from 90-97, and had never heard of Chisel till I moved there. And what a pleasant shock it was when I found myself hearing this very CD (my first taste o&amp;#039;Chisel) and singing/stomping along on the first &amp;#039;spin&amp;#039;. This band is the essence of Oz - raw power and emotion with simply great tunes to back them. Why this band never made it HUGE in the US is beyond me...but heck, forget that and get this CD for an unprecedented treat GREAT music (esp for parties). Barnesy and Mossy are one of the best songwriting teams ever! I have since gone back and bought everything this band has done to make sure I didn&amp;#039;t &amp;#039;miss a beat&amp;#039;!\n\n\n\nnow check out this AMG review!!!\n\n\nReview\tby Jonathan Lewis\n\nCold Chisel started life as just another pub rock band, but it finished as one of Australia&amp;#039;s all-time greatest acts. This disc provides the perfect retrospective of one of the seminal Australian acts of the early &amp;#039;80s.\n\nCold Chisel was a band that was able to rock hard, but it also showed a deceptive depth and perceptiveness in their lyrics. They managed to record songs that covered not only a range of styles but a full range of emotions, from the bitter &quot;You Got Nothing I Want&quot; to the tender &quot;Choir Girl.&quot; They wrote tales of drunken excesses (&quot;Cheap Wine&quot;) and resigned sadnesses (&quot;Flame Trees&quot;), and their superb ode to a returned Vietnam War veteran, &quot;Khe Sanh,&quot; is a song that will forever epitomize this period of Australian music.\n\nWhile the drug and alcohol excesses of Cold Chisel and their lead singer Jimmy Barnes are the stuff of legend, their music never suffered for it. These songs are classics, and to have them all collected here makes this disc nothing short of sublime. \n\nI&amp;#039;ve included scanned cover art, plus an AMG bio\n\nhey really check this out...this is one of the best rock bands from OZ\nfrom by Barking Barnes &amp; lead guitars by Melting Moss\nbut the real secret here is the lyric writer &amp; keyboard player...go searching...it&amp;#039;s worth your while....a true Wild Turkey fan\n\nthanks for seeding again Pirates!!!\ncheers Gazza","torrent":{"xt":"urn:btih:48d2c04c80eb8a2f37ab551a91567df0cd9a97c8","amp;dn":"Cold+Chisel+%7E+Very+Best+of","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48d2c04c80eb8a2f37ab551a91567df0cd9a97c8","infoHashBuffer":{"type":"Buffer","data":[72,210,192,76,128,235,138,47,55,171,85,26,145,86,125,240,205,154,151,200]},"announce":[],"urlList":[]}}