{"title":"Exposé Greatest Hits 320cbr (Big Papi) 1995 Dance Pop","uid":9469800,"size":157578164,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:492502405b9a111d814ea30e0968b4afff48cecc&amp;dn=Expos%26eacute%3B+Greatest+Hits+320cbr+%28Big+Papi%29+1995+Dance+Pop&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1389534590,"description":"Source:  1995 CD\n\n\n\nBy Jennifer\n\nI had heard of Expose since they were being played on my favorite hits radio station where I live and I liked their whole &quot;get up and dance&quot; motive with infectious songs such as &quot;Point Of No Return&quot; and &quot;Come Go With Me&quot;, I didn't get serious with their music because well...I was naive. Now, being the mature teenager I am (cough) I brought the Greatest Hits collection at a used CD store and was amazed at such ignored talent!\n\nExpose covers a wide range of styles, from pop, Latin, R&amp;B and soul and they do a heck of a job doing it. Consisting of lovely women Ann, Janette and Gioia (who later left the group due to a throat problem and replaced by Kelly) these women crafted '80's freestyle and then some. I know some bigger fans of Expose say that this album is missing some songs but in all resepct it is a very well put together Greatest Hits, and one of the best greatest hits collections I own.\n\nThis album displays some pretty soild BIG hits, the upbeat, thumping &quot;Point Of No Return&quot; to the clubby, &quot;Come Go With Me&quot; and the soulful strut of &quot;Let Me Be The One&quot; and my all-time fave the sultry ballad &quot;Seasons Change&quot; as well as the driving, chanting vibe of &quot;Exposed to Love&quot; all from their debut &quot;Exposure&quot;. Then there's the stuff from their sophomore album, &quot;What You Don't Know&quot;. The big band, Latin sound of the can't-get-out-of-your-head title track, the strong message R&amp;B/hip-hop influence of &quot;Tell Me Why&quot;, sappy but sweet &quot;When I Looked At Him&quot; and the slow, begging song of &quot;Your Baby Never Looked Good In Blue&quot; hit the spot as well. Then there is the soft jam of &quot;I'll Never Get Over You Getting Over Me&quot; that eerily sounds like something Wilson Phillips would have done that I hadn't heard since I was a little thing! Aah! It's a sweet song that showcases Diane Warren's writing best. All in all a pretty worthy effort for these songs alone.\nThe remixes, I hate to say, aren't that incredible, I think they could have done without those (except for &quot;I Specialize In Love&quot; which was also a winner) and added some notable non-hits or something they did live, they also could have done without the new songs &quot;I'll Say Goodbye For The 2 Of Us&quot; and &quot;End Of The World&quot; which aren't even up to par with their Greatest.\n\nMy friends don't even know about Expose, which is a shame because they had some pretty awesome songs. What ever happened to them? They would be welcomed in today's music world because dance music is so popular now. Oh, wells I have another great CD to listen to and another new group that I like! :)[/quote]","torrent":{"xt":"urn:btih:492502405b9a111d814ea30e0968b4afff48cecc","amp;dn":"Expos%26eacute%3B+Greatest+Hits+320cbr+%28Big+Papi%29+1995+Dance+Pop","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"492502405b9a111d814ea30e0968b4afff48cecc","infoHashBuffer":{"type":"Buffer","data":[73,37,2,64,91,154,17,29,129,78,163,14,9,104,180,175,255,72,206,204]},"announce":[],"urlList":[]}}