{"title":"Programming Lego Mindstorms With Java","uid":8409448,"size":11145453,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4a24a21879d5e46161ff1588b340897fc7252269&amp;dn=Programming+Lego+Mindstorms+With+Java&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"roadjag","files":1,"time":1366878935,"description":"Please help seed I have satcoms wont be able to seed for long.\n\n\nLego robots! The first book that teaches you to program Lego Mindstorms using Java\nLego Mindstorms are a new generation of Lego Robots that can be manipulated using microcomputers, light and touch sensors, an infrared transmitter and CD-ROMs. Since Lego launched Lego Mindstorms in late 1998 sales have skyrocketed - with no sign of slowing down. Mindstorms have captured the imagination of adults and children alike, creating a subculture of Mindstorm enthusiasts around the world. The kits are now a staple part of engineering and computer science classes at many high profile Universities.\nUp until very recently, the only languages available to program Lego Mindstorms were NQC, pbForth, and legOS. This is the first book detailing how to program Lego Mindstorms using the newly released Java Virtual Machine for Lego Mindstorm programming. Programming Lego Mindstorms provides readers with all of the information they need to construct and program Lego Mindstorm Robots. ","torrent":{"xt":"urn:btih:4a24a21879d5e46161ff1588b340897fc7252269","amp;dn":"Programming+Lego+Mindstorms+With+Java","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a24a21879d5e46161ff1588b340897fc7252269","infoHashBuffer":{"type":"Buffer","data":[74,36,162,24,121,213,228,97,97,255,21,136,179,64,137,127,199,37,34,105]},"announce":[],"urlList":[]}}