{"title":"The Complete New Doctor Who","uid":6745207,"size":37919903728,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4afb894a1d89bb0f6a745aa29295d8ce6039f811&amp;dn=The+Complete+New+Doctor+Who&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Whovian22","files":93,"time":1318660931,"description":"The Complete New Doctor Who Contents Summary:\n\nWelcome to &quot;The Complete New Doctor Who&quot; as torrented, fixed up, rearranged, and re-created by yours truly.\nWithin these folders you will find the many wonderful episodes of the NewWHO series as well as a special beginning surprise.\n\nFew who begin watching NewWHO take the time to view &quot;Doctor Who: The Movie&quot; beforehand.\nHowever, here I give you the opportunity to do so, as shared by other torrent providers.\n\nThe contents of this folder are as follows:\nThe Eighth Doctor --&gt; &quot;Doctor Who: The Movie&quot;\nSeries 1 - The Ninth Doctor (Eccleston)\nSeries 2 - The Tenth Doctor (Tennant)\nSeries 3 - The Tenth Doctor (Tennant)\nSeries 4 - The Tenth Doctor (Tennant)\nSeries 4.5 - The Tenth Doctor (Tennant's final episodes)\nSeries 5 - The Eleventh Doctor (Smith)\nSeries 6 - The Eleventh Doctor (Smith)\n\nAs well as the aforementioned episodes and movie, this torrent also includes two mini-episodes.\nThese episodes are approximately three minutes a piece, and due to their continuity are kept in a single file.\n\nA file containing actor and director commentary, with previews to Series 6 may be torrented elsewhere, as well.\nHowever, since Series 6 is included here, I did not feel that was necessary.\n\nAs a final note, I will say that I recommend the media player VLC for this folder and its contents.\nVLC is a lesser-known player that has the capability to play around 99% of all media -- the remaining 1% being three-dimensional material.\nAs there are multiple file types in this torrent, I highly recommend VLC. \nWindows Media Player WILL NOT WORK for most of these.\n\nI hope to create new torrents as the new series are released, and I hope you'll look for them in the future!\nI hope you enjoy these as much as I have and will continue to enjoy them!\n\nFor Whovians who've seen the older series, a warning: This is NOT your parents' WHO. :)\n\nEnjoy~","torrent":{"xt":"urn:btih:4afb894a1d89bb0f6a745aa29295d8ce6039f811","amp;dn":"The+Complete+New+Doctor+Who","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4afb894a1d89bb0f6a745aa29295d8ce6039f811","infoHashBuffer":{"type":"Buffer","data":[74,251,137,74,29,137,187,15,106,116,90,162,146,149,216,206,96,57,248,17]},"announce":[],"urlList":[]}}