{"title":"Pavia 1525: The Climax of the Italian Wars","uid":11783025,"size":16824725,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4b5efab81961e2be478a062d636d91c2edd07df4&amp;dn=Pavia+1525%3A+The+Climax+of+the+Italian+Wars&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1427667291,"description":"By 1525, France had been campaigning in Italy for over 30 years. Her original intention, in 1494, had been to enforce her claim to the kingdom of Naples, but by the turn of the century her attention had focused on the more accessible and richer Duchy of Milan. The French armies were opposed or assisted at varying times by Italian states - either individual states or alliances - with both sides calling upon the support of Swiss, German and Italian mercenaries. In these campaigns France's toughest adversary was the Spanish army, and when the thrones of Spain and Austria were combined in 1519, it altered the whole nature of the Italian wars. The Hispano-Imperial victory at Pavia in 1525 was not only the product of this union, but also the most decisive battle of the Italian wars. In a titanic clash the French were smashed by the Imperial army, King Francis I captured, and the cream of his nobility slaughtered. A military cataclysm on a scale France had not seen since Agincourt, it swung the balance of power in western Europe towards the Empire of Charles V. Hailed as the first modern battle, Pavia saw the demise of the traditionally armed man-at-arms and the rise of hand held firearms. Angus Konstam examines this important action and the campaign that led to it","torrent":{"xt":"urn:btih:4b5efab81961e2be478a062d636d91c2edd07df4","amp;dn":"Pavia+1525%3A+The+Climax+of+the+Italian+Wars","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b5efab81961e2be478a062d636d91c2edd07df4","infoHashBuffer":{"type":"Buffer","data":[75,94,250,184,25,97,226,190,71,138,6,45,99,109,145,194,237,208,125,244]},"announce":[],"urlList":[]}}