{"title":"How.Women.Abuse.Men.Using.Their.Sexuality.(A Must Read)","uid":6874760,"size":775245,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4bcd7553a8fe8825f1d84cbad2d827c86dd11799&amp;dn=How.Women.Abuse.Men.Using.Their.Sexuality.%28A+Must+Read%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Heterodox","files":1,"time":1323375312,"description":"Sex-Ploytation.How.Women.Abuse.Men.Using.Their.Sexuality.(A Must Read)[J-William]\n\nTwenty-five years ago, a remarkable book was published entitled The Manipulated Man.\nIts author was Esther Vilar, an Argentinian-born physician and psychologist, who had\nemigrated from her native Buenos Aires to West Germany. From the vantage point of\nsuch rich cultural experience, Vilar was in a unique position to cast a critical eye on the\nsocial milieu of the 1960's and 70's; and because she had managed to disencumber herself\nfrom the hypocrisy so natural to her gender, she was free to unleash her intelligence as a\nruthlessly honest critic of male/female relationships.\nAlthough it was only a slim volume, The Manipulated Man nevertheless packed the\nwallop of a hand grenade. Vilar's crucial thesis was that women, by manipulating men\nwith sex, have conditioned them to respond like Pavlov's dogs, to be shackled into a\nlifetime of subservience and slavery for the fulfillment of female desires. It was a coldblooded\nmanipulation, indeed. To Vilar, the typical American housewife was nothing\nmore than a parasitic prostitute living off the bounty of her husband's hard labor,\nmercilessly goading him to make more money so that she could enjoy the finer things in\nlife without any expenditure of effort on her part. In her words: &quot;Women live an animal\nexistence. They like eating, drinking, sleeping-even sex, providing there is nothing to do\nand no real effort is required of them.&quot;\nExtreme though her conclusions appeared to be, nevertheless Vilar had hit her target dead\ncenter. Predictably enough, the book touched off a furor of controversy and female rage\n(it was vilified as a textbook of misogyny). Women's age-old scam of trading sex for\nfood and shelter, so long whitewashed by tacit societal approval, had been suddenly\nspotlighted under the stark glare of public scrutiny. Women protested; Vilar was\ncondemned as a traitor to her gender; copies of the book were confiscated and burned by\nthreatened wives and girlfriends. The female con game had been at last exposed, and the\ntruth burned like the slash of a knife.\nThe late 60's and early 70's was an era of abrupt and tumultuous cultural change, and\nVilar might have thought she had touched a nerve in younger readers. Giddily\nempowered by a reckless interpretation of the new fad of feminism, women began to\nburn their bras and to clamor for better jobs and pay equal to their male counterparts. The\ninvention of the birth control pill freed them to experiment with sex, to enjoy its pleasures\nwithout fear of pregnancy. The sort of women Vilar had been castigating-housewives\nidling away their afternoons lunching with girlfriends and withholding sex until their\nhusbands bought them a bigger diamond ring or a fur coat-suddenly seemed hopelessly\npassÃƒÂ©. An unstoppable tide of liberation seemed to have turned. Yesterday's whores\nwould hand down their burnt-out torches of greed to an enlightened generation of women\nwho treasured men as partners in life, not meal tickets. Sex had become a celebration, no\nlonger a tool to extort money from men. A new age had begun......\n\n\n\ndownload to read\n\nseed! seed! seed!\t\n\nkick ass torrent http://www.kat.ph/user/j-william/\t","torrent":{"xt":"urn:btih:4bcd7553a8fe8825f1d84cbad2d827c86dd11799","amp;dn":"How.Women.Abuse.Men.Using.Their.Sexuality.%28A+Must+Read%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4bcd7553a8fe8825f1d84cbad2d827c86dd11799","infoHashBuffer":{"type":"Buffer","data":[75,205,117,83,168,254,136,37,241,216,76,186,210,216,39,200,109,209,23,153]},"announce":[],"urlList":[]}}