{"title":"The Blackstone Chronicles Omnibus - John Saul","uid":9640567,"size":2553600,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4bd1c79e2372efcdeedf08cb12eb289eeb51f73b&amp;dn=The+Blackstone+Chronicles+Omnibus+-+John+Saul&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"ZamKhan","files":-1,"time":1392919920,"description":"Now, for the first time, the New York Times bestselling serial thriller is complete in one terrifying volume. John Saul, the master of supernatural suspense, John Saul, brings to chilling life the small New England town of Blackstone--and the secrets and sins that lay buried there. . . .\nFrom atop Blackstone's highest hill, the old Asylum casts its shadow over the village. Built in the 1890s to house the insane, the Asylum has stood vacant for decades. But now, the wrecker's ball is about to strike--and unleash an ominous evil. Strange gifts begin to appear on the doorsteps of Blackstone's finest citizens.\nEach bears a mysterious history.\nEach brings a horrifying power to harm.\nEach reveals another thread in the suspensefully woven web of . . .\n\nTHE BLACKSTONE CHRONICLES\n\nContents\nPart I--An Eye for an Eye: The Doll: When the demolition of Blackstone Asylum is postponed due to financial problems, worried contractor Bill McGuire receives the mysterious gift of an antique doll, which is snatched up by his small daughter and contains a terrible evil.\n\nPart II--Twist of Fate: The Locket: His career as president of the First National Bank threatened by a troubling audit, Jules Hartwick is further disturbed when he receives a mysterious silver locket that, once opened, sets off a terrifying chain of events, in the second of a six-part serial saga.\n\nPart III--Ashes to Ashes: The Dragon's Flame: Rebecca Morrison purchases the perfect &quot;&quot;welcome home&quot;&quot; gift for her cousin Andrea, an exotic cigarette lighter in the form of a dragon, a gift that inflames the darkest passions of the human heart.\n\nPart IV--In the Shadow of Evil: The Handkerchief: While digging through his attic, Oliver Metcalf discovers a handkerchief with a beautifully embroidered &quot;&quot;R&quot;&quot; in one corner and gives it to Rebecca, but this handkerchief has a terrifying history and is about to take part in another nightmare\n\nPart V--Day of Reckoning: The Stereoscope: When attorney Ed Becker spots the carved antique dresser in a dusty attic, he takes it to restore. Then his young daughter, Amy, makes a curious discovery: Inside one of the drawers she finds a set of old pictures and a stereoscope, an old-fashioned device that allows you to see images in three dimensions. Oddly, one of the photos resembles their house, where Eds grandmother lived long ago. But the scenes inside the stereoscope also bring to vivid life some terrifying memories, eerie images that seem all too real. . . \n\nPart VI--Asylum: Editor Oliver Metcalf has written a provocative article on the Asylum that implies there may be a curse on the town. The community is outraged, charging him with inflaming hysteria. More urgent is the mysterious disappearance of Rebecca Morrison. As Blackstone rallies to find the missing woman, a mysterious package arrives on Harvey Connally's front porch. The contents hold the ultimate, grisly key to the horrors of the Asylum. Now, at last, Oliver must confront the gruesome truth of the past--one that threatens to crush all the inhabitants of Blackstone in one final grip of terror. . . .","torrent":{"xt":"urn:btih:4bd1c79e2372efcdeedf08cb12eb289eeb51f73b","amp;dn":"The+Blackstone+Chronicles+Omnibus+-+John+Saul","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4bd1c79e2372efcdeedf08cb12eb289eeb51f73b","infoHashBuffer":{"type":"Buffer","data":[75,209,199,158,35,114,239,205,238,223,8,203,18,235,40,158,235,81,247,59]},"announce":[],"urlList":[]}}