{"title":"Passages Part 2 (Classic XXX)","uid":7194216,"size":1116554478,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:4cdad4dda18e0b01ad941bd17fbc52aceb585235&amp;dn=Passages+Part+2+%28Classic+XXX%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":4,"uploader":"chkm8te","files":4,"time":1334739715,"description":"Screens: &lt;a href=&quot;\nhttp://4ufrom.me/viewer.php?file=nh1ygxbricwhv3ztkub0.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://4ufrom.me/viewer.php?file=nh1ygxbricwhv3ztkub0.jpg&lt;/a&gt;\n\n\nCoed Jennifer Stewart's coming of sexual age continues. She's still pretty naive when it comes to the birds and the bees. But now that she and her &quot;lover&quot; Marc Wallice have gotten their first, furtive sexual encounter out of the way (a great piece of spontaneous combustion in the first film), they're methodical and practiced in their approach. Stewart is now diddling around with birth control, and it's very uncomfortable for her.In a crying jag, she opens herself to roommate Christy Canyon which prompts a wonderful speech about screwing taking a piece of your heart (sounds like something from Janis Joplin) but giving an extra measure of assuredness and self confidence in return. Stewart, however, is still unaware that Canyon, the person she loves, is going behind her back and having an affair with Wallice.It's almost sickening to hear the patronizing both Wallice and Canyon afford Stewart in this situation. &quot;She's such a nice girl...&quot; But that's the intended response for the viewer, and it certainly doesn't marshal any sympathy behind Canyon's character, either. So when Wallice, in a surprising move, dumps Canyon (you're really thinking he's going to do it to Stewart), you're basically left with the feeling that Christy has gotten just what she deserved - which kind of leaves me flat for the finale - the cry-on-my-shoulders consolation scene between Stewart and Canyon.That aside, Passages 2 is poignant, touching, and has some memorable character interaction. Both Stewart and Canyon are wonderful and convincing in their respective roles, and for good measure, the sex is evoked with warm, melodramatic efficiency. Both Passages and Passages 2, plus the two upcoming sequels, are wonderful additions to your couples section, and certainly will restore your faith in the quality of adult productions.\nThis sequel is even better than the original , with dirty talking Christy Canyon great threesome with Mark Wallice and TT Boy.\n\nScene Breakdowns:\nScene 1. Christy Canyon, Marc Wallice\nScene 2. Carolyn Monroe, Christy Canyon, Heather Hart, Peter North\nScene 3. Jennifer Stewart, Marc Wallice\nScene 4. Christy Canyon, Marc Wallice, TT Boy\nScene 5. Christy Canyon, Jennifer Stewart","torrent":{"xt":"urn:btih:4cdad4dda18e0b01ad941bd17fbc52aceb585235","amp;dn":"Passages+Part+2+%28Classic+XXX%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4cdad4dda18e0b01ad941bd17fbc52aceb585235","infoHashBuffer":{"type":"Buffer","data":[76,218,212,221,161,142,11,1,173,148,27,209,127,188,82,172,235,88,82,53]},"announce":[],"urlList":[]}}