{"title":"Illustrated C# 2010 ","uid":6547315,"size":11232767,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4d347f4f2fa44c7ba314fcde941e8beac7c0ce62&amp;dn=Illustrated+C%23+2010+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"TheBookie","files":-1,"time":1310925840,"description":"Illustrated C# 2010 (Experts Voice in .NET) by Daniel Solis \n\nThis book presents the C# language in a uniquely succinct and visual format. Often in programming books, the information can be hidden in a vast sea of words. As a programmer who has over the years used a dozen programming languages, the author understands it can sometimes be difficult to slog through another 1,000-page book of dense text to learn a new language. There are likely many other programmers who feel the same way. To address this situation, this book explains C# using figures; short, focused code samples; and clear, concise explanations.\n\nFigures are of prime importance in this book. While teaching programming seminars, Solis found that he could almost watch the lightbulbs going on over the students heads as he drew the figures on the whiteboard. In this text, he has distilled each important concept into simple but accurate illustrations. The visual presentation of the content will give you an understanding of C# thats not possible with text alone.\n\nFor something as intricate and precise as a programming language, however, there must be text as well as figures. But rather than long, wordy explanations, Solis has used short, concise descriptions and bulleted lists to make each important piece of information visually distinct.\n\nBy the end of this book, youll have a thorough working knowledge of all aspects of the C# language, whether youre a novice programmer or a seasoned veteran of other languages. If you want a long, leisurely, verbose explanation of the language, this is not the book for you. But if you want a concise, thorough, visual presentation of C#, this is just what youre looking for.","torrent":{"xt":"urn:btih:4d347f4f2fa44c7ba314fcde941e8beac7c0ce62","amp;dn":"Illustrated+C%23+2010+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d347f4f2fa44c7ba314fcde941e8beac7c0ce62","infoHashBuffer":{"type":"Buffer","data":[77,52,127,79,47,164,76,123,163,20,252,222,148,30,139,234,199,192,206,98]},"announce":[],"urlList":[]}}