{"title":"Nico Gomez and his Afro Percussions Inc. - Ritual (1971) MP3@320","uid":9634171,"size":90537325,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4d430acfe4de891991ca267406bb95f966c40e0b&amp;dn=Nico+Gomez+and+his+Afro+Percussions+Inc.+-+Ritual+%281971%29+MP3%40320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"AaronVincent","files":11,"time":1392826067,"description":"Belgium, not the first place you'd think of when it comes to Latin or Afro funk. Yet one of the greatest records to blend both styles came from the small northern European country, masterminded by Nico Gomez and his Afro Percussion Inc.\n\nRitual was originally released in 1971 on the Dutch label Omega International (Gomez was born in Holland before moving to Belgium in the late 40s) and is being reissued by Mr Bongo in 2013, bringing its blazing funk grooves to both new ears and those already tuned in to this masterpiece's legacy.\n\nAcross its 11 tracks Ritual delivers the kind of production, arrangement and musicianship that rightfully belong in a dictionary next to the definition of professional. Gomez' band was tight and they knew it, showing it off on their covers of Perez Prado's 'Caballo Negro' and 'Lupita' by injecting the originals with a deep funk that blends both Afro and Latin influences. On 'Samba De Una Nota So' and 'El Condor Pasa', another pair of covers, they switch to soulful downtempo with mesmerising ease. The title cut remains one of the album's highlights, a devastating dancefloor groove with horns to match that has aged beautifully and was heavily sampled by Liquid People for 'The Dragon'. 'Pa! Pa! Pa! Pa!' adds touches of rock with fuzzy guitars for one of the album's headier experiences.\n\nRitual is a perfect example of the kind of experimentation that was rife in the 70s and which, when done as well as on this album, proves quite simply timeless.","torrent":{"xt":"urn:btih:4d430acfe4de891991ca267406bb95f966c40e0b","amp;dn":"Nico+Gomez+and+his+Afro+Percussions+Inc.+-+Ritual+%281971%29+MP3%40320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d430acfe4de891991ca267406bb95f966c40e0b","infoHashBuffer":{"type":"Buffer","data":[77,67,10,207,228,222,137,25,145,202,38,116,6,187,149,249,102,196,14,11]},"announce":[],"urlList":[]}}