{"title":"The Penguin Complete Novels of Nancy Mitford","uid":12892779,"size":1618976,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4d8639b820612ddf222fb54894be3b9e65cea2d6&amp;dn=The+Penguin+Complete+Novels+of+Nancy+Mitford&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ZamKhan","files":1,"time":1449147261,"description":"The Penguin Complete Novels of Nancy Mitford, with an introduction by India Knight. In print together for the first time in many years, and here in one volume, are all eight of Nancy Mitford's sparklingly astute, hilarious and completely unputdownable novels, with a new introduction by India Knight.\r\nPublished over a period of 30 years, they provide a wonderful glimpse of the bright young things of the thirties, forties, fifties and sixties in the city and in the shires; firmly ensconced at home or making a go of it abroad; and what the upper classes really got up to in peace and in war. \r\n\r\n'Entirely original, inimitable and irresistible' Spectator 'Deliciously funny' Evelyn Waugh \r\n'Utter, utter bliss' Daily Mail\r\nNancy Mitford (1904-1973) was born in London, the eldest child of the second Baron Redesdale. Her childhood in a large remote country house with her five sisters and one brother is recounted in the early chapters of The Pursuit of Love (1945), which according to the author, is largely autobiographical. Apart from being taught to ride and speak French, Nancy Mitford always claimed she never received a proper education. \r\nShe started writing before her marriage in 1932 in order 'to relieve the boredom of the intervals between the recreations established by the social conventions of her world' and had written four novels, including Wigs on the Green (1935), before the success of The Pursuit of Love in 1945. After the war she moved to Paris where she lived for the rest of her life. \r\nShe followed The Pursuit of Love with Love in a Cold Climate (1949), The Blessing (1951) and Don't Tell Alfred (1960). She also wrote four works of biography: Madame de Pompadour, first published to great acclaim in 1954, Voltaire in Love, The Sun King and Frederick the Great. \r\nAs well as being a novelist and a biographer she also translated Madame de Lafayette's classic novel, La Princesse de Clèves, into English, and edited Noblesse Oblige, a collection of essays concerned with the behaviour of the English aristocracy and the idea of 'U' and 'non-U'. Nancy Mitford was awarded the CBE in 1972","torrent":{"xt":"urn:btih:4d8639b820612ddf222fb54894be3b9e65cea2d6","amp;dn":"The+Penguin+Complete+Novels+of+Nancy+Mitford","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d8639b820612ddf222fb54894be3b9e65cea2d6","infoHashBuffer":{"type":"Buffer","data":[77,134,57,184,32,97,45,223,34,47,181,72,148,190,59,158,101,206,162,214]},"announce":[],"urlList":[]}}