{"title":"Standup Comedy - Bobcat Goldthwait - Share The Warmth","uid":5551998,"size":24816979,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4e4d52252dfa172769f15f7a654f9852ec6f8b92&amp;dn=Standup+Comedy+-+Bobcat+Goldthwait+-+Share+The+Warmth&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rambam1776","files":-1,"time":1273575717,"description":"Evening with Bobcat Goldthwait - Share the Warmth\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0092990/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0092990/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.amazon.com/Evening-Bobcat-Goldthwait-Share-Warmth/dp/6302034892&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Evening-Bobcat-Goldthwait-Share-Warmth/dp/6302034892&lt;/a&gt;\n\n\nBy Robert I. Hedges\n\nThis review is from: An Evening with Bobcat Goldthwait - Share the Warmth [VHS] (VHS Tape)\n\nThis is a tape of a 54 minute nightclub performance of Bobcat Goldthwait from 1987, right after his success in the dreadful 'Police Academy' movies. I think he is a very talented and original comic, but also think that he got better with age; his latest CD &quot;I Don't Mean to Insult You but You Look Like Bobcat Goldthwait&quot; is absolutely hilarious.\n\nThis tape does have some funny material, much of it improvised interplay with the cameramen, hecklers, and the quirky lightshow in the club, but a lot of the material is very dated and doesn't really stand the test of time too well. Aside from a bit too much emphasis on his trademark guttural utterances, his material on (then) contemporary politics doesn't play too well seventeen years later, particularly the Reagan and Iran Contra jokes, which would have been modestly funny at the time, but are now mere historical trivialities that most people (especially younger fans) won't remember enough about to even comprehend.\n\nOverall, an adequate performance (though the actual quality of the tape itself is of average quality at best) with a few very funny bits (like the Dr. Seuss and Shakespeare collaboration), and a lot of dated references that don't play as well now as they did at the time this was made. For truly great Bobcat, check out his new CD instead of this relic. \n\n","torrent":{"xt":"urn:btih:4e4d52252dfa172769f15f7a654f9852ec6f8b92","amp;dn":"Standup+Comedy+-+Bobcat+Goldthwait+-+Share+The+Warmth","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e4d52252dfa172769f15f7a654f9852ec6f8b92","infoHashBuffer":{"type":"Buffer","data":[78,77,82,37,45,250,23,39,105,241,95,122,101,79,152,82,236,111,139,146]},"announce":[],"urlList":[]}}