{"title":"Fighting American","uid":4566122,"size":263961713,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:4e83a83a0f93634dbce99daa202f34e76e4467db&amp;dn=Fighting+American&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"brodahisou","files":-1,"time":1228873802,"description":"Fighting American is a patriotic comic book character created in 1954 by writer Joe Simon and artist Jack Kirby, published by Cretswood Publication / Prize Comics and, against normal industry practices, creator-owned. It was later published by Harvey Comics, DC Comics and Awesome Entertainment.\n\nThe character was similar to war-era Captain America (aside from his jingoisticly patriotic attitude), wore a similar flag-inspired costume, and worked with a youthful sidekick, Speedboy, but didn't use a shield. Joe Simon told a panel audience at the 1974 New York Comic Art Convention that the character was not so much inspired by Captain America as it was simply a product of the times.\n\nFighting American was brought back in 1994 in a six-issue mini-series, published by DC Comics, where the character was turned into a former radio host bent on avenging his brother's death, and later in 1997 by Awesome Entertainment, based loosely on the Simon/Kirby stories, as a retired hero coping with the death of his partner.\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:4e83a83a0f93634dbce99daa202f34e76e4467db","amp;dn":"Fighting+American","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e83a83a0f93634dbce99daa202f34e76e4467db","infoHashBuffer":{"type":"Buffer","data":[78,131,168,58,15,147,99,77,188,233,157,170,32,47,52,231,110,68,103,219]},"announce":[],"urlList":[]}}