{"title":"McFadden - Federal Reserve Exposed (collective speeches of US Co","uid":8418159,"size":1587295,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4eccb777bde8f11d45e44fc8efec8454da583d8f&amp;dn=McFadden+-+Federal+Reserve+Exposed+%28collective+speeches+of+US+Co&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"red_gonzo","files":1,"time":1367103863,"description":"This is Louis T. McFadden's explosive book Federal Reserve Exposed - Collective Speeches of Congressman Louis T. McFadden (1970) which contains the fiery speeches of US Congressman Louis T. McFadden made in the House of Representatives from February 26, 1930 through June 15, 1934. McFadden, due to his having served as Chairman of the Banking and Currency Committee for more than 10 years, was the best posted man on these matters in America and was in a position to speak with authority of the vast ramifications of this gigantic private credit monopoly known as the Federal Reserve system. A banker by trade, he was an opponent of the Federal Reserve system, and was the chief sponsor of the McFadden Act of 1927 which limited federal branch banks to the city in which the main branch operates. On May 23, 1933, McFadden, brought formal charges against the Board of Governors of the Federal Reserve Bank system, The Comptroller of the Currency and the Secretary of United States Treasury for numerous criminal acts, including but not limited to, conspiracy, fraud, unlawful conversion, and treason. He also attempted to impeach President Herbert Hoover. Federal Reserve Exposed is a treasure chest of information about who exactly is behind the financial web that gripped America by the neck. No student of history, politics, or government will want to be without this important book. 540 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:4eccb777bde8f11d45e44fc8efec8454da583d8f","amp;dn":"McFadden+-+Federal+Reserve+Exposed+%28collective+speeches+of+US+Co","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4eccb777bde8f11d45e44fc8efec8454da583d8f","infoHashBuffer":{"type":"Buffer","data":[78,204,183,119,189,232,241,29,69,228,79,200,239,236,132,84,218,88,61,143]},"announce":[],"urlList":[]}}