{"title":"Alison Weir - Lady Jane Grey: The Innocent Traitor (Unabridged)","uid":4551808,"size":526877191,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:4edc0878321c5a84356651060b1bd72c60a90b19&amp;dn=Alison+Weir+-+Lady+Jane+Grey%3A+The+Innocent+Traitor+%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dougietrotter","files":-1,"time":1228334270,"description":"Lady Jane Grey was a great-niece of King Henry VIII of England, and the term political pawn could have been invented for her. In alternating voices, each distinctively authentic, Weir lets Lady Jane and other individuals involved in her life and fate tell their sides of the story, and what a story it is. \n\nKing Henry, it will be remembered, had succession problems: namely, until his marriage to his third wife, he had no male heir. Added to that was the age's seemingly irresolvable conflict between Protestants and Catholics. Therein lay the trouble for the teenage Lady Jane. She was thrust by her power-hungry and caustically Protestant parents into a plot to place her on the throne upon the death of the little king Edward VI, the late king Henry's Protestant son, instead of the legal heiress, the Catholic princess Mary. \n\nMary won the day and throne, and Lady Jane went to the block. Weir finds Jane an intelligent individual, a thinker in her own right; but, tragically, given the times and the power available to the &quot;grown-ups&quot; around her, she ultimately could not resist the political currents swirling over her. A brilliantly vivid and psychologically astute novel.","torrent":{"xt":"urn:btih:4edc0878321c5a84356651060b1bd72c60a90b19","amp;dn":"Alison+Weir+-+Lady+Jane+Grey%3A+The+Innocent+Traitor+%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4edc0878321c5a84356651060b1bd72c60a90b19","infoHashBuffer":{"type":"Buffer","data":[78,220,8,120,50,28,90,132,53,102,81,6,11,27,215,44,96,169,11,25]},"announce":[],"urlList":[]}}