{"title":"Everything You Know About English Is Wrong","uid":7858283,"size":4200615,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4f65ee93e289d419282406f21e0da5204afc7add&amp;dn=Everything+You+Know+About+English+Is+Wrong&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1353802952,"description":" Bill Brohaugh, &quot;Everything You Know About English Is Wrong&quot;\n2008 | ISBN-10: 140221135X | 256 pages | PDF | 4 MB\n\nI don't know how else to tell you this...everything you know about English is wrong.\n&quot;If you love language and the unvarnished truth, you'll love Everything You Know About English Is Wrong. You'll have fun because his lively, comedic, skeptical voice will speak to you from the pages of his word-bethumped book.&quot;\n-Richard Lederer, author of Anguished English, Get Thee to a Punnery, and Word Wizard\nNow that you know, it's time to, well, bite the mother tongue. William Brohaugh, former editor of Writer's Digest, will be your tour guide on this delightful journey through the English language, pointing out all the misconceptions about our wonderful-and wonderfully confusing-native tongue. Tackling words, letters, grammar and rules, no sacred cow remains untipped as Brohaugh reveals such fascinating and irreverent shockers as:\n- If you figuratively climb the walls, you are agitated/frustrated/crazy. If you literally climb the walls, you are Spiderman.\n- &quot;Biting the Mother Tongue&quot;: English does not come from England.\n- The word &quot;queue&quot; is the poster child of an English spelling rule so dominant we'll call it a dominatrix rule: &quot;U must follow Q! Slave!&quot;\n- So much of our vocabulary comes from the classical languages-clearly, Greece, and not Grease, is the word, is the word, is the word.\n-Emoticons: Unpleasant punctuational predictions\n&quot;Better plotted than a glossary, more riveting than a thesaurus, more filmable than a Harry Potter index-and that's just Brohaugh's footsnorts... Imean, feetsnotes...umfeetsneets?...good gravy I'mglad I'mjust a cartoonist.&quot;\n-John Caldwell, one of Mad magazine's Usual Gang of Idiots\nThis book guarantees you'll never look at the English language the same way again-if you write, read or speak it, it just ain't possible to live without this tell-all guide. (&quot;Ain't,&quot; incidentally, is not a bad word.) ","torrent":{"xt":"urn:btih:4f65ee93e289d419282406f21e0da5204afc7add","amp;dn":"Everything+You+Know+About+English+Is+Wrong","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f65ee93e289d419282406f21e0da5204afc7add","infoHashBuffer":{"type":"Buffer","data":[79,101,238,147,226,137,212,25,40,36,6,242,30,13,165,32,74,252,122,221]},"announce":[],"urlList":[]}}