{"title":"Led Zeppelin - 1975.03.21 Seattle, Washington","uid":15661951,"size":435953178,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4f8632feeb5b5f610533eca11f10704a2f641088&amp;dn=Led+Zeppelin+-+1975.03.21+Seattle%2C+Washington+MP3%40320&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mysterioso","files":15,"time":1472183852,"description":"Led Zeppelin - 1975.03.21 Seattle, Washington   \r\n\r\nArtist: Led Zeppelin\r\nDate: Friday, March 21, 1975\r\nLocation: Seattle, Washington\r\nVenue: Seattle Center Coliseum\r\nSource: Audience (Source 1)\r\nTransferred By: weedwacker (Andy R.)\r\n\r\nSource: \r\nIncomplete excellent 1st audience source. 182 minutes.\r\n\r\nDetails: \r\nIt is extremely clear and very sharp source and all the \r\ninstruments are in excellent balance. The audience noise \r\nis really small here. It is reported that taper situated \r\nrecorder on top of a nearby stack of unused folding chairs \r\nin the second tier of the huge arena and left recording \r\nwhile he returned to his seat.\r\n\r\nTracklist:\r\n\r\n01. Introduction* 2:15\r\n02. Rock And Roll 3:42\r\n03. Sick Again 6:42\r\n04. Over The Hills And Far Away 8:55\r\n05. In My Time Of Dying 12:47\r\n06. The Song Remains The Same 5:20\r\n07. The Rain Song 9:22\r\n08. Kashmir 10:26 \r\n09. No Quarter** 25:27\r\n10. Since I've Been Loving You 9:25\r\n11. Trampled Underfoot 10:18\r\n12. Moby Dick 28:00\r\n13. Dazed And Confused 42:22\r\n14. Stairway To Heaven(cut) 5:58\r\n\r\nRuntime 180:59\r\n\r\n* small cut missing part of the announcer's introduction speech\r\n** small cut missing about 2 minutes of audience banter between No Quarter\r\nand Since I've Been Loving You due to a reel change\r\n\r\nThe story of how the show was taped:\r\n&quot;Through a series of intricate negotiations, clandestine meetings and[actually] just a stroke of luck, I recently spoke with the individual who made the recording used as the source for Seattle Supersonic and Hammer Of The Gods. It should be noted that [Stan] had no intention of recording the shows for use on a bootleg--he was simply a recording hobbyist and Zep fan, taping for the \r\nenjoyment of himself and his friends.\r\n\r\n[Stan] utilized a portable Tandberg full-track, mono reel-to-reel tape deck.  The machine was the size of a small typewriter and ran on ten &quot;D&quot; batteries and the Zep shows were recorded at a tape speed of 7 1/2 ips, part of the reason for the excellent sound quality (cassettes run at 1 7/8 ips and faster tape speed yields better sound). \r\n\r\nTo avoid any hassles in bringing in his equipment into the Coliseum, [Stan]--who at the time had quite short hair--dressed very &quot;straight.&quot; He walked right up to one of the policemen stationed at the door, holding up his black shoulder bag containing the tape deck and proclaimed &quot;I've got my equipment right here, if you want to check it!&quot; The cop didn't even open the bag, he just escorted our man to the ticket-taker and ushered him into the building, no doubt thinking anyone looking that straight and behaving in such an up-front manner must be authorized. It was a different era, to be sure!\r\n\r\nOn Friday (March 21), he arrived on time and got everything going fine for the first reel of tape as well as the second [a misloaded tape, flipped to the non-recording side, yielded a blank second reel and hence incomplete Seattle '75 master]. The band performed at extremely high volume, and the location of the equipment not only solved the audience noise problem, it captured the sound coming out of the PA system in a uniquely 'distilled  fashion'-not a lot of room reverb, and an extremely even balance between the different elements of the music. -HJ\r\n\r\nComments: \r\nThis show is one of the best from the 1975 tour. The entire show and length are impressive, but what makes this so memorable are the two epics. No Quarter is 30 minutes long and one of the best ever. But here, we have the second to last longest ever Dazed And Confused, clocking in at 45 minutes and it is the best one ever (the other one, clocks at 46, can be found on the last LA date, on March 27th). It moves through several sections and has many dynamic contrasts to keep it interesting throughout ... it doesn't seem like 45 minu","torrent":{"xt":"urn:btih:4f8632feeb5b5f610533eca11f10704a2f641088","amp;dn":"Led+Zeppelin+-+1975.03.21+Seattle%2C+Washington+MP3%40320","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f8632feeb5b5f610533eca11f10704a2f641088","infoHashBuffer":{"type":"Buffer","data":[79,134,50,254,235,91,95,97,5,51,236,161,31,16,112,74,47,100,16,136]},"announce":[],"urlList":[]}}