{"title":"Damien Jurado...Maraqopa(2012)[FLAC]","uid":7143804,"size":225429481,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4fe2f8423630976f99deac380cbe97179ea4174b&amp;dn=Damien+Jurado...Maraqopa%282012%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":14,"time":1333085869,"description":"\n1. Nothing is the News\n2. Life Away from the Garden\n3. Maraqopa\n4. This Time Next Year\n5. Reel to Reel\n6. Working Titles\n7. Everyone a Star\n8. So On, Nevada\n9. Museum of Flight\n10. Mountains Still Asleep\n\nWelcome to Maraqopa, population 2. Damien Jurado's newest collaboration with producer Richard Swift drops us into a brutal and benevolent landscape. The bold strokes and new turns the pair made with 2010's Saint Bartlett are taken even further. He throws open the gate on his oft insular dirges and allows them do some real wilding out in the canyon. In Maraqopa, the vistas are miles-wide; the action is more dynamic; the close-ups sweaty and snarling. The strummed desert blues that begin &quot;Nothing is the News&quot; quickly bursts open into an Eddie Hazel-worthy supernova shred session, all of it swirling in tinny-psych and Echoplex'd howls. We've never heard anything like this from Jurado. Fifteen years into his remarkable career, and he continues to blossom. Jurado and Swift establish themselves not only as inventive, trusting collaborators, but as one another's spirit animals in American outsider songcraft --lone wolves in black sheep's clothing. Swift is the Ennio Morricone to Jurado's Sergio Leone.\n\nAt Swift's National Freedom studios, the live-to-tape ethos allowed these songs to expand and retract like a great beast's breath. Every in-the-moment bell and whistle here is hung with a natural, casual care. And from this, each song offers up its own unique gift: the enchanting children's choir that echoes each line of Jurado's lament for innocence lost on &quot;Life Away from the Garden&quot;; the breezy bossa nova that begins &quot;This Time Next Year&quot; and rises as effortless as a smoke cloud into high-noon showdown pop; &quot;Reel to Reel&quot;'s wobbly, Spector-symphony and its meta themes; the wonderful falsetto vocal work Jurado pulls from himself on &quot;Museum of Flight.&quot; The Seattle Times recently called Jurado &quot;Seattle's folk-boom godfather,&quot; a praising recognition to be sure. But also a title Jurado might not yet be ready to accept. That's a title for someone who has settled. With each visit to National Freedom, Jurado is exploring, taking risks. He's not only freeing his songs. The gate is opened wide to allow us all into his once-isolated musical universe. One gets the sense he's just now hitting his stride.\n\ncd ripped by EAC\n\nplease seed\n &lt;a href=&quot;\nhttp://dickthespic.org/2010/11/23/damien-jurado/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/2010/11/23/damien-jurado/&lt;/a&gt;","torrent":{"xt":"urn:btih:4fe2f8423630976f99deac380cbe97179ea4174b","amp;dn":"Damien+Jurado...Maraqopa%282012%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4fe2f8423630976f99deac380cbe97179ea4174b","infoHashBuffer":{"type":"Buffer","data":[79,226,248,66,54,48,151,111,153,222,172,56,12,190,151,23,158,164,23,75]},"announce":[],"urlList":[]}}