{"title":"Jon Ronson - The Men Who Stare at Goats","uid":4795511,"size":159090555,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5000b630ba3a8648659036dae865c7567e7e4411&amp;dn=Jon+Ronson+-+The+Men+Who+Stare+at+Goats&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Diceman_","files":-1,"time":1237862236,"description":"The unabridged audiobook of which the upcoming feature film starring Ewan McGregor, George Clooney and Kevin Spacey is based on.\n\nEncoded in 2-pass 48kbps 44khz mono WMA which I guarantee is free of compression artifacts and genuine CD quality (in mono). Ipod owners can use iTunes or FFmpegx to convert the files or install Rockbox firmware.\n\nNarrated by Sean Mangan. Runtime of 7 hours and 20 minutes.\n\nBlurb:\nIn 1979 a secret unit was established by the most gifted minds within the US Army. Defying all known accepted military practice - and indeed, the laws of physics - they believed that a soldier could adopt the cloak of invisibility, pass cleanly through walls and, perhaps most chillingly, kill goats just by staring at them. Entrusted with defending America from all known adversaries, they were the First Earth Battalion. And they really weren't joking. What's more, they're back and fighting the War on Terror. 'The men who stare at goats' reveals extraordinary - and very nutty - national secrets at the core of George W Bush's War on Terror.\n \nWith first-hand access to the leading players in the story, Ronson traces the evolution of these bizarre activities over the past three decades, and sees how it is alive today within US Homeland Security and post-war Iraq. Why are they blasting Iraqi prisoners-of-war with the theme tune to Barney the Purple Dinosaur? Why have 100 de-bleated goats been secretly placed inside the Special Forces command centre at Fort Bragg, North Carolina? How was the US Military associated with the mysterious mass-suicide of a strange cult from San Diego? 'The men who stare at goats' answers these, and many more, questions.","torrent":{"xt":"urn:btih:5000b630ba3a8648659036dae865c7567e7e4411","amp;dn":"Jon+Ronson+-+The+Men+Who+Stare+at+Goats","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5000b630ba3a8648659036dae865c7567e7e4411","infoHashBuffer":{"type":"Buffer","data":[80,0,182,48,186,58,134,72,101,144,54,218,232,101,199,86,126,126,68,17]},"announce":[],"urlList":[]}}