{"title":"Rage Against The Machine - 1999 - The Battle Of Los Angeles","uid":3464044,"size":43505390,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5036797b57256c1f64f753dcb5123c09bfa79c7b&amp;dn=Rage+Against+The+Machine+-+1999+-+The+Battle+Of+Los+Angeles&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"KindTorrents","files":13,"time":1143714459,"description":"Cover:\n\n[img]http://image.allmusic.com/00/amg/cov200/drd700/d735/d73570al5ll.jpg[/img]\n\nArtist:\n\nRage Against The Machine\n\n[img]http://image.allmusic.com/00/amg/pic200/drp200/p229/p229606wslv.jpg[/img]\n\nAlbum:\n\nThe Battle Of Los Angeles\n\nBio\n\nRage Against the Machine earned acclaim from disenfranchised fans (and not insignificant derision from critics) for their bombastic, fiercely polemical music, which brewed sloganeering leftist rants against corporate America, cultural imperialism, and government oppression into a Molotov cocktail of punk, hip-hop, and thrash. Rage formed in Los Angeles in the early &amp;#039;90s out of the wreckage of a number of local groups: vocalist Zack de la Rocha (the son of Chicano political artist Beto) emerged from the bands Headstance, Farside, and Inside Out; guitarist Tom Morello (the nephew of Jomo Kenyatta, the first Kenyan president) originated in Lock Up; and drummer Brad Wilk played with future Pearl Jam frontman Eddie Vedder. Rounded out by bassist Tim Bob (aka Tim C., born Tim Commerford), a childhood friend of de la Rocha&amp;#039;s, Rage debuted in 1992 with a self-released, self-titled 12-song cassette featuring the song &quot;Bullet in the Head,&quot; which became a hit when reissued as a single later in the year.\n\nThe tape won the band a deal with Epic, and their leap to the majors did not go unnoticed by detractors, who questioned the revolutionary integrity of Rage Against the Machine&amp;#039;s decision to align itself with the label&amp;#039;s parent company, media behemoth Sony. Undeterred, the quartet emerged in late 1992 with their eponymous official debut, which scored the hits &quot;Killing in the Name&quot; and &quot;Bombtrack.&quot; After touring with Lollapalooza and declaring their support of groups like FAIR (Fairness and Accuracy in Reporting), Rock for Choice, and Refuse &amp; Resist, Rage spent a reportedly tumultuous four years working on their follow-up; despite rumors of a breakup, they returned in 1996 with Evil Empire, which entered the U.S. album charts at number one and scored a hit single with &quot;Bulls on Parade.&quot; During 1997, the group joined forces with hip-hop supergroup the Wu-Tang Clan for a summer tour and remained active in support of various leftist political causes, including a controversial 1999 benefit concert for death-row inmate Mumia Abu-Jamal. The Battle of Los Angeles followed later in 1999, also debuting at number one and going double platinum by the following summer. In early 2000, de la Rocha announced plans for a solo project, and the band performed an incendiary show outside the Democratic National Convention in August. The following month, bassist Commerford was arrested for disorderly conduct at MTV&amp;#039;s Video Music Awards following his bizarre disruption of a Limp Bizkit acceptance speech, in which he climbed to the top of a 15-foot set piece and rocked back and forth.\n\nPlans for a live album were announced shortly thereafter, but in October, de la Rocha abruptly announced his departure from the band, citing breakdowns in communication and group decision-making. Surprised but not angry, the remainder of Rage announced plans to continue with a new vocalist, while de la Rocha re-focused on his solo album, which was slated to include collaborations with acclaimed hip-hop artists including DJ Shadow and El-P of Company Flow. December 2000 saw the release of de la Rocha&amp;#039;s final studio effort with the band, the Rick Rubin-produced Renegades; it featured nearly a dozen covers of hip-hop, rock, and punk artists like EPMD, Bruce Springsteen, Devo, the Rolling Stones, the MC5, and more. By 2001, Morello, Wilk, and Commerford had formed Audioslave with former Soundgarden frontman Chris Cornell, and the group released an eponymous album by the end of 2002. With a de la Rocha solo album still not announced, Epic finally released the long-promised concert album Live at the Grand Olympic Auditorium on CD and DVD in time for Christmas 2003.\n\nReview:\n\nRage Against the Machine isn&amp;#039;t really the only metal band that matters, but their aggressive social and political activism is refreshing, especially in an age of blind (or usually self-directed) rage due to groups like Limp Bizkit, Bush, or Nine Inch Nails. Recorded in less than a month, The Battle of Los Angeles is the most focused album of the band&amp;#039;s career, exploding from the gate and rarely letting go the whole way through. Like a few other famous revolution-in-the-head bands (most notably Minor Threat), Rage Against the Machine has always been blessed by the fact that the band is spewing just as much vitriol as its frontman. Any potential problems created here by Zack de la Rocha&amp;#039;s one-note delivery and extremist polemics are smoothed over by songs and grooves that make it sound like the revolution really is here, from the single &quot;Guerrilla Radio&quot; to album highlights like &quot;Mic Check,&quot; &quot;Calm Like a Bomb,&quot; and &quot;Born of a Broken Man.&quot; As on the previous two Rage Against the Machine albums, Tom Morello&amp;#039;s roster of guitar effects and vicious riffs are nigh overpowering, and are as contagious as the band has ever been since their debut. De la Rocha is best when he has specific targets (like the government or the case against Mumia Abu Jamal), but when he attempts to cover more general societal problems, he falters. If anything less than one of the most talented and fiery bands in the music world were backing him, The Battle of Los Angeles wouldn&amp;#039;t be nearly as high-rated as it is.\n\nTracks:\n\n1. Testify\n2. Guerrilla Radio\n3. Calm Like A Bomb\n4. Mic Check (Once Hunting, Now Hunted)\n5. Sleep Now In The Fire\n6. Born Of A Broken Man\n7. Born As Ghosts\n8. Maria\n9. Voice Of The Voiceless\n10. New Millennium Homes\n11. Ashes In The Fall\n12. War Within A Breath\n\nRating (of 10):\n\n8\n\nRelease Date:\n\nNov 2, 1999\n\nLabel:\n\nEpic\n\nGenre:\n\n* Rock\n\nStyles:\n\n* Heavy Metal\n* Alternative Pop/ Rock\n* Alternative Metal\n* Rap-Metal\n\nBitrate:\n\n128kbps\n\nFile format:\n\nmp3\n\nFile size:\n\n48.5 MB","torrent":{"xt":"urn:btih:5036797b57256c1f64f753dcb5123c09bfa79c7b","amp;dn":"Rage+Against+The+Machine+-+1999+-+The+Battle+Of+Los+Angeles","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5036797b57256c1f64f753dcb5123c09bfa79c7b","infoHashBuffer":{"type":"Buffer","data":[80,54,121,123,87,37,108,31,100,247,83,220,181,18,60,9,191,167,156,123]},"announce":[],"urlList":[]}}