{"title":"The Vietnam War","uid":11740531,"size":3335485,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5080544dad6920f359aafb750535bbad6640e4c6&amp;dn=The+Vietnam+War&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1425785779,"description":"The Vietnam War was different from most previous U.S. wars of the twentieth century. It was an undeclared and limited war. The draft to supply the soldiers and serious problems in the Selective Service system meant that the burden of the war was carried disproportionately by minorities and working class whites, many of whom did not want to serve. While many Americans saw service in Vietnam as their patriotic duty, others opposed the war. This is the story of the men and women who served in that war, whether overseas in active combat or in support roles in Viet Nam and stateside. Working from newspaper and other primary accounts, including soldiers' letters to and from home, government documents, interviews with Vietnam Era veterans, and other resources, James E. Westheider covers these issues of the war: The draft and problems in the Selective Service System. Draft resistance and the antiwar movement Can you be &quot;Black and Navy Too?&quot; African Americans and the Armed Forces The effects of climate and terrrain on fighting Life in camp, the food, and types of R &amp; R Morale Getting along with the South Vietnamese Casualties and medical treatment Reception back in the United States Problems of transition: jobs, employment, posttraumatic stress syndrome The book also includes a timeline to put dates and events in better perspective; a comprehensive, topically arranged bibliography; and a thorough index","torrent":{"xt":"urn:btih:5080544dad6920f359aafb750535bbad6640e4c6","amp;dn":"The+Vietnam+War","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5080544dad6920f359aafb750535bbad6640e4c6","infoHashBuffer":{"type":"Buffer","data":[80,128,84,77,173,105,32,243,89,170,251,117,5,53,187,173,102,64,228,198]},"announce":[],"urlList":[]}}