{"title":"Gay Twinklight (  DVD RIP  )","uid":6051176,"size":1657751552,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:509ab6eef3be5b31d9762fc7d0ae71c52c92cb4a&amp;dn=Gay+Twinklight+%28++DVD+RIP++%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":null,"files":-1,"time":1292734217,"description":"Widescreen 1.85.1\n\nRunning Time:   103 minutes\nReleased:   07/2010\nStudio Name:   1R Media \nDirector:   Afton Nills \nStars:   Krys Perez   Darin   Rad Matthews   Skyler Bleu   Levon Meeks   Preston Andrews   ...More\nStars:   Krys Perez   Darin   Rad Matthews   Skyler Bleu   Levon Meeks   Preston Andrews   Jayden Ellis   J.T. Wreck   Brice Carson   Aidan Chase   Dustin Revees   Ethan Storm   ...Less\nCategories: Feature   Twink   Anal   Safe Sex   Parody   High Definition  \nDescription:   Even in death love has to prevail, no matter what the cost... It's an epic journey through love and death.\nClose Review X Read Review\nReviewer: Marc Sylvian Date: 10/19/2010\nSource: Aebn\n\nThe Twilight saga brought us the concept of sparkly bloodsuckers, but they could use a little sexing up. Thanks to director Afton Nills for creating an erotic, stylish gay porn interpretation called &quot;Twinklight.&quot;\n\nThe film starts with a hot, brief fuck scene between dark-haired cutie Billa (Skyler Bleu) and his boyfriend (Darin), complete with gorgeous orgasm faces. Afterward, the boyfriend dumps Billa abruptly. Billa leaves a note for his mom, hitchhikes to Las Vegas, and crashes on his friend Bailey's (J.T. Wreck) couch. Bailey encourages him to &quot;lighten up,&quot; so Billa goes clubbing at the Piranha.\n\nAs Billa dances, oblivious to the wine glasses filled with something that isn't wine, a mysterious hottie on the balcony watches and Billa smiles back. Billa meets this admirer, Edmund (Krys Perez), when a fanged go-go dancer offers to give Billa a flyer for the &quot;V.I.P.&quot; area upstairs, where he can find Bailey. In a flash, Edmund is downstairs scaring off the would-be bloodsucker.\n\nMeanwhile, a razor-thin twink (Preston Andrews) gets turned into a vamp after fucking a bloodsucker in the ass. Edmund has saved Billa from a similar fate. We see the two of them talking in a diner, but the conversation is brief and leaves Billa with more questions than answers.\n\nBailey is in the V.I.P. area with a vampire (Brice Carson), who takes control of his smooth little ass. They have a very hot fuck and when it's over, the vamp pours candle wax all over his smooth chest as he straddles Bailey's torso. Now they both have something white splashed all over their front. Bailey's life is spared, for now.\n\nBilla dreams of Edmund topping him. It's hot to a swoon-inducing degree and you hope for Billa's sake that it will happen. Bailey wakes Billa up so he won't miss school, and it's a good thing, because Edmund is in his art class! This gives Billa the chance to know the mysterious guy better. It's not long before Billa falls for Edmund even though he resents Edmund's protectiveness. Edmund insists on being at Billa's side in the club without explaining that it's a vampire den. He's there when a blood-drained, loopy Bailey tells Billa the truth about Edmund and the Piranha. Edmund drags Billa away from the dying Bailey because he's still trying to protect him from the vampire world. Bailey recovers quickly because, as it turns out, he's been drained enough to turn into a vampire. He has his first 3-way as a bloodsucker right after Billa and Edmund leave.\n\nEdmund shows Billa some of his memories and tells him some of his most important stories. In flashback, we see Edmund passionately fucking his lost love Egan (Jayden Ellis). It's one of the movie's hottest scenes, especially watching Edmund try to control his blood lust as Egan sucks his cock and rides him in cowgirl. Unlike sex with Egan, this time Edmund is tender. Billa, the much twinkier of the pair, is the bottom to Edmund's romantically commanding top. Now that Edmund has found a way to control his bloodlust, he can find happiness with Billa.\n\n&quot;Twinklight&quot; blends hot guys, gorgeous sex scenes, and genuinely funny dialogue to make a parody that you'll enjoy whether you're a Twilight fan or not. And in case you're wondering where you can find such lush rooms to have some romantic vamp role-play, it was filmed at the Blue Moon Resort, the only hotel in Las Vegas exclusively for gay men.\nClose Review X\n","torrent":{"xt":"urn:btih:509ab6eef3be5b31d9762fc7d0ae71c52c92cb4a","amp;dn":"Gay+Twinklight+%28++DVD+RIP++%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"509ab6eef3be5b31d9762fc7d0ae71c52c92cb4a","infoHashBuffer":{"type":"Buffer","data":[80,154,182,238,243,190,91,49,217,118,47,199,208,174,113,197,44,146,203,74]},"announce":[],"urlList":[]}}