{"title":"Desk Set","uid":5444461,"size":734263296,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:50e99f9c90ea23017e20fc31373e18f79a2bc393&amp;dn=Desk+Set&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Livinha","files":1,"time":1268974446,"description":"Desk Set takes place at the &quot;Federal Broadcasting Network&quot; (exterior shots are of Rockefeller Center, headquarters of NBC). Bunny Watson (Katharine Hepburn) is in charge of its reference library, which is responsible for researching and answering questions on all manner of topics, such as the names of Santa's reindeer. She has been involved for seven years with rising network executive Mike Cutler (Gig Young), with no marriage in sight.\n\nThe network is negotiating a merger with another company, but is keeping it secret. To help the employees cope with the extra work that will result, the network head has ordered two computers (called &quot;electronic brains&quot; in the film). Richard Sumner (Spencer Tracy), the inventor of EMMARAC (an allusion to the early computers UNIVAC and ENIAC) and an efficiency expert, is brought in to see how the library functions, to figure out how to ease the transition. Though extremely bright, as he gets to know Bunny, he is surprised to discover that she is every bit his match.\n\nWhen they find out the computers are coming, the employees jump to the conclusion the machines are going to replace them. Their fears seem to be confirmed when everyone on the staff receives a pink slip printed out by the new payroll computer. Fortunately, it turns out to be a mistake; the machine fired everybody in the company, including the president.","torrent":{"xt":"urn:btih:50e99f9c90ea23017e20fc31373e18f79a2bc393","amp;dn":"Desk+Set","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50e99f9c90ea23017e20fc31373e18f79a2bc393","infoHashBuffer":{"type":"Buffer","data":[80,233,159,156,144,234,35,1,126,32,252,49,55,62,24,247,154,43,195,147]},"announce":[],"urlList":[]}}