{"title":"Dorothy Morrison, Tracy Nelson, Angela Strehli and Annie Sampson","uid":10254442,"size":312145916,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:514d060918cc586aed36d84f32e7ee637c211253&amp;dn=Dorothy+Morrison%2C+Tracy+Nelson%2C+Angela+Strehli+and+Annie+Sampson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"eika256","files":-1,"time":1401392039,"description":"Dorothy Morrison, Tracy Nelson, Angela Strehli and Annie Sampson - 2012 - The Blues Broads\n\nThe Blues Broads are a supergroup composed of Dorothy Morrison, Tracy Nelson, Annie Sampson, and Angela Strehli, women who all have viable solo careers in blues, country, soul, rock, and gospel music. The band had its genesis at Strehli's Marin club Rancho Nicasio, one of Nelson's favorite West Coast venues. The duo performances of Nelson and Strehli were so powerful they decided to expand their numbers and before settling on the current lineup three years ago, Maria Muldaur, Carlene Carter, and Linda Tillery all played a part in various Blues Broads events. The current quartet is nothing short of awesome, to use an overworked superlative. This debut set was cut live at the Throckmorton Theater in Mill Valley with stellar backing by Steve Ehrmann on bass, Paul Revelli on drums, Gary Vogensen on guitar, Mike Emerson on keys, and Deanna Bogart on piano, vocals, and sax. There's not a note wasted here, and several tunes are downright transcendent. Morrison takes the lead on &quot;River Deep,&quot; the Phil Spector/Ike &amp; Tina Turner hit that never was, and her spine-chilling performance underscores the connection between the blues, soul, and gospel music. Bogart shares lead vocals with Nelson and Morrison on &quot;It Won't Be Long&quot; and also contributes a playful stop-time piano solo. They close with a trio of gospel tunes. Morrison takes the lead on the Spinners' &quot;Mighty Love,&quot; and though the song may be secular, her rousing vocal takes it back to the church. For their a cappella version of &quot;Jesus, I'll Never Forget,&quot; they're joined by Deanna Bogart with Morrison adding Sam Cooke-like melismas to the arrangement and Vogensen adding the bass vocals. Morrison's signature tune, &quot;Oh Happy Day,&quot; provides a fitting climax and even 44 years after she first sang it, she still imbues the tune with an inspiring, sanctified fire. The album package includes a DVD of the performance that's up close and personal with the live feel of the music coming though loud and clear. Like the music itself, the video is down-home and in-your-face in the best possible way. (AllMusic)\n\nTrack list:\n01 - Livin' The Blues\n02 - Bring Me Your Love\n03 - Two Bit Texas Town\n04 - River Deep\n05 - Blue Highway\n06 - It Won't Be Long\n07 - Walk Away\n08 - Mighty Love\n09 - Jesus, I'll Never Forget\n10 - Oh Happy Day\n\nPersonnel:\nDorothy Morrison: vocals\nTracy Nelson: vocals\nAnnie Sampson: vocals\nAngela Strehli: vocals\nSteve Ehrmann: bass\nPaul Revelli: drums\nGary Vogensen: guitar\nMike Emerson: keyboards\nDeanna Bogart: keyboards, vocals, tenor \n\nEnjoy and share!","torrent":{"xt":"urn:btih:514d060918cc586aed36d84f32e7ee637c211253","amp;dn":"Dorothy+Morrison%2C+Tracy+Nelson%2C+Angela+Strehli+and+Annie+Sampson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"514d060918cc586aed36d84f32e7ee637c211253","infoHashBuffer":{"type":"Buffer","data":[81,77,6,9,24,204,88,106,237,54,216,79,50,231,238,99,124,33,18,83]},"announce":[],"urlList":[]}}