{"title":"Continental, un Film Sans Fusil 2007 DVDRip Sonata Premiere","uid":15897974,"size":734376155,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:515e922737ab92e322603a03ac772dac321f7727&amp;dn=Continental%2C+un+Film+Sans+Fusil+2007+DVDRip+Sonata+Premiere&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"kleen2","files":4,"time":1474978619,"description":"First-time Canadian helmer Stephane Lafleur's offbeat French-language comedy-drama Continental, un film sans fusil (AKA Continental: A Film Without Guns) 2007) commences with a bizarre event: a man who falls asleep on a bus awakens to find the vehicle suddenly vacant, hears unidentifiable sounds emanating from a nearby forest, and treks off to investigate. Lafleur then proceeds to crisscross several stories, concerning idiosyncratic characters who are both acquainted with the vanished gentleman and have no discernible connection to him. In one, the man's wife feels torn violently between accepting his disappearance and accepting the idea that he may never again turn up; at a complete loss to make this call, she opts instead to visit a ballroom and do the continental of the title. In another, a young insurance salesman (Real Bosse) spends the evening in a hotel and finds himself listening intently to a woman and her partner who make love in a nearby room - until the lady crops up and asks the salesman to visit the room and watch. In a third, a butterfingered young executive assistant (Fanny Mallette) at a packed bridal shower accepts an offer to hold a woman's baby - but drops it, to everyone's horror; and in a fourth, a pawn shop worker (Bernard Sicotte) with a serious dental problem begs his ex-wife for the money necessary to have the procedure - and proceeds to whittle it away on gambling bids.\r\n\r\n\r\nLanguage: French / English\r\n\r\nSubs srt: Portuguese / English / Spanish","torrent":{"xt":"urn:btih:515e922737ab92e322603a03ac772dac321f7727","amp;dn":"Continental%2C+un+Film+Sans+Fusil+2007+DVDRip+Sonata+Premiere","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"515e922737ab92e322603a03ac772dac321f7727","infoHashBuffer":{"type":"Buffer","data":[81,94,146,39,55,171,146,227,34,96,58,3,172,119,45,172,50,31,119,39]},"announce":[],"urlList":[]}}