{"title":"The Twilight Zone - (37 Eps) - Audio Sci-Fi Drama - MP3 - Slimoo","uid":6405736,"size":1365429739,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:51c31cff8e1504804eba0008b52ddb8f51976110&amp;dn=The+Twilight+Zone+-+%2837+Eps%29+-+Audio+Sci-Fi+Drama+-+MP3+-+Slimoo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"_Slimoo_","files":38,"time":1305804401,"description":"The Twilight Zone - Audio Sci-Fi Drama - BBC7 \n37 x 32 to 47 Minute Episodes - 128Kbps - Mp3 - Slimoo\n \n\n\nThe Twilight Zone Radio Dramas is a nationally syndicated radio adaptation of the classic television series The Twilight Zone.\n\nLaunched in October 2002. Many of the stories are based on Rod Serling's scripts from the original Twilight Zone series, and are slightly expanded and updated to reflect contemporary technology and trends (e.g., the mention of &quot;cell phones&quot; and &quot;CD-ROMs&quot; which, of course, weren't around when the television show aired in the 1960s). \n\n\n\n\n[b]There is an issue with naming these.\n\nBBC7 decided to call the new set - Series 02.\nBBC7 are the only station to call them series 02.\nThey never called the first lot - Series 01!.\n\nI have decided to use the Wiki listings for the CD Volumes for naming.\n15 Volumes with 10 Episodes each.[/b]\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Twilight_Zone_(radio_series)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Twilight_Zone_(radio_series)&lt;/a&gt;\n\n\nThe Twilight Zone - V01 - E07 - Mr Dingle, The Strong\nThe Twilight Zone - V01 - E09 - The Lonely\nThe Twilight Zone - V01 - E10 - Of Late I Think Of Cliffordville\n\nThe Twilight Zone - V02 - E01 - The Obsolete Man\nThe Twilight Zone - V02 - E02 - The Bard\nThe Twilight Zone - V02 - E03 - Back There\nThe Twilight Zone - V02 - E04 - A Short Drink From A Certain Fountain\nThe Twilight Zone - V02 - E07 - Mr Garrity And The Graves\nThe Twilight Zone - V02 - E08 - Escape Clause\nThe Twilight Zone - V02 - E09 - Four O'Clock\n\nThe Twilight Zone - V03 - E01 - The Fear\nThe Twilight Zone - V03 - E03 - A Hundred Yards Over The Rim\nThe Twilight Zone - V03 - E04 - One For The Angels\nThe Twilight Zone - V03 - E06 - The Rip Van Winkle Caper\nThe Twilight Zone - V03 - E07 - A Most Unusual Camera\nThe Twilight Zone - V03 - E08 - Twenty-Two\nThe Twilight Zone - V03 - E09 - Walking Distance\nThe Twilight Zone - V03 - E10 - The Passersby\n\nThe Twilight Zone - V04 - E02 - No Time Like The Past\nThe Twilight Zone - V04 - E03 - Still Valley\nThe Twilight Zone - V04 - E09 - Cavender Is Coming\n\n\n\nThe Twilight Zone - V06 - E01 - Time Enough At Last\nThe Twilight Zone - V06 - E06 - The Hitch-Hiker\n\nThe Twilight Zone - V07 - E01 - Five Characters In Search Of An Exit\nThe Twilight Zone - V07 - E05 - It's A Good Life\n\n\n\nThe Twilight Zone - V09 - E03 - From Agnes__With Love\n\nThe Twilight Zone - V10 - E04 - Ring-A-Ding-Girl\n\nThe Twilight Zone - V11 - E01 - Nightmare At 20,000 Feet\nThe Twilight Zone - V11 - E02 - Elegy\n\nThe Twilight Zone - V12 - E01 - The Last Flight\nThe Twilight Zone - V12 - E02 - Long Live Walter Jameson\nThe Twilight Zone - V12 - E07 - The Chaser\n\nThe Twilight Zone - V13 - E02 - Pattern For Doomsday\n\nThe Twilight Zone - V14 - E01 - Night Call\nThe Twilight Zone - V14 - E05 - Free Dirt\nThe Twilight Zone - V14 - E06 - Number Twelve Looks Just Like You\n\nThe Twilight Zone - V15 - E02 - A Piano In The House\n\n\nYou're Entering The Twilight Zone\n\n\n\nAudio Format    : MP3\nDuration        : 32 to 47mn\nBit rate mode   : Constant\nBit rate        : 128 Kbps\nChannel(s)      : 2 channels\nSampling rate   : 44.1 KHz\nResolution      : 16 bits\n\n\n[\n\n\n\n\n-----------------------------------------------\n\nI post quite a few torrents if this site is down when I post a new one I don't have time to keep trying.\nIf it's down then it's skipped.\n\nYou can follow me on Twitter so you don't miss any\n\n\nOr add the RSS feed in uTorrent (In FEEDS on the left add)\n\n-----------------------------------------------\n\n","torrent":{"xt":"urn:btih:51c31cff8e1504804eba0008b52ddb8f51976110","amp;dn":"The+Twilight+Zone+-+%2837+Eps%29+-+Audio+Sci-Fi+Drama+-+MP3+-+Slimoo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51c31cff8e1504804eba0008b52ddb8f51976110","infoHashBuffer":{"type":"Buffer","data":[81,195,28,255,142,21,4,128,78,186,0,8,181,45,219,143,81,151,97,16]},"announce":[],"urlList":[]}}