{"title":"Screeching Weasel + Riverdales Discography (1988-2013) [FLAC]","uid":8779379,"size":8947982215,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:51ddaf919a19e83e4d82586eb4b64f7119ec82f3&amp;dn=Screeching+Weasel+%2B+Riverdales+Discography+%281988-2013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"politux","files":-1,"time":1375641724,"description":"\n  Screeching Weasel + Riverdales Discography (1988-2013) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Alternative, Hardcore, Punk Revival, Punk-Pop\n  Source: CD \n  Codec: FLAC\n  Bit Rates: ~ 800 - 1,000 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  Screeching Weasel\n\n  1988 Boogada Boogada Boogada\n  1993 Anthem for a New Tomorrow\n  1994 How to Make Enemies and Irritate People\n  1996 Bark Like a Dog\n  1997 Screeching Weasel (Reissue)\n  1998 Major Label Debut EP\n  1998 Televsion City Dream\n  1999 Emo\n  2000 Teen Punks in Heat\n  2005 Anthem for a New Tomorrow (Remaster)\n  2005 Boogada Boogada Boogada (Reissue)\n  2005 My Brain Hurts (Remaster)\n  2005 Wiggle (Reissue)\n  2010 Television City Dream (Remaster)\n  2011 First World Manifesto\n \n  Screeching Weasel Compilations\n\n  1995 Kill the Musicians\n  1998 Beat is on the Brat\n  1999 Four on the Floor\n  2000 Thank You Very Little\n  2005 Kill the Musicians (Reissue)\n  2005 Weasel Mania\n \n  The Riverdales \n\n  1995 Riverdales\n  1997 Storm the Streets\n  2003 Phase Three\n  2009 Invasion USA\n  2010 Tarantula\n\n  Dan Vapid and the Cheats\n\n  2012 Dan Vapid and the Cheats\n  2013 Dan Vapid and the Cheats Two\n\n  Artist Bios\n\n  Screeching Weasel\n\n  Chicago's Screeching Weasel generally have a polarizing effect on most punk fans -- either you love their amateurish, tuneful Ramones imitation and singer/guitarist Ben Weasel's smartass suburbanite, often pop culture-oriented lyrics, or you hate them. Over the course of the band's career, which lasted for more than a decade and saw several breakups and numerous personnel changes, Weasel (in spite of occasional nitpicking from critics) remained true to his staunch D.I.Y. indie ethics, as befits a former columnist for the defiantly punk 'zine Maximumrocknroll.\n\n  Screeching Weasel were formed in 1986 by vocalist Ben Foster, who performed under the name Ben Weasel, after seeing a Ramones show. Early members included guitarist John Jughead and drummer Steve Cheese; after Weasel gave up trying to play bass, Vinnie Bovine was added on that instrument. The band recorded its self-titled debut album in 1987 for Underdog Records, of which only about 3,000 copies were pressed. Vinnie Bovine's personal problems got him kicked out of the band, and ex-Ozzfish Experience guitarist Warren &quot;Fish&quot; Ozzfish replaced him on bass. After playing some gigs in California, Screeching Weasel joined the fledgling Roadkill label, with Jughead and Weasel taking a hand in its operations, and released Boogada Boogadaboogada! in 1989.\n\n  Cheese left the band due to his reluctance to tour and was replaced by Brian Vermin. Following the supporting tour, Warren left and was replaced by Danny Vapid (born Dan Schafer), known early on as &quot;Sewercap&quot;; he had performed as a vocalist with Chicago-area hardcore bands like Generation Waste and the Igor Skulls. Following several EPs and singles of varying quality, Vermin and Vapid left to form Sludgeworth, and Jughead and Weasel called it quits and attempted to form another band with members including bassist Dave Naked. Screeching Weasel got back together following a reunion show designed to help the band pay off its debts, with a lineup featuring Weasel, Jughead, Naked, Vapid (now on second guitar), and new drummer Dan Panic (born Dan Sullivan). Lookout! Records agreed to release the band's next album if it was recorded under the name Screeching Weasel, and the more Ramones-like My Brain Hurts appeared in 1991.\n\n\n  The Riverdales\n\n  The Riverdales were formed by Ben Foster (aka Ben Weasel), Dan Schafer, and Dan Sullivan -- all from the classic punk band Screeching Weasel -- in 1995. Paying tribute to the genius of the Ramones, the Riverdales kick out some catchy, straight-up punk rock &amp; roll on their singles Back to You and Fun Tonight. The band's self-titled debut, produced by Mass Giorgini and Green Day's Billie Joe Armstrong, was released on Lookout! in June of 1995. Storm the Streets followed on Honest Don's in 1997.  ","torrent":{"xt":"urn:btih:51ddaf919a19e83e4d82586eb4b64f7119ec82f3","amp;dn":"Screeching+Weasel+%2B+Riverdales+Discography+%281988-2013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51ddaf919a19e83e4d82586eb4b64f7119ec82f3","infoHashBuffer":{"type":"Buffer","data":[81,221,175,145,154,25,232,62,77,130,88,110,180,182,79,113,25,236,130,243]},"announce":[],"urlList":[]}}