{"title":"Mahmoud Darwish - Almond Blossoms and Beyond [poetry] (2009)","uid":8888446,"size":752122,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5235a828c5ffd51fef48b1aa8441747c6b487764&amp;dn=Mahmoud+Darwish+-+Almond+Blossoms+and+Beyond+%5Bpoetry%5D+%282009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"workerbee","files":-1,"time":1378523344,"description":"Mahmoud Darwish - Almond Blossoms and Beyond (Interlink, 2009).  Translated by Mohammad Shaheen.\n\nISBN: 9781566567770 | 95 pages | PDF\n\n\nAlmond Blossoms and Beyond is one of the last collections of poetry that Mahmoud Darwish (1941-2008) left to the world. Composed of brief lyric poems and the magnificent sustained Exile cycle, Almond Blossoms holds an important place in Darwish's unparalleled oeuvre. It distills his late style, in which, though the specter of death looms and weddings turn to funerals, he threads the pulses and fragilities and beauties of life into the lines of his poems. Their liveliness is his own response to the collection's final call to bid &quot;Farewell / Farewell, to the poetry of pain.&quot;\n\n\nReviews\n\n&quot;A brilliant poet -- certainly the most gifted of his generation in the Arab world.&quot; -- Edward Said\n\n&quot;Darwish writes in a clear, simple, and yet elusive language charged with sharp visual images and vibrant musical beats. . . A particular strength is his building on theme words that recur throughout, allowing his text to take different shapes and structures. Though Darwish is a cultural icon among his people who has contributed much to shaping the Palestinian identity and consciousness, this workÂ  showcases his ability to recharge his language and reach for universal themes.&quot; -- Library Journal\n\n&quot;Almond Blossoms and Beyond, first published in Arabic in 2005 and newly translated by Mohammad Shaheen, is a complex counterpoint between the personal and the political, the poetic and the poetological (poetry about poetry), the reflective and the polemical, the real and the surreal. These shifts are rapid but graceful, a grace that is well captured by Shaheen's translations. . . Almond Blossoms and Beyond is a carefully, almost symmetrically structured collection . . . beautifully produced.&quot; -- Electronic Intifada\n\n&quot;Almond Blossoms and Beyond comprises many of the last poems of the internationally acclaimed Mahmoud Darwish. . . Celebratory contemplations on the passage of time, the changing of seasons, weddings, funerals, and nature in the earlier sections employ a charming, conversational voice that floats on the surface of layered meanings. The meditations on exile in the later sections are philosophical journeys that reflect an even greater sensitivity to the imminence of death and recount conversations either with himself or an imagined other.&quot; -- Multicultural Review\n\n&quot;Shaheen's [tranlations] are so much less cluttered, so much more moving.&quot; -- The Nation\n\n_____________________________________________\n\nFor more poetry by Mahmoud Darwish, see:\n\nUnfortunately, It Was Paradise: Selected Poems (2003) &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8836980/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8836980/&lt;/a&gt;\n\nA River Dies of Thirst: Journals (2009) &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8832813/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8832813/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:5235a828c5ffd51fef48b1aa8441747c6b487764","amp;dn":"Mahmoud+Darwish+-+Almond+Blossoms+and+Beyond+%5Bpoetry%5D+%282009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5235a828c5ffd51fef48b1aa8441747c6b487764","infoHashBuffer":{"type":"Buffer","data":[82,53,168,40,197,255,213,31,239,72,177,170,132,65,116,124,107,72,119,100]},"announce":[],"urlList":[]}}