{"title":"Yo Yo Ma - Kreisler, Paganini (Transcriptions) TQMP","uid":5126770,"size":211612693,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:53451c43d60b7a693e0f4c10a9e467d2f6a41d90&amp;dn=Yo+Yo+Ma+-+Kreisler%2C+Paganini+%28Transcriptions%29+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zootallure","files":26,"time":1255686857,"description":"Act II of the &quot;classic break&quot; from Zappa :-)))\n\n\n\nTrack list\nFritz Kreisler \t  \tTambourin Chinois, for violin &amp; piano, Op. 3 \t  \t \n \nFritz Kreisler \t  \tSerenade for violin &amp; piano (transcription from LehÃƒÂ¡r's Frasquita) \t  \t \n\nFritz Kreisler \t \tRondino on a Theme by Beethoven, for violin &amp; piano \t  \t \n\nFritz Kreisler \t   \tIndian Lament for violin &amp; piano (arr. from DvorÃƒÂ¡k's Sonatina for violin &amp; piano, Op. 100) \t  \t \nFritz Kreisler \t   \tSongs My Mother Taught Me for violin &amp; piano (transcription of Dvorak's Gypsy Songs, Op. 55/4) \t  \t \n\nFritz Kreisler \t   \tSchÃƒÂ¶n Rosmarin, for violin &amp; piano \t  \t \n.\nFritz Kreisler \t\tLiebesfreud (Love's Joy), for violin &amp; piano \t  \t \n\nFritz Kreisler \t  \tLiebesleid (Love's Sorrow), for violin &amp; piano \t  \t \n\nNiccolÃƒÂ² Paganini    \tCaprice for solo violin in E major (&quot;The Hunt&quot;), Op. 1/9, MS 25/9 \t  \t \n\nNiccolÃƒÂ² Paganini \tCaprice for solo violin in B flat major (&quot;The Devil's Chuckle&quot;), Op. 1/13, MS 25/13 \t  \t \n\nNiccolÃƒÂ² Paganini \tCaprice for solo violin in E flat major (Moderato), Op. 1/14, MS 25/14 \t  \t \n\nNiccolÃƒÂ² Paganini \tCaprice for solo violin in E flat major (Sostenuto-Andante), Op. 1/17, MS 25/17 \t  \t \n\nNiccolÃƒÂ² Paganini \tCaprice for solo violin in A minor (Theme &amp; Variations), Op. 1/24, MS 25/24 \t  \t \n\nNiccolÃƒÂ² Paganini \tIntroduction and Variations on &quot;Dal tuo stellato soglio&quot; from Rossini's &quot;MosÃƒÂ¨&quot;, for violin &amp; orchestra, MS 23\n\n\n\n\nPatricia Zander carried the limelight with her wherever she went; she didn't seek it, but it shone within her.\n\nAs a pianist, she toured the world in recital with cellist Yo-Yo Ma for a decade, though following a shoulder injury 22 years ago she stopped performing.\n\nMs. Zander was already a sought-after teacher when Ma came to work with her as a Harvard freshman in 1972. After she stopped playing in public, she continued to be active, influential, and charismatic in every other dimension of musical life. For more than 40 years she taught, challenged, and mentored generations of performers who passed through her studio in the New England Conservatory or her Cambridge living room; among them were baritone Sanford Sylvan, pianists Judith Gordon and Max Levinson, and violinist Stefan Jackiw.\n\nMs. Zander died in Youville Hospital in 2008 after a seven-year struggle with cancer. She was 66. Against medical advice, she taught through the end of the school year in May - and then listened to auditions for next year.\n\n&quot;For Patricia,&quot; Ma said, &quot;music was something to be lived, something to be breathed, at all times. The notes were a code towards something, the energy of life, I guess I would call it. There was so much vitality, rhythm, and forward motion in her playing; she characterized everything in the music vividly and viscerally.&quot;\n\n\n\nYo-Yo Ma is among the finest cellists of his generation, and a musician of unusually broad appeal. His great success is no doubt due to an easygoing, friendly stage personality in addition to his fine, adventurous musicianship.\n\nIndeed, Ma appears to have music in his blood: his mother was a singer in Hong Kong, his father a conductor, composer, and teacher. Although he had his first cello lessons at age four, memorizing two bars of Bach's cello suites every day, he had initially studied the violin, then the viola. When he was seven, the family moved to New York so that Ma could study with Janos Scholz. At the age of eight, Ma appeared on American television on &quot;The American Pageant of the Arts,&quot; in a concert conducted by Leonard Bernstein. He joined the junior department of the Juilliard School as a pupil of Leonard Rose. However, he left Juilliard in 1971, questioning whether he would continue with his cello studies despite international recognition while still in his teens.\n\nMa eventually enrolled at Harvard, where teachers, including composers Leon Kirchner and Earl Kim, gave him confidence to continue. The most important turning point, though, was a trip to the Marlboro Festival, where he heard the great cellist Pablo Casals perform. Says Ma, &quot;The commitment behind each note, the belief he had, was a wonderful example.&quot;\n\nIn 1978 Ma won the Avery Fisher Prize, establishing himself as one of a very few genuine superstars in classical music. Since then, he has appeared with nearly all of the world's great orchestras and conductors. He also is active in chamber music, often in a piano trio with Young Uck Kim and Emanuel Ax; Ma and Ax won a Grammy award for their recording of the Brahms cello sonatas. In 1982 Ma was invited to appear in the inaugural concert of the London Symphony Orchestra's new concert hall at the Barbican Centre in London, where he played in the presence of Queen Elizabeth II. He has won numerous Grammy awards, recording such diverse music as Brazilian bossa nova, Argentine tango, American roots and bluegrass, and the soundtrack for Crouching Tiger, Hidden Dragon. In 1998 he founded the Silk Road Project, to explore the exchange of musical ideas that occurred along the trade route. His CDs of the early 2000s have touched on both traditional and crossover repertory, with two albums of Vivaldi's music recorded with keyboardist and conductor Ton Koopman emerging as successful examples of the former, and the Obrigado Brazil CD becoming another crossover best seller.\n\nPlaying a Montagnana cello and the &quot;Davidov&quot; Stradivari previously used by Jacqueline du PrÃƒÂ©, Ma produces a relatively lean and focused, though warm, tone, with a tight, fast vibrato. His performances are a unique blend of rhapsodic and seemingly spontaneous music-making; at the same time, his playing is tempered by intellectually rigorous analysis and forethought. He places great importance on not repeating performances from the past, either those of other artists or his own.\n\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at:               &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\nSay Ã‚Â»thank youÃ‚Â« by seeding... just seed, it is not harmful to your health :-)","torrent":{"xt":"urn:btih:53451c43d60b7a693e0f4c10a9e467d2f6a41d90","amp;dn":"Yo+Yo+Ma+-+Kreisler%2C+Paganini+%28Transcriptions%29+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53451c43d60b7a693e0f4c10a9e467d2f6a41d90","infoHashBuffer":{"type":"Buffer","data":[83,69,28,67,214,11,122,105,62,15,76,16,169,228,103,210,246,164,29,144]},"announce":[],"urlList":[]}}