{"title":"Taito Legends Vol1&amp;2 [Arcade ITA] [TNTvillage]","uid":5246318,"size":202955985,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:543b77efcb74bad7131715b831c830dd2e582d3f&amp;dn=Taito+Legends+Vol1%262+%5BArcade+ITA%5D+%5BTNTvillage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Xeely","files":2,"time":1261961421,"description":"Taito Legends\nVolume 1 &amp; 2\n\n\nÃ‚Â» Scheda di Gioco Ã‚Â«\n\nÃ‚Â» Titolo: Taito Legends Vol. 1 &amp; 2 Ã‚Â«\nÃ‚Â» Piattaforma: PC Ã‚Â«\nÃ‚Â» Genere: Arcade Ã‚Â«\nÃ‚Â» Sviluppatore: Taito Corporation &amp; Empire Interactive Ã‚Â«\nÃ‚Â» Distributore: Empire Interactive Ã‚Â«\nÃ‚Â» Anno pubblicazione: 2005-2006 Ã‚Â«\nÃ‚Â» Lingua: Italiano Ã‚Â«\nÃ‚Â» Dimensione: 200 MB Ã‚Â«\n\n\n\nÃ‚Â» Requisiti Minimi Ã‚Â«\n\nWindows 98/ME/2000/XP\nTestato anche su Vista e Seven\nScheda Video 32 MB\nProcessore 1GHz\nRAM 128 MB\nDirectX 9 installate\n500 MB di spazio libero sul disco rigido\n\n\n\nÃ‚Â» Recensione Ã‚Â«\n\nVolume 1\nSe oramai non siete piÃƒÂ¹ dei giovincelli ma appartenete a quella fascia d'etÃƒÂ  che oscilla tra i 30 e gli 80 anni allora avrete senz'altro vissuto in prima persona il periodo in cui i videogiochi cominciarono a fioccare nelle sale dei bar in tutta la loro imponenza. Cabinati mastodontici e coloratissimi andavano a colmare quella che era un'esperienza di gioco ripetitiva e limitata ma, stranamente, additiva all'inverosimile. I gestori dei bar diventavano ricchi a furia di elargire monetine ai drogati di pixels e le software houses si ingegnavano a creare nuovi mondi in cui catapultare il 'popolo del joystick'. Questa fu infatti una tappa chiave del media videoludico dove ci si rese conto delle sue effettive potenzialitÃƒÂ ; e fu proprio in quegli anni che le case piÃƒÂ¹ importanti come Konami, Taito, Capcom e altre sfornarono alcune tra le piÃƒÂ¹ belle pagine della storia dei videogiochi. Lasciare che tutto questo venga perduto sarebbe davvero un peccato e, vuoi per comoditÃƒÂ  (vendere un emulatore e farlo passare per novitÃƒÂ  non ÃƒÂ¨ che sia un grosso sforzo), vuoi per pura operazione di recupero, spesso e volentieri ogni software house che si rispetti si impegna a rimettere in circolazione i propri titoli piÃƒÂ¹ rappresentativi di quell'epoca. Dopo Capcom (Capcom Generations per Saturn e PSOne), Konami (Konami Arcade Gallery per PSOne e GBA), Midway (Midway's Arcade Treasures per SNES, PSOne, ecc.), Namco (Namco Museum per PSOne, N64, GBA ecc.) e altri, stavolta tocca a Taito ricordarci qualche pagina entusiasmante della nostra giovinezza.\n\nLa compilation in questione presenta la bellezza di 29 titoli che, per l'esattezza, sono: Battle Shark, Bubble Bobble, Colony 7, Continental Circus, Electric Yo-Yo, Elevator Action, Exzisus, Gladiator, Great Swordsman, Jungle Hunt, New Zealand Story, Ninja Kids, Operation Thunderbolt, Operation Wolf, Phoenix, Plotting, Plump Pop, Rainbow Islands, Rastan, Return of the Invaders, Space Gun, Space Invaders, Space Invaders part II, Super Qix, Thunderfox, Tokio, Tube It, Volfied, Zoo Keeper. \n\nVolume 2\nFin dagli albori dei cabinati nei primi anni '70, Taito si ÃƒÂ¨ affermata come uno dei maggiori produttori di videogames arcade, legando indissolubilmente il proprio nome ad alcuni dei piÃƒÂ¹ illustri esponenti del genere, quali Space Invaders o Arkanoid. Nel primo decennio, la portata del movimento videoludico fu tale da influire perfino sulla circolazione monetaria, curiosamente gravata dallo &quot;insert coin&quot;, celeberrima richiesta di ogni postazione di gioco. Taito Legends 2 ripropone trentanove glorie (aggiungere vecchie sarebbe ingeneroso, in alcuni casi si tratta di capolavori senza etÃƒÂ ) apparse in sala giochi nel corso degli anni '80 e '90. \nSono stati conservati il sopra citato &quot;insert coin&quot; e i &quot;credits&quot;, con la precisa volontÃƒÂ  di rimarcare l'identitÃƒÂ  arcade della raccolta. Il rituale inserimento della monetina ÃƒÂ¨ stato ovviamente sostituito dalla piÃƒÂ¹ semplice pressione di un tasto, ma tanto basta a rievocare i nostalgici gruzzoletti spesi per la propria passione. Gli extra, oltre a qualche cenno biografico della Taito, comprendono per ogni gioco un interessante corredo di opuscoli pubblicitari originali. Questi, affianco alla superficiale promozione del prodotto, forniscono un quadro dell'iconografia ludica nel periodo riguardante la raccolta.\nI titoli meno recenti, risalenti ai primi anni '80, sono caratterizzati da un aspetto visivo necessariamente minimalista, il quale perÃƒÂ² si presta spesso ad un gameplay dalla formula semplice ma accattivante. Perfetta sintesi di quanto appena espresso sembra essere Qix, ove ÃƒÂ¨ necessario riempire porzioni di schermo evitando una specie di barra che si agita in esso; talmente semplice che ÃƒÂ¨ impossibile rendere a parole la genialitÃƒÂ  che vi si cela. In Wild Western si difende un convoglio dall'assalto dei banditi, con uno svolgimento che si rivela molto meno accessibile e piÃƒÂ¹ profondo di quanto sembri in a prima vista.\n\nLa lista dei titoli comprende: Alpine Ski, Arabian Magic, Bonze Adventure, Bubble Symphony, Cadash, Cameltry, Chack'n Pop, Cleopatra Fortune, Crazy Balloon, Darius Gaiden, Don Doko Don, Dungeon Magic, Elevator Action Returns, Fairyland Story, Football Champ, Front Line, Gekirindan, Grid Seeker, Growl, Gun &amp; Frontier, Insector X, KiKi Kaikai, Kuri Kinton, Legend of Kage, Liquid Kids, Lunar Rescue, Metal Black, Nastar Warrior, Pop'n Pop, Puchi Carat, Puzzle Bobble 2, Qix, Raimais, Rayforce, Space Invaders 95, Space Invaders DX, Super Space Invaders, Violence Fight e Wild Western.\n\n\n\nÃ‚Â» Installazione Ã‚Â«\n\nEstraete il contenuto dell'archivio RAR e potete subito cominciare a giocare al volume 1 e 2 di Taito Legends lanciando il file Taito.exe situato nelle rispettive cartelle.\nEnjoy!","torrent":{"xt":"urn:btih:543b77efcb74bad7131715b831c830dd2e582d3f","amp;dn":"Taito+Legends+Vol1%262+%5BArcade+ITA%5D+%5BTNTvillage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"543b77efcb74bad7131715b831c830dd2e582d3f","infoHashBuffer":{"type":"Buffer","data":[84,59,119,239,203,116,186,215,19,23,21,184,49,200,48,221,46,88,45,63]},"announce":[],"urlList":[]}}