{"title":"Dungeoncorp - DOCR - May 10, 2016 - Veronica Jett","uid":15057021,"size":570885708,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:5469f6705a335c8e0d8efe3afc08fd2ec5cc08a4&amp;dn=Dungeoncorp+-+DOCR+-+May+10%2C+2016+-+Veronica+Jett&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"merzedes","files":192,"time":1466700862,"description":"&quot;Double Teamed by Freaks&quot; \r\nDungeon of Cum : Redux\r\n Veronica Jett\r\n\r\n Mp4 480p + Pics \r\n\r\nLithe little Veronica Jett is our latest offering here at Fucking Dungeon for repeat customer Otto Bauer. Veronica is a tiny dark haired, olive skinned beauty, with striking looks and features. Also in this latest update, we welcome BDSM veteran Micheal Mayhem to assist Mr. Bauer in really turning up the heat... We kick it off with Ms. Jett tied and gagged, her feet bound to wooden platforms as Mr. Mayhem enters the room. Micheal promptly gets to work taking his flogger to Veronica's backside. He then takes a nightstick and whip to Ms. Jett's ass and thighs. As the pain and moaning intensifies, there is a knock on The Dungeon door, and Otto enters and immediately begins rudely fucking Veronica from behind as Mayhem takes a leather strap to her upper torso. In scene two, Veronica is bound doggy style over a steel bench, nervously anticipating what may come next... Otto and Mayhem enter the room like a dastardly duo and immediately spring into action. Micheal quickly grabs Veronica's head and shoves it onto Otto's waiting cock. As Veronica receives her involuntary skull fucking, Mayhem swats her ass from behind. Then once again, she is rudely mounted by Otto as Mayhem demands for her to be fucked. The nightstick is again brought out and menacingly brandished by Mr. Mayhem. As the nightstick appears, Otto vacates Veronica's pussy for it as he switches back to Ms. Jett's face again. What we see next is a bizarre double team switch off volley- cock to face, nightstick to cunt, and back and forth. Next, Veronica is suspended from the ceiling with her legs spread. As we watch her wriggle and moan, our dastardly double team appears again. Mr. Mayhem holds Veronica firmly in place so Otto can gain enough traction to rudely enter Ms. Jett's sopping pussy once again. As Mayhem pinches and pulls, Otto hammers away at Veronica's pussy and throat. As the screams get louder, Otto is fueled further into Veronica's cunt. Until finally, she is spun around just in time to catch a load in her mouth and then swallows it on demand... \r\n\r\n Screens\r\n \nhttp://www.dungeoncorp.com/updates16/DRE/VER_092607/index.php\r\n\r\n Uploaded by Merzedes and Shallow2\r\n\r\n 21 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\n Just keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\n Also, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\n Any Questions ?? Read our FAQ!!\r\n \nhttps://yuq.me/users/23/079/W2kwa6hEeP.png\r\n \nhttps://s16.postimg.org/rxyfm...llow2_FAQ_The_Pirate_Bay.jpg\r\n\r\n Cheers :-)","torrent":{"xt":"urn:btih:5469f6705a335c8e0d8efe3afc08fd2ec5cc08a4","amp;dn":"Dungeoncorp+-+DOCR+-+May+10%2C+2016+-+Veronica+Jett","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5469f6705a335c8e0d8efe3afc08fd2ec5cc08a4","infoHashBuffer":{"type":"Buffer","data":[84,105,246,112,90,51,92,142,13,142,254,58,252,8,253,46,197,204,8,164]},"announce":[],"urlList":[]}}