{"title":"Plants vs. Zombies v6.1.11","uid":13404529,"size":63206091,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:54f7fe4ca1281f8d6f7b7614af1e6c83100ebd23&amp;dn=Plants+vs.+Zombies+v6.1.11&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Androider","files":2,"time":1454415532,"description":"Get ready to soil your plants as a mob of fun-loving zombies is about to invade your home. Use your arsenal of 49 zombie-zapping plants — Peashooters, Wall-nuts, Cherry Bombs and more — to mulchify 26 types of zombies before they break down your door.\r\n\r\nOne of the top tower-defense action games ever, Plants vs. Zombies™ features zombies with their own special skills, so you'll need to think fast and plant faster to have a successful strategy and combat them all. \r\n\r\nBut be careful how you use your limited supply of greens and seeds — as you dash to battle the fun-dead, obstacles like a setting sun, creeping fog and a swimming pool add to the challenge.\r\n\r\nGame Features\r\n\r\n• Conquer zombies in all 50 levels of Adventure mode — through day, night and fog, in a swimming pool and on the rooftop\r\n• Battle 26 types of zombies including Pole-Vaulters, Snorkelers and Bucketheads, each with its own special skills\r\n• Earn 49 powerful perennial plants and collect coins to buy a pet snail, power-ups and more\r\n• Open the Almanac to see all the plants and zombies, plus amusing &quot;facts&quot; and quotes\r\n• Collect 47 fun-dead achievements and show off your zombie-zapping prowess\r\n• Enjoy all the zombie-zapping fun of the hit PC/Mac game — fully optimized for Android\r\n• Hilarious graphics, great soundtrack and a bonus music video\r\n• Need coins for great new stuff? Buy up to 600,000 coins right from the Main Menu\r\n• Includes all the mini-games and the full features of the original game\r\n• Made by PopCap, the creators of Bejeweled, the #1 puzzle game in the world\r\n\r\nDownload today to stem a zombie attack on your Android device!\r\n\r\nWhats new:\r\n\r\nHello zombie battlers! In this update, we’ve unleashed fun-dead approval for Android Lollipop 5.0 and Marshmallow 6.0. Thanks, as always, for playing!\r\n\r\nMore info:\r\n \nhttps://play.google.com/store/apps/details?id=com.popcap.pvz_row\r\n\r\n\r\nInstructions:\r\n\r\n1.Copy 'com.popcap.pvz_row' folder to 'sdcard/Android/obb'\r\n2.Install APK\r\n3.Launch the game","torrent":{"xt":"urn:btih:54f7fe4ca1281f8d6f7b7614af1e6c83100ebd23","amp;dn":"Plants+vs.+Zombies+v6.1.11","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54f7fe4ca1281f8d6f7b7614af1e6c83100ebd23","infoHashBuffer":{"type":"Buffer","data":[84,247,254,76,161,40,31,141,111,123,118,20,175,30,108,131,16,14,189,35]},"announce":[],"urlList":[]}}