{"title":"The Bliss of Mrs. Blossom (1968)","uid":5306249,"size":1146052725,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:552e580a1e3d8c04d3b09ddede2f696c26197b5e&amp;dn=The+Bliss+of+Mrs.+Blossom+%281968%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"samf63","files":1,"time":1264399598,"description":"I sampled this from VHS, before it disappeared forever, as the studios have chosen to let this one die without conversion. Please keep a copy and seed, as this is the only way it will endure.\n\nIt is a very strange film. When I described it to my friends, they felt certain that I must have dreamt it, as we all though when one of them told us about Zardoz, which is also real (and made the conversion to digital on its own). \n\n\n\nSPOILER ALERT\n\n\n\nThis is from the Wikipedia:\n\nThe Bliss of Mrs. Blossom\n\nDirected by \tJoseph McGrath\nProduced by \tJosef Shaftel\nWritten by \tAlec Coppel\nDenis Norden\nBased on a short story by Josef Shaftel\nStarring \tShirley MacLaine\nRichard Attenborough\nJames Booth\nMusic by \tRiz Ortolani\nCinematography \tGeoffrey Unsworth\nEditing by \tRalph Sheldon\nDistributed by \tParamount Pictures\nRelease date(s) \tSeptember 11, 1968 (USA)\nNovember 21, 1968 (UK)\nRunning time \t93 minutes\nCountry \tUnited Kingdom\nLanguage \tEnglish\n\nThe Bliss of Mrs. Blossom is a 1968 British comedy film directed by Joseph McGrath. The screenplay by Alec Coppel and Denis Norden was adapted from a play by Coppel that was based on a short story by Josef Shaftel, who served as the film's producer.\n\n\nPlot synopsis\n\nRobert Blossom is a workaholic brassiere manufacturer. When his wife Harriet's sewing machine breaks down, he sends his bumbling employee Ambrose Tuttle to repair it. Mrs. Blossom seduces him, then hides him in the attic, instructing him to sneak out in the middle of the night. Ambrose, however, is enchanted by the woman and decides to settle in to serve as her secret paramour. When he's reported missing, Det. Sgt. Dylan from Scotland Yard is assigned to the case, one he doggedly pursues for years. The mysterious noises Robert frequently hears overhead finally lead to his nervous breakdown, but Ambrose saves the day by passing along stock tips that turn his employer into a millionaire. The grateful Mr. Blossom not only allows Ambrose to remain with his wife, but presents the couple with his factory as a wedding present.\n[edit] Story\n\nThe film is loosely based on a real incident. In the early 1920s, Walburga Oesterreich kept her lover, Otto Sanhuber in the attic where he lived for many years. The real story doesn't have the happy ending of the movie.\n\n\nProduction notes\n\nAssheton Gorton served as production designer for the film.\n\nLocation scenes were filmed in Bloomsbury, at the National Film Theatre in the South Bank Centre, and at Alexandra Palace in London. Interiors were filmed at the Twickenham Film Studios in Middlesex.\n\nThe soundtrack includes the songs &quot;The Way That I Live&quot; performed by Jack Jones and &quot;Fall in Love&quot; performed by the New Vaudeville Band.\n\nFrank Thornton, Barry Humphries, and John Cleese make brief appearances in the film.\n\n\nPrincipal cast\n\n    * Shirley MacLaine ..... Harriet Blossom\n    * Richard Attenborough ..... Robert Blossom\n    * James Booth ..... Ambrose Tuttle\n    * Freddie Jones ... Det. Sgt. Dylan\n    * Bob Monkhouse ..... Dr. Taylor\n    * Patricia Routledge ..... Miss Reece\n\n\nReception\n\nIn his review in the New York Times, Howard Thompson called the film &quot;roguish, restrained and absurdly likable, with a neat climactic twist.&quot; [1]\n\nVariety described it as &quot;a silly, campy and sophisticated marital comedy, always amusing and often hilarious in impact . . . although basically a one-joke story, [the] idea is fleshed out most satisfactorily so as to take undue attention away from the premise. Performances are all very good, Attenborough's in particular.&quot; [2]\n\nTime Out New York calles it a &quot;coarse comedy which looks a little like Joe Orton gone disastrously wrong . . . any sparks in the script or performances are ruthlessly extinguished by atrocious direction.&quot;","torrent":{"xt":"urn:btih:552e580a1e3d8c04d3b09ddede2f696c26197b5e","amp;dn":"The+Bliss+of+Mrs.+Blossom+%281968%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"552e580a1e3d8c04d3b09ddede2f696c26197b5e","infoHashBuffer":{"type":"Buffer","data":[85,46,88,10,30,61,140,4,211,176,157,222,222,47,105,108,38,25,123,94]},"announce":[],"urlList":[]}}