{"title":"Carole Lombard Collection - True Confession (1937) Xvid 1cd - Fr","uid":9427057,"size":734017536,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5568576b14ba5dbc2c8bb95a9baa1dd44ff54c13&amp;dn=Carole+Lombard+Collection+-+True+Confession+%281937%29+Xvid+1cd+-+Fr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SaM","files":-1,"time":1388725271,"description":"Carole Lombard Collection - True Confession (1937) Xvid 1cd - Fred MacMurray [DDR\n\nTrue Confession is a 1937 screwball comedy film starring Carole Lombard, Fred MacMurray, and John Barrymore. \nIt was directed by Wesley Ruggles and based on the play Mon Crime, written by Georges Berr and Louis Verneuil.\n\n    CAST:-\n    Carole Lombard as Helen Bartlett\n    Fred MacMurray as Ken Bartlett\n    John Barrymore as Charley Jasper\n    Una Merkel as Daisy McClure\n    Porter Hall as Prosecutor\n    Edgar Kennedy as Darsey\n    Lynne Overman as Bartender\n    Irving Bacon as the coroner\n    Fritz Feld as Krayler's butler\n    John T. Murray as Otto Krayler\n    Richard Carle as Judge\n    Hattie McDaniel appears in a small role as a maid named Ella.\n\nDirected by Wesley Ruggles\nProduced by Albert Lewin\nWritten by Georges Berr (Play), Louis Verneuil (Play), Claude Binyon\nMusic by Frederick Hollander\n\nMOVIE REVIEW- True Confession (1937)\nHelen Bartlett (Lombard) is the wife of the honest lawyer Ken (MacMurray). She is a &quot;writer&quot; but cannot think of anything to write and instead lives in her fantasy world of telling lies. \n\nWhen she discovers that they are broke, she attempts to get Ken to take a case of a man who stole hams. Ken finds out that the man really did steal the hams, and therefore does not take the case. Helen is forced to get a job as a secretary for businessman Otto Krayler (John T. Murray). While working, he attempts to seduce Helen, which causes Helen to quit the job. However, she discovers that she accidentally left her hat and coat at the apartment. She returns only to find that Otto Krayler has been killed and $12,000 of money the supposed motive. The police suspect Helen and take her into custody. To further complicate her situation, Helen divulges a vivid account of the murder, discussing how she did it and everything, and then says that she had nothing to do with it.\n\nKen represents Helen at the trial and believes that there is no way that the jury will believe that Helen did not commit the murder, and therefore has her plead self-defense. As the trial continues, an obnoxious man named Charley Jasper (Barrymore) believes that Helen did not murder Krayler, but he keeps it to himself.\n\nHelen wins the case and publishes a hugely successful novel of her life story. Having earned a fortune, Helen and Ken buy a lavish home on Martha's Lake, but Ken expresses remorse that their fortune has come out of crime. Helen wonders if she should confess her innocence, but Ken states that perjury would be worse than the crime she had already committed. \n\nMeanwhile, Charley visits Helen and Ken with Krayler's wallet and attempts to blackmail them into saying that he (Charley) killed Krayler and having Helen put into perjury. Helen then tells Ken that she did not kill Krayler and has Charley confess that his brother-in-law was the real murderer. Ken leaves the house, sickened by Helen's lying, but Helen chases after him and lies once more by saying that she is pregnant. Ken then takes Helen into the house in an attempt to teach her not to lie.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 855 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages:English\nRunTime  85 mins\nSubtitles: None\nRipped by: Trinidad [DDR]\nDuration: 85 mins","torrent":{"xt":"urn:btih:5568576b14ba5dbc2c8bb95a9baa1dd44ff54c13","amp;dn":"Carole+Lombard+Collection+-+True+Confession+%281937%29+Xvid+1cd+-+Fr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5568576b14ba5dbc2c8bb95a9baa1dd44ff54c13","infoHashBuffer":{"type":"Buffer","data":[85,104,87,107,20,186,93,188,44,139,185,90,155,170,29,212,79,245,76,19]},"announce":[],"urlList":[]}}