{"title":"Ciara - And I","uid":4710532,"size":136519684,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:562b4fbce0fade21cd54b93fdca8790db9e2f821&amp;dn=Ciara+-+And+I&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"2nafish","files":-1,"time":1234004142,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;And I&quot; is a pop song written by American R&amp;B singer Ciara, and produced by Adonis Shropshire for Ciara's debut album Goodies (2004). It was released as the album's fourth and final single in August 2005 (see 2005 in music) in the North America.\n\nThe song was originally the third choice for the fourth single. Ciara has mentioned in an interview that &quot;Thugstyle&quot; or &quot;Pick up the Phone&quot; would be the fourth single, but when Ciara suggested &quot;And I&quot; to executives at her record label LaFace, they were unhappy because they wanted &quot;Next to You&quot; to be the fourth single.\n\nThe music video for &quot;And I&quot;, directed by the Fat Cats, is loosely based on the 1992 Whitney Houston film The Bodyguard. It takes place in a forest and on the set of a music video, and Carmelo Anthony plays Ciara's boyfriend. Ciara's boyfriend is flirting amongst other women while Ciara is filming her music video. When Ciara's bodyguard takes her to visit her boyfriend in her trailer, he opens the door and sees Ciara's boyfriend kissing another woman. Ciara's bodyguard tells her to not go inside. When she realizes he has been cheating on her, Ciara sits on a log under lights that have been rigged to fall on her. (Earlier in the video, a man had been acting strangely whilst Ciara was signing autographs.) Her bodyguard saves her just before the lights fall and Ciara holds him in her arms.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:562b4fbce0fade21cd54b93fdca8790db9e2f821","amp;dn":"Ciara+-+And+I","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"562b4fbce0fade21cd54b93fdca8790db9e2f821","infoHashBuffer":{"type":"Buffer","data":[86,43,79,188,224,250,222,33,205,84,185,63,220,168,121,13,185,226,248,33]},"announce":[],"urlList":[]}}