{"title":"Lone Survivors: How We Came to Be the Only Humans on Earth","uid":8746879,"size":1018672,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:56c94c3a028c709cab7b558ee1edf402a0d9de08&amp;dn=Lone+Survivors%3A+How+We+Came+to+Be+the+Only+Humans+on+Earth&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Djofullinn","files":1,"time":1374940461,"description":"A leading researcher on human evolution proposes a new and controversial theory of how our species came to be\n\nIn this groundbreaking and engaging work of science, world-renowned paleoanthropologist Chris Stringer sets out a new theory of humanity's origin, challenging both the multiregionalists (who hold that modern humans developed from ancient ancestors in different parts of the world) and his own -out of Africa- theory, which maintains that humans emerged rapidly in one small part of Africa and then spread to replace all other humans within and outside the continent. Stringer's new theory, based on archeological and genetic evidence, holds that distinct humans coexisted and competed across the African continent-exchanging genes, tools, and behavioral strategies.\n\nStringer draws on analyses of old and new fossils from around the world, DNA studies of Neanderthals (using the full genome map) and other species, and recent archeological digs to unveil his new theory. He shows how the most sensational recent fossil findings fit with his model, and he questions previous concepts (including his own) of modernity and how it evolved.\n\nLone Survivors is the definitive account of who and what we were, and will change perceptions about our origins and about what it means to be human. \n\n","torrent":{"xt":"urn:btih:56c94c3a028c709cab7b558ee1edf402a0d9de08","amp;dn":"Lone+Survivors%3A+How+We+Came+to+Be+the+Only+Humans+on+Earth","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56c94c3a028c709cab7b558ee1edf402a0d9de08","infoHashBuffer":{"type":"Buffer","data":[86,201,76,58,2,140,112,156,171,123,85,142,225,237,244,2,160,217,222,8]},"announce":[],"urlList":[]}}