{"title":"The Anime Encyclopedia: Japanese Animation Since 1917","uid":5497986,"size":133160840,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5753fcd212f16df076a64d7beea321695570a123&amp;dn=The+Anime+Encyclopedia%3A+Japanese+Animation+Since+1917&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"artpepper","files":-1,"time":1271377687,"description":"The Anime Encyclopedia: A Guide to Japanese Animation Since 1917\n\nBy Jonathan Clements and Helen McCarthy\n\nStone Bridge Press | Revised and Expanded Ed. | November 1, 2006 | ISBN: 9781933330105 \n\nEnglish | 867 pages | HQ PDF | 133.2 MB \n\n\n\n\n\n\n\nFrom the first examples in 1917 to today's feature-length animated masterpieces like Princess Mononoke, Japanese animation (or anime) has drawn a devoted international fan base. For quite some time, these enthusiasts have needed an all-encompassing, detail-oriented reference work. \n\n\nFortunately, Clements and McCarthy, who coedited The Erotic Anime Movie Guide and have an outstanding history in anime indexing, translation, and criticism, are just the folks to carry it off. \n\n\nChoosing the best examples from a field that was about twice the final number of entries, the authors review and detail more than 2000 anime films and TV series. Each entry includes a short synopsis, commentary, details about key creative personnel, and evaluation of the work's significance. \n\n\nOver 100 illustrations representing major releases are sprinkled throughout. Other notable features include a selective bibliography, a name/studio index, and a title index that makes it easy to go right to the vital information about a particular example. \n\n\nThe end product is a huge, exhaustive, timely, and authoritative compendium of information that will be appreciated by anime experts and neophytes alike. Recommended for all libraries and essential for film and media collections.\n","torrent":{"xt":"urn:btih:5753fcd212f16df076a64d7beea321695570a123","amp;dn":"The+Anime+Encyclopedia%3A+Japanese+Animation+Since+1917","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5753fcd212f16df076a64d7beea321695570a123","infoHashBuffer":{"type":"Buffer","data":[87,83,252,210,18,241,109,240,118,166,77,123,238,163,33,105,85,112,161,35]},"announce":[],"urlList":[]}}