{"title":"Natural Mineral Nanotubes - Properties and Applications","uid":15359078,"size":85239566,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:57c79bfea8d4de6191f1022bb4742d5e4ac9e07a&amp;dn=Natural+Mineral+Nanotubes+-+Properties+and+Applications&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1469016718,"description":"Natural Mineral Nanotubes - Properties and Applications - P. Pasbakhsh et al. (AAP, 2015).pdf\r\n\r\nISBN 978-1-4822-6225-4\r\n\r\nThe book provides a wide introduction on history, minerology, geology, and the characteristics and application of different natural nanotubes. It is the first comprehensive book to discuss natural nanotubes, particularly halloysite nanotubes. The book will be useful mainly for postgraduate students and researchers working on the application of natural nanotubes. It will also be useful for those companies or researchers that focus on the design of materials and composites for sustainability.\r\n\r\nThis book:\r\n\r\n• Provides updates on the diverse and expanding applications of natural mineral nanotubes (including halloysite, sepiolite, and palygorskite) in various industries, and polymer nanocomposites for medical, health, and environmental applications\r\n\r\n• Provides a comprehensive review of the modification and intercalation of different natural mineral nanotubes\r\n\r\n• Reviews recent studies of the mechanical properties of halloysite nanotubes\r\n\r\n• Provides an up-to-date background on the structure, identification, and nomenclature of various natural mineral nanotubes, including halloysite, palygorskite, sepiolite, chrysotile, and erionite\r\n\r\n• Gives comprehensive global information on the mineralogy, geology, and occurrence of natural mineral nanotubes\r\n\r\n• Discusses the current understanding of the health risks of natural mineral nanotubes","torrent":{"xt":"urn:btih:57c79bfea8d4de6191f1022bb4742d5e4ac9e07a","amp;dn":"Natural+Mineral+Nanotubes+-+Properties+and+Applications","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57c79bfea8d4de6191f1022bb4742d5e4ac9e07a","infoHashBuffer":{"type":"Buffer","data":[87,199,155,254,168,212,222,97,145,241,2,43,180,116,45,94,74,201,224,122]},"announce":[],"urlList":[]}}