{"title":"Herbie: The Love Bug (Multi audio 3) (multi subs 8) 2Lions-Team","uid":5098632,"size":7939026201,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:57ecce8e55d96aec79083b9a51fc006f36a37187&amp;dn=Herbie%3A+The+Love+Bug+%28Multi+audio+3%29+%28multi+subs+8%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"goedkopekees","files":-1,"time":1253791613,"description":"Love Bug, The (1968) \n\nAlternatieve titel: Herbie: The Love Bug \n\n\nVerenigde Staten \n107 minuten \n\ngeregisseerd door Robert Stevenson \nmet Dean Jones, Michele Lee en David Tomlinson \n\nHerbie is een Volkswagen Kever met een eigen wil, die slecht behandeld wordt door de autoverkoper Peter Thorndyke. \nDe auto wordt gekocht door Jim Douglas, die hem wil gaan gebruiken voor autoraces. \nAls dat succesvol blijkt, probeert Thorndyke de auto terug in handen te krijgen. \n\nEnglish \n\nMeet Jim Douglas, a down-on-his-luck race car driver who lives in an old run-down fire house in San Francisco with his friend Tennessee Steinmetz, a occasional drunk mechanic. One day, Jim went to a luxury car dealer and surprisingly seen a strange Volkswagon Beetle with a unusual problem, it tends to drive on it's own almost having its own mind. Then this car drove all the way to Jim's home. Believing that the owner of the car dealership Peter Thorndyke, planted the car on him. Then, Jim wanted to try out the car for himself, then, he experienced the nature of the car for himself. Then, Jim fixed it and now is in more control. Tennessee dubbed the car &quot;Herbie&quot;. Then, Jim used Heribe for races. Jim then, was rising to fame and becoming more successful in racing, Then, Thorndyke wants Herbie back, but Jim refuses and Thorndyke wanted to compete against Jim in the races, then Thorndyke sabotaged Herbie before a race so, he can win. then, a big race known as the &quot;El Dorado&quot; was coming up and Jim and Tennessee along with Thorndyke's former assistant (and ex-Girlfriend) Carrol Bennet, repaired Herbie before the El Dorado. The trio are determined to beat Thorndyke in the El Dorado, who will swindle and cheat to make sure that they do not win \n\n\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD9 \nBron : Retail (pal) \nAudio : English, French, Spanish 5.1 \nOndertitels : Nederlands, English, French, Spanish, Swedish, Norwegian, Danish, Finnish (instelbaar) \n\nGenre : Komedie \n\n\n\n\nWeblink : http://www.moviemeter.nl/film/4899 \nWeblink : http://www.imdb.com/title/tt0064603 \n\n","torrent":{"xt":"urn:btih:57ecce8e55d96aec79083b9a51fc006f36a37187","amp;dn":"Herbie%3A+The+Love+Bug+%28Multi+audio+3%29+%28multi+subs+8%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57ecce8e55d96aec79083b9a51fc006f36a37187","infoHashBuffer":{"type":"Buffer","data":[87,236,206,142,85,217,106,236,121,8,59,154,81,252,0,111,54,163,113,135]},"announce":[],"urlList":[]}}