{"title":"Lida Husik - Fly Stereophonic [1997] [FLAC]","uid":8170875,"size":237197742,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:588b6ab0aa0d0a4f20294fa6d226038d9886237b&amp;dn=Lida+Husik+-+Fly+Stereophonic+%5B1997%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":15,"time":1361424022,"description":"Artist: Lida Husik\nRelease: Fly Stereophonic\nDiscogs: 342199\nReleased: 1997-06-24\nLabel: Alias Records\nCatalog#: A 121\nFormat: FLAC / Lossless / Log (100%) / Cue / CD\nCountry: US\nStyle: Electronic, Synth-pop\n\nTracklisting:\n\n01. Fly Stereophonic\n02. Fade Sister Cool\n03. Sharon Hill Shadows\n04. Soundman\n05. Cape Fear\n06. Cafe Con Leche\n07. Death Trip\n08. Ein Symphonie Des Grauens\n09. The Slide\n10. Dead Poets\n11. Chocolate City\n12. Dancing Pants\n\nCredits: Show\n\nReview by Stanton Swihart via Allmusic\n\nLida Husik sounds like the hippest bird of the aloof literate set, a sunglassed beatnik chick, one part dark and mysterious cafe habitue and one part swirling go-go girl, which makes Fly Stereophonic whimsically effervescent music that taps all the coolest touchstones of the au courant crowd. And for that reason alone, the album would be worth hearing, the rush of fizzy good nature and the energy burst that results from a carbonated high. Husik has a delightfully whiny voice that betrays an innocent mischief, and there is a definite touch of tweeness -- a taste for utterly charming kitsch -- to the album, yet it is accomplished with a knowing, devilish wink, a bright-eyed smile. And nearly every song is utterly, preposterously dance-worthy, in the '60s frug/jerk sense. What elevates Fly Stereophonic beyond, though, is that it is brimful of great songs. &quot;Chocolate City&quot; and the title track are ebullient songs full of insouciant good cheer, and hold down each end so that the music doesn't float balloon-like away; on display between them is a plethora of frothy delights and clever songwriting accomplishment: &quot;Cafe con Leche&quot; is oscillating, breezy folk-rock; &quot;Death Trip&quot; takes a Bo Diddley beat straight to the ballroom for a spin on the dancefloor; &quot;Fade Sister Cool&quot; and &quot;Cape Fear&quot; show that even when Husik is in a vaguely downbeat mood (granted, not often), it feels temporary, maybe even feigned for cool points. And that's the only real contention with Fly Stereophonic: the songs are wonderful, the production expert, and Husik a guileless delight, but it leaves you wondering if it is all a put-on or falls a bit too hard on the hip side; nevertheless, the utter lack of anger (at least of the self-righteous variety) and spite makes the album a cool refreshment on a hot day, a warm comforter on a cold one. Check your cynicism at the door, kids.\n &lt;a href=&quot;\nhttp://dickthespic.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:588b6ab0aa0d0a4f20294fa6d226038d9886237b","amp;dn":"Lida+Husik+-+Fly+Stereophonic+%5B1997%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"588b6ab0aa0d0a4f20294fa6d226038d9886237b","infoHashBuffer":{"type":"Buffer","data":[88,139,106,176,170,13,10,79,32,41,79,166,210,38,3,141,152,134,35,123]},"announce":[],"urlList":[]}}