{"title":"God Of War 2 Ps2 Dvd5 2 Disk Edition English Ntsc","uid":5520769,"size":8537671352,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:58a71cd01cbb2b3bc5d734aa3ef9fcdc36dbe764&amp;dn=God+Of+War+2+Ps2+Dvd5+2+Disk+Edition+English+Ntsc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"jingaro","files":175,"time":1272620815,"description":"GOD OF WAR 2 PS2 DVD5 2 DISK Edition English NTSC\n==================================================\n\nSince the Toxic Dual Layer Patch didn't work to well.\n\nI give you God Of War 2 UNCOMPRESSED on two DVD5 disks.\n\n\nFilename.....: God.of.War.2.USA.PS2DVD5-Dashing.part01 \n               God Of War 2 2nd Layer \n\nReleased.: ???... Well now i guess\nFormat.......: DVD5\nPlatform.: PlayStation 2 (PS2)\nDVD(s).......: 2\nFiles.....\nDISK 1: 86 RAR - 3.97 GB\nDISK 2: 87 RAR - 3.97 GB\nRipped.......: N/A\n\n\n-----------------------------------------------------------------------------------\n\nThe story picks up where players last left off with Kratos. Sitting atop his throne on Olympus, Kratos, the once mortal warrior has become a threat far worse than his predecessor Ares, had ever been. Kratos is a ruthless God, whose wrath strikes down anyone who crosses his path or the path of his beloved Sparta. The &quot;Ghost of Sparta&quot; sets out to alter that which no mortal, or god has ever changed, his fate.\n\nKratos' journey brings him to the very edge of the Earth, facing countless beasts, monsters, and horrors from his previous life, all bent on preventing him from reaching his goal. But this is Kratos, and his defiance is filled with such arrogance and contempt that all of the Ancient World still trembles at his name: Kratos, the God of War.\n\n    * Huge Collection of Combat Moves: Players can utilize their favourite combo attacks from GOD OF WAR along with a whole new set of moves and magic. Magic is based on nature's elements which include utilizing the power if wind, ice and much more.\n    * New Characters: From the popular Cyclops and Cerebus to the Flying Gryphon and more, players will encounter some of the greatest Greek mythological beasts, along with more enemies and bosses.\n    * Puzzle Solving: GOD OF WAR II features more puzzle solving, where players must solve intelligent, challenging and progressively more complicated puzzles latent with brutal elements that are intricately woven into the overarching story.\n    * Exploration: Players will continue their previous experiences in the dark, violent world of Greek mythology and test their agility through more levels as they traverse treacherous, often brutal terrain that will range from the undiscovered Sisters of Fate to the Dark Swap and more.\n\n-----------------------------------------------------------------------------------\n\nMAKE THE GAME WORK:\n\nNow to the info you actually need in order go make the game run.\n\nSince most of the TPB community had problems with the DVD9 disk i bring you the DVD5*2 version, the only fucking rip that is worth downloading.\n\nThe game can be played on any PS2 with a modchip even DMS3 since the game is split in to two DVD5 disks...\n\nSo put your DVD9 aside and bring back the good ol' DVD5 disk.\n\nTo make the game run is quite simple, when you reach &quot;The Great Chasm&quot; in the game stop at the save point and just switch disks and then just continue and that's it....\n\nNOTE: If you switch disks when you are on the bridge then the game will still bugg and Icarus won't appear, you need to switch disks BEFORE THE BACKGROUND MUSIC DISSAPEARS.\n-----------------------------------------------------------------------------------\n\nABOUT THE EXTRA MATERIAL:\n\nNo extra material has been removed\n\nWidescreen = Hell yeah\nDownsized in game movies = FUCK NO\nExtra material such as interviews and Challange Of The Titans = You got it!\nHacking = NO\n----------------------------------------------------------------------------------\n\nGOOD TO KNOW:\n\nUnlike other dipshits that claim that their version of the game is legit and &quot;works\nlike a charm&quot; i have actully played through the game and can assure you all that this is not a fake.\n\nWhen it comes to the problems with the &quot;Toxic Dual Layer Patch&quot; with the ECHELON version some people did make Icarus appear on the but the graphics started to hack then and the game was pretty much then unplayable.\n\nI personally managed to get past Icarus and get to meet Atlas but after that the game just blacks out, so that version is pretty much useless for us with a slim Pstwo and a just a modchip. \n\nYou can also resume your games from the ECHELON version so you don't need to start  over.\n\n\nFUN: Sooner or later the PS3 will also get cracked and a modchip will come out for it and when it does you can play GoW2 on your PS3 in HD resulation if you have a HDTV.\n\nJust press L1+L2+L3+SQUARE+CIRCLE at the same time and you will be able to play this game in a much higher resultionen..\n\nFor mor info about this check these links.\n &lt;a href=&quot; &lt;a href=&quot;\nhttp://cache.kotaku.com/assets/resources/2007/04/gowhdinstructions.jpg&quot;&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://cache.kotaku.com/assets/resources/2007/04/gowhdinstructions.jpg&quot;&lt;/a&gt; rel=&quot;nofollow&quot;&gt; &lt;a href=&quot;\nhttp://cache.kotaku.com/assets/resources/2007/04/gowhdinstructions.jpg&lt;/a&gt;&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://cache.kotaku.com/assets/resources/2007/04/gowhdinstructions.jpg&lt;/a&gt;&lt;/a&gt; &lt;a href=&quot; &lt;a href=&quot;\nhttp://www.gametrailers.com/player.php?id=18591&amp;type=wmv&amp;pl=game&quot;&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.gametrailers.com/player.php?id=18591&amp;type=wmv&amp;pl=game&quot;&lt;/a&gt; rel=&quot;nofollow&quot;&gt; &lt;a href=&quot;\nhttp://www.gametrailers.com/player.php?id=18591&amp;type=wmv&amp;pl=game&lt;/a&gt;&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.gametrailers.com/player.php?id=18591&amp;type=wmv&amp;pl=game&lt;/a&gt;&lt;/a&gt;\n\n\nNOTE: HIGH RESOLUTION ONLY WORKS ON PS3\n----------------------------------------------------------------------------------\nONE MORE THING: \n\nBoth of the disks can start the game and show the menu's in the beginning but only disk 1 can start the game from the beginning (duh).\n\nSo if you by any chance get the &quot;loading screen of death&quot; then that just simply means that you are loading your game from the wrong disk.\n\n\nREMEMBER BEFORE &quot;THE GREAT CHASM&quot; = DISK 1\nAFTER &quot;THE GREAT CHASM&quot; (BEFORE ICARUS/BRIDGE) = DISK 2 \n----------------------------------------------------------------------------------\nSEEDING:\nI will remain as the main seeder of this game between April 29 - May 5 then it's up to you guys.\n\nNOTE to the first downloaders: If you by any chance get 0 dl under a short period, don't crap yourself, that's just me rebooting my machine....\n\n----------------------------------------------------------------------------------\nLAST NOTES:\n\nI just wanted everyone to know that i am not the cracker/ripper of this game, got it from a friend of mine, so if the actual cracker/ripper is out there SALUT to you my man and a great thanx.\n\nPS: DITCH ALL THE BULLSHIT REALESES OF GOW2, Download this for a fully working and uncompressed version...","torrent":{"xt":"urn:btih:58a71cd01cbb2b3bc5d734aa3ef9fcdc36dbe764","amp;dn":"God+Of+War+2+Ps2+Dvd5+2+Disk+Edition+English+Ntsc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58a71cd01cbb2b3bc5d734aa3ef9fcdc36dbe764","infoHashBuffer":{"type":"Buffer","data":[88,167,28,208,28,187,43,59,197,215,52,170,62,249,252,220,54,219,231,100]},"announce":[],"urlList":[]}}