{"title":"Cartoon - The World of David the Gnome - Disc 1 of 4","uid":4511359,"size":6632216623,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:58d2e0a3f5636c458daee7af90a94b913413c92e&amp;dn=Cartoon+-+The+World+of+David+the+Gnome+-+Disc+1+of+4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"cowboy23","files":28,"time":1226788261,"description":"There is already a set of DVD rips on Demonoid but figured I&amp;#039;d upload the actual full disc&amp;#039;s if anyone is interested. This disc contains episodes 1-6\n\n# Format: Region Free thanks to AnyDVD\n# Language English\n# Region: Region 2\n# Aspect Ratio: 1.33:1\n# Number of discs: 4\n\n1 &quot;Good Medicine&quot; January 4, 1988[1]\nDavid explains what the daily life of the gnomes is like. He tells about his job as a doctor and the time he saved a goat who had swallowed a wire and a badger that had a splinter in his eye. David also tells that the gnomes have enemies, the trolls.\n2 &quot;Witch Way Out&quot;\nLisa becomes worried when David doesn&amp;#039;t come back home. He was removing a thorn from a deer&amp;#039;s hoof, but hadn&amp;#039;t come back. On the way home, David tells that there are many stories about supernatural creatures in the forest. While going down a steep hill, Swift trips over a rope, and he and David are captured by the trolls. Lisa sets out to find them, and disguised as a witch, makes a sleeping potion for the trolls. When the trolls were asleep, she rescued David and Swift.\n3 &quot;David to the Rescue&quot;\nDavid is called to Italy to treat a gnome girl. She had eaten a strawberry that had been sprayed with pesticide. The only plant that can cure her is the Shining Begonia. David travels to the Alps and outsmarts a snake to find the flower. On the way back, he meets Pot, one of the trolls.Pot challenges him to a dancing contest, and David cleverly keeps Pot waiting until the sun comes up. The troll turns into stone in the sunlight. David goes back to the palace and revives the gnome girl.\n4 &quot;The Baby Troll&quot;\nThe episode starts with Lisa explaining about the clothes gnomes wear. She mentions that David is out helping two deer who have their antlers locked together. David has to saw through the antlers to break them apart. When he is heading home, he sees a baby troll on a rock in the middle of the river! David decides to save the baby, although trolls are their enemies. David calls a gnome friend, and they set up a rope pulley to save the baby. The baby had been put out in the river by a farmer, because the mother troll switched his baby for hers.\n5 &quot;Little Houses for Little People&quot;\nDavid explains how gnomes build their houses. The entrance of the house is under a tree, with an underground tunnel leading to another tree. Many other gnomes and animals help build the houses. David and Lisa get a message from a rabbit about a deer with a broken leg. They both go to help the deer, who had fallen on a sharp rock, and part of it was embedded in her leg. David removes the piece of rock and puts a splint made of branches on her leg. Later that night, David also has to remove pine cones from the throat of another deer.\n6 &quot;The Wedding that almost wasn&amp;#039;t&quot;\nIt is wintertime in the forest, and David and Lisa are going to a friend&amp;#039;s wedding. David explains that trolls love to ruin weddings, so the gnomes had already set up some clever traps. David performs the wedding for the new couple, and all the guests go to their new house. The trolls also come to the house and start a fire outside so the gnomes would be suffocated by smoke. Once all of the gnomes were out, David found Pat the troll in one of the gnome traps. Pat tells the gnomes that the other trolls have gone to the mountains, so the gnomes follow him there. Next the gnomes and animals barrage the trolls with snow and put them to sleep.\n\nFor more information about the series check out Wikipedia http://en.wikipedia.org/wiki/The_World_of_David_the_Gnome","torrent":{"xt":"urn:btih:58d2e0a3f5636c458daee7af90a94b913413c92e","amp;dn":"Cartoon+-+The+World+of+David+the+Gnome+-+Disc+1+of+4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58d2e0a3f5636c458daee7af90a94b913413c92e","infoHashBuffer":{"type":"Buffer","data":[88,210,224,163,245,99,108,69,141,174,231,175,144,169,75,145,52,19,201,46]},"announce":[],"urlList":[]}}