{"title":"The Paul Butterfield Blues Band - An Anthology; The Elektra Year","uid":8636796,"size":931247186,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:598c8e63af895bc9524d834c228f301226856a00&amp;dn=The+Paul+Butterfield+Blues+Band+-+An+Anthology%3B+The+Elektra+Year&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":59,"time":1372775073,"description":"This is the same torrent that was uploaded to Demonoid in August 2008.\n\n\nThe Paul Butterfield Blues Band - An Anthology: The Elektra Years (1997) (2 CDs)\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/415VZKFRQQL._SL500_AA240_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/415VZKFRQQL._SL500_AA240_.jpg&lt;/a&gt;\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com)\nTracks have full tags (including embedded thumbnail).\nAll artwork in jpgs at 300 d.p.i. Rotated and cropped losslessly using jpegcrop. (Includes 24 page booklet.)\nAMG Bio.txt\nAMG Review.txt\nNotes.txt (which is simply these notes included in the torrent)\n\nBio from All Music:\n\nWith a style honed in the gritty blues bars of Chicago's south side, the Butterfield Blues Band was instrumental in bringing the sound of authentic Chicago blues to a young white audience in the mid-'60s, and although the band wasn't a particularly huge commercial success, its influence has been enduring and pervasive. The band was formed when singer and harmonica player Paul Butterfield met guitarist and fellow University of Chicago student Elvin Bishop in the early '60s. Bonding over a love of the blues, the pair managed to hijack Howlin' Wolf's rhythm section (bassist Jerome Arnold and drummer Sam Lay) and began gigging in the city's blues houses, where they were spotted in 1964 by producer Paul Rothchild, who quickly had them signed to Elektra Records. Guitar whiz Mike Bloomfield joined the band just before they entered the studio to record their debut album (and in time to be on-stage with the group when they backed up Bob Dylan at his infamous electric set at the 1965 Newport Folk Festival). Organist and pianist Mark Naftalin also came on board during the sessions for the self-titled The Paul Butterfield Blues Band, which was released by Elektra late in 1965. Lay became ill around this time, and his drum chair was taken by Billy Davenport, whose jazz and improvisational background came in handy during the recording of the band's second album, the Ravi Shankar-influenced East-West, released in 1966. Bloomfield departed to form Electric Flag in 1967, and Bishop handled all the lead guitar on the more R&amp;B-oriented third album, The Resurrection of Pigboy Crabshaw, which was released later that year and featured an entirely new rhythm section of Bugsy Maugh on bass and Phil Wilson on drums. Bishop and Naftalin left the band following the recording of 1968's In My Own Dream, and Butterfield drafted in 19-year-old guitarist Buzzy Feiten to help with the recording of 1969's Keep On Moving, which also featured the return of drummer Billy Davenport. After a live album in 1970 and the lackluster Sometimes I Just Feel Like Smilin', released in 1971, Butterfield put the band to rest. In retrospect, the Butterfield Blues Band had pretty much put their cards on the table in their first two albums, both of which are classics of the era, featuring a heady mixture of folk, rock, psychedelia, and even Indian classical music played over an embedded base of good old Chicago blues.\n\nTaken from: &lt;a href=&quot; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:3jfoxqugldke~T21&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:3jfoxqugldke~T21&lt;/a&gt;\n\nAll Music Album Review:\n\nAn Anthology -- The Elektra Years is a double-disc, 33-song set that offers a comprehensive overview of Paul Butterfield's eight years with the label. His first two albums, Paul Butterfield Blues Band and East-West, were seminal, groundbreaking records that blurred the boundaries between blues, jazz and rock, suggesting everything from blues-rock to psychedelia. They were stunning achievements which proved difficult to match, but Butterfield's remaining albums for the label all had a few good cuts. An Anthology does a nice job of rounding up those highlights, picking the best moments from uneven records; consequently, it's quite a valuable package for listeners who simply want a sampling from those later albums instead of purchasing them individually. Butterfield's first two albums remain necessary listens in their own right, but this set offers an excellent summary of his entire stint with Elektra.\n\nTaken from: &lt;a href=&quot; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:a9fqxqrjld0e&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:a9fqxqrjld0e&lt;/a&gt;\n\nAmazon has this album: &lt;a href=&quot; http://www.amazon.com/dp/B000002HRB&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.amazon.com/dp/B000002HRB&lt;/a&gt;\n\nTrack List:\n\nDisc 1:\n\n01. Born In Chicago\n02. Lovin' Cup\n03. One More Mile\n04. Off The Wall\n05. Come On In\n06. Nut Popper #1\n07. Ain't No Need To Go No Further, It's Too Late Brother\n08. Born In Chicago\n09. Shake Your Money Maker\n10. Blues With A Feeling\n11. Thank You Mr. Poobah\n12. Our Love Is Driftin'\n13. Mystery Train\n14. Last Night\n15. Walkin' Blues\n16. I Got A Mind To Give Up Living\n17. Work Song\n18. All These Blues\n19. East West\n\nDisc 2:\n\n01. One More Heartache\n02. Double Trouble\n03. Last Hope's Gone\n04. Mornin' Blues\n05. Just To Be With You\n06. Get Yourself Together\n07. In My Own Dream\n08. Love March\n09. Walkin' By Myself\n10. Love Disease\n11. Everything's Gonna Be Alright\n12. Driftin' &amp; Driftin'\n13. Blind Leading The Blind\n14. Song For Lee\n","torrent":{"xt":"urn:btih:598c8e63af895bc9524d834c228f301226856a00","amp;dn":"The+Paul+Butterfield+Blues+Band+-+An+Anthology%3B+The+Elektra+Year","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"598c8e63af895bc9524d834c228f301226856a00","infoHashBuffer":{"type":"Buffer","data":[89,140,142,99,175,137,91,201,82,77,131,76,34,143,48,18,38,133,106,0]},"announce":[],"urlList":[]}}