{"title":"Kid Creole &amp; The Coconuts - Fresh Fruit 1981 EAC-FLAC (oan)","uid":5822857,"size":365259150,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:59fe2ee0ff38151190257977abbe5029c445ee41&amp;dn=Kid+Creole+%26+The+Coconuts+-+Fresh+Fruit+1981+EAC-FLAC+%28oan%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"oneanight","files":-1,"time":1284125665,"description":"Not my rip thank you very much to the original poster..;)\n\nKid Creole &amp; The Coconuts - Fresh Fruit In Foreign Places (1981) (2002 Remaster) EAC-FLAC.\n &lt;a href=&quot;\nhttp://leetleech.org/images/85947187606330059403.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://leetleech.org/images/85947187606330059403.jpg&lt;/a&gt;\n\nFirst released in 1981, the camp Caribbean-influenced outfit's second album was a dizzying Technicolor confection of outrageous Carmen Miranda-influenced songs, reggae, New York downtown experimental funk, Cuban son, and Afropop. This re-mastered re-release also contains Kid Creole sidekick Coati Mundi's irrepressible slice of wacky Latin pop, &quot;Que Pasa/Me No Pop I&quot;. \n\n01. Going Places\n02. In The Jungle\n03. Animal Crackers\n04. I Stand Accused\n05. Latin Music\n06. Musica Americana\n07. I Am\n08. Schweinerei\n09. Gina, Gina\n10. With A Girl Like Mimi\n11. Table Manners\n12. Dear Addy\n13. Table Manners (12&quot;)\n14. Que Pasa / Me No Pop I (Coati Mundi - 12&quot; Mix) \n\nAfter the critical acclaim of 'off the coast of me', August Darnell now had the backing to follow through his ideas and produce an album with a more polished sound. 'Fresh fruit in foreign places' is the first of three 'concept' albumns that charts the travels and adventures of the Kid and his friends, telling of the search for lost love and journeys to distant lands.\n\nDarnell's varying musical influences i.e. latin, swing, reggae, funk and music theatre, are used to great effect in describing the themes of travel and discovery. All the different styles are then turned on their head and fused in a way which creates music that is hard to define. Like most of Kid Creole and the Coconuts' albums 'Fresh fruit in foreign places' displays exuberance, superb musicianship and arrangements, and tongue in cheek wit.\n\n'Going places' sets the scene. Featuring a deft vibes solo by Coati Mundi, it has a real sense of anticipation and an air of mystery about it. From the atmospheric 'In the jungle' and the lamenting 'Dear Addy' to the tracks featuring the classic latin sounds, the team exude skill and confidence, clear in the knowledge that they're creating a colourful and exciting musical landscape and a magical world. Customer Review\nwww.amazon.co.uk\n\nI will not write an album review! I will not write an album review! I will not write an album review! I will not write an album review!\n\nNo, it's a great album. Buy it. Enjoy it. But I'm not adding my contribution here because of this album. I'm writing to tell you that if you buy it, with the inclusion of Coati Mundi's Me No Pop I/Que Pasa double A-sided single (here provided as a single, seemless remix into one longer track) you will have in your possession what is one of the greatest pop singles ever made. It barely scratched the chart's backside on release but it is a brilliant mix of latino pop funk, two(!) of the catchiest choruses you will ever hear, a vocal delivery that veers from drunken abuse to preening machismo to beligerent insults, all slurred, snarled and (occasionally) sung, by an abused, horny, disappointed, vengeful and lovelorn lothario. There is one moment in every artist's life when everything hits exactly the right spot in one place and one time, and for Andy Hernandez (aka Coati Mundi) this was it. Nigh on perfect. Customer Review www.amazon.co.uk\n\n\n\n\nLong a critical favorite, this record is one of the best releases of the 1980's. This digital remaster does justice to the original, whose lyrical virtuosity and standout musicianship, as well as outstanding production, made it an instant vintage.\n\nAn &quot;album&quot; in the best sense of the word, this is enlightened &quot;mulatto music&quot; for the masses. Standout tracks include &quot;Schweinerei,&quot; and &quot;In the Jungle,&quot; and of course &quot;Me No Pop I,&quot; whose twelve inch mix is included in this remaster. But do yourself a favor and enjoy this album as the complete work of art it was intended to be.\n\nHow good do I think this record is? I play cuts from this album (and the entire album when time permits) in my introductory African Diaspora classes and workshops. There are few truly modern works of art that embody the concept of &quot;Creole&quot; as skillfully as this work does, not just in terms of stamps on one's passport, but also in terms of artfully blending the multidudinous ways in which the &quot;changing same&quot; that characterizes so much of African-matrixed forms of art. Much of the album involves not just fanciful plays on words, but fun with language (and languages) itself, a truly African Diaspora oriented notion. Another wonderful aspect of this music is its explicitly self-aware historicism and playful incorporation of a 1930's and 1940's big band jazz (New York style as well as Island style) aesthetic.\n\nMany of the themes explored here were already in evidence with Dr. Buzzard's Original Savannah Band, but they are taken to a new level in this work. Much of the credit for that goes to the musicians, particularly the legendary Winston Grennon, whose drumming is outstanding. Above all, August Darnell deserves beaucoup credit for assembling such top-notch talent.\n\nSometimes the critics are right. This is one such example. Customer Review www.amazon.com\n\nAll Artwork Included At 300dpi ","torrent":{"xt":"urn:btih:59fe2ee0ff38151190257977abbe5029c445ee41","amp;dn":"Kid+Creole+%26+The+Coconuts+-+Fresh+Fruit+1981+EAC-FLAC+%28oan%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59fe2ee0ff38151190257977abbe5029c445ee41","infoHashBuffer":{"type":"Buffer","data":[89,254,46,224,255,56,21,17,144,37,121,119,171,190,80,41,196,69,238,65]},"announce":[],"urlList":[]}}