{"title":"Gavick University Joomla 2.5-3.X Template","uid":10372200,"size":30430636,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:5a06e694a4f5975b2f9fb7ebb1e87ea2e6f8e4ee&amp;dn=Gavick+University+Joomla+2.5-3.X+Template&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"wasexton","files":1,"time":1402948934,"description":"Enjoy the exclusive design and superb functionality provided by our new education template. Full JomSocial support along with our specially-prepared pages and modules helps to bridge the gap between students and teachers, making interaction an important part of school and college campus life.\n\nOur own custom modifications to K2 combine with our News Show Pro module to provide additional events tracking on the frontpage, with themed pages especially for detailing the particulars of the event, with date, time and venue information. What's more, registering and logging-in are handled on the same page, so no need to unnecessary extra links.\n\nThe frontpage grows even more dynamic, with latest news displayed in elegant showcases on a parallax-effect background, a large header slider and latest social information from your chosen Twitter feed and JomSocial streams to keep visitors up-to-date with what's going on at the school.\n\nCustom HTML elements round out the layout, with embedded video, contact forms, newsletters and important links all accounted for. We've also added new layouts for K2 and Joomla pages, with teacher profiles and event lists, as well as an About Us area with ready-prepared sections for history, FAQs and fact sheets.\n\nUniversity also comes with advanced typography and extensive options for an awe-inspiring college or school website.","torrent":{"xt":"urn:btih:5a06e694a4f5975b2f9fb7ebb1e87ea2e6f8e4ee","amp;dn":"Gavick+University+Joomla+2.5-3.X+Template","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a06e694a4f5975b2f9fb7ebb1e87ea2e6f8e4ee","infoHashBuffer":{"type":"Buffer","data":[90,6,230,148,164,245,151,91,47,159,183,235,177,232,126,162,230,248,228,238]},"announce":[],"urlList":[]}}