{"title":"Feathers: The Evolution of a Natural Miracle - Thor Hanson - MP3","uid":11693673,"size":241256521,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5a1263c2b5318f216f042738991656531b7dad0f&amp;dn=Feathers%3A+The+Evolution+of+a+Natural+Miracle+-+Thor+Hanson+-+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Squiddy82","files":18,"time":1423627323,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nFeathers: The Evolution of a Natural Miracle\n\nWritten by: Thor Hanson\nNarrated by: Andy Ingalls\nLength: 8 hrs and 20 mins\nUnabridged Audiobook\nRelease Date:04-07-14\n\nFeathers are an evolutionary marvel: Aerodynamic, insulating, beguiling. They date back more than 100 million years. Yet their story has never been fully told.\nIn Feathers, biologist Thor Hanson details a sweeping natural history, as feathers have been used to fly, protect, attract, and adorn through time and place. Applying the research of paleontologists, ornithologists, biologists, engineers, and even art historians, Hanson asks: What are feathers? How did they evolve? What do they mean to us?\nEngineers call feathers the most efficient insulating material ever discovered, and they are at the root of biology's most enduring debate. They silence the flight of owls and keep penguins dry below the ice. They have decorated queens, jesters, and priests. And they have inked documents from the Constitution to the novels of Jane Austen.\nFeathers is a captivating and beautiful exploration of this most enchanting object","torrent":{"xt":"urn:btih:5a1263c2b5318f216f042738991656531b7dad0f","amp;dn":"Feathers%3A+The+Evolution+of+a+Natural+Miracle+-+Thor+Hanson+-+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a1263c2b5318f216f042738991656531b7dad0f","infoHashBuffer":{"type":"Buffer","data":[90,18,99,194,181,49,143,33,111,4,39,56,153,22,86,83,27,125,173,15]},"announce":[],"urlList":[]}}