{"title":"Flu Factories (swine flu and factory farming documentary)","uid":5306995,"size":3462004736,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:5a7c5216218eb566e4d617272ca9a17693ab0197&amp;dn=Flu+Factories+%28swine+flu+and+factory+farming+documentary%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mhg1","files":-1,"time":1264432467,"description":" Influenza pandemics, triggered by bird or swine flu viruses, have the potential \n to kill millions of people. The influenza virus has existed for millions of\n years as an innocuous intestinal virus of wild ducks. What turned a\n harmless waterborne duck virus into a killer? In an engaging multimedia\n presentation, Dr. Michael Greger traces the human role in the evolution\n of this virus and suggests what society can do to reduce  the likelihood \n of such potential catastrophes in the future.\n &lt;a href=&quot;\nhttp://drgreger.org/DVDs/#swineflu&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://drgreger.org/DVDs/#swineflu&lt;/a&gt;\n\nA graduate of the Cornell University School of Agriculture and the Tufts University School of Medicine, Michael Greger, M.D., serves as Director of Public Health and Animal Agriculture at The Humane Society of the United States.  An internationally recognized lecturer, he has presented at the Conference on World Affairs, the National Institutes of Health, and the International Bird Flu Summit, testified before Congress, and was an expert witness in defense of Oprah Winfrey at the infamous &quot;meat defamation&quot; trial.  His recent scientific publications in American Journal of Preventive Medicine, Biosecurity and Bioterrorism, Critical Reviews in Microbiology, and the International Journal of Food Safety, Nutrition, and Public Health explore the public health implications of industrialized animal agriculture, and his latest book, the acclaimed Bird Flu: A Virus of Our Own Hatching, is now available full-text at no cost at www.BirdFluBook.org.\n","torrent":{"xt":"urn:btih:5a7c5216218eb566e4d617272ca9a17693ab0197","amp;dn":"Flu+Factories+%28swine+flu+and+factory+farming+documentary%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a7c5216218eb566e4d617272ca9a17693ab0197","infoHashBuffer":{"type":"Buffer","data":[90,124,82,22,33,142,181,102,228,214,23,39,44,169,161,118,147,171,1,151]},"announce":[],"urlList":[]}}