{"title":"Hank Crawford - 1983 - Indigo Blue (1991) FLAC","uid":8812396,"size":199922917,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5bcb3e77471aa1261fa1d52223abdd3d023d7538&amp;dn=Hank+Crawford+-+1983+-+Indigo+Blue+%281991%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"eika256","files":-1,"time":1376491335,"description":"Hank Crawford - 1983 - Indigo Blue (1991)\n\nHank Crawford's Indigo Blue was released in August of 1983, less than a year after his excellent comeback set, Midnight Ramble, and proves that his renewed sense of creativity was no fluke. Here he teams once more with Dr. John on piano and organ and drummer Bernard Purdie. Melvin Sparks took over the guitar chair from Calvin Newborn, and Wilber Bascombe, Jr. holds down the rhythm section on bass. In addition, a horn section that includes David &quot;Fathead&quot; Newman, Danny Moore, Howard Johnson, and Martin Banks, arranged by Crawford, follows the same recipe as Midnight Ramble. The performances here are solid, truly impressive. Crawford plays sweet and slow as well as honking mean in getting at the root source of straight-ahead jazz and soul-jazz: the blues. And speaking of blues, the opener, &quot;All Alone and Blue,&quot; is a barrelhouse of nasty guitar and organ work with Crawford's alto walking the bar while playing a mean solo. It's quite a changeup to open a set with -- but the only other thing you could do is close with it. This is followed by a gorgeous reading of Ray Noble's &quot;The Very Thought of You,&quot; all slow, deep, and refined with only Crawford's alto allowed to bring in the edges. But there are more surprises as Crawford and band tackle Willie Nelson's &quot;Funny&quot; and reveal both the blues and jazz roots in the tune. The swing between Dr. John and Sparks in the title track is truly canny, and Crawford's response in blowing shows it. This one is in the cut, and the groove is everywhere. The bittersweet ballad &quot;Just for a Thrill&quot; ends the set, with some of the sweetest and most lyrical piano and alto playing either man had done on a record until that time. Indigo Blue is a winner; it's hungry and elegant, sophisticated and swaggering. It's a trademark recording by Hank Crawford. (AllMusic)\n\nTrack list:\n01 - All Alone And Blue\n02 - The Very Thought Of You\n03 - Things Ain't What They Used To Be\n04 - Funny\n05 - Indigo Blue\n06 - Just For A Thrill\n\nEnjy and share! ","torrent":{"xt":"urn:btih:5bcb3e77471aa1261fa1d52223abdd3d023d7538","amp;dn":"Hank+Crawford+-+1983+-+Indigo+Blue+%281991%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5bcb3e77471aa1261fa1d52223abdd3d023d7538","infoHashBuffer":{"type":"Buffer","data":[91,203,62,119,71,26,161,38,31,161,213,34,35,171,221,61,2,61,117,56]},"announce":[],"urlList":[]}}