{"title":"Ted Nugent - Double Live Gonzo (resequenced and expanded by }{ey","uid":9281670,"size":694105627,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:5be173a64b854d38fc43fe590707105df96b6e82&amp;dn=Ted+Nugent+-+Double+Live+Gonzo+%28resequenced+and+expanded+by+%7D%7Bey&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"}{eywood","files":18,"time":1385948469,"description":"Ted Nugent\nDouble Live Gonzo\nspecial expanded and resequenced edition\nby }{eywood\n\n\nThis is my remake of Ted's seminal live album.  CD releases of this album always fell short for me because of the fades between songs (a no-no for me when it comes to live albums.  Never fade anything except the end), plus it had several songs that had farewells at the end, making it seem like a collection of the ends of a bunch of shows, not a recreation of a single concert experience.\n\nSo I took it upon myself to resequence the album so that it sounded like a real concert in order and in mood.  Also, many of Ted's albums have been remastered and re-released with live bonus tracks, and the 1993 Out Of Control set featured tracks recorded at the same shows used for this album, which led me to expanding the tracklist in the process.  Many of the live tracks added as bonus tracks were the same songs as on this album (albeit different versions) and I chose not to use them here.   There were a few songs not utilized when assembling this album originally, and they are now presented here, for the first time in context.\n\nThe quality of the original recordings left something to be desired, so I EQd the record a bit to match it more properly to the newer releases.  Unfortunately I couldn't go back and fix the mixes themselves, some of which are awful (the drums on Motor City Madhouse are so dull you can barely make them out), but I did my best, and I feel that this sounds more like a real concert than a collection of various loose tracks.\n\n01 Just What The Doctor Ordered\n02 Yank Me, Crank Me\n03 Free-For-All\n04 Dog Eat Dog\n05 Wang Dang Sweet Poontang\n06 Cat Scratch Fever\n07 Walking Tall\n08 Great White Buffalo\n09 Stormtroopin'\n10 Stranglehold\n11 Hibernation\n12 Gonzo\n13 Baby Please Don't Go\n14 Motor City Madhouse","torrent":{"xt":"urn:btih:5be173a64b854d38fc43fe590707105df96b6e82","amp;dn":"Ted+Nugent+-+Double+Live+Gonzo+%28resequenced+and+expanded+by+%7D%7Bey","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5be173a64b854d38fc43fe590707105df96b6e82","infoHashBuffer":{"type":"Buffer","data":[91,225,115,166,75,133,77,56,252,67,254,89,7,7,16,93,249,107,110,130]},"announce":[],"urlList":[]}}