{"title":"Robin Thicke - Sex Therapy  (2nafish)","uid":5228146,"size":148791300,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:5c1e80b189b507ff36bd52eef823da6d4bfa2640&amp;dn=Robin+Thicke+-+Sex+Therapy++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"2nafish","files":-1,"time":1261217943,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Sex Therapy&quot; is a song by American R&amp;B singer Robin Thicke. The R&amp;B ballad is the lead single from his upcoming album Sex Therapy. The song was released to radio on October 20, 2009. The official remix features Ludacris and was released December 17, 2009.\n\nRobin Thicke confirmed on his twitter account that he shot the video for the song on October 24 in L.A. with music video director Melina Matsoukas, at the same mansion of Hilary Duff's Reach Out. The video was released on November 19. Model Saleisha Stowers made a cameo in the video.\n\nKelsey Paine from Billboard Magazine gave a very positive review for the song, saying that: &quot;Robin Thicke delivers his signature smooth talk on &quot;Sex Therapy,&quot; . Producers Polow Da Don and Hot Sauce set up a languorous backbeat with understated synths and soft drum kicks, while Thicke turns the heat all the way up. &quot;Stressed out, uptight, overworked, wound up/Unleash what you got, let's explore your naughty side,&quot; the singer croons. &quot;Just let me love you, lay right here, I'll be your fantasy/Give you sex therapy.&quot; The come-hither lyrics, accompanied by Thicke's breathy falsetto and deep bass undertones, give the song an unforced eroticism that feels ideal for lovers of romance. Thicke's stripped-down brand of R&amp;B is of an ultra-suggestive nature, but his earnest vocal performance is what ultimately keeps it classy.\n\nSex Therapy: the Session is the fourth studio album by American R&amp;B singer-songwriter Robin Thicke, released December 15, 2009 on Star Trak Entertainment in the United States. The album's first single, the title track, was released on October 20, 2009. He linked with Jay-Z to feature on the track &quot;Meiple (Me I Play)&quot; on the album. The album is also set to feature a song with Game, Jazmine Sullivan, Kid Cudi, Snoop Dogg, Nicki Minaj, and Estelle. It is Robin Thicke's first album with a Parental Advisory warning label printed on it.\n\nThere will be two different versions of the album. The regular version is called Sex Therapy: The Session. The deluxe version, to be released on the same day, is called Sex Therapy: The Experience, which has five additional tracks. Unlike most other special editions, where the bonus tracks are all at the end, the extra tracks on The Experience are mixed in with the regular Session tracklisting.\n\nRobin Charles Thicke (born March 10, 1977) is an American Grammy-Award-winning singer, songwriter, musician, composer, and occasional actor. Thicke's albums are noted for their feature of a predominately R&amp;B sound.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:5c1e80b189b507ff36bd52eef823da6d4bfa2640","amp;dn":"Robin+Thicke+-+Sex+Therapy++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c1e80b189b507ff36bd52eef823da6d4bfa2640","infoHashBuffer":{"type":"Buffer","data":[92,30,128,177,137,181,7,255,54,189,82,238,248,35,218,109,75,250,38,64]},"announce":[],"urlList":[]}}