{"title":"The Butthole Surfers - Rembrandt Pussyhorse","uid":4090754,"size":47497149,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5c27f3d997e795fe43d8278bb39c5d82991ab26a&amp;dn=The+Butthole+Surfers+-+Rembrandt+Pussyhorse&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"butcherboys","files":11,"time":1206054531,"description":"Artist:  The Butthole Surfers\nAlbum:   Rembrandt Pussyhorse\nBitrate: 192\nRelease: 1986\nGenre:   Punk\n\n\n\n   1. &quot;Creep in the Cellar&quot; ? 2:05\n   2. &quot;Sea Ferring&quot; ? 4:00\n   3. &quot;American Woman&quot; (Bachman, Cummings, Kale, Peterson) ? 5:33\n   4. &quot;Waiting for Jimmy to Kick&quot; ? 2:21\n   5. &quot;Strangers Die Everyday&quot; ? 3:08\n   6. &quot;Perry&quot; ? 3:32\n   7. &quot;Whirling Hall of Knives&quot; ? 4:44\n   8. &quot;Mark Says Alright&quot; ? 4:08\n   9. &quot;In the Cellar&quot; ? 3:18\n\n\nRembrandt Pussyhorse is the second full-length studio album by American punk band Butthole Surfers, released in April 1986. All songs were written and produced by the Butthole Surfers, except &quot;American Woman&quot;, which was written by Randy Bachman, Burton Cummings, Jim Kale, and Garry Peterson of The Guess Who, and &quot;Perry&quot;, which borrows the tune from the theme music to the old Perry Mason TV show starring Raymond Burr.\n\nThe album was originally released on Touch and Go, and was reissued on Latino Buggerveil in 1999. Both Touch and Go &amp; Latino Buggerveil&amp;#039;s CD versions of the album include 1985&amp;#039;s Cream Corn from the Socket of Davis EP.\n\nRembrandt Pussyhorse is one of the most experimental releases in the Surfers&amp;#039; considerably experimental catalog. Making heavy use of in-studio tape editing and sound modulation, the album adds piano, organ, and violin, amongst other sounds, to the Surfers&amp;#039; then-usual battery of electric guitar, bass, and dual drummers. According to guitarist Paul Leary and lead vocalist Gibby Haynes, the Surfers were a four-piece for most of these sessions, with Leary playing the majority of the bass lines.\n\nHowever, not all of the new instrumentation was performed by the band. The piano on &quot;Creep in the Cellar&quot; and the organ on &quot;Perry&quot; were played by the recording studio&amp;#039;s owner, who offered free studio time in exchange for being included on the album. &quot;Creep...&quot;&amp;#039;s piano part was written by Haynes, though.\n\nAlso of note is the violin heard on &quot;Creep in the Cellar.&quot; This was the result of the Surfers purchasing a used 16-track tape, on which a country &amp; western band had previously recorded. Upon playing their mix of &quot;Creep in the Cellar,&quot; the band discovered they had inadvertently kept one of the country band&amp;#039;s channels, which contained a backwards violin track. Liking the way it worked with the song, they opted to keep it.\n\nFinally, the growls on &quot;Mark Says Alright&quot; are from a female pit bull that the band owned at the time, named Mark Farner.","torrent":{"xt":"urn:btih:5c27f3d997e795fe43d8278bb39c5d82991ab26a","amp;dn":"The+Butthole+Surfers+-+Rembrandt+Pussyhorse","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c27f3d997e795fe43d8278bb39c5d82991ab26a","infoHashBuffer":{"type":"Buffer","data":[92,39,243,217,151,231,149,254,67,216,39,139,179,156,93,130,153,26,178,106]},"announce":[],"urlList":[]}}