{"title":"Pocket Guide to GastrointestinaI Drugs (Wiley) [PDF] [StormRG]","uid":11079282,"size":2105378,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5c8b000bfdfef885d9cacce55454ef0674522cc0&amp;dn=Pocket+Guide+to+GastrointestinaI+Drugs+%28Wiley%29+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"0xmovva","files":2,"time":1411379777,"description":"\nAuthor: M. Michael Wolfe (Editor), Robert C. Lowe (Editor)\nPaperback: 288 pages\nPublisher: Wiley-Blackwell; 1 edition (March 3, 2014)\nLanguage: English\nISBN-10: 1118481577\nISBN-13: 978-1118481578\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds forthe seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n________________________________________________________________________________\n\n\nLearn all you need to know about gastrointestinal drugs and their clinical use with this one-stop, rapid reference pocket guide.\nBrought to you by many of the world's leading GI drug experts, Pocket Guide to Gastrointestinal Drugs provides comprehensive guidance to the pharmacological properties of drugs used to treat gastrointestinal conditions, including mechanisms of action, appropriate administration, and potential adverse effects associated with their use.\n\nOrganized by class of drug and ranging from PPIs to immunosupressants, each chapter first examines the specific agents within that class and then their appropriate and judicious use across a range of specific GI disorders.\n\nKey features include:\n\nIntroduction of drug class\nBasic pharmacology, including mechanism of action, bioavailability, metabolism, interactions, adverse effects, toxicity, and special considerations\nDosing information for each GI condition and on- and off-label use\nConsistent use of both generic and trade names throughout\nSpecific reference to drug use in pediatric patients and during pregnancy\nPerfect for quick consultation on the wards and in the office, Pocket Guide to Gastrointestinal Drugs is the ideal tool for all those managing patients with GI conditions, including gastroenterologists, GI trainees, emergency physicians, GI specialist nurses, primary care physicians and residents, intensivists and pharmacists.","torrent":{"xt":"urn:btih:5c8b000bfdfef885d9cacce55454ef0674522cc0","amp;dn":"Pocket+Guide+to+GastrointestinaI+Drugs+%28Wiley%29+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c8b000bfdfef885d9cacce55454ef0674522cc0","infoHashBuffer":{"type":"Buffer","data":[92,139,0,11,253,254,248,133,217,202,204,229,84,84,239,6,116,82,44,192]},"announce":[],"urlList":[]}}