{"title":"Jaco Pastorius - 2003 - Punk Jazz FLAC","uid":9105783,"size":1070225128,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5ca4f131b8b1d8be24ae2234c31e3a1e609088d0&amp;dn=Jaco+Pastorius+-+2003+-+Punk+Jazz+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"eika256","files":-1,"time":1382869038,"description":"Jaco Pastorius - 2003 - Punk Jazz\n\nThankfully, there is finally a definitive Jaco Pastorius anthology that offers an accurate portrait of the breadth and depth of his innovative artistry beyond what his contributions to Weather Report and his own Word of Mouth and Trio of Doom (which many would argue are sufficient in and of themselves) would suggest. This two-CD, 28-track collection ranges across the fretless bass inventor's earliest recordings, documented by a live appearance with Wayne Cochran's C.C. Riders and home playing the Cochran standard &quot;Amelia,&quot; to his work with underground R&amp;B act Little Beaver and such artists as Pat Metheny, Mike Stern, Joni Mitchell in and out of the studio, Paul Bley, Airto and Flora Purim, Michel Columbier, Brian Melvin, and his diverse projects -- including &quot;Birdland&quot; with Weather Report. There are three unreleased cuts -- &quot;Amelia,&quot; an unreleased home demo of &quot;The Chicken,&quot; and &quot;Good Morning Annya&quot; from his unfinished steel drum project, Holiday for Pans. Two other cuts, &quot;Foreign Fun&quot; and &quot;Okonkole y Trompa,&quot; are on CD in the United States for the first time. Pastorius fanatics will no doubt already have everything here in one form or another. Casual listeners will be astonished by the sheer multi-dimensional nature of his limitless musicality and vision. Even those well acquainted with Pastorius will be surprised as to how well the sequencing of these tracks offers such a prismatic view of Pastorius' growth as a bassist -- check out the silky funky grooves on Little Beaver's &quot;I Can Dig It Baby&quot; and the gutbucket greasy R&amp;B of &quot;Amelia,&quot; as they give way to adventurous early fusion of &quot;Batterie&quot; with Metheny, Bley, and Bruce Ditmas. Even in abstraction, Pastorius had a groove. The more pop side of Jaco's work is highlighted on the first disc with his contributions to Joni Mitchell's Mingus and Shadows and Light albums, as well as his more exotic, atmospheric work with Airto and Flora. Disc two concentrates on Jaco's innovative work as a composer for his own bands, as evidenced by &quot;Word of Mouth,&quot; &quot;Liberty City,&quot; &quot;John and Mary,&quot; &quot;Chromatic Fantasy,&quot; and &quot;Blackbird.&quot; Four live tracks with the big band showcase his role as a bandleader and arranger of true authority and vision. The solo &quot;Amerika&quot; offers a more intimate view of Pastorius as a seeker of texture and sonic subtleties. The set closes with him in trios with Mike Stern and Brian Melvin. This is a necessary package for anyone interested in the development of electric jazz in the 1970s and 1980s. (AllMusic)\n\nTrack list:\nCD 1\n01. Jaco Pastorius - The Chicken (Home Recording)\n02. Wayne Cochran's C.C. Riders - Amelia (Live, 1972)\n03. Little Beaver - I Can Dig It Baby\n04. Jaco Patorius, Pat metheny, Bruce Ditmas, Paul Bley - Batterie\n05. Jaco Pastorius - Continuum\n06. Pat Metheny - Midwestern Nights Dream\n07. Trilogue - Foreign Fun (Live, 1976)\n08. Weather Report - Birdland\n09. Airto - Nativity\n10. Flora Purim - Las Olas\n11. Michel Colombier - Sunday\n12. Michel Colombier - Layas\n13. Joni Mitchel - Goodbye Pork Pie Hat\n14. Joni Mitchel - The Dry Cleaner From Des Moines (Live, 1979)\n15. Jaco Pastorius - Punk Jazz (Live, 1981)\nCD 2\n01. Jaco Pastorius - 3 Views Of A Secret\n02. Jaco Pastorius - Liberty City\n03. Jaco Pastorius - Chromatic Fantasy\n04. Jaco Pastorius - Blackbird\n05. Jaco Pastorius - Word Of Mouth\n06. Jaco Pastorius - John And Mary\n07. Jaco Pastorius - Good Morning Anya\n08. Jaco Pastorius Big Band - Invitation (Live, 1982)\n09. Jaco Pastorius Big Band - Soul Intro./The Chicken (Live, 1982)\n10. Jaco Pastorius Big Band - Amerika (Live, 1982)\n11. Jaco Pastorius Big Band - Okonkole' Y Trompa (Live, 1982)\n12. Mike Stern - Mood Swings\n13. The Brian Melvin Trio - Out Of The Night\n\nPersonnel:\nJaco Pastorius - saxophone, guitar, bass, electric bass, drums\nJoe Zawinul - vocals, acoustic piano, synthesizer, melodica\nWillie &quot;Little Beaver&quot; Hale - vocals, guitar, bass\nJoni Mitchell - vocals\nHubert Laws - soprano &amp; alto saxophone\nBob Mintzer - soprano &amp; tenor saxophone\nTeddy Ludwig - alto saxophone\nMichael Brecker - tenor saxophone\nBob Gable - baritone saxophone\nRandy Emerick - baritone saxophone\nT-Don Capron - trumpet\nPeter Graves - bass trombone\nToots Thielemans - harmonica\nHerbie Hancock - acoustic piano, Fender Rhodes piano, synthesizer\nBenny Latimore - keyboards\nTimmy Thomas - keyboards\nLee Ritenour - guitar\nLarry Carlton - guitar\nKenny Cordray - guitar\nPeter Erskine - drums\nJack DeJohnette - drums\nAllyn Robinson - drums\nWillie Clarke - percussion\nGlen &quot;Zeke&quot; Holmes - percussion\nBetty Wright - background vocals\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:5ca4f131b8b1d8be24ae2234c31e3a1e609088d0","amp;dn":"Jaco+Pastorius+-+2003+-+Punk+Jazz+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ca4f131b8b1d8be24ae2234c31e3a1e609088d0","infoHashBuffer":{"type":"Buffer","data":[92,164,241,49,184,177,216,190,36,174,34,52,195,30,58,30,96,144,136,208]},"announce":[],"urlList":[]}}