{"title":"POtHS - SIN-ister Secrets - 29 - Maafa 21 - Black Genocide and M","uid":7830663,"size":5822323279,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5dcec9898661093487bb89c5fe0b2888169562fc&amp;dn=POtHS+-+SIN-ister+Secrets+-+29+-+Maafa+21+-+Black+Genocide+and+M&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"POtHS11","files":-1,"time":1353045739,"description":"\nPOtHS\nPouring Out the Holy Spiritruth\n\n\nPOtHS - SIN-ister Secrets - 29 - Maafa 21 - Black Genocide and More - Repaired\n\n\nDescription:[/size]\n\nThey were stolen from their homes, locked in chains and taken across an ocean. And for more than 200 years, their blood and sweat would help to build the richest and most powerful nation the world has ever known.\n\nBut when slavery ended, their welcome was over. America's wealthy elite had decided it was time for them to disappear, and they were not particular about how it might be done.\n\nMaafa 21 is about eugenics, and elitism, and well-hidden racial agendas. It's about treachery and corruption a the highest levels of political and corporate America. It's about things the media has been hiding and politicians don't want you to know.\n\nWhat you are about to see is that the plan these people set in motion 150 years ago is still being carried out today. So don't think that this is history. It is not. It is happening right here, and it's happening right now.\n\nThe Entire Collection can be found here: \n\nThis is in memory of my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\nThese Torrents are currently on a Free Leech --  High Speed Server\n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n\n \nSeed long and Prosper with Blessings from our Father. I have prayed to The Father, Bless all that Seed Long. (I have 4 year old active seeds out there, must be working for some folks!)\n\nEphesians 5:11\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n\n :thankyou:    :thankyou:   Thank You JESUS  ","torrent":{"xt":"urn:btih:5dcec9898661093487bb89c5fe0b2888169562fc","amp;dn":"POtHS+-+SIN-ister+Secrets+-+29+-+Maafa+21+-+Black+Genocide+and+M","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5dcec9898661093487bb89c5fe0b2888169562fc","infoHashBuffer":{"type":"Buffer","data":[93,206,201,137,134,97,9,52,135,187,137,197,254,11,40,136,22,149,98,252]},"announce":[],"urlList":[]}}