{"title":"DesktopX 3.2 whit keygen","uid":3816324,"size":32999080,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5de424e337ec721117681383dfefb1d0af041618&amp;dn=DesktopX+3.2+whit+keygen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"ale4","files":24,"time":1190506451,"description":" DesktopX is a desktop utility designed to enable users to build their own desktops, widgets, and gadgets. \n\n \t\nMore Info:\n\n    * Objects - DesktopX supports desktop objects. Objects can be live data or just images. They run as part of the DesktopX environment. Widgets can also be imported as objects and run as part of a single environment (saving memory). Example of DesktopX objects in action: Video\n    * Widgets - DesktopX objects can be exported as mini-applications called widgets. Widgets are similar to objects except they are actual programs (.EXEs) that run in their own memory space.  Widgets do not require DesktopX to be running to be used but require DesktopX to be installed.\n    * Desktop themes - DesktopX can also build entire desktops that can be secured (kiosks, OEM systems, custom desktop experiences, etc.). Example of a DesktopX theme in action: Screenshot\n    * Gadgets - For users of DesktopX Pro DesktopX widgets can be exported as stand-alone programs (.EXEs) called gadgets that require no additional files or run-times to be installed. Gadgets can be sent to any user of Windows XP or 2000 to be used. No installation required.\n\n\nwhit keygen! ;)","torrent":{"xt":"urn:btih:5de424e337ec721117681383dfefb1d0af041618","amp;dn":"DesktopX+3.2+whit+keygen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5de424e337ec721117681383dfefb1d0af041618","infoHashBuffer":{"type":"Buffer","data":[93,228,36,227,55,236,114,17,23,104,19,131,223,239,177,208,175,4,22,24]},"announce":[],"urlList":[]}}