{"title":"Vikings S01E03_{JKS}_Xvid","uid":8366468,"size":540053097,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5e3d0906e4dcf46122588db890f8464370f7ae90&amp;dn=Vikings+S01E03_%7BJKS%7D_Xvid&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"jksADIDAS","files":2,"time":1365783845,"description":"Vikings Season 01 Episode 03\n\nIMDb: http://www.imdb.com/title/tt2306299/\nWiki: http://en.wikipedia.org/wiki/Vikings_(TV_series)\nOfficial Site: http://www.history.com/shows/vikings\n\nVikings is a Canadian-Irish historical drama television series, written and created by Michael Hirst for the television channel History in Canada.  It premiered on March 3, 2013.\nFilmed in Ireland, Vikings is inspired by the tales about the Viking Ragnar Lodbrok, one of the best-known Norse heroes and notorious as the scourge of France and Britain. It portrays Ragnar as a Viking farmer who pioneers the first daring raids into Britain with the support of fellow warriors, his brother, and his wife, the shieldmaiden Lagertha.\nOn April 5, 2013, History renewed Vikings for a ten-episode second season.\n\nTITLE: Dispossessed  DIRECTED BY:  Johan Renck   WRITTEN BY: Michael Hirst   ORIGINAL AIR DATE: March 17, 2013  U.S. VIEWERS (MILLION): 4.83  FILE FORMAT: xvid(.avi)\n\nRagnar's warband returns in triumph to Kattegat, where the Earl confiscates the plundered riches except for one piece per man. Ragnar picks the distraught Athelstan and returns home. The monk's faith and his vow of chastity perplex Ragnar, but Ragnar gathers useful intelligence about the kingdom of Northumbria. On that basis, Earl Haraldson authorizes another raid on England. Now accompanied by Lagertha and the Earl's trustee Knut, Ragnar re-embarks post-haste, leaving Athelstan to mind the farm and the children. As the Vikings set foot on English soil, they are met by the local sheriff and a handful of armsmen, who invite the newly landed &quot;traders&quot; to meet King Aelle. Ragnar agrees, but his other warriors' distrust incites a battle, in which the Northumbrians are slaughtered.\n","torrent":{"xt":"urn:btih:5e3d0906e4dcf46122588db890f8464370f7ae90","amp;dn":"Vikings+S01E03_%7BJKS%7D_Xvid","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e3d0906e4dcf46122588db890f8464370f7ae90","infoHashBuffer":{"type":"Buffer","data":[94,61,9,6,228,220,244,97,34,88,141,184,144,248,70,67,112,247,174,144]},"announce":[],"urlList":[]}}