{"title":"Black Sabbath - Master of Reality [24 bit FLAC] vinyl","uid":8223598,"size":1716341808,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5e85409dc60a90a1e311ffefadb855aea2c91537&amp;dn=Black+Sabbath+-+Master+of+Reality+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"24.96","files":-1,"time":1362532420,"description":"  Black Sabbath - Master of Reality (1971) [24 bit FLAC] vinyl\n\n  Released: 1971\n  Genre: Pop/Rock\n  Style: Heavy Metal\n  Codec: FLAC\n  Bit Rate: ~ 2,800 kbps\n  Bits Per Sample: 24\n  Sample Rate: 96,000 Hz\n\n  Universal/Sanctuary / 2701103\n\n  Record One: Original Album 1971\n  A1. Sweet Leaf\n  A2. After Forever\n  A3. Embryo\n  A4. Children Of The Grave\n\n  B1. Orchid\n  B2. Lord Of This World\n  B3. Solitude\n  B4. Into The Void\n\n  Record Two: Previously Unreleased Bonus Tracks 2009\n  C1. Weevil Woman '71\n  C2. Sweet Leaf (Studio Outtake Featuring Alternative Lyrics)\n  C3. After Forever (Studio Outtake - Instrumental)\n  C4. Children Of The Grave (Studio Outtake Featuring Alternative Lyrics)\n\n  D1. Children Of The Grave (Studio Outtake - Instrumental)\n  D2. Orchid (Studio Outtake - With Tony Count-In)\n  D3. Lord Of This World (Studio Outtake Featuring Piano &amp; Slide Guitar)\n  D4. Solitude (Studio Outtake - Intro With Alternative Guitar Tuning)\n  D5. Into The Void &quot;Spanish Sid&quot; (Studio Outtake - Alternative Version)\n\n  The shortest album of Black Sabbath's glory years, Master of Reality is also their most sonically influential work. Here Tony Iommi began to experiment with tuning his guitar down three half-steps to C#, producing a sound that was darker, deeper, and sludgier than anything they'd yet committed to record. (This trick was still being copied 25 years later by every metal band looking to push the limits of heaviness, from trendy nu-metallers to Swedish deathsters.) Much more than that, Master of Reality essentially created multiple metal subgenres all by itself, laying the sonic foundations for doom, stoner and sludge metal, all in the space of just over half an hour. Classic opener &quot;Sweet Leaf&quot; certainly ranks as a defining stoner metal song, making its drug references far more overt (and adoring) than the preceding album's &quot;Fairies Wear Boots.&quot; The album's other signature song, &quot;Children of the Grave,&quot; is driven by a galloping rhythm that would later pop up on a slew of Iron Maiden tunes, among many others. Aside from &quot;Sweet Leaf,&quot; much of Master of Reality finds the band displaying a stronger moral sense, in part an attempt to counteract the growing perception that they were Satanists. &quot;Children of the Grave&quot; posits a stark choice between love and nuclear annihilation, while &quot;After Forever&quot; philosophizes about death and the afterlife in an openly religious (but, of course, superficially morbid) fashion that offered a blueprint for the career of Christian doom band Trouble. And although the alternately sinister and jaunty &quot;Lord of This World&quot; is sung from Satan's point of view, he clearly doesn't think much of his own followers (and neither, by extension, does the band). It's all handled much like a horror movie with a clear moral message, for example The Exorcist. Past those four tracks, listeners get sharply contrasting tempos in the rumbling sci-fi tale &quot;Into the Void,&quot; which shortens the distances between the multiple sections of the band's previous epics. And there's the core of the album -- all that's left is a couple of brief instrumental interludes, plus the quiet, brooding loneliness of &quot;Solitude,&quot; a mostly textural piece that frames Osbourne's phased vocals with acoustic guitars and flutes. But, if a core of five songs seems slight for a classic album, it's also important to note that those five songs represent a nearly bottomless bag of tricks, many of which are still being imitated and explored decades later. If Paranoid has more widely known songs, the suffocating and oppressive Master of Reality was the Sabbath record that die-hard metalheads took most closely to heart.","torrent":{"xt":"urn:btih:5e85409dc60a90a1e311ffefadb855aea2c91537","amp;dn":"Black+Sabbath+-+Master+of+Reality+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e85409dc60a90a1e311ffefadb855aea2c91537","infoHashBuffer":{"type":"Buffer","data":[94,133,64,157,198,10,144,161,227,17,255,239,173,184,85,174,162,201,21,55]},"announce":[],"urlList":[]}}