{"title":"The Rise and Fall of The Murdoch Empire - John Lisners.epub","uid":9431938,"size":1772644,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5f5c0fc5fb2e97a94372731abdc1cf3100fb866b&amp;dn=The+Rise+and+Fall+of+The+Murdoch+Empire+-+John+Lisners.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1388824592,"description":"Rupert Murdoch - ruthless visionary, empire builder and business genius. He has created a global media network which has made him one of the most powerful and influential figures in the world. So potent was the force of his empire that he was even on first-name terms with presidents and prime ministers - superpowers were only a telephone call away. But just recently, rather than controlling the news, Murdoch has instead become the front-page story as the world had been gripped by the unfolding drama of the News International phone hacking scandal. Within days of achieving his final and most ambitious goal - outright ownership of the Â£1 billion-a-year profit-making BSkyB satellite television station - Murdoch was forced to concede as his prize look set to disintegrate before his eyes. Always a winner in the past, the devastating events that overtook News Coporation with tsunami speed shocked the 80-year-old founder - particularly as the most hurtful arrows were fired from the very institution which he had carefully cultivated for so many years. Freelance journalist John Lisners tells the fascinating story of Murdoch's amazing rise and fall. His graphic account of the culture, the methods and the men who worked for Rupert Murdoch is as incisive as it is entertaining. He uncovers: * How Murdoch beat Robert Maxwell to the News of the World * Rupert Murdoch's role in the sacking of a Prime Minister * The bungled but lethal attempt to kidnap his wife * How the big News International expose stories were done. This revealing and compelling book tells the complete story of the changing fortunes of the man who altered the face of the world's media forever.","torrent":{"xt":"urn:btih:5f5c0fc5fb2e97a94372731abdc1cf3100fb866b","amp;dn":"The+Rise+and+Fall+of+The+Murdoch+Empire+-+John+Lisners.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f5c0fc5fb2e97a94372731abdc1cf3100fb866b","infoHashBuffer":{"type":"Buffer","data":[95,92,15,197,251,46,151,169,67,114,115,26,189,193,207,49,0,251,134,107]},"announce":[],"urlList":[]}}