{"title":"Insidious Foes: The Axis Fifth Column and the American Home Fron","uid":11802734,"size":14855469,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5f8032f9e98d9038067dbe56874db744ce3248f8&amp;dn=Insidious+Foes%3A+The+Axis+Fifth+Column+and+the+American+Home+Fron&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1428460004,"description":"Nazi Germany's efforts to weaken the United States by subversion failed miserably. Bungling spies were captured and half-hearted efforts at sabotage came to nothing. Yet anyone who lived through WWII remembers the chilling posters warning Americans that &quot;Enemy Agents Have Big Ears&quot; and &quot;Loose Lips Sink Ships.&quot; Even Superman joined the struggle against these insidious foes. In 1940, polls showed that 71% of Americans believed a Nazi Fifth Column had penetrated the country. Almost half were convinced that spies, saboteurs, dupes, and rumor-mongers lurked in their own neighborhoods and work-places. These fears extended to the White House and Congress.\n\nIn this book, Francis MacDonnell explains the origins and consequences of America's Fifth Column panic, arguing that conviction and expedience encouraged President Roosevelt, the FBI, Congressmen, Churchill's government, and Hollywood to legitimate and exacerbate American's fears. Gravely weakening the isolationists, fostering Congress's role in rooting out Un-American activities, and instigating the creation of the modern intelligence establishment, the Fifth Column scare did far more than sell movie tickets, comic books, and pulp fiction. Insidious Foes traces the panic from its origins in the minds of reasonable Americans who saw the vulnerability of their open society in an age of encroaching totalitarianism","torrent":{"xt":"urn:btih:5f8032f9e98d9038067dbe56874db744ce3248f8","amp;dn":"Insidious+Foes%3A+The+Axis+Fifth+Column+and+the+American+Home+Fron","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f8032f9e98d9038067dbe56874db744ce3248f8","infoHashBuffer":{"type":"Buffer","data":[95,128,50,249,233,141,144,56,6,125,190,86,135,77,183,68,206,50,72,248]},"announce":[],"urlList":[]}}