{"title":"Tomb Raider 2 Portable","uid":7989348,"size":203381414,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:602d51816051d2ab7342dd4c278e1c4780e686f3&amp;dn=Tomb+Raider+2+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"The_Duck1","files":-1,"time":1357375695,"description":"No need to install,\nNo need to put serials and cracks to get the full version, (already done it for you).\nNo unnecessary registry changes,\nNo boring installation of tool-bars in your browser,\nThis makes a portable version a better version.\n\nThe story of Tomb Raider II surrounds the mythical Dagger of Xian, a weapon which was used by an Emperor of China to command his army. By plunging the weapon into its owner's heart, the weapon has the power to turn its bearer into a dragon. A flashback reveals that the last battle which was fought with the Dagger ended in defeat when the warrior monks of Tibet succeeded in removing the knife from the Emperor's heart. The Dagger was then returned to its resting place within the Great Wall.\n\n\nThe Dagger of Xian as seen in Tomb Raider III.\nThe game begins in the present day near the remains of the Great Wall, where Lara Croft investigates the legend of the Dagger. Upon reaching the door which leads to the dagger, she is attacked by a thug who claims to work for Marco Bartoli, a Venetian Mafia leader who has an obsession with the ancient lore of the Dagger. After traveling to Venice, Lara makes her way through Bartoli's hideout and an opera house where Bartoli's men are plotting a heist. Lara manages to follow Bartoli aboard his aeroplane, but she is knocked unconscious before she can confront him.\nThe plane is headed toward an oil platform. At the site, the cult of Xian have killed all the rig's staff, dumping the bodies into the sea and are carrying out excavations on a sunken ship called the Maria Doria, a luxury ocean liner which was owned by Marco's Father that sank two years ago. When Lara regains consciousness, she learns that the crew have taken her weapons and equipment. She retrieves her weapons and makes her way through the oil rig. She later learns from an imprisoned Tibetan monk, Brother Chan, that the shipwreck carries an ancient Tibetan artefact called the Seraph. Lara dives alongside a submersible and arrives at the shipwreck. There she successfully retrieves the Seraph. Having obtained this, she heads towards the monastery via aeroplane.\nAs Lara heads to the Tibetan monastery the plane suffers engine failure and crash lands. As the plane is skidding along the ground she manages to escape using a parachute and arrives at the Barkhang Monastery in Tibet. There she is helped by monks in confronting the thugs of Marco Bartoli. With the help of the monks, she finds and uses five prayer wheels to open a door that leads to a room to hold the Seraph. She continues her journey inside the catacombs to find the Talion, a key used to open the door which leads to the dagger. After confronting several yetis, she recovers the Talion. The FMV cutscene shows Lara exiting the caves. She takes off in a jeep while a guard is patrolling outside. Another jeep with two guards follows Lara, but she manages to escape.\nBack in China, Lara opens the door to the chamber holding the Dagger. Before she reaches the artefact, however, Lara is plunged into the catacombs beneath the Great Wall. After climbing a staircase with blades, she makes her way to a place with green floating islands and warriors which come alive when triggered. She finally moves to the room where she witnesses Bartoli drive the dagger into his heart, transforming himself into a dragon. In the final scene, Lara manages to temporarily render the creature unconscious and pulls the dagger from Bartoli's heart. Soon after this, the whole tomb begins to collapse, and a part of Great Wall is destroyed. In the epilogue, Lara returns home and is shown cleaning the dagger when she hears an alarm going off. She discovers the remainder of Marco Bartoli's men have tracked her down to England and are planning to invade her mansion. Luckily she overpowers them. The final shot is of Lara, disrobing before entering the shower. She turns to the camera and says: &quot;Don't you think you've seen enough?&quot; She then blasts her shotgun at the camera.","torrent":{"xt":"urn:btih:602d51816051d2ab7342dd4c278e1c4780e686f3","amp;dn":"Tomb+Raider+2+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"602d51816051d2ab7342dd4c278e1c4780e686f3","infoHashBuffer":{"type":"Buffer","data":[96,45,81,129,96,81,210,171,115,66,221,76,39,142,28,71,128,230,134,243]},"announce":[],"urlList":[]}}