{"title":"Etta James - Let's Roll","uid":7522664,"size":377361932,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:60a3a32e85778d7a9fcefee35f6fb354838a4930&amp;dn=Etta+James+-+Let%27s+Roll&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rambam1776","files":-1,"time":1344676343,"description":"These days, the blues market often functions as a sanctuary for R&amp;B artists who still provide soul and/or funk as we knew it in the '60s and '70s. Sounding a lot like Sam &amp; Dave or Wilson Pickett won't get you on urban contemporary radio -- actually, it will probably keep you off urban radio -- but it might result in a gig at the Chicago Blues Festival or a contract with Alligator Records. For Etta James, refusing to embrace urban contemporary-style R&amp;B has meant two things: (1) zero airplay on modern black stations, and (2) an enthusiastic following in the blues market. James has always been more of an R&amp;B singer than a blues singer, but because she's so rootsy by today's standards, this 2003 release will get much of its support from blues fans. James, who turned 65 on January 25, 2003, is in fine form throughout the CD. Over the years, James has worked with a variety of producers, but she produced Let's Roll herself -- and the result is one of her most rock-minded releases. A few of the tracks have a blues-rock outlook, including &quot;The Blues Is My Business&quot; and a gutsy performance of Billy Beck's early-'50s hit &quot;Stacked Deck.&quot; But much of the time, James favors a rock-influenced approach to Southern soul. In fact, many of the selections recall Ike &amp; Tina Turner's '60s and early-'70s output, especially &quot;Strongest Weakness,&quot; &quot;Lie No Better,&quot; and &quot;Somebody to Love&quot; (not to be confused with the psychedelic Jefferson Airplane classic). James' longtime fans will be happy to know that she is very much on top of her game throughout this excellent CD.\n\n01 - Somebody To Love\n02 - The Blues Is My Business\n03 - Leap Of Faith\n04 - Strongest Weakness\n05 - Wayward Saints Of Memphis\n06 - Lie No Better\n07 - Trust Yourself\n08 - A Change Is Gonna Do Me Good\n09 - Old Weakness\n10 - Stacked Deck\n11 - On The 7th Day\n12 - Please, No More","torrent":{"xt":"urn:btih:60a3a32e85778d7a9fcefee35f6fb354838a4930","amp;dn":"Etta+James+-+Let%27s+Roll","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60a3a32e85778d7a9fcefee35f6fb354838a4930","infoHashBuffer":{"type":"Buffer","data":[96,163,163,46,133,119,141,122,159,206,254,227,95,111,179,84,131,138,73,48]},"announce":[],"urlList":[]}}