{"title":"[PDF] [2005] Stigma and Group Inequality Social Psychological Pe","uid":6397570,"size":1924701,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:62241c44efe3d392a5345f39278ed0b627a6b338&amp;dn=%5BPDF%5D+%5B2005%5D+Stigma+and+Group+Inequality+Social+Psychological+Pe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"lyndavilla","files":2,"time":1305562939,"description":"DOWNLOAD MORE EBOOKS, MAGAZINES, &amp; PDFS:\n &lt;a href=&quot;\nhttp://buyabook.ws/download-ebooks-magazines-pdfs-more/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://buyabook.ws/download-ebooks-magazines-pdfs-more/&lt;/a&gt;\n\nBOOK INFO:\n\nThis book provides a snapshot of the latest theoretical and empirical work on social psychological approaches to stigma and group inequality. It focuses on the perspective of the stigmatized groups and discusses the effects of the stigma on the individual, the interacting partners, the groups to which they belong, and the relations between the groups.\n\nBroken into three major sections, Stigma and Group Inequality:\n*discusses the tradeoffs that stigmatized individuals must contend with as they weigh the benefits derived from a particular response to stigma against the costs associated with it;\n*explores the ways in which environments can threaten one's intellectual performance, sense of belonging, and self concept; and\n*argues that the experience of possessing a stigmatized identity is shaped by social interactions with others in the stigmatized group as well as members of other groups.\n\nStigma and Group Inequality is a valuable resource for students and scholars in the fields of psychology, sociology, social work, anthropology, communication, public policy, and political science, particularly for courses on stigma, prejudice, and intergroup relations. The book is also accessible to teachers, administrators, community leaders, and concerned citizens who are trying to understand and improve the plight of stigmatized individuals in school, at work, at home, in the community, and in society at large.\n","torrent":{"xt":"urn:btih:62241c44efe3d392a5345f39278ed0b627a6b338","amp;dn":"%5BPDF%5D+%5B2005%5D+Stigma+and+Group+Inequality+Social+Psychological+Pe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62241c44efe3d392a5345f39278ed0b627a6b338","infoHashBuffer":{"type":"Buffer","data":[98,36,28,68,239,227,211,146,165,52,95,57,39,142,208,182,39,166,179,56]},"announce":[],"urlList":[]}}