{"title":"ME3,Mass effect 3, Nude Mod","uid":7887227,"size":41025788,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6237731110325c534fcc9b971e8f416d61a33928&amp;dn=ME3%2CMass+effect+3%2C+Nude+Mod&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"RafVne2","files":-1,"time":1354642822,"description":"So...\nWhy...?!\nBecause I was bored. It's that simple.\nOriginally I thought I'll paint a stupid mustaches on every character (again, out of boredom), but since I like pussy and tits, that changed into... well that.\n\nThe  edits are simple... a &quot;see thru&quot; armor for Liara and Edi... (since joker wanted to &quot;hit that&quot;, Edi had to be anatomically correct under that armor.)\nWhy small edits only... ? Laziness, Besides, I fucking hate editing normal maps... they never come out right and even if I get the edit I was working on right, I fucked up some other original area in the process... and actually... these just look best imo...\n\nSo... I added just textures, very slightly adjusted spectextures.\nThese are: second Edi's (black) outfit and second Liara's outfit.\n\nThose are not big edits, I ended up discarding most of the shit. \nFor Liara I took an easy route and just streached her face to provide for an overlay texture, otherwise... some streaching, overlaying some source photos ((I've become quite efficient with Photshop). \n\nI'll include the original nude sources, if you're offended.. then fuck you, and you're probably gay... \n\nI'm throwing in also a coalesced.bin which will unlock... well... pretty much everything. You will be able to change shepards outfits to nude with that, and even her in game armor if you choose so.\n\nHopefully those files don't include &quot;work in progress&quot; stuff... you know, testing, first draft overlays, grid overlays to sync textures, etc... if it does then sorry... if you still have a problem.... then fuck you... and.... and.... and I'll tell your mother what the fuck you were searching for... :)\n\n\nWhat else...\n\nBIG thank you to the devs that created ME3 explorer... their software made it so fucking quick and easy to fuck around with textures.\nThank you to the guy that created the Nude mod for original A7EveNudeModME3 A7DancerGucciChanelME3beta mods. looks great... Rhanks guys. I dont think I modified it at all just replaced the textures..\n\n\nWhat else... I think that's it...\n\nSome nude shots... No... not mine you sick fuck... the game :) he he he\n &lt;a href=&quot;\nhttp://raf696.fotosik.pl/albumy/1328725.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://raf696.fotosik.pl/albumy/1328725.html&lt;/a&gt;\n\n\nOh... to make it work just replace the files in the: Mass Effect 3BIOGameCookedPCConsole folder... don't forget to make a copy of original files first.\n\n","torrent":{"xt":"urn:btih:6237731110325c534fcc9b971e8f416d61a33928","amp;dn":"ME3%2CMass+effect+3%2C+Nude+Mod","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6237731110325c534fcc9b971e8f416d61a33928","infoHashBuffer":{"type":"Buffer","data":[98,55,115,17,16,50,92,83,79,204,155,151,30,143,65,109,97,163,57,40]},"announce":[],"urlList":[]}}