{"title":"Literotica [Entire Collection]","uid":13537662,"size":2896507446,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:624957e43016baae6c02aaf42cd0174da9c51943&amp;dn=Literotica+%5BEntire+Collection%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"xxxsunset","files":1,"time":1455450495,"description":"Literotica is the largest collection of user generated erotica online! The quality of these stories varies greatly (but is generally proportional to the number of views). The categories are often self descriptive, but not all stories fit neatly into any one category. Incest and Taboo for instance could include stories about in-laws, siblings, and other familial acts. BDSM tends to have a lot of cross-over with Non-Consent / Reluctance, even though BDSM communities don't agree that's a fair description. Non-Consent / Reluctance goes from quietly having your way with someone on a train to full out forced penetration (All stories are fictional). The foreign language folders were left in there to be kind to the international community, if you don't like them, delete them.\r\n\r\nMy biggest apology is that there's no way to know if it's MMFF, MM, FM, FMFMF, or any other mix. You can get a good idea from the first paragraph or so of what's going on.\r\n\r\nThese are fun to carry around on a Nook or Kindle and a great way to switch up your dopamine source, and you can read them in front of your SO without being bothered! You're reading after all. Please enjoy this collection, and let me know if you find anything seriously wrong (i.e data from one story is in the wrong file name or the chapters are out of order, which is true for books that spelled chapter numbers... who the fuck does that?) Anyway, they should be mostly ordered and of an interesting quality","torrent":{"xt":"urn:btih:624957e43016baae6c02aaf42cd0174da9c51943","amp;dn":"Literotica+%5BEntire+Collection%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"624957e43016baae6c02aaf42cd0174da9c51943","infoHashBuffer":{"type":"Buffer","data":[98,73,87,228,48,22,186,174,108,2,170,244,44,208,23,77,169,197,25,67]},"announce":[],"urlList":[]}}