{"title":"The_Raspberries_72-74","uid":6570598,"size":1025690933,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:62622d94c534e4c2c2a10c71da48fa9151756aba&amp;dn=The_Raspberries_72-74&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"billydoll","files":59,"time":1311959417,"description":"The Raspberries 1972-1972, some of the best &quot;Power Pop&quot; even \nmade, in fact &quot;All This And More&quot; by The Dead Boys was actually\na Raspberries Song just re-arranged.  Oh with my Bongos_1st_CD\n(Drums Along The Hudson) I encoded it with &quot;Replay Gain&quot; checked,\nwhich doesn't change the file, it does make the volume lower, \nin the player but I hear it can be removed. This time I didn't\ncheck that option, so this thing is full blast, enjoy!\nOh if you ever get the chance, check out the song &quot;It's Cold\nOutside&quot; by The Choir, that band one of The Raspberries in it.\nNow if I could just post Elton Montello, or if anyone has it,\nplease post it, I really love that, you know the one with &quot;Jet\nBoy, Jet Girl&quot;.  Oh yeah this is in Flac, try to seed it a bit\ncause a good Raspberries torrent is hard to find. I did edit\nthis into individual tracks, with a cheap free editor, and did\nmy best, maybe it's not perfect, or not. Any complaints go ahead\nI don't mind, I 'll see what I can do. \n     Oh, I read somewhere, Eric Carmen said he &quot;Spent his \nteenage years with his head in between 2 speakers trying to\nfigure stuff out, even listening to stuff like &quot;Pet Sounds&quot;\nby The Beach Boys, and paying attention to the Modulations,\n(not the usual C Major, then modulation to A Minor Stuff, but\nhe liked the way that Brian Wilson could modulate to a distant\nkey, and make it back again, with it all sounding natural.\nYou certainly hear that sort of stuff in &quot;Go All The Way&quot;,\nsomething Eric Carmen said he wrote so the kids would get it,\nbut the &quot;Powers That Be&quot; wouldn't.  Still it was banned in\nthe U.K. I hear, but heck so were the Sex Pistols, didn't \nseem to hurt them.  Oh well, here is my &quot;Goody Of The day&quot;\nenjoy no matter which side of The Atlantic you are on.\n\n","torrent":{"xt":"urn:btih:62622d94c534e4c2c2a10c71da48fa9151756aba","amp;dn":"The_Raspberries_72-74","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62622d94c534e4c2c2a10c71da48fa9151756aba","infoHashBuffer":{"type":"Buffer","data":[98,98,45,148,197,52,228,194,194,161,12,113,218,72,250,145,81,117,106,186]},"announce":[],"urlList":[]}}