{"title":"Ryan Bingham - 2007 - Mescalito  [EAC - FLAC]","uid":5046663,"size":430219576,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6272768fafb2a09faec345d9ceb67240d7bb6370&amp;dn=Ryan+Bingham+-+2007+-+Mescalito++%5BEAC+-+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bludStain","files":-1,"time":1249671150,"description":"Ryan Bingham - 2007 - Mescalito  [EAC - FLAC]\n\nRipped with EAC, converted to FLAC with dbPoweramp.\n\nBiography  by Andrew Leahey\nAmericana singer/songwriter Ryan Bingham was raised in rural Texas, where years of hardscrabble ranch work and competitions on the rodeo circuit would eventually surface in the dusty riffs of his country-styled debut, Mescalito. Living alone since his mid-teens, Bingham shuttled back and forth between Southwestern border towns and relatives' homes, often sleeping in his truck after nightly rodeo gigs. It was during those treks that he began entertaining friends with the guitar, an instrument he'd learned at the age of 17 from a mariachi neighbor. Drawing inspiration from Bob Dylan, Marshall Tucker, and Bob Wills -- all of whom populated the jukebox of The Halfway Bar, a roadhouse owned by Bingham's uncle (whose musical tastes influenced those of his nephew) -- Bingham fashioned a road-weary sound that soon piqued the interest of a barroom proprietor in Stephenville, TX.\n\nBingham was offered a weekly residency at the bar; soon after, he began issuing such self-released albums as Lost Bound Rails and Wishbone Saloon. The popular material was brought to the attention of Nashville heavyweights Lost Highway Records, who signed Bingham and issued his major-label debut, Mescalito (featuring production by Marc Ford, former guitarist for the Black Crowes), in October 2007. Mescalito was well received by critics, with Rolling Stone aptly comparing Bingham's raw, scratchy voice to that of &quot;Steve Earle's dad.&quot; After supporting the album with ample tour dates, the songwriter reprised his relationship with Marc Ford, who produced 2009's Roadhouse Sun. \n\nReview by Andrew Leahey\nLoneliness runs rampant in Texas, where arid flatlands and empty highways converge to influence some of country's best songwriting. Newcomer Ryan Bingham is cut from the same dusty denim cloth as Texan troubadours Billy Joe Shaver and Willie Nelson, having crisscrossed the Lonestar State for years in search of employment, housing, or something else to inspire his road-weary songwriting. He makes his major-label debut with Mescalito, a bilingual collection of melancholic Americana that often delves into roadhouse country-rock. To those familiar with the genre, Bingham's lyrics are somewhat predictable accounts of hard times, rivers' edges, and fieldwork, all sung in a wizened rasp whose sandpapered texture is impressive coming from a 25-year-old songwriter. Years of sleeping outside rodeo arenas in a truck bed have done a number on Bingham's throat, lending him a sense of rustic authenticity that would otherwise be absent. He may be young, but that cracked voice is testament to Bingham's experiences since leaving his parents' home during childhood. It's the voice of roadside bars and last calls, of bull-riding gigs and border town trailer parks. &quot;I've been working in the goddamn sun for just one dollar a day,&quot; he croaks, and clichÃƒÂ©s be damned, you cannot help but believe him. When he's singing about marijuana plants or casually slipping into Spanish during a lonesome Mexican ballad, Bingham truly distinguishes himself from his country contemporaries, playing the rugged outlaw to Nashville's smooth Rascal Flatts. Where he falters is the album's homogeneity, as too many tracks adopt a midtempo pace whose haunting effect wears thin. One can't help but wish for more country-rock grit, but Mescalito nevertheless bodes well for this upstart's future work.\n\n\nTracks\n01  -  Southside of Heaven   -  Bingham   -  6:19\n02  -  The Other Side   -  Bingham   -  2:11\n03  -  Bread and Water   -  Bingham   -  4:08\n04  -  Don't Wait for Me   -  Bingham   -  4:56\n05  -  Boracho Station   -  Bingham   -  2:03\n06  -  Sunshine   -  Bingham   -  4:20\n07  -  Ghost of Travelin' Jones   -  Bingham   -  4:09\n08  -  Hard Times   -  Bingham   -  4:38\n09  -  Dollar a Day   -  Bingham   -  2:11\n10  -  Take It Easy Mama   -  Bingham   -  3:03\n11  -  Long Way from Georgia  -  Bingham   -  3:54\n12  -  Ever Wonder Why   -  Bingham   -  4:59\n13  -  Sunrise   -  Bingham   -  4:45\n14  -  For What It's Worth   -  Bingham   -  13:58 ","torrent":{"xt":"urn:btih:6272768fafb2a09faec345d9ceb67240d7bb6370","amp;dn":"Ryan+Bingham+-+2007+-+Mescalito++%5BEAC+-+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6272768fafb2a09faec345d9ceb67240d7bb6370","infoHashBuffer":{"type":"Buffer","data":[98,114,118,143,175,178,160,159,174,195,69,217,206,182,114,64,215,187,99,112]},"announce":[],"urlList":[]}}