{"title":"Chemical Functionalization of Carbon Nanomaterials","uid":15332229,"size":116271325,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6382bcc1b271e9fb5a436e6c12d6f41beffdaa4a&amp;dn=Chemical+Functionalization+of+Carbon+Nanomaterials&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1468748121,"description":"Chemical Functionalization of Carbon Nanomaterials - Chemistry and Applications - V.K Thakur, M.K. Thakur (CRC, 2016).pdf\r\n\r\nISBN 978-1-4822-5396-2\r\n\r\nCarbon-based nanomaterials are rapidly emerging as one of the most fascinating materials in the twenty-first century. Chemical Functionalization of Carbon Nanomaterials: Chemistry and Applications provides a thorough examination of carbon nanomaterials, including their variants and how they can be chemically functionalized. It also gives a comprehensive overview of current advanced applications of functionalized carbon nanomaterials, including the automotive, packaging, coating, and biomedical industries.\r\n\r\nThe book covers modern techniques to characterize chemically functionalized carbon nanomaterials as well as characterization of surface functional groups. It includes contributions from international leaders in the field who highlight the multidisciplinary and interdisciplinary flexibility of functionalized carbon nanomaterials. The book illustrates how natural drawbacks to carbon nanomaterials, such as low solubility, can be countered by surface modifications and shows how to make modifications.\r\n\r\nIt discusses developments in the use of carbon nanomaterials in several critical areas in scientific research and practice, including analytical chemistry, drug delivery, and water treatment. It explores market opportunities due to the versatility and increasing applicability of carbon nanomaterials. It also gives suggestions on the direction of the field from its current point, paving the way for future developments and finding new applications.\r\n\r\nChemical Functionalization of Carbon Nanomaterials: Chemistry and Applications is a significant collection of findings in a rapidly developing field. It gives an in-depth look at the current achievements of research and practice while pointing you ahead to new possibilities in functionalizing and using carbon nanomaterials.\r\n\r\n----------------------------------------\r\nnote: if u can't read chapter 40 with adobe reader, try different ebook reader (foxit, stdu viewer, etc)","torrent":{"xt":"urn:btih:6382bcc1b271e9fb5a436e6c12d6f41beffdaa4a","amp;dn":"Chemical+Functionalization+of+Carbon+Nanomaterials","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6382bcc1b271e9fb5a436e6c12d6f41beffdaa4a","infoHashBuffer":{"type":"Buffer","data":[99,130,188,193,178,113,233,251,90,67,110,108,18,214,244,27,239,253,170,74]},"announce":[],"urlList":[]}}