{"title":"Heroes-4x05-Hysterical Blindness.(eng.subITA) by BabyBoy.avi","uid":5123435,"size":314574848,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:63a432a1fa95c73b8b74ea57201a414f93028c98&amp;dn=Heroes-4x05-Hysterical+Blindness.%28eng.subITA%29+by+BabyBoy.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"cirip2006","files":1,"time":1255476770,"description":"HEROES - Hysterical Blindness - ep.5 stagione 4\naudio : INGLESE\nsubs : ITALIANO\nvideo codec : XviD (AVI file)-300MB\n\n\nVi avevo domandato se vi interessa questa serie televisiva, &quot;SLEEPER CELL&quot; del 2005 ( 2007 stagione 1 e 2008 stagione 2 in ITALIA), ovviamente eng-subITA, 18 episodi 10+8. Dovevate lasciare commenti qui per sapere se la devo postare o no. La serie tratta la storia di una cellula terrorista dormiente (o meno) sul territorio statunitense. Per dettagli :\nhttp://it.wikipedia.org/wiki/Sleeper_Cell\nhttp://www.imdb.it/title/tt0465353/\n\nPer me, il fatto di non aver ricevuto alcuna risposta da parte vostra fin'ora e giÃƒÂ  una risposta : non vi puÃƒÂ² fregare di meno di questa serie e della mia buona volontÃƒÂ . Io la prendo come una mancanza di rispetto nei miei confronti. Va bene, se non la volete, non ci sarÃƒÂ . Come non ci sarÃƒÂ  qui neanche il prossimo episodio di HEROES coi sub italiani la settimana prossima. Io l'avrÃƒÂ², ma voi no. E tutte le altre serie che fino adesso ve li portavo, no ci saranno piÃƒÂ¹. Questa settimana posterÃƒÂ² gli episodi che ci saranno, ma dalla settimana prossima non piÃƒÂ¹. Almeno che non cambiate l'atitudine. Non vi ho chiesto soldi, ma solo qualche commento, un grazie o un voto li qualcosa. Ma voi no. Comportamento da maleducati : a parte il &quot;prendo e scappo&quot;, quindi niente share(SEED), non avete neanche il boun senso di rispondere ad una semplice domanda.\nMa per chi cavolo mi metto io il sedere a rischio ? Sapete, no, che ÃƒÂ¨ illegale quello che faccio, no ? Magari dopo capirete che avete perso (NCIS, STARGATE UNIVERSE, HEROES, SMALLVILLE, FLASHFORWARD ecc.). Come nel amore, capisci quello che perdi solo dopo aver perso...\nAd un certo punto, ero arrivato con uno dei miei torrent ad un ratio..., direi record assoluto : 65.400. Ma i seeders erano sempre 2, dopo una settimana di share, erano sempre 2. Non c'ÃƒÂ¨ la faccio piÃƒÂ¹ in questo modo. Che diventi uno di voi l'uploader di tutte queste serie...\n\nRIMANETE IN SEED ! anzi, fate che cavolo vi pare, tanto io in mattinata stacco, se riuscite a condividerlo avanti, bene, se no, uguale.","torrent":{"xt":"urn:btih:63a432a1fa95c73b8b74ea57201a414f93028c98","amp;dn":"Heroes-4x05-Hysterical+Blindness.%28eng.subITA%29+by+BabyBoy.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63a432a1fa95c73b8b74ea57201a414f93028c98","infoHashBuffer":{"type":"Buffer","data":[99,164,50,161,250,149,199,59,139,116,234,87,32,26,65,79,147,2,140,152]},"announce":[],"urlList":[]}}