{"title":"Tweak-7 1.0 Build 1115 x86","uid":6558078,"size":37282807,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:63ec15cb37bd78814618cc8ffc0e21b0208e0cf1&amp;dn=Tweak-7+1.0+Build+1115+x86&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Anacondaz","files":-1,"time":1311354627,"description":"Tweak-7 1.0 Build 1115 x86\n\nComparing Tweak-7 with other optimization and tweak tools is simply impossible since no competitive product covers such a huge functionality: from simple system tweaking to complex and fast registry cleaning and registry defragmentation and comprehensive system cleanup.\n\nTweak-7 featurelist\n\n- Hundreds of tweaks\nTweak-7 includes hundreds of tweaks to optimize and customize Windows 7 to your very personal needs.\n- Cleanup your system\nScan your system for unneeded files, old system update backups, and a lot more to set free hundreds of GB on your hard disk.\n- Cleanup your registry\nThe included registry cleaner automatically scans your system registry for dead data and errors.\n- Defragment your registry\nCleanup and defrag your system registry for fastest and optimized system performance\n- Easy and secure tweaking\nJust a few mouse clicks are required in order to activate performance tweaks. No geek knowledge required!\n- Transfer your tweaks\nCreate tweak snapshots and use them to transfer tweaks and customizations to other machines running Windows 7 and Tweak-7.\n- Auto-optimize Windows 7\nTweak-7 includes an auto optimizer which optimizes Windows 7 with the most common speed improvement tweaks.\n- Detailed system information\nTweak-7 includes a system information feature displaying 3D system and performance information\n- Access lost Microsoft Product keys\nLost any of your Microsoft Windows, or Microsoft Office CD keys? Tweak-7 will get them back.\n- View Hard Disk statistics\nTweak-7 provides detailed hard disk statistics on all your installed drives.\n- Disallow access to certain drives\nWith the included features you can restrict access to drives and folders.\n- CPU tweaks included\nTweak-7 automatically tweaks Windows 7 to work perfectly with your specific CPU.\n- CD/DVD drive tweaks\nOptimizes the cache of your CD/DVD drives.\n- Memory Optimizer included\nOptimize your physical memory (RAM) for better performance if you run low on RAM.\n- RAM Disk Drive\nCreate a RAM Disk Drive of up to 256 MB for fastest access to files (available on 32bit systems only).\n- Virtual drives\nEasily turn any folder on your hard drive into a disk drive!\n- Control Windows Error Reporting and much more\nAlong with heaps of miscellaneous system tweaks you and control the Windows Error Reporting, time sync settings, OEM information ...\n- Change system folder settings\nEasily change the location of system and user folders.\n- Control panel tweaks\nRestrict access to control panel items, hide control panel features, and much more.\n- Control auto starts\nControl what is started automatically with your system - disable and remove autostarts.\n- Auto logon and auto shutdown\nEnable auto login and auto shutdown features for Windows 7.\n- Application tweaks\nHeaps of tweaks and customizations for Windows Applications.\n- Application restrictions\nGet more control over the features of Windows 7 with the includes application restrictions.\n- Start menu tweaks\nHeaps of tweaks to customize the look and feel of your Windows 7 start menu: hide items, show items.\n- Task bar tweaks\nGet control over your Windows 7 task bar and tweak it the way you want it.\n- Desktop tweaks\nChange the desktop style, enable heaps of desktop related tweaks, manage DWM settings.\n- Customize the desktop context menu\nInclude your favorite applications to the desktop context menu for fastest access\n- Shortcut overlay icons\nRemove the annoying desktop shortcut overlay icons or set up your own.\n- Outlook and Windows mail tweaks\nControl Outlook attachment settings and tweak Microsoft Outlook\n- Internet Explorer tweaks and restrictions\nTweak IE to the max and restrict access to it.\n- Windows Utilities\nGet quick access to the most useful Windows 7 utilities\n\nHome Page - http://www.totalidea.com/\n\n\n\n\n-----------------------------------------------------------------------------------\n-----------------------------------------------------------------------------------\n\n\n\n*** When using TPB please read these important notes: \n-----------------------------------------------------\n\n01. AV software may warn about keygens, patches, cracks etc because of their \n    capabilities and signatures (generating codes, etc). Sometimes also they're \n    added to the virus/spyware database and will be detected as malware. If not \n    trusting keygens, patches, cracks etc don't use them.\n\n02. To avoid AV software removing/blocking clean cracks etc: exclude the crack \n    or folder from being auto-protected &amp; auto-scanned by the AV software.\n\n03. If AV software removed a clean crack usually it can be restored \n    (if it's not in Quarantine then look at History or something similar).\n\n04. To avoid risks when using cracks also Sandboxie can be used to test them:\n   &lt;a href=&quot; http://www.sandboxie.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.sandboxie.com/&lt;/a&gt;\n   &lt;a href=&quot; http://thepiratebay.se/torrent/6487418&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/torrent/6487418&lt;/a&gt;\n\n05. Before running .exe-files, keygens, patches, cracks etc always check first \n    if they can be unpacked. Often some thirth party added a virus to the \n    original file, repacked it, and uploaded it again.\n\n06. Letting AV software software sending scan results to their companies \n    can cause keygens, patches, cracks etc being added to their virus-database.\n\n07. Firewalls which are set to automatically decide for connections will allow \n    connections for lots of apps &amp; MALWARE!. To avoid so firewalls should be set \n    to decide yourself which connection to allow or not.\n\n08. Clicking on unknown links can coz malware being silently installed on a pc!\n\n09. Usually (new) torrents with extreme many downloads &amp; seeders in a short time \n    are very suspicious! Torrents with a SKULL-logo are trusted.\n\n10. Some (frustrated) people use multiple accounts and post lots of FAKE comments \n    and/or files trying to spread confusion. Usually they NEVER seriously reply \n    on comments and don't have any torrent, or to look reliable just a few.\n\n11. In general often there are more fake &amp; negative comments than reliable &amp; \n    positive comments.\n\n12. In some countries uploading/downloading copyright-protected material is \n    forbidden, but showing some appreciation to reliable uploaders is not.\n\n13. Posting FAKE comments &amp; uploads on TPB can result in getting banned from TPB!\n\n14. Comments are welcome, unlike ranting, trolling, whining, etc.\n\n15. No Promises ... No Debts!\n\n\nFor reporting bad or suspicious torrents:    &lt;a href=&quot;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&lt;/a&gt;\n\nFor requests:   &lt;a href=&quot;\nhttp://forum.suprbay.org/forumdisplay.php?fid=31&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/forumdisplay.php?fid=31&lt;/a&gt;\n\nFor visiting my 1000+ torrents:    &lt;a href=&quot;\nhttp://thepiratebay.se/user/Anacondaz/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/Anacondaz/&lt;/a&gt;\n\n\n\n-----------------------------------------------------------------------------------\n\n\nTo the &quot;United Reliable The Pirate Bay Users&quot;,\n\nNowadays a lot of TPB members abuse their TPB membership by intentionally \nposting fake comments &amp; files. Their meaning is just trying to spread \nconfusion and to frustrate TPB and it's users. \nLess downloaders = less seeders = less download speed etc = not good! \n\nIt's in the benefit of TPB and all reliable users to warn each other about people \nwho intentionally keep posting fake comments &amp; files. It's an easy answer against \nthose who intentionally keep posting fake comments &amp; files, which is a never \nending issue. \n\nWhen reporting errors or false positives just keep in mind that what goes up for \none does not always goes up for another. That's for both the working of an app \nand about false positives! Remember: whatever is said, say it constructive! \nLet's just try to help each other and TPB by thinking about what's said &amp; posted. \nThings are all up to you, the &quot;United Reliable The Pirate Bay Users&quot;!\n\n\nEnjoy The Pirate Bay","torrent":{"xt":"urn:btih:63ec15cb37bd78814618cc8ffc0e21b0208e0cf1","amp;dn":"Tweak-7+1.0+Build+1115+x86","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63ec15cb37bd78814618cc8ffc0e21b0208e0cf1","infoHashBuffer":{"type":"Buffer","data":[99,236,21,203,55,189,120,129,70,24,204,143,252,14,33,176,32,142,12,241]},"announce":[],"urlList":[]}}