{"title":"Environmental Analysis and Technology for the Refining Industry","uid":7386991,"size":2704105,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:644fcde8308f191a396ecfb8c7dfdc1b45698eac&amp;dn=Environmental+Analysis+and+Technology+for+the+Refining+Industry&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1340661458,"description":"A timely, hands-on guide to environmental issues and regulatory standards for the petroleum industry\n\nEnvironmental analysis and testing methods are an integral part of any current and future refining activities. Today's petroleum refining industry must be prepared to meet a growing number of challenges, both environmental and regulatory.\n\nEnvironmental Analysis and Technology for the Refining Industry focuses on the analytical issues inherent in any environmental monitoring or cleanup program as they apply to today's petroleum industry, not only during the refining process, but also during recovery operations, transport, storage, and utilization. Designed to help today's industry professionals identify test methods for monitoring and cleanup of petroleum-based pollutants, the book provides examples of the application of environmental regulations to petroleum refining and petroleum products, as well as current and proposed methods for the mitigation of environmental effects and waste management.\n\nPart I introduces petroleum technology, refining, and products, and reviews the nomenclature used by refiners, environmental scientists, and engineers. Part II discusses environmental technology and analysis, and provides information on environmental regulation and the impact of refining.\n\nCoverage includes:\n* In-depth descriptions of analyses related to gaseous emissions, liquid effluents, and solid waste\n* A checklist of relevant environmental regulations\n* Numerous real-world examples of the application of environmental regulations to petroleum refining and petroleum products\n* An analysis of current and proposed methods of environmental protection and waste management\n\n\n\nHardcover: 349 pages\nPublisher: Wiley-Interscience; 1 edition (August 31, 2005)\nLanguage: English\nISBN-10: 0471679429\nISBN-13: 978-0471679424","torrent":{"xt":"urn:btih:644fcde8308f191a396ecfb8c7dfdc1b45698eac","amp;dn":"Environmental+Analysis+and+Technology+for+the+Refining+Industry","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"644fcde8308f191a396ecfb8c7dfdc1b45698eac","infoHashBuffer":{"type":"Buffer","data":[100,79,205,232,48,143,25,26,57,110,207,184,199,223,220,27,69,105,142,172]},"announce":[],"urlList":[]}}