{"title":"Spencer Davis Group - Classic Spencer Davis Group  FLAC","uid":5610866,"size":322700599,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:64cea4fa3663abc59237c97ae50d76a96acee443&amp;dn=Spencer+Davis+Group+-+Classic+Spencer+Davis+Group++FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"keeybee","files":24,"time":1275859882,"description":"Please seed!\n\nThe Spencer Davis Group was a mid-1960s British beat group from Birmingham, England formed by Spencer Davis with Steve Winwood and his brother Muff Winwood. Their three best known songs are &quot;Keep On Running&quot;, a number one in the UK Singles Chart written by reggae musicianJackie Edwards; and &quot;Gimme Some Loving&quot; and &quot;I'm a Man&quot;. &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Spencer_Davis_Group&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Spencer_Davis_Group&lt;/a&gt; &lt;a href=&quot;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:difexqe5ld6e&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:difexqe5ld6e&lt;/a&gt;\n\n\nThe Spencer Davis Group - Classic Spencer Davis Group\nThis compilation 1999\n\n01  The Spencer Davis Group - Classic Spencer Davis Group - Gimme Some Lovin' [U.S. Single Remix]\n02  The Spencer Davis Group - Classic Spencer Davis Group - Time Seller\n03  The Spencer Davis Group - Classic Spencer Davis Group - When A Man Loves A Woman\n04  The Spencer Davis Group - Classic Spencer Davis Group - Keep On Running\n05  The Spencer Davis Group - Classic Spencer Davis Group - She Put The Hurt On Me\n06  The Spencer Davis Group - Classic Spencer Davis Group - Midnight Train\n07  The Spencer Davis Group - Classic Spencer Davis Group - I'm Getting Better\n08  The Spencer Davis Group - Classic Spencer Davis Group - Stevie's Blues\n09  The Spencer Davis Group - Classic Spencer Davis Group - Searchin'\n10  The Spencer Davis Group - Classic Spencer Davis Group - I Can't Stand It\n11  The Spencer Davis Group - Classic Spencer Davis Group - I Washed My Hands In Muddy Waters\n12  The Spencer Davis Group - Classic Spencer Davis Group - Blues In F\n13  The Spencer Davis Group - Classic Spencer Davis Group - My Babe\n14  The Spencer Davis Group - Classic Spencer Davis Group - I'll Drown In My Own Tears\n15  The Spencer Davis Group - Classic Spencer Davis Group - High Time Baby\n16  The Spencer Davis Group - Classic Spencer Davis Group - Goodbye Stevie\n17  The Spencer Davis Group - Classic Spencer Davis Group - Don't Want You No More\n18  The Spencer Davis Group - Classic Spencer Davis Group - Magpie - TV Theme","torrent":{"xt":"urn:btih:64cea4fa3663abc59237c97ae50d76a96acee443","amp;dn":"Spencer+Davis+Group+-+Classic+Spencer+Davis+Group++FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64cea4fa3663abc59237c97ae50d76a96acee443","infoHashBuffer":{"type":"Buffer","data":[100,206,164,250,54,99,171,197,146,55,201,122,229,13,118,169,106,206,228,67]},"announce":[],"urlList":[]}}