{"title":"Data-intensive Computing [PDF]~StormRG~","uid":9801072,"size":6833103,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:64deeb8a751f39e42db1b4dde3dab324edb96e57&amp;dn=Data-intensive+Computing+%5BPDF%5D%7EStormRG%7E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"steelballz","files":-1,"time":1395377928,"description":"Description\nData-intensive Computing\nAuthor:Ian Gorton, Deborah K. Gracio\nPublished: Oct. 29 2012\nPublisher:Cambridge University Press\nISBN-10:0521191955\nISBN-13:978-0521191951\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nTested on the above readers with no problems on laptop and Android tablet.\nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. Please allow a couple\nseconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\nimage\nCover from actual book file\n\n\nProduct Description\n\nPublication Date: Oct. 29 2012 | ISBN-10: 0521191955 | ISBN-13: 978-0521191951\nThe world is awash with digital data from social networks, blogs, business, science, and engineering. Data-intensive computing facilitates understanding of complex problems that must process massive amounts of data. Through the development of new classes of software, algorithms, and hardware, data-intensive applications can provide timely and meaningful analytical results in response to exponentially growing data complexity and associated analysis requirements. This emerging area brings many challenges that are different from traditional high-performance computing. This reference for computing professionals and researchers describes the dimensions of the field, the key challenges, the state of the art, and the characteristics of likely approaches that future data-intensive problems will require. Chapters cover general principles and methods for designing such systems and for managing and analyzing the big data sets of today that live in the cloud, and describe example applications in bioinformatics and cybersecurity that illustrate these principles in practice.\n\n\n\n\n\nimage\nScientia est potentia\n","torrent":{"xt":"urn:btih:64deeb8a751f39e42db1b4dde3dab324edb96e57","amp;dn":"Data-intensive+Computing+%5BPDF%5D%7EStormRG%7E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64deeb8a751f39e42db1b4dde3dab324edb96e57","infoHashBuffer":{"type":"Buffer","data":[100,222,235,138,117,31,57,228,45,177,180,221,227,218,179,36,237,185,110,87]},"announce":[],"urlList":[]}}