{"title":"The Amazing Story of Quantum Mechanics by J Kakalios.mobi","uid":9169533,"size":1787677,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:65e6d1e7a534ceb88b638664375a8a4d44ec75d6&amp;dn=The+Amazing+Story+of+Quantum+Mechanics+by+J+Kakalios.mobi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"420weedman","files":1,"time":1384046001,"description":"A highly entertaining exploration of the complicated science of quantum mechanics made easy to understand by way of pop culture.\n\nAs a young science fiction fan, physicist James Kakalios marveled at the future predicted in the pulp magazines, comics, and films of the '50s and '60s. By 2010, he was sure we'd have flying cars and jetpacks. But what we ended up with-laptop computers, MRI machines, Blu-ray players, and dozens of other real-life marvels-are even more fantastic. In The Amazing Story of Quantum Mechanics, he explains why the development of quantum mechanics enabled our amazing present day.\n\nIn his trademark style, Kakalios uses pop culture examples- everything from the graphic novel Watchmen to schlock horror movies of the '50s-to elucidate some of the most complex science there is. And he brings to life the groundbreaking scientists whose discoveries made our present life possible. Along the way, he dispels the misconception that quantum mechanics is unknowable by mere mortals. It's not magic; it's science!","torrent":{"xt":"urn:btih:65e6d1e7a534ceb88b638664375a8a4d44ec75d6","amp;dn":"The+Amazing+Story+of+Quantum+Mechanics+by+J+Kakalios.mobi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65e6d1e7a534ceb88b638664375a8a4d44ec75d6","infoHashBuffer":{"type":"Buffer","data":[101,230,209,231,165,52,206,184,139,99,134,100,55,90,138,77,68,236,117,214]},"announce":[],"urlList":[]}}