{"title":"CRC Press Labor Law A Basic Guide to the National Labor Relation","uid":8731506,"size":3978515,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:660d2880b0b94da7e44870c80ba7ee846e961f97&amp;dn=CRC+Press+Labor+Law+A+Basic+Guide+to+the+National+Labor+Relation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"BlackTar","files":2,"time":1374614027,"description":"TITLE........: LABOR LAW: A BASIC GUIDE TO THE NATIONAL LABER RELATIONS ACT\n\nPUBLISHER....: CRC PRESS                 -  LANGUAGE......: ENGLISH\nLINK.........:      -  RELEASE TYPE..: RETAIL        \nFORMAT.......: PDF                       -  RELEASE DATE..: 2013/07/17    \nISBN.........: 9781439855959             -  STORE DATE....: 2011      \nAUTHOR.......: DAVID E. STRECKER         -  DISKS.........: 01\n\nSAVED MONEY..: 53 POUND\n\n&lt;--( BOOK )-------------------------------------------------------------------&gt;\nWhether you are a supervisor, a business owner, or an HR professional, it is \nessential that you understand the laws and rules governing how one treats \nemployees and interacts with unions. In a comprehensive and accessible format,\nLabor Law: A Basic Guide to the National Labor Relations Act provides a \npractice-oriented foundation on labor law. The book sheds light on one of \nAmerica's most important laws and one which is also, perhaps, the most \nmisunderstood. \n\nThis book presents an overview of labor and employment laws such that managers \nmay understand their rights as employers as well and their employees' rights. I\nt covers an introduction to the topic of labor and employment law as well as \na brief history within the United States. Other chapters deal with unions and \nunion relations, collective bargaining agreements, grievances, labor \narbitration, unfair labor practice proceedings, and strikes and lockouts. The \nauthor does not focus on complex regulations and convoluted case law, but \ndistills them to reveal the essence of the NLRA and how it works. \n\nAs important as it is, at times labor law can seem counter-intuitive. Written \nby a highly experienced labor lawyer, this book contains concise explanations\nin an easy-to-use format. Clearly delineating a process that can be fraught \nwith traps for the unwary, it supplies a quick reference that can be used in \na crisis situation to understand the parameters of what you can and cannot do.","torrent":{"xt":"urn:btih:660d2880b0b94da7e44870c80ba7ee846e961f97","amp;dn":"CRC+Press+Labor+Law+A+Basic+Guide+to+the+National+Labor+Relation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"660d2880b0b94da7e44870c80ba7ee846e961f97","infoHashBuffer":{"type":"Buffer","data":[102,13,40,128,176,185,77,167,228,72,112,200,11,167,238,132,110,150,31,151]},"announce":[],"urlList":[]}}