{"title":"20130530-Stossel-[The Fight Over Austerity].FBN.CF.avi","uid":8528002,"size":296621060,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6623d01f03e4ac1cf1fcbe49fbf7c691c9c78aae&amp;dn=20130530-Stossel-%5BThe+Fight+Over+Austerity%5D.FBN.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"skJGZV6z","files":-1,"time":1370074148,"description":"----------\n\nSTOSSEL - [The Fight Over Austerity] - Fox Business Network\n2013, May 30, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\n&quot;Austerity.&quot; The word means &quot;self-denial&quot; but politicians rarely &quot;deny&quot; themselves anything.\n\nDespite the media wailing about &quot;austerity,&quot; there have been few real cuts. Few in Congress actually want to cut spending. Senator Rand Paul explains why he is one of the few who does.\n\nLeftists say Europe's poor economy proves that &quot;austerity&quot; fails. But Cato Institute economist, Dan Mitchell, says Europe didn't even give &quot;austerity&quot; a chance to fail. There have been no spending cuts. As the chart shows, spending increased (except finally in Greece, where they had to cut).\n\nBob Kuttner, author of &quot;Debtor's Prison: The Politics of Austerity Versus Possibility&quot;, says government can spend its way to prosperity. He debates economist Mark Skousen.\n\nRadio host Dave Ramsey says debt is a behavioral problem and government must learn self-control.\n\nEconStories co-founders, John Papola and Russ Roberts, say the intellectual debate on &quot;austerity&quot; really began about 80 years ago. In their music videos, they bring Friedrich Hayek and John Maynard Keynes back for a stimulus vs. austerity rap battle.\n\nWhen I talked with people in Times Square most agreed that the Federal deficit is &quot;scary,&quot; but when asked what they would cut... most had no ideas! The Feds spend almost 4 trillion dollars and most people have no clue about what to cut?\n\nWell, I have a few ideas.\n\nWho needs a commerce department? Commerce... just happens. The Education department? Department of Energy? Labor? Cut those too!\n\nIf we cut government to the limited government the founders had in mind, poverty would become something so rare our kids would have to learn about it in history books.","torrent":{"xt":"urn:btih:6623d01f03e4ac1cf1fcbe49fbf7c691c9c78aae","amp;dn":"20130530-Stossel-%5BThe+Fight+Over+Austerity%5D.FBN.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6623d01f03e4ac1cf1fcbe49fbf7c691c9c78aae","infoHashBuffer":{"type":"Buffer","data":[102,35,208,31,3,228,172,28,241,252,190,73,251,247,198,145,201,199,138,174]},"announce":[],"urlList":[]}}