{"title":"Alan_Watts__Matter.epub","uid":10569084,"size":152015,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:66275e99057721bb19ecd3cc8d93665c2d56df3d&amp;dn=Alan_Watts__Matter.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":1,"time":1405553948,"description":"This is a series of essays representing philosopher Alan Watts's most recent thinking on the astonishing problems of man's relations to his material environment. The basic theme is that civilized man confuses symbol with reality, his ways of describing and measuring the world with the world itself, and thus puts himself into the absurd situation of preferring money to wealth and eating the menu instead of the dinner. Thus, with his attention locked upon numbers and concepts, man is increasingly unconscious of nature and of his total dependence upon air, water, plants, animals, insects, and bacteria. He has been hallucinated into the notion that the so-called &quot;external&quot; world is a cluster of &quot;objects&quot; separate from himself, that he &quot;encounters&quot; it, that he comes into it instead of out of it. Consequently, our species is fouling its own nest and is in imminent danger of self-obliteration. Here, a philosopher whose works have been mainly concerned with mysticism and Oriental philosophy gets down to the &quot;nitty-gritty&quot; problems of economics, technology, clothing, cooking, and housing.","torrent":{"xt":"urn:btih:66275e99057721bb19ecd3cc8d93665c2d56df3d","amp;dn":"Alan_Watts__Matter.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66275e99057721bb19ecd3cc8d93665c2d56df3d","infoHashBuffer":{"type":"Buffer","data":[102,39,94,153,5,119,33,187,25,236,211,204,141,147,102,92,45,86,223,61]},"announce":[],"urlList":[]}}