{"title":"Ani DiFranco - Allergic to Water (2014) [MP3 V0] politux","uid":11386992,"size":86256874,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:66293636ef17c1f43b59804fa91c6fb603540e50&amp;dn=+Ani+DiFranco+-+Allergic+to+Water+%282014%29+%5BMP3+V0%5D+politux&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"politux","files":-1,"time":1415279819,"description":"  Ani DiFranco - Allergic to Water (2014) [MP3 V0] politux\n\n  Genre: Folk\n  Style: Singer/Songwriter \n  Codec: MP3\n  Source: Converted from CD-ripped FLAC\n  Bit rate: V0 \n  Bit depth: 16\n  Sample rate: 44.1 kHz\n\n  01 Dithering \n  02 See See See See \n  03 Woe Be Gone \n  04 Careless Words \n  05 Allergic to Water \n  06 Harder Than It Needs to Be \n  07 Genie \n  08 Happy All the Time \n  09 Yeah Yr Right \n  10 Tr'w \n  11 Still My Heart\n  12 Rainy Parade \n\n  Ani DiFranco's extensive catalog boasts records that range from punky folk to funky jazz to electronically appended rock. She has relentlessly and restlessly explored her creative passions and obsessions with a vengeance. Allergic to Water was recorded in two four-day sessions -- one while she was six-and-a-half months pregnant -- at her home in New Orleans and a studio in Treme. Her band includes longtime bassist Todd Sickafoose (who also contributes keyboards) and NOLA drum ace Terence Higgins, with guests Ivan Neville on Wurlitzer and Jenny Scheinman on violin. DiFranco's signature guitar sound is everywhere. She produced and mixed the record through headphones in the nighttime hours while her family slept. More than anything, this is what informs the sound and feel of the record: It's quieter, more mysterious, and unhurried. There is less urgency in these songs, but no less poignancy. \n\n  The wryly humorous opener &quot;Dithering&quot; is a topical song about information overload and contains a slippery, syncopated funk backbeat. The title track, with its muted yet martial snares and simple chord progression, relates the role of an increasingly perilous biological environment in the everyday life of her speaking subject. There are different kinds of love songs here. &quot;Careless Words,&quot; with its astute meld of folk, jazz, and clever atmospherics, is an indictment of a former lover. &quot;Harder Than It Needs to Be&quot; candidly discusses the difficulties in committed relationships through hazy, country-folk blues beautifully colored by Matt Perrine's muted sousaphone. &quot;Genie,&quot; which immediately follows, is an acoustic rocker that expresses gratitude for finding love in the aftermath of personal darkness and isolation. Other songs express spiritual themes, as on &quot;Woe Be Gone,&quot; a grooving empathic balm for the suffering of humankind. It's countered with the biting irony in &quot;Happy All The Time,&quot; delivered with a vintage R&amp;B tinge. &quot;Still My Heart,&quot; with its minor-key guitar vamp and Scheinman's layers of violin, testifies to the attempt to remain sane in the face of life's chaos. DiFranco's songs here employ a strategy she's not used often: Abundant lyric repetition. It roots these songs closer in spirit and form to folk, blues, and gospel traditions. Since they are less dense and more experiential, emotional authority is articulated in each line. DiFranco's mix, for all its space and texture, is one of tasteful restraint. It allows melodic and rhythmic invention to shine through, underscoring the skill in her composing and the quality of the instrumental performances. In a catalog that contains over 20 studio albums, Allergic to Water is exemplary for its craft","torrent":{"xt":"urn:btih:66293636ef17c1f43b59804fa91c6fb603540e50","amp;dn":"+Ani+DiFranco+-+Allergic+to+Water+%282014%29+%5BMP3+V0%5D+politux","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66293636ef17c1f43b59804fa91c6fb603540e50","infoHashBuffer":{"type":"Buffer","data":[102,41,54,54,239,23,193,244,59,89,128,79,169,28,111,182,3,84,14,80]},"announce":[],"urlList":[]}}