{"title":"The Happiness Choice: The Five Decisions That Will Take You","uid":8583816,"size":1300811,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6661eb1175a50a9cdbdc222918cb5df3270a175c&amp;dn=The+Happiness+Choice%3A+The+Five+Decisions+That+Will+Take+You&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1371483152,"description":"\nThe Happiness Choice: The Five Decisions That Will Take You From Where You Are to Where You Want to Be by Marilyn Tam\n2013 | ISBN: 1118493168 | English | 188 Pages | EPUB | 1.25 MB\n\nDiscover the path to a happy life, from a woman who overcame the odds and achieved a joyful life\nAuthor Marilyn Tam takes what she learned from being an unwanted, neglected, and abused child in Hong Kong to become an international business success and humanitarian who is happy, healthy, and at peace with herself. In The Happiness Choice, she teaches readers how to live the life of their dreams. This book reveals the principles, tools, and philosophies she has used to achieve a balanced, healthy, and joyful life. People want contentment, love, and happiness from meaningful work, personal relationships, healthy mind and body, a spiritual core, and a reason for living. Tam details a path to get you there.\n\n* Offers overall perspective, inspiration, and support to help people achieve their dreams\n* Packed with personal stories and advice from Tam, celebrated entrepreneur and sought-after speaker and consultant, working globally with Fortune 500 companies, governments, and non-profit organizations","torrent":{"xt":"urn:btih:6661eb1175a50a9cdbdc222918cb5df3270a175c","amp;dn":"The+Happiness+Choice%3A+The+Five+Decisions+That+Will+Take+You","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6661eb1175a50a9cdbdc222918cb5df3270a175c","infoHashBuffer":{"type":"Buffer","data":[102,97,235,17,117,165,10,156,219,220,34,41,24,203,93,243,39,10,23,92]},"announce":[],"urlList":[]}}