{"title":"ExploitedCollegeGirls: Aubrey [XXX] x264 ","uid":12355974,"size":802270351,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:66ac43b0133f81c4bd206515778a3702bf1e676c&amp;dn=+ExploitedCollegeGirls%3A+Aubrey+%5BXXX%5D+x264+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Chinu685","files":2,"time":1441477664,"description":"Category: Anal, Legal Teen, College Girl, Cream Pie, Reality, Hardcore, Oral, All Sex\n\n\nCast: Aubrey\n\n\n.:Description:.\nIt's possible ECG has never had a girl this hot, this undeniably sexy and also this dirty. She looks like the prettiest girl on campus, but when Jay fucks her she talks like a truckstop hooker. It's beyond hot. There's one thing Aubrey says during this shoot that will probably make you blow your load instantly (if you haven't already.) After Jay pins her down and fucks her ass she bends over, smiles and tells the camera, &quot;Oh my god, my hole feels so wide right now!&quot;\nSo, spoiler alert from above, there is definitely some anal this week. But it only comes after a great build up. We meet Aubrey sitting on the bed and doing a little behind the scenes with Jay and showing off her amazing body. From her tanned C cups to her perfect little handful of ass, she's def. a 10. However, with a little persistence Jay gets her to admit that she's not as innocent as she looks. She loves sucking cock, might like anal, she's not bi- but she'll eat a pussy if she wants to and she loves giving head.\nThe interview quickly turns to a blur of intense sex. Jay and Aubrey use a vibrator together to get her first O, and she returns the favor by sucking Jay's cock. He really gets into it and is fucking her face like he's going to blow in her throat. He throws her on the bed and fucks her on her back until he remembers her comment about liking anal. A little lube and a quick flip and Jay's balls deep in her butt. After making her orgasm again in cowgirl, Jay blows his load deep inside of her puss for a gourmet creampie.\nLongtime fans of Exploited College Girls will recognize Aubrey's update for what it is: hands down some of Jay's finest work with the camera and with the cock. The chemistry between Jay and Aubrey is undeniable, at some point during the shoot Aubrey realizes that she's never been fucked this well and she completely loses herself in it. From the way she rubs her clit while Jay pounds her to the way she begs for him to fuck her harder, it's amazing.\nTake a look at screenshots! Enjoy!\n &lt;a href=&quot;\nhttp://milfimage.org/img-55eb18bca8bdc.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://milfimage.org/img-55eb18bca8bdc.html&lt;/a&gt;\n\n\nâ—†â—†â—†..:For more awesome stuff please click below:..â—†â—†â—†\n                                                       &lt;a href=&quot;\nhttps://thepirateba698y.la/user/Chinu685/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepirateba698y.la/user/Chinu685/&lt;/a&gt;","torrent":{"xt":"urn:btih:66ac43b0133f81c4bd206515778a3702bf1e676c","amp;dn":"+ExploitedCollegeGirls%3A+Aubrey+%5BXXX%5D+x264+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66ac43b0133f81c4bd206515778a3702bf1e676c","infoHashBuffer":{"type":"Buffer","data":[102,172,67,176,19,63,129,196,189,32,101,21,119,138,55,2,191,30,103,108]},"announce":[],"urlList":[]}}