{"title":"Gran.Torino.[DVDRip][Ac3-5.1][Castellano][2009].avi","uid":5004929,"size":1471236486,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:66e584d3b7437043876c57bcc0615bdff43076ee&amp;dn=Gran.Torino.%5BDVDRip%5D%5BAc3-5.1%5D%5BCastellano%5D%5B2009%5D.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Marxelosp","files":1,"time":1247681439,"description":"DirecciÃƒÂ³n: Clint Eastwood.\nPaÃƒÂ­s: USA.\nAÃƒÂ±o: 2008.\nDuraciÃƒÂ³n: 116 min.\nGÃƒÂ©nero: Drama.\nInterpretaciÃƒÂ³n: Clint Eastwood (Walt Kowalski), Christopher Carley (padre Janovich), Bee Vang (Thao), Ahney Her (Sue), Brian Haley (Mitch), Geraldine Hughes (Karen), Dreama Walker (Ashley), Brian Howe (Steve), John Carroll Lynch (Martin), William Hill (Tim Kennedy), Brooke Chia Thao (Vu).\nGuiÃƒÂ³n: Nick Schenk; basado en un argumento de David Johannson y Nick Schenk.\nProducciÃƒÂ³n: Clint Eastwood, Robert Lorenz y Bill Gerber.\nMÃƒÂºsica: Kyle Eastwood y Michael Stevens.\nFotografÃƒÂ­a: Tom Stern.\nMontaje: Joel Cox y Gary D. Roach.\nDiseÃƒÂ±o de producciÃƒÂ³n: James J. Murakami.\nVestuario: Deborah Hopper.\nEstreno en USA: 9 Enero 2009.\nEstreno en EspaÃƒÂ±a: 6 Marzo 2009.\n\nWalt Kowalski (Clint Eastwood), un trabajador del automÃƒÂ³vil jubilado, ocupa su tiempo con reparaciones domÃƒÂ©sticas, cerveza y visitas mensuales al peluquero. Aunque el ÃƒÂºltimo deseo de su difunta esposa fue que se confesara, para Walt, un resentido veterano de la Guerra de Corea que mantiene su rifle M-1 limpio y listo, no hay nada que confesar. Aquellos a los que solÃƒÂ­a considerar sus vecinos se han trasladado o han fallecido y han sido sustituidos por inmigrantes hmong, del sudeste asiÃƒÂ¡tico, que ÃƒÂ©l desprecia. Ofendido por prÃƒÂ¡cticamente todo lo que ve: los aleros caÃƒÂ­dos, el cÃƒÂ©sped descuidado y los rostros extraÃƒÂ±os que le rodean; las pandillas sin propÃƒÂ³sito de adolescentes hmong, latinos y afroamericanos que creen que el barrio les pertenece; los extraÃƒÂ±os inmaduros en que se han convertido sus hijos; Walt sÃƒÂ³lo espera a que llegue su ÃƒÂºltima hora. Hasta la noche en que alguien intenta robar su Gran Torino del 72. Tan reluciente como estaba el dÃƒÂ­a en que el propio Walt ayudÃƒÂ³ a sacarlo de la cadena de montaje hace dÃƒÂ©cadas, el Gran Torino hace que su tÃƒÂ­mido vecino adolescente, Thao (Bee Vang), entre en su vida cuando los pandilleros hmong presionan al chico para que intente robarlo. Pero Walt lo impide, convirtiÃƒÂ©ndose en el reacio hÃƒÂ©roe del barrio, especialmente para la madre y la hermana mayor de Thao, Sue (Ahney Her), quien insiste en que Thao trabaje para Walt para enmendar su conducta.","torrent":{"xt":"urn:btih:66e584d3b7437043876c57bcc0615bdff43076ee","amp;dn":"Gran.Torino.%5BDVDRip%5D%5BAc3-5.1%5D%5BCastellano%5D%5B2009%5D.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66e584d3b7437043876c57bcc0615bdff43076ee","infoHashBuffer":{"type":"Buffer","data":[102,229,132,211,183,67,112,67,135,108,87,188,192,97,91,223,244,48,118,238]},"announce":[],"urlList":[]}}