{"title":"Cinderella (2006) South Korean Horror film","uid":7322480,"size":262486995,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6784752bf24a39dd47e058b14e2fb7ed10d7ccf9&amp;dn=Cinderella+%282006%29+South+Korean+Horror+film&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"baronww1","files":2,"time":1338659444,"description":"Though having never once in her life seen her father, Hyun-soo has never felt his absence, as there is a perfect mother for her. Her mother is also a renowned plastic surgeon, so she is never lonely, surrounded by girls who want beauty consultations from her mother. But her happiness comes to an end as her friends who have received facial surgery from her mother start to commit mysterious suicides by cutting out their faces. She also starts to feel that there is someone else in the house where she lives alone with her mother. One day, she discovers a hidden basement and there, she comes to find a secret from her past, which will bring great turmoil to mother and daughter.\n\nThis AVI file that I uploaded was originally split into CD1 and CD2 since there was really no single AVI file of it I thought I would splice the CD1 and CD2 together and included English SRT file for those who can not understand Korean.\n\nI hope you enjoy this movie as much as I have, also keep seeding, since this is a hard to find movie I will add more movies shortly. If you have a request for a movie I will try to find a good copy to upload for the masses\n\nkeep it alive,\n\nbaronww1\t","torrent":{"xt":"urn:btih:6784752bf24a39dd47e058b14e2fb7ed10d7ccf9","amp;dn":"Cinderella+%282006%29+South+Korean+Horror+film","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6784752bf24a39dd47e058b14e2fb7ed10d7ccf9","infoHashBuffer":{"type":"Buffer","data":[103,132,117,43,242,74,57,221,71,224,88,177,78,47,183,237,16,215,204,249]},"announce":[],"urlList":[]}}