{"title":"Tom Sharpe, Indecent exposure and Riotous Assembly","uid":6546561,"size":458797345,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:67b737e476c0d4b778f0219f69d4359a76913232&amp;dn=Tom+Sharpe%2C+Indecent+exposure+and+Riotous+Assembly&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mustafa-crap","files":28,"time":1310891395,"description":"Indecent exposure\n\nOnce against the setting is Piemburgem, the deceptively peaceful-looking capital of Zululand, where Kommandant van Heerden, Konstabel Els and Luitenant Verkramp continue to terrorize true Englishmen and even truer Zulus in their relentless search for a perfect South Africa. While that great Anglophile, Kommandant van Heerden, gropes his way towards attaining true &quot;Englishness&quot; in the company of the eccentric Dornford Yates Club, Luitenant Verkramp, whose hatred of all things English is surpassed only by his fear of sex. This sets in motion an experiment in mass chastity, with the help of the redoubtable lady psychiatrist Dr. von Blimenstein, which has remarkable and quite unforeseen results. Once more, Konstabel Els, homicidal to the last, saves the day - or what's left of it - in one of the most savage hunts ever chronicled in fiction.\n\n\nRiotous Assembly\n\nWhen Miss Hazelstone of Jacaranda Park kills her Zulu cook in a sensational crime of passion, the gallant members of the South African police force are soon upon the scene: Kommandant van Heerden, whose secret longing for the heart of an English gentleman leads to the most memorable transplant operation yet recorded: Luitenant Verkramp of the Security Branch, ever active in the pursuit of Communist cells; Konstabel Els, with his propensity for shooting first and not thinking later - and also for forcing himself upon African women in a manner legally reserved for male members of their own race. In the course of the strange events which follow, we encounter some very esoteric perversions and some even more amazing perversions of justice when Miss Hazelstone's brother, the Bishop of Barotseland, is sentenced to be hanged on the ancient gallows in the local prison.","torrent":{"xt":"urn:btih:67b737e476c0d4b778f0219f69d4359a76913232","amp;dn":"Tom+Sharpe%2C+Indecent+exposure+and+Riotous+Assembly","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67b737e476c0d4b778f0219f69d4359a76913232","infoHashBuffer":{"type":"Buffer","data":[103,183,55,228,118,192,212,183,120,240,33,159,105,212,53,154,118,145,50,50]},"announce":[],"urlList":[]}}