{"title":"Pink Floyd Piper at the Gates of Dawn 24 Bit Vinyl Pack","uid":9456499,"size":2655532732,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:67db5e867aad65750707a06a2198840e936c3da5&amp;dn=Pink+Floyd+Piper+at+the+Gates+of+Dawn+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"politux","files":-1,"time":1389283359,"description":"\n  Pink Floyd Piper at the Gates of Dawn 24 Bit Vinyl Pack\n\n  Genre: Pop/Rock\n  Styles: Art Rock, Album Rock, Prog-Rock, Psychedelic \n  Source: vinyl\n  Codec: FLAC\n  Bitrate: ~ 2,900 kbps\n  Bit Depth: 24\n  Sampling Rate: 96,000 Hz\n\n  3 Versions\n\n  The title of Pink Floyd's debut album is taken from a chapter in Syd Barrett's favorite children's book, The Wind in the Willows, and the lyrical imagery of The Piper at the Gates of Dawn is indeed full of colorful, childlike, distinctly British whimsy, albeit filtered through the perceptive lens of LSD. Barrett's catchy, melodic acid pop songs are balanced with longer, more experimental pieces showcasing the group's instrumental freak-outs, often using themes of space travel as metaphors for hallucinogenic experiences -- &quot;Astronomy Domine&quot; is a poppier number in this vein, but tracks like &quot;Interstellar Overdrive&quot; are some of the earliest forays into what has been tagged space rock. But even though Barrett's lyrics and melodies are mostly playful and humorous, the band's music doesn't always bear out those sentiments -- in addition to Rick Wright's eerie organ work, dissonance, chromaticism, weird noises, and vocal sound effects are all employed at various instances, giving the impression of chaos and confusion lurking beneath the bright surface. The Piper at the Gates of Dawn successfully captures both sides of psychedelic experimentation -- the pleasures of expanding one's mind and perception, and an underlying threat of mental disorder and even lunacy; this duality makes Piper all the more compelling in light of Barrett's subsequent breakdown, and ranks it as one of the best psychedelic albums of all time.","torrent":{"xt":"urn:btih:67db5e867aad65750707a06a2198840e936c3da5","amp;dn":"Pink+Floyd+Piper+at+the+Gates+of+Dawn+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67db5e867aad65750707a06a2198840e936c3da5","infoHashBuffer":{"type":"Buffer","data":[103,219,94,134,122,173,101,117,7,7,160,106,33,152,132,14,147,108,61,165]},"announce":[],"urlList":[]}}