{"title":"Video Capture/Convert/Split/Merge/Burn Studio 6.9.5.1-serial inc","uid":4694916,"size":20236199,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:67ef841b247721eeb494ec75de27e8a940f369a2&amp;dn=Video+Capture%2FConvert%2FSplit%2FMerge%2FBurn+Studio+6.9.5.1-serial+inc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"jmb2012","files":3,"time":1233520930,"description":"Video Convert/Split/Merge Studio can burn, capture, convert, split and merge: AVI, MPEG, MPEG 1, MPEG 2, MPEG 4, VCD, DVD, VCD, RMVB, RM, WMV and any most used video formats. It is a home video software to realize requirements of watching at home theater or storing in PC. It is compatible with DVD/VCD/ SVCD burning. It is easy-in-use, only in 4 steps to burn, convert, capture, split or merge movies. \t\n\n  Convert Between All Video Formats \nConvert between formats such as AVI (DivX, XviD, etc), MPEG 1,2 and 4, 3GP, MOV, RM, SWF. WMV and DVD, SVCD, VCD...,with fast speed.\n\nBurn DVD/VCD/SVCD\nCreate DVD/VCD/SVCD from video files of all supported formats to watch them on your home DVD player with friends and family. \n\nSimple Transfer\nCapture from DV and analog cameras, VCRs, TV tuners and WEB cams. Start making your movies from the first run. \nBatch Mode Processing \nProcess several files at once. Merge and split them. Delete unwanted scenes from your movies. Join several video files and make one DVD. \n\nMerge And Split \nMerge different videos into 1 disc and split videos into several pieces you desired. \n\nExtract Audio And Images \nSave audio streams as audio files, extract single frames and save them as image files.\n\nVideo Convert Master Key Features\nEasily capture, convert, split, and share your videos all from one simplified interface! \n \t \n\nFeatures \nConvert AVI, MPEG, MPEG 1, MPEG 2, MPEG 4, VCD, DVD, SVCD, RMVB, RM, WMV, MOV, DIVX and other video format;\nBurn DVD/VCD/SVCD;\nConvert your movies in batch mode;\nSplit AVI, VCD, DVD or other videos into several ones\nCustomizable video screen size, audio/video bit rate, frame rate, aspect\nAnd much more!\n\nHigh-speed converting \nWith the combination of DirectX 9.0 and the high-speed converting encoders available, you really won't find any application that converts faster than Video Convert/Split/Merge Studio. \n\nBurn DVD/VCD/SVCD \nCreate DVD/VCD/SVCD from video files of all supported formats with its wonderful output quality, full functionality that easy to use and multiple options. With it, you can watch them on your home DVD player with friends and family. \n\nVideo batch conversion \nWant to convert 'Star Wars' collection from AVI to something you can watch on DVD player? \nWell, 20 hours movie might take a while to convert, and you don't want to be sitting there watching toggle the bits. \nSo, just add all AVI files you want to convert, go to bed, and the next morning DVD videos are all there waiting for you. \n\nSplit and merge \nBurning 'The Lord of Rings' generally takes more than two discs in VCD formats. If you really want watch it with your VCD player, you can think about splitting it. On the other hand, you may want to merge 2 AVI videos into one sometime. Video Convert/Split/Merge Studio provides solutions in splitting and merging. \n\nAvailable formats \n\nInput Formats:\nAVI (DivX, XviD, MS MPEG 4, Uncompressed, Cinepak and others)\nMPEG (MPEG 1, MPEG 2 Video, VCD, DVD, SVCD) \nWMV Windows Media Video\nQuick Time Apple video format for the Macintosh\n\n\nOutput Formats:\nAVI (DivX, XviD, MS MPEG 4, Uncompressed, Cinepak and others)\nMPEG (MPEG 1, MPEG 2 Video, VCD, DVD, SVCD) \nWMV Windows Media Video\nRM Real Networks Video\t \n \n\nProcessor type:\tPentium\nProcessor speed:\t233 MHz\nMemory (Cache):\t64 MB RAM Minimum\nHard disk:\tIDE\nOperating system:\tWindows 2000/XP/2003 Server/Vista\nSoundcard:\tMME-compatible Soundcard\nGraphics:\t256 colors @ 800 x 600\n\t \n ","torrent":{"xt":"urn:btih:67ef841b247721eeb494ec75de27e8a940f369a2","amp;dn":"Video+Capture%2FConvert%2FSplit%2FMerge%2FBurn+Studio+6.9.5.1-serial+inc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67ef841b247721eeb494ec75de27e8a940f369a2","infoHashBuffer":{"type":"Buffer","data":[103,239,132,27,36,119,33,238,180,148,236,117,222,39,232,169,64,243,105,162]},"announce":[],"urlList":[]}}