{"title":"[DC] Dead or Alive 2 [NTSC] [SB] [CDI]","uid":5106284,"size":268883966,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:6824a0bf819852929501d8e0f60ed013ec0af5be&amp;dn=%5BDC%5D+Dead+or+Alive+2+%5BNTSC%5D+%5BSB%5D+%5BCDI%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Big_dude","files":-1,"time":1254394013,"description":"Dead or Alive 2 for the Sega Dreamcast                             Rel. 02/29/2000\n\n\nFormat:\t       CD-R NTSC-USA\nLang.:\t       English\nDiscs:          1\nImage:          CDI\nGener.:         Fighting/Arcade\nSelfboot:       Yes\nRequirements:   Dreamcast Console, or DC Emulator.\n\n\nCompressed with WinRar, Game was tested and works. \nTry 7Zip its free google it, if you don't have WinRar.\n\n\nRelease Notes: This is Dead or Alive 2 for the dreamcast and is selfboot \n               on a standard CD-R. Read below for info on type of media you \n               should use &amp; how you should burn. All's thats needed is a cd-r \n               and a dreamcast console or you can try an emulator. This game \n               was tested on a regular dc console (made in 1999) and ran fine.\n             \n     \nImportant: Some later versions of Sega dreamcast consoles supposedly won't allow\n           utopia or copies of games, not sure if this is true but to be on the \n           safe side try to use a console manufactured before october 2000.  You\n           can find the manfacture date on the bottom of the console on the sticker\n           in fine print just look for it. Of course the only way to know is to\n           just try it on your dreamcast.\n\n\n\nGame Description:\n\nNote - There is some load times where the screen will turn black for a little bit just wait and it will load and after fight press L or R or Start on controller. These load times are because the game has been converted to a CD-R but everything else is fine and won't effect gameplay nothing to worry about.\n\nThe arcade conversion adds an improved tag feature, with new stadiums to fight in, new character moves to play with, and plenty of windows, walls and ledges to fall over and crash through. Unlike Tekken Tag Tournament, however, DOA2 also includes a single player mode, a dodge button (allowing you to move left and right away from attacks), and multi-level arenas.\n\n\n\nGame Pics included.\n\n\nBurn with Alcohol 120% or Discjuggler (Both included in download).\n\nIn Options enable overburn disc in Alcohol or DiscJuggler. (Do for all DC games)\n\nSet Write Method To Raw/Dao and burn at 4x Speed for Alcohol 120%.\n\n\nIf you wanna burn using DiscJuggler Set Burn settings to Raw Write Mode 2 2352 \nCD-DA or Mode 1 2048 Raw Write and burn at 4x Speed.\n\n\nUse Verbatim or Tayio Yuden CD-R Media for best quality, or if other media isn't working.\n\n(No CD-RW will not work only CD-R's).\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\n\nEnjoy!\t\t","torrent":{"xt":"urn:btih:6824a0bf819852929501d8e0f60ed013ec0af5be","amp;dn":"%5BDC%5D+Dead+or+Alive+2+%5BNTSC%5D+%5BSB%5D+%5BCDI%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6824a0bf819852929501d8e0f60ed013ec0af5be","infoHashBuffer":{"type":"Buffer","data":[104,36,160,191,129,152,82,146,149,1,216,224,246,14,208,19,236,10,245,190]},"announce":[],"urlList":[]}}