{"title":"Hybrid Nanocomposites for Nanotechnology - Lhadi Merhari","uid":15340919,"size":17418287,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6826a5fbb6f50e31fc0b7aef67f3b84a012761ad&amp;dn=Hybrid+Nanocomposites+for+Nanotechnology+-+Lhadi+Merhari&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1468835804,"description":"Hybrid Nanocomposites for Nanotechnology - Lhadi Merhari (Springer, 2009).pdf\r\n\r\nWith the advent of nanoscience and nanotechnology, the dream of scientists to engineer new functional materials combining the best specific properties of organic and inorganic materials is closer to reality. The traditional targeted application has been the reinforcement of plastics with the addition of inorganic fillers. Accelerated research over the past two decades, as evidenced by the large bulk of literature on mechanical properties of organic–inorganic composites, focused on systems such as clay/polymer nanocomposites, which are now exploited by the automotive industry worldwide. Although, in the low filler loading range, clay/polymer na- composites can replace traditional fiber-reinforced composites, there is still a long way to go before understanding the mechanisms of enhancement of major en- neering properties of polymers and to tailor their nanostructure. The driving force to edit the present comprehensive book has been to show that the applications of organic–inorganic nanocomposites extend far beyond the above-mentioned traditional mechanical applications and that hybrid nanoc- posites should be considered as an attractive, versatile, technological platform for future electronic, optical, magnetic, and biomedical applications. Indeed, taking up challenges such as homogeneous dispersion of inorganic nanoobjects into a polymer matrix or tailoring of the multiscale nano-to-macro structure of the c- posites will contribute to the establishment of a solid unified hybrid nanocomp- ite technological platform for commercially-viable products revolutionizing various industrial sectors. The generally-accepted definition of a hybrid nanocomposite is a material created by dispersing inorganic nanoparticulates into a macroscopic organic matrix","torrent":{"xt":"urn:btih:6826a5fbb6f50e31fc0b7aef67f3b84a012761ad","amp;dn":"Hybrid+Nanocomposites+for+Nanotechnology+-+Lhadi+Merhari","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6826a5fbb6f50e31fc0b7aef67f3b84a012761ad","infoHashBuffer":{"type":"Buffer","data":[104,38,165,251,182,245,14,49,252,11,122,239,103,243,184,74,1,39,97,173]},"announce":[],"urlList":[]}}