{"title":"Eric Andersen - A Country Dream (1969) MP3@320","uid":9651591,"size":98697269,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:686ce9e26e1313980b94a7df3aa72be4a8cdc996&amp;dn=Eric+Andersen+-+A+Country+Dream+%281969%29+MP3%40320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"AaronVincent","files":11,"time":1393086030,"description":"Eric Andersen (born February 14, 1943, Pittsburgh, Pennsylvania) is an American folk musician and singer-songwriter. His best-known songs from the 1960s folk era are &quot;Violets of Dawn&quot;, &quot;Come to My Bedside&quot;, and &quot;Thirsty Boots&quot; (the latter recorded by Judy Collins, Bob Dylan, amongst others) while the Blue River album and the song &quot;Is It Really Love At All?&quot; are popular from his work from the singer-songwriter movement.\n\nIn the early 1960s, Eric Andersen was part of the Greenwich Village folk scene in New York. In 1964, Andersen made his debut at Gerdes Folk City in a live audition for Vanguard Records. In 1965 he released his first Vanguard album Today is the Highway.[4] In 1966 he made his Newport Folk Festival debut. The Beatles manager Brian Epstein was in the process of becoming his manager when Epstein died.\n\nAndersen took part in the Festival Express tour across Canada in 1970 with the Grateful Dead, Janis Joplin, The Band, Delaney Bramlett and others.\nAndersen signed with Columbia in 1972 and issued his most commercially successful album Blue River. The master tapes of his follow-up album Stages were lost before the album could be released, resulting in the loss of much of the momentum he had gained with Blue River.\n\nAndersen parted ways with Columbia and recorded sporadically for a number of labels throughout the remainder of the 1970s and into the early 1980s. In 1975 he performed with Arlen Roth at the opening show of Bob Dylan's Rolling Thunder Revue at Gerde's Folk City and again in Niagara Falls.\n\nIn the late 70s, Andersen was also a member of The Woodstock Mountains Revue, a unique folk group that also featured Artie Traum, Happy Traum and John Sebastian.","torrent":{"xt":"urn:btih:686ce9e26e1313980b94a7df3aa72be4a8cdc996","amp;dn":"Eric+Andersen+-+A+Country+Dream+%281969%29+MP3%40320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"686ce9e26e1313980b94a7df3aa72be4a8cdc996","infoHashBuffer":{"type":"Buffer","data":[104,108,233,226,110,19,19,152,11,148,167,223,58,167,43,228,168,205,201,150]},"announce":[],"urlList":[]}}