{"title":"Josh T. Pearson...Last of the Country Gentlemen(2011)[FLAC]","uid":6285694,"size":279639922,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:68d0175f4937a35220cf7f45c7225e5437d74173&amp;dn=Josh+T.+Pearson...Last+of+the+Country+Gentlemen%282011%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"dickspic","files":11,"time":1301604925,"description":"[img]http://image.allmusic.com/00/amg/cov200/drp800/p836/p83648pgdoz.jpg[/img]\n[color=Green]2011 Last of the Country Gentlemen   CD  Mute [/color] \n[img]http://i128.photobucket.com/albums/p180/SonAfterDark/tracklistlatest.png[/img]\n\n  1  Thou Art Loosed -Pearson 3:14 \n  2  Sweetheart I Ain't Your Christ -Pearson 11:45 \n  3  Woman, When I've Raised Hell -Pearson 6:59 \n  4  Honeymoon's Great! Wish You Were Her -Pearson 13:00 \n  5  Sorry with a Song -Pearson 10:50 \n  6  Country Dumb -Pearson 10:13 \n  7  Drive Her Out -Pearson 2:32 \n\nJosh T. Pearson's Last of the Country Gentlemen is a nakedly confessional, unflinchingly honest, sometimes suffocatingly intimate album. It profiles the desperation of one who desires deliverance from tormented obsession and self-destructive behavior, yet can find neither rest nor redemption. Pearson expresses this without megalomania or self-pity. He's fronted by Texas trio Lift to Experience, who released a single album a decade ago, The Texas-Jerusalem Crossroads, which married the beautiful, overdriven sonics of My Bloody Valentine to Americana with Biblical-scale spiritual visions. But Pearson's lived hard and wild in the ensuing decade. Last of the Country Gentlemen reveals that he still believes in his God, but he's been also torn apart by love, drink, and a past he cannot reconcile, but which he accepts full responsibility for. Recorded over two nights in Berlin, the disc contains seven songs -- four over ten-minutes long -- usually skeletally adorned by his voice and elliptical guitar playing. (The latter is sometimes a device he'll employ for long stretches, seemingly to summon the courage to continue to sing). These songs are direct lyrically, and often repetitive, but seldom do they offer resolution. They can make monumental leaps in narrative and emotion: one moment he's expressing naked tenderness, the next drunken brutality, and in a flash, he shifts back. Opener &quot;Thou Art Loosed&quot; features Pearson's beautiful falsetto in a wished-for bravado he doesn't possess: &quot;Don't cry for me baby/You'll learn to live without me/Don't cry for me baby/I'll learn to live without you,&quot; before truthfully snarling the delusional, &quot;I'm off to save the world/At least I can hope,&quot; at song's end. &quot;Sweetheart I Aint Your Christ,&quot; spurns a lover's enormous need because it terrifies him. His own hunger appears later in &quot;Sorry with a Song.&quot; &quot;Woman When I've Raised Hell&quot; (which features a small string section that includes Warren Ellis) demands acceptance of his alcoholism, because refusal would result in violent consequence. The hinge piece, &quot;Honeymoon's Great! Wish You Were Here,&quot; is a tormented confession revealing his love for a woman he isn't marrying. Its lyrics are too profound to excerpt; it's the most loaded (and finest) song in this collection. That woman returns three songs later in closer &quot;Drive Her Out,&quot; which is a truer alter-ego of &quot;Thou Art Loosed.&quot; Last of the Country Gentlemen is a demanding listen; its wandering pace, startling, emotionally jarring terrain of uncalculated honesty, and obsession can be uncomfortable. That said, it is a recording of surprising originality and great beauty. \n\ncd ripped by dBpoweramp\n\nplease seed\n\n[url]http://dickthespic.org/2011/03/23/josh-t-pearson/[/url]","torrent":{"xt":"urn:btih:68d0175f4937a35220cf7f45c7225e5437d74173","amp;dn":"Josh+T.+Pearson...Last+of+the+Country+Gentlemen%282011%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68d0175f4937a35220cf7f45c7225e5437d74173","infoHashBuffer":{"type":"Buffer","data":[104,208,23,95,73,55,163,82,32,207,127,69,199,34,94,84,55,215,65,115]},"announce":[],"urlList":[]}}