{"title":"The Pastels - Mobile Safari [1995]","uid":9473154,"size":269222332,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:691ae02a0c2e3cfbea73a91a153936bb99fa11ec&amp;dn=The+Pastels+-+Mobile+Safari+%5B1995%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"GenXRock","files":-1,"time":1389630998,"description":"Review by Stephen Cramer\nOn Mobile Safari, the Pastels stretched out to an American audience with their calm and reflective style of blissful indie pop. Stephan Pastel remained the band's primary songwriter, while Katrina Mitchell (drums) and Aggi Wright (bass) began to contribute more this time around. Mitchell sings bittersweet and awkward lead vocals on &quot;Mandarin&quot; and &quot;Token Collecting.&quot; Her untrained crooning is part of the allure of her songs. Wright leads on vocals on the festive &quot;Yoga&quot; and composed the instrumental &quot;Mobile Deli.&quot; Pastel leads the way on the rest of the songs with his dry and deep vocal style. His delivery speeds up from its normally sluggish pace on the toe-tapping &quot;Classic Line-Up&quot; and &quot;Strategic Gear.&quot; He collaborated with former member David Keegan on &quot;Exploration Team&quot; and &quot;Flightpaths to Each Other.&quot; The whole trio of Pastel, Mitchell, and Wright collaborated on the disc's final track, the sublimely cool and horn-filled &quot;Worlds of Possibility.&quot; Gerard Love added guitar and vocals to some of the tracks, while Luna's Dean Wareham also appeared as a guest guitarist. Mobile Safari was recorded at CAVA Sound Workshops and Stuffhouse Studios, both in the band's home of Glasgow, Scotland. (4.5/5)","torrent":{"xt":"urn:btih:691ae02a0c2e3cfbea73a91a153936bb99fa11ec","amp;dn":"The+Pastels+-+Mobile+Safari+%5B1995%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"691ae02a0c2e3cfbea73a91a153936bb99fa11ec","infoHashBuffer":{"type":"Buffer","data":[105,26,224,42,12,46,60,251,234,115,169,26,21,57,54,187,153,250,17,236]},"announce":[],"urlList":[]}}