{"title":"Jonathan Richman - 2004 - Not So Much... (FLAC)","uid":11235447,"size":225211445,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:69cb706575e3e1c652f7c1fb1fa32ba20e6f26b3&amp;dn=Jonathan+Richman+-+2004+-+Not+So+Much...+%28FLAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":16,"time":1413596327,"description":"&quot;All right, kids, gather around: Once upon a time, Jonathan Richman was the lead singer of a seminal proto-punk band called The Modern Lovers. He later jettisoned that group's Velvet Underground-tinged drone for an acoustic guitar and gigs on &quot;Sesame Street&quot; and in There's Something About Mary. Now the 53-year-old patron saint of the eternally childlike is back with Not So Much to Be Loved as to Love, another set of doe-eyed, goofily innocent songs of love and growing up by a boy genius who never will.\n\nWith Richman's gentle guitar and Tommy Larkins' birthday-party percussion, this record sounds much like his last outing, 2001's Her Mystery Not of High Heels and Eye Shadow, except this time Richman handles the clean, chaste production himself. But while that album described relationships in all their messy vitality, Not So Much is really a record about art. It obviates criticism-- &quot;He gave us the wine to taste, not to talk about it,&quot; Richman sings-- but could inspire ponderous tomes of scholarly exegesis and coloring book after coloring book of outside-the-lines Crayola scribblings.\n\nAn artist must adhere to his own, singular vision above all else, Richman proposes, and to do so apparently requires all the imagination and unbridled glee of an eight-year-old. Here the man who wrote the immortal &quot;Pablo Picasso&quot; breezily revives &quot;Vincent Van Gogh&quot;, a classic from his long-out-of-print 1986 LP Rockin' and Romance. &quot;He loved color and he let it show,&quot; the singer explains. On &quot;Salvador Dali&quot;, a characteristically earnest narrator describes how Dali's art got him through adolescence and introduced him &quot;to the dream world, to the dream world.&quot; The album's title, from a prayer by St. Francis of Assisi, is far more than a homily about romantic or platonic love. What's important for Richman and his favorite painters is not popular affection, but their art-- which is an expression of love itself. See?\n\nNot So Much is suffused with this creative love. It's the kind of love that necessitates repetition. Van Morrison once called it &quot;the love that loves the love that loves the love that loves the love that loves to love the love that loves to love the love that loves,&quot; layering a few simple Germanic syllables with endless mists of meaning. In a perky, 50s-style love song, Richman calls it &quot;My Baby Love Love Loves Me&quot;.\n\nThis kind of love causes Richman to speak in tongues: Italian on the exuberant &quot;In Che Mondo Viviamo&quot; and the boisterous bossa nova of &quot;Cosi Veloce&quot;, French for &quot;On a Du Soleil&quot; (a track that's like un chat yawning by a window in the afternoon) and the similarly celestial &quot;Les Etoiles&quot;. I'm unable to understand either language without Babelfish, but I can still marvel at these sounds. True love &quot;brings up hurt from when you were five years old,&quot; Richman once sang. But it also brings up joy.&quot;","torrent":{"xt":"urn:btih:69cb706575e3e1c652f7c1fb1fa32ba20e6f26b3","amp;dn":"Jonathan+Richman+-+2004+-+Not+So+Much...+%28FLAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69cb706575e3e1c652f7c1fb1fa32ba20e6f26b3","infoHashBuffer":{"type":"Buffer","data":[105,203,112,101,117,227,225,198,82,247,193,251,31,163,43,162,14,111,38,179]},"announce":[],"urlList":[]}}