{"title":"Overdiagnosed (Re-upload)","uid":10403464,"size":416118658,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6a236916da7a9ff67eb0845e72494270ee6e6c3d&amp;dn=Overdiagnosed+%28Re-upload%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dogmatist","files":-1,"time":1403412371,"description":"This file included two high quality .mp3 torrent files from audible.com\n\nDescription of book:\n\nGoing against the conventional wisdom reinforced by the medical establishment and Big Pharma that more screening is the best preventative medicine, Dr. Gilbert Welch builds a compelling counterargument that what we need are fewer, not more, diagnoses. Documenting the excesses of American medical practice that labels far too many of us as sick, Welch examines the social, ethical, and economic ramifications of a health-care system that unnecessarily diagnoses and treats patients, most of whom will not benefit from treatment, might be harmed by it, and would arguably be better off without screening.\nDrawing on 25 years of medical practice and research, Dr. H. Gilbert Welch and his colleagues, Dr. Lisa M. Schwartz and Dr. Steven Woloshin, have studied the effects of screenings and presumed preventative measures for disease and pre-disease. Examining the social, medical, and economic ramifications of a health care system that unnecessarily diagnoses and treats patients, Welch makes a reasoned call for change that would save us from countless unneeded surgeries, debilitating anxiety, and exorbitant costs.","torrent":{"xt":"urn:btih:6a236916da7a9ff67eb0845e72494270ee6e6c3d","amp;dn":"Overdiagnosed+%28Re-upload%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a236916da7a9ff67eb0845e72494270ee6e6c3d","infoHashBuffer":{"type":"Buffer","data":[106,35,105,22,218,122,159,246,126,176,132,94,114,73,66,112,238,110,108,61]},"announce":[],"urlList":[]}}