{"title":"WinAVI All-In-One Converter v1.7.0.4734 Incl Crack","uid":9152365,"size":18691620,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6ad93dd1ee77308ba8c9d9347a8e03d3b165731a&amp;dn=WinAVI+All-In-One+Converter+v1.7.0.4734+Incl+Crack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"kishordeepu","files":-1,"time":1383716698,"description":"WinAVI All-In-One Converter is a professioal world's fastest converter for multimedia conversion including video and audio formats that converts a 4G DVD movie only within ten minutes while a 20 sets TV series only needs one hour. Key features: 1. Convert video and audio between almost all the popular media formats including WMV, ASF,AVI, RMVB, FLV, RM, MOV, QT, MP4, M4V, DV, 3GP, 3G2, DAT,MPG, MPEG, VOB, FLV, MKV, MTS, M2TS, F4V ; and Audio Formats: AAC, AC3, AIFF, AMR, M4A, MP2, MP3, OGG, RA, AU, WAV, WMA, MKA, FLAC,etc. 2. Compatible with various devices such as iPad, iPod, Zune, iPhone, Apple TV, PSP, PS3, Blackberry, Xbox 360, Archos, iRiver, Motorola, Creative Zen, MP4/MP3 Player, Smart Phone, Pocket PC, Mobile Phone,etc. 3. Convert video/audio formats files to DVD/VCD/SVCD formats as output and preset DVD menu. 4. Support High-Definition video conversion such as MKV HD, AVI HD, MP4 HD, MPEG2 HD, WMV HD, RMVB HD, etc. 5. Personalize videos by editing and appending effects and customize the subtitles of your own style. 6. Easy, quick and convenient to convert and batch conversion with super fast conversion speed and high quality. 7. Convert a 4G DVD movie only within ten minutes while a 20 sets TV series only needs one hour. You needn't wait for a long time.\nWhat's new in this version: Supports input Blu-Ray file to convert; Optimized MPEG4 codec.","torrent":{"xt":"urn:btih:6ad93dd1ee77308ba8c9d9347a8e03d3b165731a","amp;dn":"WinAVI+All-In-One+Converter+v1.7.0.4734+Incl+Crack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ad93dd1ee77308ba8c9d9347a8e03d3b165731a","infoHashBuffer":{"type":"Buffer","data":[106,217,61,209,238,119,48,139,168,201,217,52,122,142,3,211,177,101,115,26]},"announce":[],"urlList":[]}}