{"title":"Flightradar24 6.5.0 (ipa)","uid":12656003,"size":50638176,"categoryP":"applications","categoryS":"ios_(ipad_iphone)","magnet":"?xt=urn:btih:6bd50a6451045f2a9497f463596752072266cd45&amp;dn=Flightradar24+6.5.0+%28ipa%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"tomasjojo","files":1,"time":1446217025,"description":"*** Cracked ***\r\n\r\n\r\nFlightradar24 6.5.0 for iDevices.\r\n\r\n\r\nTurn your iPhone, iPad or Apple Watch into an air traffic radar and see planes around the world move in real-time on a detailed map. Or point your device at a plane in the sky to find out where it’s going and more. Discover today why millions are already tracking flights with Flightradar24.\r\n\r\nFeatures that have helped make Flightradar24 - Flight Tracker the #1 selling app in 115 countries include: \r\n* Watch planes move in real-time on detailed map\r\n* Identify planes flying overhead by simply pointing your device at the sky (requires GPS equipped device)\r\n* Experience what the pilot of a an aircraft sees in real-time and in 3D (requires iPhone 4S, iPad 2, iPod Touch 5th gen., and above + iOS 6.0 or higher)\r\n* Tap on a plane for comprehensive flight and aircraft information such as route, estimated time of arrival, actual time of departure, aircraft type, speed, altitude, and high-resolution picture\r\n* Tap on an airport icon for current delay stats and weather conditions\r\n* Easy to search for individual flights using flight number, airport, or airline\r\n* Easy to filter by airline, aircraft, altitude, speed, and more\r\n* Easy to set bookmarks to enable quick navigation to areas of interest\r\n* Get a detailed list of all flights in the air in your area on your Apple Watch\r\n* Turn the device into the arrivals and departures board of any major airport and get real-time status updates for flights (in-app purchase)\r\n* Realistic aircraft symbols (in-app purchase)\r\n* Set up custom alerts based on airline, aircraft type, flight number or registration (in-app purchase) \r\n\r\nHOW IT WORKS\r\nMost aircraft today are equipped with so called ADS-B transponders that transmit positional data. Flight radar 24 has a rapidly growing network of several thousand ground stations around the world to receive this data that then shows up as aircraft moving on a map in the app. In an expanding number of regions Flightradar24, with the help of multilateration, is able to calculate the positions of aircraft that don’t have ADS-B transponders.\r\n\r\nTraditional radar data is also used in the app thanks to a direct feed from the US Federal Aviation Administration (FAA). This data provides near real-time coverage of all US and Canadian airspace","torrent":{"xt":"urn:btih:6bd50a6451045f2a9497f463596752072266cd45","amp;dn":"Flightradar24+6.5.0+%28ipa%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6bd50a6451045f2a9497f463596752072266cd45","infoHashBuffer":{"type":"Buffer","data":[107,213,10,100,81,4,95,42,148,151,244,99,89,103,82,7,34,102,205,69]},"announce":[],"urlList":[]}}