{"title":"Principia Discordia","uid":6102656,"size":2549253,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6d28d7cf56c26dd99752b0cafc1b14865846e660&amp;dn=Principia+Discordia&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rukahu","files":1,"time":1295035109,"description":"Principia Discordia is a Discordian religious text written by Greg Hill (Malaclypse The Younger) and Kerry Thornley (Omar Khayyam Ravenhurst). It was originally published under the title &quot;Principia Discordia or How The West Was Lost&quot; in a limited edition of 5 copies in 1965. The name, meaning &quot;The Principles of Strife&quot;, deviates from correct Latin which would read Principia DiscordiÃƒÂ¦. The Principia is widely regarded as one of the most important Discordian works ever written.\n\nThe Principia describes the Discordian Society and its Goddess Eris, as well as the basics of the POEE denomination of Discordianism. It features typewritten and handwritten text intermixed with clip art, stamps, and seals appropriated from other sources, possibly in violation of copyright laws.\n\nWhile the Principia is full of literal contradictions and unusual humor, it contains several passages which propose that there is serious intent behind the work, for example a message scrawled on page 00075: &quot;If you think the PRINCIPIA is just a ha-ha, then go read it again.&quot;\n\nThe Principia is quoted extensively in and shares many themes with the science fiction book The Illuminatus! Trilogy by Robert Shea and Robert Anton Wilson. While Wilson was not directly involved in writing the Principia, both the letter signed &quot;Mad Malik&quot; and the stamps used were his.\n\n","torrent":{"xt":"urn:btih:6d28d7cf56c26dd99752b0cafc1b14865846e660","amp;dn":"Principia+Discordia","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d28d7cf56c26dd99752b0cafc1b14865846e660","infoHashBuffer":{"type":"Buffer","data":[109,40,215,207,86,194,109,217,151,82,176,202,252,27,20,134,88,70,230,96]},"announce":[],"urlList":[]}}