{"title":"Active Desktop Calendar 7.88 Build 091229 (32 and 64 bit)","uid":5287800,"size":10379319,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6d33885b60abdb6fe16e4f03875004002a7b1581&amp;dn=Active+Desktop+Calendar+7.88+Build+091229+%2832+and+64+bit%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"InjuredMonkeys","files":5,"time":1263780084,"description":"Active Desktop Calendar 7.88 Build 091229\n32 and 64 bit\n\t \nComes with world clock screen saver that shows your computer's system time, plus five major time zones around the world.\n\nThis software will bring the calendar on your desktop.This fully customizable calendar with notes, tasks, alarms and contacts provides seamless integration and interactivity with the desktop background. You can organize your data in layers and share them with other people on a local area network.\n\nThe program can integrate with Outlook to show its appointments and tasks on the desktop. Preset calendars with holidays for many different countries are included with the program. There are options for changing calendar icons, fonts and colors, marking weekdays of choice and marking dates with notes and/or alarms.\n\nYou can have a text only version of the calendar and choose between displaying one, two or three months on the desktop. More than 250 icons divided in 9 categories are available for marking notes.\n\n\nRecurrence patterns are available for both notes and alarms. An alarm can be stand alone or attached to a note. If interactive desktop option is enabled the program accepts direct clicks on dates, notes and tasks displayed on the desktop.\n\nYou can set each note to have normal, private or invisible desktop view. Private notes are displayed as generic text reminder only and invisible notes are not displayed on the desktop at all.\n\nGoogle Calendars are supported through direct connection with their iCal addresses. Special desktop pictures option will let you add some of your pictures to existing desktop background.\n\nFor importing and exporting calendar data, the program supports iCal and comma separated values CSV formats. Tablet PC users should not worry as the program detects desktop orientation changes automatically.\n\nActive Desktop Calendar comes with world clock screen saver that shows your computer's system time, plus five major time zones around the world.\n\nHere are some key features of &quot;Active Desktop Calendar&quot;:\n\nÃ‚Â· Blends data with desktop wallpaper\nÃ‚Â· Calendar, notes, tasks, alarms, contacts\nÃ‚Â· Many recurrence patterns for notes/alarms\nÃ‚Â· Interactive desktop interface\nÃ‚Â· Fully customizable (icons, fonts, colors)\nÃ‚Â· Data export/import/print (CSV, iCal supported)\nÃ‚Â· Each user profile has its own data set\nÃ‚Â· Detects Tablet PC desktop orientation\nÃ‚Â· Dual/multi monitor systems supported\nÃ‚Â· Group calendar data in layers\nÃ‚Â· Share data layers on a local area network\nÃ‚Â· Direct connection with Outlook\nÃ‚Â· Google calendar support\n\nRequirements:\n\nÃ‚Â· 32 MB RAM","torrent":{"xt":"urn:btih:6d33885b60abdb6fe16e4f03875004002a7b1581","amp;dn":"Active+Desktop+Calendar+7.88+Build+091229+%2832+and+64+bit%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d33885b60abdb6fe16e4f03875004002a7b1581","infoHashBuffer":{"type":"Buffer","data":[109,51,136,91,96,171,219,111,225,110,79,3,135,80,4,0,42,123,21,129]},"announce":[],"urlList":[]}}