{"title":"Sexually Broken--Tiny Emma Haize bound and fucked by 2 cocks, di","uid":10328683,"size":1957626350,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:6d7ff2e481b95c36a11ce6497ffc7b713537dd83&amp;dn=Sexually+Broken--Tiny+Emma+Haize+bound+and+fucked+by+2+cocks%2C+di&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"merzedes","files":-1,"time":1402387431,"description":"\n\nTiny Emma Haize gets tightly bound and fucked hard by 2 big cocks, dicked down by 10 inch BBC! | Emma Haize | Matt Williams\n\nJune 9, 2014\n\n\niPod, Low and High bitrate MP4 + Pics.\n\n\nTiny little blonde pixie Emma Haize is cute as a button. You can't be that cute and not expect to get stuffed full of dick until your eyeballs bulge. Her blonde hair is in pigtails, and make perfect handles to guide her mouth hole onto the cock. Despite how innocent this little angelface might appear, the true it that she is a filthy slut that craves bondage and rough sex. Lucky for her, that is exactly what Sexuallybroken specializes in.\n\nWe start off with having Emma put on a leather blindfold. It is always fun when they assist in their own destruction. Then we quickly bind her arms behind her back. That is all it takes. Emma is now reduced to a cockshealth for our use. And use her we do. Dropping this throat slut down to her knees, we make full use of her face. One after another the cocks sink in balls deep, reshaping her mouth until it is custom fitted.\n\nIt is a relentless frenzy of dick. We never let up, never slow down, one or two cocks is firmly lodged in a hole at all times. Between the bondage, the dick and the vibrator, Emma is blasted deeply into subspace, and we are only getting started. We ragdoll fuck her all over the stage before moving her on top of our handy fuck stool. It is time to finish this slut off.\n\nOnce we have her tied down on top of the stool, it is on. Bound in a back breaking position with both ends deliciously exposed, Emma is truly fucked. We stuff her full to the brim until she is a drooling mess. The more she suffers the hotter she gets. Once we have fucked the wings right off this little pixie, we leave her broken and babbling, still bound on our fuck stool. Welcome back to Sexuallybroken dear... \n \nScreens &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2014/06_09ehaize/SexuallyBroken-Emma-Haize-Matt-Williams-Tiny-Emma-Haize-gets-tightly-bound-and-fucked-hard-by-2-big-cocks-dicked-down-by-10-inch-BBC.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2014/06_09ehaize/SexuallyBroken-Emma-Haize-Matt-Williams-Tiny-Emma-Haize-gets-tightly-bound-and-fucked-hard-by-2-big-cocks-dicked-down-by-10-inch-BBC.php&lt;/a&gt;\n\n14 000 down, but how much more to come ?? You decide ;) \n\nThe more you appreciate it, the more we want to do it. Can we get to 15k ??? \n\nWell, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:6d7ff2e481b95c36a11ce6497ffc7b713537dd83","amp;dn":"Sexually+Broken--Tiny+Emma+Haize+bound+and+fucked+by+2+cocks%2C+di","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d7ff2e481b95c36a11ce6497ffc7b713537dd83","infoHashBuffer":{"type":"Buffer","data":[109,127,242,228,129,185,92,54,161,28,230,73,127,252,123,113,53,55,221,131]},"announce":[],"urlList":[]}}