{"title":"Black Books Series 1-3 with audio commentaries and DVD extras","uid":9884518,"size":11206588700,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6da671f8c2d5381a37e9f39894f7e9115737ad37&amp;dn=Black+Books+Series+1-3+with+audio+commentaries+and+DVD+extras&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":5,"uploader":"Sanicle","files":46,"time":1396577090,"description":"After months of searching, collating, quality testing and, in a number of cases, remuxing files, I present what I consider the most definitive collection of Black Books on the internet. All content has been named in compliance with the episode numbers listed on thetvdb.com, in order to make them 100% media center ready.\n\nMAIN CONTENT\nThis collection includes all episodes in English, complete with subtitle files. Seasons one and two include audio commentary, toggleable within windows media player, VLC, XBMC and other popular media players. Season three, sadly, was released on DVD without an audio commentary, so it is in regular English only.\n\nADDITIONAL FEATURES\nOuttakes for all three seasons are included. All deleted scenes as released on the DVDs are included. Teasers for seasons two and three are included, as featured on their predecessors DVDs. The additional featurettes &quot;Black Dolls&quot; and &quot;Bernards Letter&quot; are included.\n\nCONTENT NOT INCLUDED\nPhoto galleries for seasons two and three were released on their DVDs, but as I consider these to be of niche interest, I chose to not include them for the sake of a more fully seeded and maintained torrent. This is also true of the per episode bloopers for season three. These have instead been collated into a single file.\n\nShould there be a demand for these features, they will be released at a later date as a separate torrent. If this happens, I will post it as a comment below this torrent.","torrent":{"xt":"urn:btih:6da671f8c2d5381a37e9f39894f7e9115737ad37","amp;dn":"Black+Books+Series+1-3+with+audio+commentaries+and+DVD+extras","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6da671f8c2d5381a37e9f39894f7e9115737ad37","infoHashBuffer":{"type":"Buffer","data":[109,166,113,248,194,213,56,26,55,233,243,152,148,247,233,17,87,55,173,55]},"announce":[],"urlList":[]}}