{"title":"Listary Pro v5.00.2410","uid":15511657,"size":3445169,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6dd071de264b066bf561379e284e186aa1dafce9&amp;dn=Listary+Pro+v5.00.2410&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"LxByte","files":1,"time":1470660360,"description":"Listary Pro v5.00.2410\r\n\r\nListary is a revolutionary search utility for Windows\r\nthat makes finding your files and launching applications blazing fast, for casual and power users alike!\r\n\r\nWith Listary you’ll never have to go through the tedious process of browsing through folders, looking for the right file names and hunting through Windows’ limited menus ever again.\r\n\r\nListary puts smart search technology at your fingertips so you can keep working without dealing with cumbersome native Windows navigation.\r\n\r\nWith a lightweight interface that doesn’t bog your system down and strain system resources, Listary puts Windows Explorer on steroids.\r\n\r\nFor power users, Listary integrates with your favorite tools such as Total Commander, Directory Opus, XYplorer, Xplorer2, WinRAR, FileZilla and many more!\r\nWith just a few clicks you can quickly and easily:\r\n\r\nSearch the entire disk drive from any window or folder\r\nQuickly find any file you need with a few short key strokes\r\nInstantly find &amp; launch programs with a quick keyboard command\r\nCopy or move files to any folder from any folder with easy context menu commands\r\nOpen a file with a specific program from anywhere\r\nInstantly jump from file manager to a target folder with a simple key command\r\nCreate a Favorites list of commonly used files and apps for fast access\r\nRight-Click any search result for a robust Action+Context menu\r\nQuickly browse your recent app and file history to continue working where you left off\r\nSearch the web with Listary’s keyword query engine\r\n\r\nOfficial Website: http://www.listary.com/","torrent":{"xt":"urn:btih:6dd071de264b066bf561379e284e186aa1dafce9","amp;dn":"Listary+Pro+v5.00.2410","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6dd071de264b066bf561379e284e186aa1dafce9","infoHashBuffer":{"type":"Buffer","data":[109,208,113,222,38,75,6,107,245,97,55,158,40,78,24,106,161,218,252,233]},"announce":[],"urlList":[]}}