{"title":"De.Dominee.2004.Dvd5.Hollands.Glorie","uid":10524287,"size":4681124744,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6dd52a8e06cb8dbb317bf30ec36c2533c67e1831&amp;dn=De.Dominee.2004.Dvd5.Hollands.Glorie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"hendriknld","files":49,"time":1405024752,"description":"De dominee is een Nederlandse speelfilm uit 2004 van regisseur Gerrard Verhage. De film vertelt het verhaal van Klaas Donkers, een fictieve drugsbaron en hoofd van het grootste misdaadsyndicaat dat ooit in Nederland actief is geweest. De film is gebaseerd op het gelijknamige boek van Bart Middelburg, waarin de opkomst en de ondergang van de Nederlandse drugsbaron Klaas Bruinsma uitvoerig wordt beschreven. De internationale titel is The Preacher.\n\nKlaas, zoon van een gevoelloze maar financieel zeer geslaagd zakenman, besluit zich geheel te wijden aan het handelen van hasj. Hij wil de grootste zijn voordat de hasj gelegaliseerd wordt, wat volgens hem op korte termijn zal gebeuren. Bovenal wil hij zich meten met zijn vader, die hij in alles wil voorbijstreven. Samen met zijn beste maatje de kickbokser Adri en zijn grote liefde Annet lukt het hem de hasjhandel in zijn greep te krijgen. Hij is zelfs even de grootste van Nederland en baadt in geld en luxe. Annet smeekt hem met de handel te stoppen omdat zij gelooft dat deze gevaarlijk is. Klaas wil echter 'nog even doorgaan'. Klaas klampt zich nog steeds vast aan het geloof dat de hasj legaal gaat worden. Maar de hasj wordt niet gelegaliseerd en langzaam maar zeker wordt Klaas gegrepen door het geweld. Hoezeer hij ook meent erboven te kunnen staan. Hij laat zelfs Adri vermoorden wanneer hij deze verdenkt van verraad. Later ontdekt Klaas dat Adri de verrader niet was, maar zijn eigen vriendin: Annet. Als Klaas 's avonds thuis komt treft hij daar een slapende Annet in bed aan. Hij schiet haar in haar slaap dood en steekt vervolgens het huis in brand. Kort daarna wordt Bruinsma's grootste hasjvoorraad (De Grote Berg) ontdekt door de politie. Er moet dus nog een verrader in het spel zijn. Klaas geeft zijn handlangers opdracht alle verdachten te liquideren, zonder enig onderzoek. Kort daarna wordt Klaas zelf geliquideerd. Zijn hebzucht dreef hem naar zijn ondergang.","torrent":{"xt":"urn:btih:6dd52a8e06cb8dbb317bf30ec36c2533c67e1831","amp;dn":"De.Dominee.2004.Dvd5.Hollands.Glorie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6dd52a8e06cb8dbb317bf30ec36c2533c67e1831","infoHashBuffer":{"type":"Buffer","data":[109,213,42,142,6,203,141,187,49,123,243,14,195,108,37,51,198,126,24,49]},"announce":[],"urlList":[]}}