{"title":"Captain America - Theater Of War (2009-2010|Digital+S|MM-PhD+)","uid":10079619,"size":281367079,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:6e19923f21d850cf2725744bf139d7cd8a468579&amp;dn=Captain+America+-+Theater+Of+War+%282009-2010%7CDigital%2BS%7CMM-PhD%2B%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1398978603,"description":"This is a collection of seven one-shots under the &quot;Theater of War&quot; title. They are all related but loosely linked but still should all be read together for best results. Promotional info for the collected edition (referring to only four issues) - &quot;Paul Jenkins brings you four stories chronicling the adventures that made Captain America the hero we know today. From Skinny Steve Rogers at boot camp to the Super-Soldier leading a battlion of men against the Nazis, this is the Captain America you thought you knew but you've never seen. Find out what happens when he's forced to make a choice between his country and his best friend! Then, follow Cap as he experiences one of his darkest days when a WWII mission doesn't go the way anyone planned. Plus, witness how the legacy of the Super-Soldier reverberates through the years in an all-new story set during the height of the Gulf War.&quot;\n\nThe four issues referenced above are all in digital copies from Minutemen-PhD. The remaining three are HQ scans by Minuteman scanners ZonesDiva, DangerZone and DTs. All credits are labeled on the files themselves. Thanks to those groups for their efforts, please seed and enjoy. :-)","torrent":{"xt":"urn:btih:6e19923f21d850cf2725744bf139d7cd8a468579","amp;dn":"Captain+America+-+Theater+Of+War+%282009-2010%7CDigital%2BS%7CMM-PhD%2B%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e19923f21d850cf2725744bf139d7cd8a468579","infoHashBuffer":{"type":"Buffer","data":[110,25,146,63,33,216,80,207,39,37,116,75,241,57,215,205,138,70,133,121]},"announce":[],"urlList":[]}}