{"title":"iCare Data Recovery Pro 7.8.2.0","uid":12679798,"size":4718577,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6e96b0045064a88e7c2ddf1a8846b2480abd956e&amp;dn=iCare+Data+Recovery+Pro+7.8.2.0&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"jovo_bih","files":1,"time":1446543632,"description":"*******************************\r\niCare Data Recovery Pro 7.8.2.0\r\n*******************************\r\n\r\nReleased: 03/11/2015 \r\n\r\nData loss won't be your headache! As a comprehensive data recovery solution, iCare Data Recovery can easily recover files from wrong formatted drives, unexpectedly file deletion, raw drive or raw file system, virus attack, partition deleted, software crash etc.\r\nIt can recover any deleted files like photos, documents, mp3, outlook file, presentations, and it also works with any type of storage media like hard drive, removable hard drive, digital cameral sd card, usb drives, ipod, memory card etc. \r\n\r\n\r\nFormat Recovery: Using advanced format searching technology, iCare Data Recovery is able to restore data after formatting when hard disk drive, memory card, usb flash etc. have been reformatted by mistake and need to restore lost data.\r\n\r\nData Recovery off Local &amp; External Drive: This data recovery software uses the most powerful file recovery ability to restore data from various kinds of data storage devices, eg the laptop&amp;destop hard disk drive, external hard disk and more drives no matter what happened that causes the data loss.\r\n\r\nPowerful Data Restore Utility: Recovering data from recycle bin, formatted, deleted, or missing partitions is some of the most frequent data restore ability by iCare Data Recovery. What's more? It also helps you recover data when system crashed, has not formatted error, cannot format partition/card, MBR corrupted, disk repartitioned...\r\n\r\nRecover Data off Various Storage Media: iCare Data Recovery is able to restore data from variuos kinds of digital devices for example: hard disk drive, external disk, usb flash, memory card, cellphone, camera, laptop, desktop.\r\n\r\nRecover Deleted Files Fast Scanning: iCare Data Recovery Free scans 300% faster than other data recovery software to undelete lost files when files have been mistakenly deleted or lost due to virus attack and more.\r\n\r\nRecover files from Memory Card: It works for various kinds of memory card recovery including SD Card, MicroSD, SDHC, CF (Compact Flash) Card, xD Picture Card, Memory Stick and more. When memory card has data loss, all you need to do is to use this program to recover formatted, deleted, even corrupted memory card files.\r\n\r\nSupported Operating Systems: Windows 10/8/7/Vista/ XP/2000 Pro; Windows Server 2008/2003/2012\r\n\r\nHomepage http://www.icare-recovery.com/","torrent":{"xt":"urn:btih:6e96b0045064a88e7c2ddf1a8846b2480abd956e","amp;dn":"iCare+Data+Recovery+Pro+7.8.2.0","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e96b0045064a88e7c2ddf1a8846b2480abd956e","infoHashBuffer":{"type":"Buffer","data":[110,150,176,4,80,100,168,142,124,45,223,26,136,70,178,72,10,189,149,110]},"announce":[],"urlList":[]}}