{"title":"Indian [Hindustani] (1996) subtitles 85 languages","uid":16044649,"size":5672970,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:6ebfeab48e8ae394faa57e25ec015b964f05775d&amp;dn=Indian+%5BHindustani%5D+%281996%29+subtitles+85+languages&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"asc11","files":1,"time":1476550817,"description":"Senapathi, a young extremist, and Amiratham, a young woman who believes in [Naxalite], are both part of the marathon struggle for independence, sharing the same goal: to see India free from the clutches of the British.\r\n  When Amiratham and other women are stripped naked for burning British goods, Amiratham contemplates suicide. But Senapathi stops her by assuring her that he will soon tie the knot with her. Soon after India gains independence, in 1947, Senapathi weds Amiratham. She gives birth to a boy, Chandrabose, and a girl, Kasturi.\r\n  Years pass. Chandrabose leaves home, since Senapathi refuses to pay a bribe for a job for Chandrabose. Within a few months, Kasturi receives burns in an accidental fire and dies because Senapathi will not pay the doctor a bribe.\r\n  The ferocious rebel in Senapathi resurges after Kasturi's death. He kills Inspector Vao, Corporation Commissioner, and warns the public that a similar end awaits others if they demand bribes.\r\n  Meanwhile, Chandrabose bribes the Road Transport Office officials and becomes an R.T.O. inspector. One day, he accepts a 5000-Rupee bribe for issuing a false certificate to a vehicle owner. Unfortunately, the vehicle causes an accident, killing 40 school children.\r\n  When Senapathi learns of his son's involvement in the accident, will he spare his own son's life, or continue his mission against corruption and become a national role model, a true Indian?\r\n\r\nSee www.imdb.com/title/tt0116630/reviews .\r\n\r\n\r\n##### ~85 COMPUTER-TRANSLATED SUBTITLE SETS #####\r\n\r\n\r\nThe movie is here: \nhttps://thepiratebay.org/torrent/6699878/HINDUSTANI__1996__DVDRip__3CD_Xvid_AC3_Subs__\r\n\r\nTry downloading it, even if the torrent page shows zero seeds","torrent":{"xt":"urn:btih:6ebfeab48e8ae394faa57e25ec015b964f05775d","amp;dn":"Indian+%5BHindustani%5D+%281996%29+subtitles+85+languages","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ebfeab48e8ae394faa57e25ec015b964f05775d","infoHashBuffer":{"type":"Buffer","data":[110,191,234,180,142,138,227,148,250,165,126,37,236,1,91,150,79,5,119,93]},"announce":[],"urlList":[]}}