{"title":"Vimanarama","uid":5167736,"size":40897675,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:6f70d156861f3113afcf4e20ac7620c92139aaed&amp;dn=Vimanarama&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"brodahisou","files":-1,"time":1258504082,"description":"Vimanarama is the story of Ali, a young British Asian awaiting the arrival of his unseen arranged marriage. A baby in his family accidentally opens a path to the centre of the Earth, unleashing ancient monsters hell bent on destroying the world. Only the Ultra-Hadeen, a team of ancient and somewhat naive super heroes can stop them.\n\nWritten by Grant Morrison, with art by Philip Bond, and published by the Vertigo imprint of DC Comics.\n\nThe story is a Jack Kirby-like (in particular his ancient astronaut series Eternals) take on ancient Indian tales, for example the Vedas (a vimana as a flying plane, for example) and Mahabharata. It also has an Arabian Nights-style romance mixed with a large dash of psychedelia and general oddness.\n\nMorrison has said that the idea arose after 9-11 when his research into Islam led him on to the ancient epic tales of the Indian subcontinent and some of the more speculative theories of people like David Hatcher Childress. He states: &quot;I just liked the idea of taking all the pomp and high holiness of one of the world's great religions...and turning it into a Jack Kirby comic.&quot;\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:6f70d156861f3113afcf4e20ac7620c92139aaed","amp;dn":"Vimanarama","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f70d156861f3113afcf4e20ac7620c92139aaed","infoHashBuffer":{"type":"Buffer","data":[111,112,209,86,134,31,49,19,175,207,78,32,172,118,32,201,33,57,170,237]},"announce":[],"urlList":[]}}