{"title":"Soda Stereo - Rex Mix (EP) (1991) WMA320","uid":6116489,"size":101537829,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:70a934f47c55a670f248732b15074282f6ecd98d&amp;dn=Soda+Stereo+-+Rex+Mix+%28EP%29+%281991%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1295572569,"description":"De los shows en el Gran Rex surgiÃƒÂ³ el EP Rex Mix (1991) que incluÃƒÂ­a versiones en vivo grabadas en el ÃƒÂºltimo de esos recitales, en la noche del 9 de julio de 1991, y versiones remixadas junto al tema nuevo &quot;No necesito verte (para saberlo)&quot;.\n\nLa Avenida 9 de Julio en Buenos Aires. AllÃƒÂ­ Soda Stereo realizÃƒÂ³ un histÃƒÂ³rico recital gratuito para 250.000 personas el 14 de diciembre de 1991, la mayor cantidad jamÃƒÂ¡s reunida en el paÃƒÂ­s para escuchar mÃƒÂºsica.El 14 de diciembre de 1991 se produjo el histÃƒÂ³rico recital de la Avenida 9 de Julio, en Buenos Aires. Soda Stereo sorprendiÃƒÂ³ y se vio sorprendido reuniendo a doscientas cincuenta mil personas (hay quienes dicen quinientas mil) para escuchar a la banda en el marco del ciclo de recitales gratuitos realizados por la Municipalidad de Buenos Aires llamados Mi Buenos Aires Querido II, que ademÃƒÂ¡s fue televisado en directo. Se trata de la mayor reuniÃƒÂ³n de personas de la historia argentina para escuchar mÃƒÂºsica,[cita requerida] relegando al segundo lugar a Luciano Pavarotti que reuniÃƒÂ³ a doscientas mil personas ese aÃƒÂ±o en ese mismo lugar, convirtiÃƒÂ©ndose en uno de los pocos grupos de rock del mundo y el ÃƒÂºnico de habla hispana en lograr un hecho de tal magnitud.\n\nLa gente bailÃƒÂ³ enloquecida cada tema y los mÃƒÂºsicos fueron captados por una sensaciÃƒÂ³n de haber llegado a lo mÃƒÂ¡ximo, de que ya no quedaba nada por conquistar. Ã‚Â«Aquello de la 9 de Julio fue una energÃƒÂ­a muy fuerteÃ‚Â», suele recordar Bosio, Ã‚Â«y gracias a Dios nos pasÃƒÂ³ en nuestra ciudad. Creo que fue una suma de factores lo que nos llevÃƒÂ³ a sentir que ya no quedaba nada por conquistar...Ã‚Â»\nTras ese furor sobrevino un perÃƒÂ­odo de dispersiÃƒÂ³n. Cerati explicaba por entonces:\n\nEs muy difÃƒÂ­cil encontrar objetivos claros despuÃƒÂ©s de semejante recepciÃƒÂ³n. Estar parado ante tanta gente que corea tu nombre es una experiencia muy fuerte. Ahora hay que empezar de nuevo desde abajo.\n\nEn ese momento Cerati comenzÃƒÂ³, paralelamente a su trabajo con Soda, la producciÃƒÂ³n de un ÃƒÂ¡lbum en conjunto con Daniel Melero, Colores Santos, el cual contÃƒÂ³ con aportes de mÃƒÂºsicos invitados como Flavio Etcheto y Carola Bony.\n\npor WIKIPEDIA\n\nTRACKLIST:\n\n01 - Hombre Al Agua.wma                                          \n02 - No Existes.wma                                              \n03 - En Camino (Viva La Patria Mix).wma                          \n04 - No Necesito Verte (Para Saberlo).wma                        \n05 - No Necesito Verte (Para Saberlo) (Krupa Mix).wma            \n06 - En Camino (Veranek Mix).wma                                 \n07 - No Necesito Verte (Para Saberlo) (Candombe Mix).wma \n\nWMA 320Kbps 44100Hz STEREO\n\ndedicado a SEEDKEY","torrent":{"xt":"urn:btih:70a934f47c55a670f248732b15074282f6ecd98d","amp;dn":"Soda+Stereo+-+Rex+Mix+%28EP%29+%281991%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70a934f47c55a670f248732b15074282f6ecd98d","infoHashBuffer":{"type":"Buffer","data":[112,169,52,244,124,85,166,112,242,72,115,43,21,7,66,130,246,236,217,141]},"announce":[],"urlList":[]}}