{"title":"Slaughterhouse: The Shocking Story Inside U.S. Meat Industry","uid":7810684,"size":2493611,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:70aebaa6a7c05391ae8e52f046358a30dbd68bec&amp;dn=Slaughterhouse%3A+The+Shocking+Story+Inside+U.S.+Meat+Industry&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1352522876,"description":"Slaughterhouse: The Shocking Story of Greed, Neglect, and Inhumane Treatment Inside the U.S. Meat Industry By Gail A. Eisnitz\n2006 | 328 Pages | ISBN: 1591024501 | EPUB + MOBI | 2 MB + 3 MB\n\n\n\n&quot;Slaughterhouse&quot; is the first book of its kind to explore the impact that unprecedented changes in the meatpacking industry over the last twenty-five years - particularly industry consolidation, increased line speeds, and deregulation - have had on workers, animals, and consumers. It is also the first time ever that workers have spoken publicly about what's really taking place behind the closed doors of America's slaughterhouses. In this new paperback edition, author Gail A Eisnitz brings the story up-to-date since the book's original publication. She describes the ongoing efforts by the Humane Farming Association to improve conditions in the meatpacking industry, media exposes that have prompted reforms resulting in multi-million dollar appropriations by Congress to try to enforce federal inspection laws, and a favourable decision by the Supreme Court to block construction of what was slated to be one of the largest hog factory farms in the country. Nonetheless, Eisnitz makes it clear that abuses continue and much work still needs to be done.\n","torrent":{"xt":"urn:btih:70aebaa6a7c05391ae8e52f046358a30dbd68bec","amp;dn":"Slaughterhouse%3A+The+Shocking+Story+Inside+U.S.+Meat+Industry","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70aebaa6a7c05391ae8e52f046358a30dbd68bec","infoHashBuffer":{"type":"Buffer","data":[112,174,186,166,167,192,83,145,174,142,82,240,70,53,138,48,219,214,139,236]},"announce":[],"urlList":[]}}