{"title":"The Diversity Illusion (2013) by Ed West","uid":10507144,"size":388340,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:710ff2528b124974a24b97c72030ba013038eb88&amp;dn=The+Diversity+Illusion+%282013%29+by+Ed+West&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":-1,"time":1404790461,"description":"The Diversity Illusion - What We Got Wrong About Immigration &amp; How to Set it Right (2013) by Ed West.epub\n\n2002 - ICM Research polling for the BBC: 47 per cent of white Britons believed immigration had damaged British society (a belief shared by 22 per cent of black and Asian Britons) and 28 per cent believed it had benefited it. 2012 - YouGov polling for the Sunday Times: 11 per cent of people believe that immigration in the past decade has been 'a good thing for Britain' - 67 per cent think it has had a negative effect. Not only does a clear majority of the British public now seem to want immigration all but stopped, it has become hugely ambivalent even about multiculturalism, post-war immigration and the very idea of 'diversity'. How could this happen? In this ground-breaking analysis, Ed West investigates who is responsible for Britain's current state of affairs and why mass immigration has never been put to the vote. He uncovers mismanagement throughout a fifty-year state of denial by the British establishment on both the left and the right, and two recent governments increasing immigration for electoral advantage. Ed West compellingly argues that Britain should face up to the real impact of immigration against the mounting concerns - even on the Left - about its consequences. The picture of modern Britain he paints is a forceful warning to stop subscribing to the diversity illusion.\n\n288 pages\nPublisher: Gibson Square Books Ltd (March 5, 2013)\nLanguage: English\nISBN-10: 1908096055\nISBN-13: 978-1908096050","torrent":{"xt":"urn:btih:710ff2528b124974a24b97c72030ba013038eb88","amp;dn":"The+Diversity+Illusion+%282013%29+by+Ed+West","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"710ff2528b124974a24b97c72030ba013038eb88","infoHashBuffer":{"type":"Buffer","data":[113,15,242,82,139,18,73,116,162,75,151,199,32,48,186,1,48,56,235,136]},"announce":[],"urlList":[]}}