{"title":"Hutcheson &amp; McDonald - Lemming Conspiracy - How to Redirect ","uid":7046524,"size":727444,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7179b33872dc11d31328f934c241d6e3a2581327&amp;dn=Hutcheson+%26amp%3B+McDonald+-+Lemming+Conspiracy+-+How+to+Redirect+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"red_gonzo","files":1,"time":1329772850,"description":"This is Don Hutcheson's and Bob D. McDonald's amazing book The Lemming Conspiracy - How to Redirect Your Life from Stress to Balance (1997) which effectively addresses the critical issue of our lives - attaining balance. In the legend, Lemmings are the small arctic mammals known as lemmings band together from time to time and, running in vast herds, throw themselves over cliffs to their deaths. As a metaphor, it seems to describe how too many of us live our lives. The pressure to achieve on the job usually undermines efforts to create a fulfilling life at home. And, even as personal pursuits are sacrificed to &quot;get ahead&quot;, many people wonder if they are traveling down the wrong career path. Based on the principles of the authors' highly successful career counseling program, this fascinating book demonstrates how readers can take control of their lives, rectify career dissatisfaction, and avoid burnout. The Lemming Conspiracy offers practical approaches and useful tools to rediscover how to bring our whole selves to work. The authors remind us that there are many transitions in our lives and each brings an opportunity to discover a deeper sense of meaning and purpose. It is a powerful guide to developing a personal vision through self-knowledge and awareness. 245 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:7179b33872dc11d31328f934c241d6e3a2581327","amp;dn":"Hutcheson+%26amp%3B+McDonald+-+Lemming+Conspiracy+-+How+to+Redirect+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7179b33872dc11d31328f934c241d6e3a2581327","infoHashBuffer":{"type":"Buffer","data":[113,121,179,56,114,220,17,211,19,40,249,52,194,65,214,227,162,88,19,39]},"announce":[],"urlList":[]}}