{"title":"Selena Gomez &amp; the Scene - Kiss &amp; Tell (2009) [FLAC]","uid":12390010,"size":336978239,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:71ebe6978bf6956af2a71938c6a142cf3d7b9775&amp;dn=Selena+Gomez+%26amp%3B+the+Scene+-+Kiss+%26amp%3B+Tell+%282009%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"politux","files":16,"time":1441880624,"description":"\n  Selena Gomez &amp; the Scene - Kiss &amp; Tell (2009) [FLAC]\n\n  Genre: Pop\n  Source: CD\n  Codec: FLAC\n  Bit rate: ~ 1,100 kbps\n  Bit depth: 16\n  Sample rate: 44.1 kHz\n\n  01 Kiss &amp; Tell \n  02 I Won't Apologize \n  03 Falling Down \n  04 I Promise You \n  05 Crush\n  06 Naturally\n  07 The Way I Loved You \n  08 More \n  09 As a Blonde \n  10 I Don't Miss You At All \n  11 Stop &amp; Erase \n  12 I Got You \n  13 Tell Me Something I Don't Know\n\n  Selena Gomez's first album under her own name will please the fans she's won as a TV star and vocalist on various Disney-based projects, and it will also make lovers of frothy, fun pop music very happy. Kiss &amp; Tell is a work of near-genius modern pop that shows off Gomez's light but surprisingly soulful vocals in a near-perfect setting. The producers and writing teams involved frame Gomez as a tougher, sassier version of the usual tween pop singer and keep the sappy ballads to a bare minimum. Instead, plenty of songs have her telling off lame boyfriends, tracks joyously detail newfound love affairs, and a good many generally rock out in a manner that might surprise a few people. Indeed, the variety of styles and sounds on the record is pretty impressive. Snappy bursts of punky pop bump up against Latin-influenced dance jams, bubblegummy midtempo ballads sit easily next to spunky new wave rockers, techno-ish dancefloor stompers lead into hopeful love songs, and Gomez is at home singing all of them. She sounds like she could leave the whole pop star world behind and join an emo-pop band on songs like &quot;Crush&quot; and &quot;I Won't Apologize.&quot; Or she could completely embrace the pop star world and top the charts with sweetly sincere and ultra-hooky songs like &quot;I Promise&quot; and frothy trifles like &quot;As a Blonde.&quot; Or she could be the lead singer of the Disney pop-era version of the Go-Go's. Thanks to the fact that one of the songwriting teams on the record has former Go-Go Gina Schock as a member and thanks to bouncy, peppy songs like &quot;Kiss &amp; Tell,&quot; that's not really too much of a stretch. Probably the best idea for the future is for Gomez to keep making records as diverse and well constructed as Kiss &amp; Tell, keeping the same producers and songwriters on board and maintaining the same smart and sassy attitude she displays throughout. That should keep the tweens and teens happy while impressing and thrilling fans of perfectly constructed capital &quot;P&quot; pop, too","torrent":{"xt":"urn:btih:71ebe6978bf6956af2a71938c6a142cf3d7b9775","amp;dn":"Selena+Gomez+%26amp%3B+the+Scene+-+Kiss+%26amp%3B+Tell+%282009%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71ebe6978bf6956af2a71938c6a142cf3d7b9775","infoHashBuffer":{"type":"Buffer","data":[113,235,230,151,139,246,149,106,242,167,25,56,198,161,66,207,61,123,151,117]},"announce":[],"urlList":[]}}