{"title":"Stalemate (Eve Duncan #7)  By Iris Johansen EPUB EN","uid":9155959,"size":244478,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7239d63b5260f95e2be28f8358f73abbe51a3cc3&amp;dn=Stalemate+%28Eve+Duncan+%237%29++By+Iris+Johansen+EPUB+EN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"perseu","files":-1,"time":1383776841,"description":"Eve Duncan has turned down the job twice already. Her\nskill and devotion in identifying murder victims and helping\nbring their killers to justice may be world-renowned. But Eve\nworks exclusively for law enforcement and the families of the\ninnocent, and the man on the other end of the phone is many\nthings-none of them law-abiding or innocent.One of the world's\nmost wanted men, little is really known about Luis Montalvo\nexcept that he is extraordinarily dangerous and that he never\ntakes no for an answer. Now he wants Eve's help in the worst\nway.\n\nFor he believes they have something in common-and he's\nabout to prove it with a grisly warning.Eve will leave\neverything and everyone behind, even the man she trusts\nand loves the most, Atlanta detective Joe Quinn, to\ntravel to Montalvo's luxurious armed compound in the\nColombian jungle to identify the skull he has recovered.\nShe has agreed to this devil's bargain to save an innocent\nfamily, but also for a reason she can't admit to Joe, to\nthe CIA, to anyone.\n\nFor the man in the jungle has promised to be able to give Eve\nwhat she wants most of all-the key to unlocking the darkest and\nmost painful mystery of her past. But Eve is in more danger than\nshe can imagine. As she gets closer to identifying the skull,\nshe finds herself caught between two ruthless killers with no\nway out. Now, with everything on the line, Eve Duncan must make\nthe most chilling choice of all. And if she's wrong-she's dead.\n\n\n\n\nStalemate (Eve Duncan #7)\nBy Iris Johansen\nLanguage: EN\nPages: EPUB 439","torrent":{"xt":"urn:btih:7239d63b5260f95e2be28f8358f73abbe51a3cc3","amp;dn":"Stalemate+%28Eve+Duncan+%237%29++By+Iris+Johansen+EPUB+EN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7239d63b5260f95e2be28f8358f73abbe51a3cc3","infoHashBuffer":{"type":"Buffer","data":[114,57,214,59,82,96,249,94,43,226,143,131,88,247,58,187,229,26,60,195]},"announce":[],"urlList":[]}}