{"title":"Shakedown (Jack Davis Thrillers) Joel Goldman (Abee)","uid":8980583,"size":443282680,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:723f86b54ee0e8cee66c8e08efb56b1a62ddc39e&amp;dn=Shakedown+%28Jack+Davis+Thrillers%29+Joel+Goldman+%28Abee%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"The_Abee","files":9,"time":1380555420,"description":"Shakedown (Jack Davis Thrillers) Joel Goldman (Abee)\n__\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/512yV1bVUcL.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/512yV1bVUcL.jpg&lt;/a&gt;\n\nAbout:\n__\n\nIf you like the knockout suspense of Michael Connelly and the gritty &quot;who done its&quot; by Linda Fairstein, you'll love Joel Goldman's Shakedown!\n\n&quot;Goldman tells a story at a breakneck pace...&quot;\nKansas City Star\n\n&quot;A killer identified via a fleeting facial expression and behavioral cues turns a middle-agend FBI agent dealing with a disruptive disability into an unexpected hero in Goldman's latest terrific thriller.&quot;\nPublisher's Weekly\n\nWhen FBI Agent Jack Davis investigates a mass murder, a leak of crucial information and his imploding personal life throw him into the ultimate danger zone - where truth lies at the heart of betrayal.\n\nNeed a thrill pill? Take Shakedown and stay up all night!\n\n&quot;Shakedown is a really fine novel. Joel Goldman has got it locked and loaded and full of the blood of character and the gritty details that make up the truth. Page for page, I loved it.&quot;\nMichael Connelly, NYT Bestselling Author\n\n&quot;Shakedown is a chillingly realistic crime novel - it's fast-paced, smartly plotted, and a gripping read to the very last page. Joel Goldman explores - with an insider's eye - a dark tale of murder and betrayal.&quot;\nLinda Fairstein, NYT Bestselling Author\n\nJames Patterson fans - take off on a rocket-fueled suspense ride with Shakedown, the first book in the Jack Davis Thriller series by Joel Goldman.\n\nAfter you catch your breath, grab The Dead Man, the second book in the series. Jack Davis crosses paths with a serial killer inside one of the most advanced research facilities in the world when people start to die exactly as they dreamed they would.\n\nAnd don't miss The Lou Mason Thriller series by Joel Goldman, featuring trial lawyer, Lou Mason.\n\nWhen two of his partners are killed, corruption, sex and murder fill trial lawyer Lou Mason's docket as he tracks the killer. Will Lou be the next victim? Found out in Motion To Kill, the action-packed, can't-put-it-down first book in the Lou Mason thriller series!\n\nLou Mason is back in The Last Witness and this time it's personal when his surrogate father, Homicide Detective Harry Ryman, arrests his best friend, Wilson &quot;Blues&quot; Bluestone, Jr., for murder. Mason unearths secrets someone will do anything to keep as he closes in on a desperate killer, setting himself up as the next target.\n\nWritten by Joel Goldman \nRead by Kevin Foley \nFormat: MP3 \nUnabridged \n\nPage Numbers Source ISBN: 0786016108\nSimultaneous Device Usage: Unlimited\nPublisher: Joel Goldman (November 25, 2011)\nSold by: Amazon Digital Services, Inc.\nLanguage: English\nASIN: B006EAMZ62\n\n\n\nSee a tiny collection of my torrents. And, find your favorite books there.  ;)\n_____________________________________\n                                                                                  &lt;a href=&quot;\nhttp://thepiratebay.se/user/The_Abee/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/The_Abee/&lt;/a&gt;\n_____________________________________\n\t\t\n\n\n `~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\n  SEED PLEASE, LET OTHERS GET IT TOO. \n `~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\n\n\n                                                     :)__Abee\t\t\t\t\n\t\t\t\t\t\t\t\t\n","torrent":{"xt":"urn:btih:723f86b54ee0e8cee66c8e08efb56b1a62ddc39e","amp;dn":"Shakedown+%28Jack+Davis+Thrillers%29+Joel+Goldman+%28Abee%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"723f86b54ee0e8cee66c8e08efb56b1a62ddc39e","infoHashBuffer":{"type":"Buffer","data":[114,63,134,181,78,224,232,206,230,108,142,8,239,181,107,26,98,221,195,158]},"announce":[],"urlList":[]}}