{"title":"Bonnie_Tyler-Faster_Then_The_Speed_Of_Night-(Retail)-1983-HHI","uid":6940288,"size":68518013,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7246970c04a2b6e8a3f75b7151b8e0894df8aab1&amp;dn=Bonnie_Tyler-Faster_Then_The_Speed_Of_Night-%28Retail%29-1983-HHI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"raidy","files":12,"time":1325982890,"description":" Artist......: Bonnie tyler \n Album.......: Faster then the speed of night \n Grabber : EAC \n Encoder : LAME v3.90.3 \n Release Date: 1983 \n Rip Date....: Mar-27-2005 \n Genre.......: Rock \n Quality : VBRkbps / 44.1kHz / Joint-Stereo \n Playtime : 43:14 min \n Ripper : Happy Hacker Industries \n Supplier : HHI \n CD Songs : 09 \n Label.......: Columbia \n Album Info..: \n \n Although she had earned worldwide fame in 1978 with &quot;It's a Heartache,&quot; Bonnie Tyler had trouble building on that success looked as if she were doomed to one-hit wonder status by the early 1980s. However, she returned to prominence in 1983 with Faster Than Speed of the Night, a bombastic opus that took her gift for heartbroken balladry to epic heights. The key to the this album's success is the production and writing chops of Jim Steinman. He applies the same gothic operatic touch that made his work with Meat Loaf so captivating (and successful), wrapping the songs in atmospheric, all-stops-out arrangements that blend drama and power chords in equal measure. The combination of Steinman's cinematic production style with Tyler's smoky vocals made Faster Than the Speed of Night her most successful album. It also spawned a huge hit single in &quot;Total Eclipse of the Heart,&quot; an epic ballad about longing for a lost love that starts as a quiet piano-led piece and builds into a gargantuan production built on an equal balance of power chords and thick choral vocals. The title track, a romantic rocker that blends lighting-fast piano runs with metallic guitar soloing from Rick Derringer, also got a decent amount of radio play. The remainder of the album has Tyler turning her attention to cover versions, including a Phil Spector-styled remake of Bryan Adams' &quot;Straight From the Heart&quot; and a radically rearranged version of &quot;Have You Ever Seen the Rain?&quot; that transforms the song into an arena rock tune built on a complex, classical-styled piano riff from Roy Bittan. The standout among the cover versions is &quot;Tears,&quot; a heart-tugging power ballad that Tyler performs as a duet with its author, Frankie Miller. Since Miller's gruff voice is close in style to Tyler's, their duet has a special chemistry and they milk the song \n for every drop of drama it has to offer. This combination of bombast and melodrama  could have worn thin quickly, but Steinman keeps things moving smoothly by carefully  pacing all the songs and throwing in odd, ear-catching elements to keep things interesting (example: the chanting children's chorus that introduces &quot;Goin' Through the Motions&quot;). All in all, Faster Than Speed of the Night remains Bonnie Tyler's finest and most consistent achievement on record. It's a must for anyone interested in her work and a worthwhile purchase for anyone who enjoys rock at its most melodramatic. \n \n Track Listing....: \n 01.Have you ever seen the rain [04:10] \n 02.Faster than the speed of [06:46] \n night \n 03.Getting so excited [03:32] \n 04.Total eclipse of the heart [07:02] \n 05.It's A jungle out there [04:39] \n 06.Goin' through the motions [04:10] \n 07.Tears [03:51] \n 08.Take me back [05:23] \n 09.Straight from the heart [03:41] \n ____ \n \n 43:14 min \n 65,3 MB","torrent":{"xt":"urn:btih:7246970c04a2b6e8a3f75b7151b8e0894df8aab1","amp;dn":"Bonnie_Tyler-Faster_Then_The_Speed_Of_Night-%28Retail%29-1983-HHI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7246970c04a2b6e8a3f75b7151b8e0894df8aab1","infoHashBuffer":{"type":"Buffer","data":[114,70,151,12,4,162,182,232,163,247,91,113,81,184,224,137,77,248,170,177]},"announce":[],"urlList":[]}}