{"title":"Troubling the Waters: Black-Jewish Relations in America","uid":10397815,"size":1255524,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:727c9b859390d8dcb8bcde0c9148186915f96a55&amp;dn=Troubling+the+Waters%3A+Black-Jewish+Relations+in+America&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":-1,"time":1403296355,"description":"Troubling the Waters - Black-Jewish Relations in the American Century (2006) by Cheryl Lynn Greenberg.pdf\n\nWas there ever really a black-Jewish alliance in twentieth-century America? And if there was, what happened to it? In Troubling the Waters, Cheryl Greenberg answers these questions more definitively than they have ever been answered before, drawing the richest portrait yet of what was less an alliance than a tumultuous political engagement--but one that energized the civil rights revolution, shaped the agenda of liberalism, and affected the course of American politics as a whole.\n\nDrawing on extensive new research in the archives of organizations such as the NAACP and the Anti-Defamation League, Greenberg shows that a special black-Jewish political relationship did indeed exist, especially from the 1940s to the mid-1960s--its so-called &quot;golden era&quot;--and that this engagement galvanized and broadened the civil rights movement. But even during this heyday, she demonstrates, the black-Jewish relationship was anything but inevitable or untroubled. Rather, cooperation and conflict coexisted throughout, with tensions caused by economic clashes, ideological disagreements, Jewish racism, and black anti-Semitism, as well as differences in class and the intensity of discrimination faced by each group. These tensions make the rise of the relationship all the more surprising--and its decline easier to understand.\n\nTracing the growth, peak, and deterioration of black-Jewish engagement over the course of the twentieth century, Greenberg shows that the history of this relationship is very much the history of American liberalism--neither as golden in its best years nor as absolute in its collapse as commonly thought.\n\n368 pages\nSeries: Politics and Society in Twentieth-Century America\nPublisher: Princeton University Press (April 10, 2006)\nLanguage: English\nISBN-10: 0691058652\nISBN-13: 978-0691058658","torrent":{"xt":"urn:btih:727c9b859390d8dcb8bcde0c9148186915f96a55","amp;dn":"Troubling+the+Waters%3A+Black-Jewish+Relations+in+America","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"727c9b859390d8dcb8bcde0c9148186915f96a55","infoHashBuffer":{"type":"Buffer","data":[114,124,155,133,147,144,216,220,184,188,222,12,145,72,24,105,21,249,106,85]},"announce":[],"urlList":[]}}