{"title":"Sexually Broken--THROAT BOARDED!  Hailey Young  Matt Williams MP","uid":7787653,"size":854272658,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:72c4037f7bb7738ad85098dccac4e5959b398f09&amp;dn=Sexually+Broken--THROAT+BOARDED%21++Hailey+Young++Matt+Williams+MP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"merzedes","files":-1,"time":1351942364,"description":"THROAT BOARDED! Hailey Young takes the most extreme deep throat fucking we have ever delivered! | Hailey Young | Matt Williams\n            \nOctober 31, 2012\n\n\nMP4 only.  \n\n\nWelcome the very beautiful Hailey Young to Sexually Broken. \nHailey has that perfect runway model look. Tall, thin, long \nsexy legs, a perfect ass, and the most amazing face and smile \nto go with it.\n\nHailey finds herself bound on the floor leaning against an \nangled 6x6. She is hooded, legs spread and arms tied out. She \nhas no idea about what is going to happen next. We start by \ntaking her tiny nipples and sucking them brutally into a tube. \nHailey cries out, the pain is intense as she feels her nipples \nstretch. Soon they will be 3 to 4 times larger then before. To \nhelp her forget about the pain we turn on the powerful \nvibrator that is locked directly on to her sensitive clit. \nWithin seconds Hailey is close to cumming. We tease her a bit, \nthen make her cum hard.\n\nWe remove the hood, Hailey is trying to catch her breath from \nthe intense orgasm we just ripped out of her helpless body, \nbut before she can adjust her eyes to the bright lights we jam \na hard cock all the way down her tight little throat. We call \nit THROAT BOARDING (It's going to be a thing) it's when you \nhave a head trapped up against a board, and you skull fuck the \nbejesus out of it. There is no place for the victim to go, \nthey must suffer the full brunt of a deep throat fucking, a \nvery scary but exciting feeling for sure.\n\nHailey takes an amazing deep rough face fucking. Amazing \ndoesn't even scratch the surface of describing what she \nendured. The cock slides all the way down her helpless throat \nand stays. She has no way to get air, the cock blocks all \nattempts to breathe. We are ruthless and Hailey somehow \nendures. However at the same time the dildo that impales her \nwith the vibrator locked onto her clit is making her cum at \nthe same time. \n\nUnable to breathe from the throat fucking, Hailey finds that \nit makes her orgasm faster and harder. As she orgasms faster \nand harder. she finds she can't catch her breath, and that \ncauses her to cum again. With the brutal skull fucking \ncombined with the extreme breath play, Hailey is reduced to a \nsucking, cumming shell of a person, that is just deep in \nsubspace that is on automatic survival mode. \n\nAll she knows is cock deep down her throat, uncontrollable \ncumming, and no air to speak of. What is truly amazing about \nthis scene is the endurance of Hailey. She never taps out, \nnever safe words, she just takes it beyond what you think any \nhuman could take. It really is that amazing.\n\nWARNING: This is an extreme deep throating scene. Watch at \nyour own comfort level.\n\nScreens &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/10_31hailey2/SexuallyBroken-Hailey-Young-Matt-Williams-THROAT-BOARDED-Hailey-Young-takes-the-most-extreem-deep-throat-fucking-we-have-ever-delivered.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/10_31hailey2/SexuallyBroken-Hailey-Young-Matt-Williams-THROAT-BOARDED-Hailey-Young-takes-the-most-extreem-deep-throat-fucking-we-have-ever-delivered.php&lt;/a&gt;\n\n8000 uploads and counting, if you like what Shallow2 and I upload, how about leaving us a nice comment below ? :)   \n \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:72c4037f7bb7738ad85098dccac4e5959b398f09","amp;dn":"Sexually+Broken--THROAT+BOARDED%21++Hailey+Young++Matt+Williams+MP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72c4037f7bb7738ad85098dccac4e5959b398f09","infoHashBuffer":{"type":"Buffer","data":[114,196,3,127,123,183,115,138,216,80,152,220,202,196,229,149,155,57,143,9]},"announce":[],"urlList":[]}}