{"title":"Michael G. Thomas - Lords of War (Star Crusades Mercenaries #1)","uid":13110632,"size":153845085,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:73af35bda9d434ddc28a0b727359e70b0c9bd23f&amp;dn=Michael+G.+Thomas+-+Lords+of+War+%28Star+Crusades+Mercenaries+%231%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Cybotage","files":22,"time":1451470607,"description":"Lords of War is the first novel in the best-selling Star Crusades: Mercenaries series that follows the violent struggles of the Alliance, mankind's first interstellar empire.\r\n\r\nSpartan is a living legend, a veteran of the Alliance Marine Corps, victor of a multitude of military campaigns including the horrific Biomech War. He is both loved and reviled by friend and foe alike, and now lives out on the fringes of the Alliance. He has fought for money, for his people and for the very survival of his species, and lost everything in the process. But when two of his closest friends are captured supplying weapons to the desperate Byotai settlers of Karnak, the fight becomes personal.\r\n\r\nThe Great Biomech War left millions dead, colonies burned, and cities turned to ash. Millions more continue to endure in the harshest of conditions. The Alliance attempts to restore order, yet already new enemies have begun to strike at will, encouraged by their weakness. Border planets succumb to the raids of warlords, and many doubt how long the peace will last, after it was won at such cost.\r\n\r\nSince the end of this war, Spartan and his friends have worked to create an elite fighting force based at Taxxu, for use by the Alliance. Using the latest high-energy weapons, armored fighting suits and a prototype Confederate-class warship, it will be a force unlike any the Alliance has seen before. Spartan will use this and every other asset at his disposal to save his friends. Nothing, not even the entire might of the invading Anicinàbe clans and their fearsome clan leaders, can stop him, even if it means starting his own private war.\r\n\r\nStar Crusades: Mercenaries is the third Star Crusades series, and is set in the aftermath of the apocalyptic Biomech War. The war may have been won, but after nine long years the future still looks bleak. Entire planets remain devastated, and millions of citizens are homeless.\r\n\r\n\r\nRead by Steven Morgan\r\nFormat: MP3\r\nBitrate: 48 Kbps\r\nLength: 7 hrs and 2 mins\r\nUnabridged Audiobook\r\nRelease Date:06-25-15\r\nPublisher: Swordworks Books","torrent":{"xt":"urn:btih:73af35bda9d434ddc28a0b727359e70b0c9bd23f","amp;dn":"Michael+G.+Thomas+-+Lords+of+War+%28Star+Crusades+Mercenaries+%231%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73af35bda9d434ddc28a0b727359e70b0c9bd23f","infoHashBuffer":{"type":"Buffer","data":[115,175,53,189,169,212,52,221,194,138,11,114,115,89,231,11,12,155,210,63]},"announce":[],"urlList":[]}}