{"title":"Ip Man 2 (2010|Cantonese edit|no crop/stretch|DVDRip|Eng sub)","uid":5608560,"size":1417845645,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:742116627cf5868b30e1e17b6e8baff8776138e7&amp;dn=Ip+Man+2+%282010%7CCantonese+edit%7Cno+crop%2Fstretch%7CDVDRip%7CEng+sub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"SyCKLe","files":-1,"time":1275720242,"description":"IP MAN 2 (2010) XTM *modified*\n\nPLOT/DESCRIPTION\n================\n\nIn this sequel, Ip Man (Donnie Yen) arrives in Hong Kong in 1949, only to discover that martial arts schools there operated like triads rather than more respectable institutions. His efforts to teach his Wing Chun discipline is fraught with poverty and meets resistance from Master Hung (Sammo Hung), a fellow kungfu master who runs a fish market and is being bullied by the British authorities. However, he takes solace in his bright student Leung (Chen Dao Ming) and his loving, patient wife (Lynn Hung @ Xiong Dai Lin). As conflicts brew and tempers flare, an English boxing champ (Darren Shahlavi) insults the Chinese and challenges the whole establishment to an East vs. West showdown, leaving Master Hung and Master Ip to find themselves possible allies.\n\nDETAILS\n=======\n\nCast.........: Donnie Yen Chi Tan, Sammo Hung Kam Bo, Lynn Xiong Dai Lin, Fan Siu Wong, Gordon Lam Ka Tung, Darren Shahlavi, Kent Cheng Jak Si, Tommy Sik Siu Lung, Huang Xiao Ming, To Yue Hong\nDirected by..: Wilson Yip  Wai Shun\nRuntime......: 01:43:23\nAlso Known As: Yip Man 2\nCountry......: China, Hong Kong\nYear.........: 2010\nLanguage.....: Cantonese\nSubtitles....: English (srt by EvilAbbot)\n\nTECHNICAL INFORMATION\n=====================\n\nSource.......: DVD\nFile Format..: AVI\nVideo Codec..: Xvid MPEG-4 Codec\nVideo Bitrate: 1683 kbps\nResolution...: 640x272\nFrame Rate...: 25.000 fps\nAudio Rate...: 48000 Hz\nAudio Codec..: MPEG-1 Layer 3\nAudio Bitrate: 133 kbps\n\nThanx to: XTM, TorrenTGui and ViSiON\n\n\n\nNOTES by SyCKLe\n===============\n\nAfter scouring the Internet for weeks looking for a Ip Man 2 (2010) rip that satisfies my three personal criteria below...\n\n1) CANTONESE audio\n2) Uncropped\n3) Unstretched\n\n... finally, one *FINALLY* makes an appearance... sans Cantonese! Yes, I know. I have groaned like many. But unlike many, I saw instant hope.\n\nThe original rip by XTM that recently made an appearance, &quot;Ip.Man.2.2010.CN.DVDRip.Xvid-XTM&quot;, thankfully has the full, uncropped video (WOOHOO!!!). Unfortunately, it has the much-dreaded full Mandarin audio dubtrack (OUCH!).\n\nTorrenTGui's rip, on the other hand, has its video cropped like ViSiON's version (double OUCH!). Fortunately though, it has the Cantonese track (WOOHOO!!!).\n\nTherefore, at my wit's end (or sheer desperation? You decide), I have taken the liberty to rip out the Cantonese audio, changed the tempo, and spliced the Cantonese dialogue from beginning to end to fit within XTM's version with the Mandarin audio, where only the beginning and end music have been retained in the latter.\n\nI have also included EvilAbbot's subtitle for Ip Man 2, and re-adjusted the timing to sync with the video as well. This is the version I prefer that I feel comes as close as possible to the original... for the moment.\n\nStill, many thanks should go to XTM, TorrenTGui and ViSiON for their generous contribution of this awesome movie! Without the video and audio sources available to work with, none of this would have been possible at all! ;)\n\nENJOY!!! :P","torrent":{"xt":"urn:btih:742116627cf5868b30e1e17b6e8baff8776138e7","amp;dn":"Ip+Man+2+%282010%7CCantonese+edit%7Cno+crop%2Fstretch%7CDVDRip%7CEng+sub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"742116627cf5868b30e1e17b6e8baff8776138e7","infoHashBuffer":{"type":"Buffer","data":[116,33,22,98,124,245,134,139,48,225,225,123,110,139,175,248,119,97,56,231]},"announce":[],"urlList":[]}}