{"title":"Black Sheep- A Wolf In A Sheep's Clothing","uid":5487738,"size":85695682,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:744843c0708ff47e07fad6e922b495c78d35ec89&amp;dn=Black+Sheep-+A+Wolf+In+A+Sheep%5C%27s+Clothing&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"artpepper","files":-1,"time":1270823295,"description":"Black Sheep - A Wolf In Sheep's Clothing (1991)\n\n160 kbps 44 kHz\n\n\n\nA Wolf In Sheep's Clothing is the debut album from Native Tongues Posse affiliate Black Sheep. The album became one of the most popular and acclaimed alternative hip hop albums of the 1990s. \n\nGroup members Mista Lawnge and Dres were praised for their humorous and creative content. In 1998, the album was selected as one of The Source's 100 Best Rap Albums.\n\nPlayfully satirical, witty, and imaginative, A Wolf in Sheep's Clothing introduced one of the freshest talents in early-'90s rap, a self-produced duo who caught the tail end of the Native Tongues family. \n\nThough Dres and Mista Lawnge didn't match the brilliant wordplay of A Tribe Called Quest or De La Soul, their topics were well-chosen, they were presented in a hilarious context, and every song was backed up by strong productions and great rapping. A Wolf in Sheep's Clothing wasn't a comedy record, but it was difficult to tell when the duo were half-serious or half-joking, especially since they were often the objects of their jokes. \n\nThey poked fun at many aspects of black music and culture of the early '90s, everything from the persuasive gangster mentality (&quot;U Mean I'm Not&quot;), obsessions over the Afrocentric viewpoint (&quot;Are You Mad?&quot;), and lewd sex raps (&quot;La Menage&quot;), as well as an amusingly incorrect response to feminism (&quot;L.A.S.M.&quot;). They also dropped a few of the best hip-hop club tracks of the era, the insanely catchy items &quot;The Choice Is Yours (Revisited),&quot; &quot;Try Counting Sheep,&quot; and &quot;Flavor of the Month.&quot; (Another smooth dance tune, &quot;Strobelite Honey,&quot; was dreadfully honest about girls who look better under the lights than upon closer inspection.) \n\nPolar opposites to the ranks of somber political rappers, and deftly counteracting the indulgence and self-seriousness of many alternative groups, Black Sheep hit a height with their debut that few hip-hop acts would ever reach. ~ John Bush, All Music Guide \n\n\n\n1. Intro\n2. U Mean I'm Not\n3. Butt...In The Meantime\n4. Have U.N.E. Pull\n5. Strobelite Honey\n6. Are You Mad?\n7. The Choice is Yours\n8. To Whom it May Concern\n9. Similak Child\n10. Try Counting Sheep\n11. Flavor of the Month\n12. La MÃƒÂ©nage\n13. L.A.S.M.\n14. Gimme the Finga\n15. Hoes We Knows\n16. Go to Hail\n17. Black with N.V.\n18. Pass the 40\n19. Blunted 10\n20. For Doz that Slept\n21. The Choice is Yours [Revisited]\n22. Yes \n","torrent":{"xt":"urn:btih:744843c0708ff47e07fad6e922b495c78d35ec89","amp;dn":"Black+Sheep-+A+Wolf+In+A+Sheep%5C%27s+Clothing","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"744843c0708ff47e07fad6e922b495c78d35ec89","infoHashBuffer":{"type":"Buffer","data":[116,72,67,192,112,143,244,126,7,250,214,233,34,180,149,199,141,53,236,137]},"announce":[],"urlList":[]}}