{"title":"Bewitching.Attraction.2006.DVDRiP.XVID","uid":4119414,"size":735084544,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:746e8f032669a680ff9832c62bce56805c00edd3&amp;dn=Bewitching.Attraction.2006.DVDRiP.XVID&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"circlensess","files":1,"time":1207475439,"description":"subs http://www.opensubtitles.com/en/subtitles/3094354/yeogyosu-ui-eunmilhan-maeryeok-en\n\nPlot Outline: The story of a beautiful teacher&amp;#039;s love affair with five men.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0778159/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0778159/&lt;/a&gt;\n\nA Nutshell Review: Bewitching Attraction, 7 May 2006\n\nAuthor: DICK STEEL from Singapore \n\nBilled as a romantic sex comedy, Bewitching Attraction is neither full of raunchy sex (ala another movie in town now - Lie With Me), nor is it full of laughs. It&amp;#039;s an acquired taste, with sporadic nudity and sex, and rests its wit in black comedy instead.\n\nStarring Moon So-Ri in the female lead role of textiles professor Eun-suk in a rural town, and Ji Jin-hee as Park Seok-gyu, a comics illustrator turned lecturer, Bewitching Attraction relies heavily on the chemistry of its leading cast to carry through a convoluted plot. Eun-suk, a lady with a limp, is extremely promiscuous, having had sex with most of the men in her faculty, possessing with her much influence on the men with her sexuality. An environmental activist, she also harbours ambitions in branching into television, hence the early sex sequence with a TV show producer - nothing much really, just full of pumping action.\n\nEnter Seok-gyu into the fray as the new lecturer, and the other folks feel threatened with the arrival of the good looker. You&amp;#039;d thought for a minute that the two will hit it off straightaway, but both have this cold shoulder exhibited. The rest of the story deals mainly with the slow revelation of a deep dark secret these two share way back in high school, which involves death in a plot line similar to that of Dorm&amp;#039;s swimming pool. In some sick fashion, I kinda enjoyed(!) the way it was played on screen, it looked horribly realistic.\n\nAnd the black comedy continues from then on, as if both characters are that forbidden alignment of the stars, that when brought together, will cause the tragic demise of those around them. I&amp;#039;ve got to give the movie credit though, that these sequences happen when you least expect it, or if you are expecting it, the delivery will still manage to surprise you for a bit.\n\nAnd is it just me, or does Moon So-Ri look like Michelle Chia from certain angles in the movie? Somehow she looks really to die for at certain angles, while other angles made her look pretty ordinary. You gotta check it out to see what I mean.\n\nBut it&amp;#039;s recommended only if you cannot get tickets to other more worthy summer movies. With the barrage of Korean movies of the same genre lately (dealing with romance), this could possibly be one of the weakest K-offering this season.\n\n\n\n","torrent":{"xt":"urn:btih:746e8f032669a680ff9832c62bce56805c00edd3","amp;dn":"Bewitching.Attraction.2006.DVDRiP.XVID","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"746e8f032669a680ff9832c62bce56805c00edd3","infoHashBuffer":{"type":"Buffer","data":[116,110,143,3,38,105,166,128,255,152,50,198,43,206,86,128,92,0,237,211]},"announce":[],"urlList":[]}}