{"title":"Speakerphone Control Full v1.9.4","uid":6985586,"size":557102,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:747289f06e7239a8e98e9ac235faaf8bc0e4553f&amp;dn=Speakerphone+Control+Full+v1.9.4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"StoneBoyTony","files":-1,"time":1327560099,"description":"Speakerphone Control Full v1.9.4\n\n\nRequires Android: 2.1+ \n\nRelease Date: January 16, 2012\n\n\nDescription\n\nAutomate your speakerphone!\n\n-Separate Speakerphone Volume Control\n\n-Auto Speakerphone\n\n-Positional Speakerphone X 2\n\n-4 Widgets\n\nSpeakerphone Volume Control - A simple tool that allows you to control the speakerphone volume without any effort. When the speakerphone is turned on the volume will adjust to the preset volume automatically! \n\nAuto Speakerphone - Incoming and outgoing calls can be automatically routed through the speakerphone. Perfect for *near* hands free driving.\n\nPositional Speakerphone - Puts phone calls in speakerphone mode when the phone is placed in a preset position of choice. Two different positions can be set. *Speakerphone turns on but is not reflected on the speakerphone button.\n\nWidgets - Four useful widgets to help stay informed of which settings are active.\n\nOption menu for volume adjustment, notifications and setting positions for Positional Speakerphone. Names can be given to each speakerphone position to display within the app and/or when the feature is turned on by a widget.\n\nPlease exclude Speakerphone Control from any TasKillers.\n\nAndroid only provides one 'In-call volume' this app allows you to have two distinct volume controls, the regular phone volume and the speakerphone volume. \n\nThis app has low battery usage, basically the application only runs during phone calls. Widgets naturally use more battery but only run for a fraction of a second, once every 2 days or when tapped.\n\nFind something wrong? Send me an email.\n\n-PERMISSIONS-\nREAD_PHONE_STATE - \nFor knowing when phone call has started and ended. Used by Speakerphone Volume Control, Auto Speakerphone, Positional Speakerphone\n\nMODIFY_AUDIO_SETTINGS -\nAdjusts the volume, used by Speakerphone Volume Control\n\nRECEIVE_BOOT_COMPLETED -\nKnow when phone has just been reset. Used to fix issues with notifications and in app features swapping after reboots.\n\nVIBRATE -\nProvides vibrations when buttons are pressed.\n\nTags: speakerphone speaker phone volume volumes control controls audio manager audiomanager calls call log contact contacts favorites auto hand hands free handsfree car dock automatic widget widgets vibrate silent loud quiet system position positional orientation orientate flip car dock cardock desk sound names toast homedock home doc\n\n\nWhat's in this version:\n\n- 1.9.4 Small bug fix\n- 1.9.3 Big update: positional speakerphone options for multiple uses during a call, huge code cleanup, bug fixes, minor theme adjustments, updated tutorial\n- 1.9.2 Lots of theme adjustments, fixes for hdpi devices, added option for controlling vibrate amount/off\n- 1.9.1 Minor theme adjustment, buttons now have better readability and a more consistent match to Android 4.0\n\n\nEnjoy and Please SeeD :)\n","torrent":{"xt":"urn:btih:747289f06e7239a8e98e9ac235faaf8bc0e4553f","amp;dn":"Speakerphone+Control+Full+v1.9.4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"747289f06e7239a8e98e9ac235faaf8bc0e4553f","infoHashBuffer":{"type":"Buffer","data":[116,114,137,240,110,114,57,168,233,142,154,194,53,250,175,139,192,228,85,63]},"announce":[],"urlList":[]}}