{"title":"Nirvana - Nevermind (1991) WMA320","uid":6139517,"size":168715833,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:747814fd7fcd7eccaa80c19a1957270fa693e0fe&amp;dn=Nirvana+-+Nevermind+%281991%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1296443049,"description":"Nirvana's Nevermind sounds so cliche and overplayed today because a million and one bands have ripped off their innovative sound that molded grunge and rock music for the better. The musicianship of the album isn't complicated for the mostpart, as &quot;Smells Like Teen Spirit&quot; and &quot;Come As You Are&quot; are typical songs for the early guitarist, but the song writing and arrangements are so well done that the need for anything profound and complex is immediately thrown out. Nirvana was a band who were great at what they did, needing only their honesty and emotion to get them across, not flashy 80's solos and glam attire.\nKurt Cobain's guitar work, as stated, was not complex, but was interesting, new, innovative, creative, and original, as he was one of the first artists to begin using the rhythm guitar to lead the melody without the choppy leads of 80's hair metal. His chord progressions are simple and basic for a large portion of the album, but throughout the entire recording his technique stays true to form, using original flowing riffs to carry the song when he does use his instrument as a lead. Kurt Cobain's guitar style has essentially motivated and shaped how the instrument has been used since 1991 and almost all of rock's song writing processes today. In equal impressiveness alongside his guitar skill are Cobain's lyrics and his vocal stylings, which always have an underwritten sense of urgency and need in them, supporting the hurt heard in his voice. Although he did not possess one of the greatest voices in music, and still does not, he used his singing well with the music, fitting the musicianship and instrumentation perfectly.\n\nChris Novoselic's bass lines are upbeat, catchy, and just as sincere as Kurt's guitar playing, his instrument carrying a melody all of its own instead of just following the bass drum and staying in the background, once again breaking away from the rock and metal stylings of the previous decade. Truly standout. Alongside him on the rhythm is Dave Grohl, who should've stuck with the drums instead of moving onto fronting the Foo Fighters in later years and taking up guitar duties. His drumming is solid and top notch on Nevermind, showing him at his best on the instrument he shines with.\n\nStandout tracks in addition to the first six, all of which were hit singles, are &quot;On A Plain&quot; and &quot;Something In The Way&quot;'s acoustic strummings. One of the greatest albums of the 90's. You may think Nirvana is getting a bit old now and the sound too cliche, but try to listen from a perspective when all this was new to the scene and you will feel the truly groundbreaking effect on you it was meant to have. \n\nby A Customer\n\nTRACKLIST:\n\n01 - Smells Like Teen Spirit.wma                                 \n02 - In Bloom.wma                                                \n03 - Come As You Are.wma                                         \n04 - Breed.wma                                                   \n05 - Lithium.wma                                                 \n06 - Polly.wma                                                   \n07 - Territorial Pissings.wma                                    \n08 - Drain You.wma                                               \n09 - Lounge Act.wma                                              \n10 - Stay Away.wma                                               \n11 - On A Plain.wma                                              \n12 - Something In The Way - Endless Nameless.wma\n\nWMA 320Kbps 44100Hz STEREO","torrent":{"xt":"urn:btih:747814fd7fcd7eccaa80c19a1957270fa693e0fe","amp;dn":"Nirvana+-+Nevermind+%281991%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"747814fd7fcd7eccaa80c19a1957270fa693e0fe","infoHashBuffer":{"type":"Buffer","data":[116,120,20,253,127,205,126,204,170,128,193,154,25,87,39,15,166,147,224,254]},"announce":[],"urlList":[]}}