{"title":"Tubular Bells - The Mike Oldfield Story","uid":9049213,"size":667880372,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:74aae274836906a14fd89b8b735b82719c7a1890&amp;dn=Tubular+Bells+-+The+Mike+Oldfield+Story&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":null,"files":1,"time":1381835418,"description":"\n\n\nIn 1973, an album was released that against all odds and expectations went to the top of the UK charts. The fact the album launched a record label that became one of the most recognisable brand names in the world (Virgin), formed the soundtrack to one of the biggest movies of the decade (The Exorcist), became the biggest selling instrumental album of all time, would eventually go on to sell over 16 million copies and was performed almost single-handedly by a 19-year-old makes the story all the more incredible. That album was Tubular Bells, and the young and painfully shy musician was Mike Oldfield.\n\nThis documentary features contributions from Sir Richard Branson, Danny Boyle, Mike's family and the original engineers of the Tubular Bells album among others. The spine of the film is an extended interview with Mike himself, where he takes us through the events that led to him writing Tubular Bells - growing up with a mother with severe mental health problems; the refuge he sought in music as a child, with talent that led to him playing in folk clubs aged 12 and signing with his sister's folk group at only 15; his frightening experience of taking LSD at 16; and finally arriving at the Manor Recording Studios as a young session musician where he gave a demo tape to a recording engineer who passed it along to young entrepreneur Richard Branson. After the album's huge success, Mike retreated to a Hereford hilltop, shunned public life and became a recluse until he took part in a controversial therapy which changed his life. In 2012 Mike captured the public's imagination once again when he was asked to perform at the London Olympic Opening Ceremony, where Tubular Bells was the soundtrack to 20 minutes of the one-hour ceremony.\n\nFilmed on location at his home recording studio in Nassau, Mike also plays the multiple instruments of Tubular Bells and shows how the groundbreaking piece of music was put together.\n\n\nVideo Codec....: H.264\nFrame.Rate.....: 25 FPS\nResolution.......: 832 x 468\nAspect.Ratio....: 16.9\t","torrent":{"xt":"urn:btih:74aae274836906a14fd89b8b735b82719c7a1890","amp;dn":"Tubular+Bells+-+The+Mike+Oldfield+Story","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74aae274836906a14fd89b8b735b82719c7a1890","infoHashBuffer":{"type":"Buffer","data":[116,170,226,116,131,105,6,161,79,216,155,139,115,91,130,113,156,122,24,144]},"announce":[],"urlList":[]}}