{"title":"IconBox Wordpress Plugin","uid":11179145,"size":903297,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:74ab227b1757411e53aad230f747e0e5c1305b77&amp;dn=IconBox+Wordpress+Plugin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"0daywp","files":-1,"time":1412832533,"description":"IconBox is responsive WordPress Plugin, with this plugin you can display informative boxes with icons in grid, carousel slider and list. The plugin contains over 900 web font icons and it support for image icons.\n\nYou can display Icon Boxes in 3 different layouts:\n\n-SLIDER\n\nThe Icon Boxes will displayed in responsive carousel slider and it works well in touch devices, in the plugin settings you can set slider settings such as (transition speed, auto play, Columns Number, Hover effect, Hover effect color, Border, Border Color, Border Radius, Background Color, Order, Order by, Number of items, Buttons arrows color, Font Style, Font Color) and many other settings.\n\n-GRID\n\nThe Icon Boxes will displayed in responsive grid, in the plugin settings you can set grid settings such as (Columns Number, Hover effect, Hover effect color, Border, Border Color, Border Radius, Background Color, Order, Order By, Number of items, Font Style, Font Color) and other settings.\n\n-LIST\n\nThe Icon Boxes will displayed in list, in the plugin settings you can set list settings such as ( Hover effect, Hover effect color, Border, Border Color, Border Radius, Background Color, Order, Order By, Number of items, Font Style, Font Color), and many other settings.\n\nThis pluign perfect to:\n\n- Create a grid of Icon Boxes with links.\n- Display Icon Boxes in grid, carousel slider and list.\n- Any others creative use.\n &lt;a href=&quot;\nhttp://codecanyon.net/item/iconbox-wordpress-plugin/7162756&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://codecanyon.net/item/iconbox-wordpress-plugin/7162756&lt;/a&gt;","torrent":{"xt":"urn:btih:74ab227b1757411e53aad230f747e0e5c1305b77","amp;dn":"IconBox+Wordpress+Plugin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74ab227b1757411e53aad230f747e0e5c1305b77","infoHashBuffer":{"type":"Buffer","data":[116,171,34,123,23,87,65,30,83,170,210,48,247,71,224,229,193,48,91,119]},"announce":[],"urlList":[]}}