{"title":"Robert B. Parker - Cold Service","uid":4789113,"size":414683376,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:75870adf477963f66210ee2eca3641d88897ede4&amp;dn=Robert+B.+Parker+-+Cold+Service&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"g-roid","files":-1,"time":1237652540,"description":"ROBERT B. PARKER\nCold Service\n\nSpenser--&quot;God's gift to the Boston crime scene&quot; (&quot;Kirkus Reviews&quot;)--and his redoubtable sidekick, Hawk, seek revenge on a cold-blooded killer.\n\nWhen his closest ally, Hawk, is brutally injured and left for dead while protecting bookie Luther Gillespie, Spenser embarks on an epic journey to rehabilitate his friend in body and soul. Hawk, always proud, has never been dependent on anyone. Now he is forced to make connections: to accept the medical technology that will ensure his physical recovery, and to reinforce the tenuous emotional ties he has to those around him.\n\nSpenser quickly learns that the Ukrainian mob is responsible for the hit, but finding a way into their tightly knit circle is not nearly so simple. Their total control of the town of Marshport, from the bodegas to the police force to the mayor's office, isn't just a sign of rampant corruption-it's a form of arrogance that only serves to ignite Hawk's desire to get even. As the body count rises, Spenser is forced to employ some questionable techniques and even more questionable hired guns, while redefining his friendship with Hawk in the name of vengeance.\n\n&quot;Few fictional detectives are as endearing-or enduring-as Parker's Spenser, whose intellectual bent and gift for snappy dialogue keep this delightful series cooking on gas.&quot; - &quot;The Tampa Tribune&quot; \n\nROBERT B. PARKER is the author of nearly fifty books. He lives in Boston with his, wife, Joan.\n\nRead by Joe Mantegna\n\nFrom 5 Audio CDs at 160 kbps in MP3 format.\n","torrent":{"xt":"urn:btih:75870adf477963f66210ee2eca3641d88897ede4","amp;dn":"Robert+B.+Parker+-+Cold+Service","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75870adf477963f66210ee2eca3641d88897ede4","infoHashBuffer":{"type":"Buffer","data":[117,135,10,223,71,121,99,246,98,16,238,46,202,54,65,216,136,151,237,228]},"announce":[],"urlList":[]}}