{"title":"Gorillaz - Demon Days (2005) MP3","uid":6048124,"size":122147102,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:767eba8cf834541ca954dc7f70e4d22dc3add356&amp;dn=Gorillaz+-+Demon+Days+%282005%29+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"thedemonbay","files":16,"time":1292630647,"description":"Released: 23.05.05\n\nGorillaz' comeback to worldwide dominance was cemented with the success of their second album proper, Demon Days, released internationally in the summer of 2005.\n\nFeaturing the singles: Feel Good Inc., DARE, Dirty Harry, El MaÃƒÂ±ana/Kids With Guns\n\t\nFormats\n\nCD/LP/MC:\n1. Intro\n2. Last Living Souls\n3. Kids With Guns\n4. O Green World\n5. Dirty Harry\n6. Feel Good Inc.\n7. El MaÃƒÂ±ana\n8. Every Planet We Reach Is Dead\n9. November Has Come\n10. All Alone\n11. White Light\n12. DARE\n13. Fire Coming Out Of The Monkey's Head\n14. Don't Get Lost In Heaven\n15. Demon Days\n\nGoodies &amp; Info\n\nA limited edition run of the album was released featuring a bonus dvd in plastic packaging. The CD itself was packaged in a fold-out digipak, allowing fans to choose which member of the band they wished to feature on the cover. The DVD and liner notes were housed in a separate booklet. The DVD featured exclusive audio track The Swagga, as well as the video, animatic and audio commentary for Feel Good Inc. It also featured two &quot;G Bite&quot; animations, one on the set of the Feel Good Inc. video as well as a shot from their &quot;Talest Quest,&quot; relating to the Search For A Star competition of 2004/5.\n\nFurthermore, the DVD granted online access to exclusive wallpapers and screensavers via the band's website. The limited edition run gave fans a crowbar as part of their website inventory, which could be used to break into a cupboard in Kong Studios, featuring the aforementioned items as well as a further exclusive audio track, Happy Landfill.\n\nCharts\n\nDemon Days smashed previous chart records worldwide for Gorillaz, heading straight in at #1 in the UK and #6 in the USA, and also making a #1 debut in France, Hong Kong, Switzerland and the UAE. It has been to date certified as platinum in the UK, USA and other territories.\n\nArtwork\n\nPromo Photo 1\nPromo Photo 2\n\nWhat They Said\n\n&quot;More sophisticated than their rambunctious debut. - Arena\n&quot;Everything's up for grabs but it works an absolute treat.&quot; - Attitude\n&quot;A ravishing romp with more bite than the walking dead; a monstrously guilty pleasure.&quot; - Clash\n&quot;You're unlikely to hear a better album this year.&quot; - Daily Star\n&quot;Deranged rapping, children's choirs and filthy basement beats... a full on aural assault.&quot; - GQ\n&quot;The album positively leaks melodies. There are gorgeous tunes hiding everywhere.&quot; - Guardian\n&quot;An aural phantasmagoria - funky, playful but sinister like the best childrens stories.&quot; - Mojo\n&quot;An honest overview of the fact that it never really is all about the music, even when the music's this exciting.&quot; - NME\n&quot;Stuffed with tunes... big statements that you can whistle.&quot; - Q\n&quot;A front runner for album of the year.&quot; - The Sun\n&quot;It's a constantly appealing, pop-cultural riot.&quot; - The Times","torrent":{"xt":"urn:btih:767eba8cf834541ca954dc7f70e4d22dc3add356","amp;dn":"Gorillaz+-+Demon+Days+%282005%29+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"767eba8cf834541ca954dc7f70e4d22dc3add356","infoHashBuffer":{"type":"Buffer","data":[118,126,186,140,248,52,84,28,169,84,220,127,112,228,210,45,195,173,211,86]},"announce":[],"urlList":[]}}