{"title":"David Gordon Green - George Washington (2000)","uid":3787878,"size":734237589,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:768f49dcb0c1e7055c7d3d268d5df14b02609fc1&amp;dn=David+Gordon+Green+-+George+Washington+%282000%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clownmonkey","files":3,"time":1188363410,"description":"Finding beauty amid decay and rot, and heroic redemption in a small town haunted by vestiges of hopelessness and death, 25-year-old director David Gordon Green&amp;#039;s astonishing George Washington introduces a major voice in American independent film. In sharp contrast to the visual indifference found in most low-budget fare (worsened by the degraded pallor of the digital-video craze), the film&amp;#039;s picturesque rural landscapes recall Terrence Malick&amp;#039;s Days Of Heaven, as does its dreamy, philosophicalpoetic narration. Comparisons to Harmony Korine&amp;#039;s caught naturalism are also hard to deny, but out of these and other influences, Green has created a new and glorious alchemy, fusing Malick&amp;#039;s rapturous style with a uniquely offbeat and compassionate way of looking at the world. A collection of loosely assembled episodes centered on young, poor, mostly black kids in rural North Carolina, George Washington captures the lazy rhythms of everyday life in a defiled, post-industrial Southern town. (&quot;It looks like two tornadoes come through here,&quot; one boy jokes.) Forced to fend for themselves without parental supervision, the 12- and 13-year-old children have become wise beyond their age, already experiencing adult feelings of love, regret, and longing. When the narrator, a levelheaded little girl played by Candace Evanofski, is asked why she dumped a sweet-natured runt (Curtis Cotton III) for the serious-minded title character (Donald Holden), she replies precociously, &quot;I wanted a more mature man.&quot; An accidental death, made all the more horrific by Green&amp;#039;s casual staging, provides some semblance of a narrative, but only in the subtle ways it alters the tone of the characters&amp;#039; lives. Some feel remorse about the incident, one child is numbed by it, and another interprets it as a call to heroic service for his family, friends, and community. The vignettes in George Washington risk seeming vague and ill-defined -- it&amp;#039;s hard to describe the film without sounding like a stoner -- but Green and his young cast are remarkably laid-back and assured, allowing themes to bubble up naturally from the setting and the performances. The director, who shares screen credit with cinematographer Tim Orr, reportedly spent a large portion of his budget on camera lenses, and his gorgeous Cinemascope images lend warmth and lyricism to an economically depressed environment. George Washington doesn&amp;#039;t downplay the inescapable hardship and tragedy that pervades its setting, but few films offer a more hopeful and transcendent portrait of innocence lost.\n- Scott Tobias, the Onion AV Club  &lt;a href=&quot;\nhttp://www.avclub.com/content/node/4412&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.avclub.com/content/node/4412&lt;/a&gt;\n\n--- File Information ---                                                        \nFile Size (in bytes):                           734,236,672                     \n                                                                                \n--- Container Information ---                                                   \nBase Type (e.g &quot;AVI&quot;):                          AVI(.AVI)                 \nSubtype (e.g &quot;OpenDML&quot;):                        OpenDML (AVI v2.0),                   \nInterleave (in ms):                             42          \nPreload (in ms):                                504       \nAudio alignment(&quot;split across interleaves&quot;):    Aligned         \nTotal System Bitrate (kbps):                    0            \nBytes Missing (if any):                         0            \nNumber of Audio Streams:                        1       \n                                                                                \n--- Video Information ---                                                       \nVideo Codec Type(e.g. &quot;DIV3&quot;):                  xvid              \nDuration (hh:mm:ss):                            01:30:53                \nFrame Count:                                    130743             \nFrame Width (pixels):                           720                  \nFrame Height (pixels):                          320                  \nDisplay Aspect Ratio (&quot;DAR&quot;):                   2.250                     \nFrames Per Second:                              30                    \nVideo Bitrate (kbps):                           955                 \nMPEG-4 (&quot;MPEG-4&quot; or &quot;&quot;):                        MPEG-4                   \nB-VOP (&quot;B-VOP&quot; or &quot;&quot;):                          B-VOP\n \n--- Audio Information ---                       \nAudio Codec (e.g. &quot;AC3&quot;):                       0x0055(MP3, ISO) MPEG-1 Layer 3 \nAudio Sample Rate (Hz):                         48000             \nAudio Bitrate(kbps):                            113                 \nAudio Bitrate Type (&quot;CBR&quot; or &quot;VBR&quot;):            VBR            \nAudio Channel Count (e.g. &quot;2&quot; for stereo):      2           \n\n************************* FREAKYFLICKS **************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing\ncinematic art in the digital era. Our goal is to disseminate such works of art to the\nwidest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional\nrole in the history of cinema and its progression in becoming a great art. Films\nthat are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate\nin our community. All you need do is include this tag in your upload and join us\nat the forum to announce your release.\n\nwww.freakyflicks.tk\t\t","torrent":{"xt":"urn:btih:768f49dcb0c1e7055c7d3d268d5df14b02609fc1","amp;dn":"David+Gordon+Green+-+George+Washington+%282000%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"768f49dcb0c1e7055c7d3d268d5df14b02609fc1","infoHashBuffer":{"type":"Buffer","data":[118,143,73,220,176,193,231,5,92,125,61,38,141,93,241,75,2,96,159,193]},"announce":[],"urlList":[]}}