{"title":"Electric Power Distribution Handbook - (Malestrom)","uid":4815230,"size":11845515,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:775929c122c5ccdd761b581122e30b3853d28488&amp;dn=Electric+Power+Distribution+Handbook+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1238518921,"description":" &lt;a href=&quot;http://www.image-upload.net/images/qndyod40nttjfafzbn6.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/qndyod40nttjfafzbn6.jpeg&lt;/a&gt;\n\nThomas Allen Short, &quot;Electric Power Distribution Handbook&quot;\nCRC | 2003 | ISBN: 0849317916 | 784 pages | PDF \n\nGeneration, transmission, distribution. Of the &quot;big three&quot; components of the electricity infrastructure, distribution typically gets the least attention. Yet, its impact on reliability, quality of service, and society often make distribution the most critical element. Today, deregulation and the emergence of distributed power generation mean it is now more important than ever for utility engineers to have fast access to better information.The Electric Power Distribution Handbook provides that information on the electrical aspects of power distribution systems. It begins with an in-depth look at equipment, applications, and tasks such as choosing transformer connections and sizing and placing capacitors. The focus then shifts to reliability and power quality, reflecting the strong dependence of the reliability of service on distribution systems performance. The author then tackles lightning protection, grounding, and safety, and concludes with a chapter that will help utilities avoid the problems inherent in the introduction of distributed generation.This book is also a comprehensive source for the hard-to-find tables, graphs, methods, and statistics that distribution system engineers need. It includes tips and solutions for solving problems and improving performance, all aimed at delivering the best quality while keeping costs down. In short, the Electric Power Distribution Handbook gives readers the tools they need to understand the science and practices of distribution systems.","torrent":{"xt":"urn:btih:775929c122c5ccdd761b581122e30b3853d28488","amp;dn":"Electric+Power+Distribution+Handbook+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"775929c122c5ccdd761b581122e30b3853d28488","infoHashBuffer":{"type":"Buffer","data":[119,89,41,193,34,197,204,221,118,27,88,17,34,227,11,56,83,210,132,136]},"announce":[],"urlList":[]}}