{"title":"Dave Brubeck &amp; Paul Desmond - The Duets (1975) [Jazz][mp3 192][h","uid":4840575,"size":53813002,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:77cdc2e778ce3964fdc571ee81602792191558cf&amp;dn=Dave+Brubeck+%26+Paul+Desmond+-+The+Duets+%281975%29+%5BJazz%5D%5Bmp3+192%5D%5Bh&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"schon55","files":11,"time":1239483553,"description":"Dave Brubeck &amp; Paul Desmond - The Duets\nOriginal Release Date: June 10, 1975 \nA&amp;M SP-703\nAudio CD: April 9, 2002 \nFormat: Original recording remastered \nLabel: Umvd Labels \nBitrate: 192 kbps\n\nOriginal Album Notes \n \nOver the years, Dave Brubeck and I have started albums in various unlikely places throughout the world, but so far this one is my favorite. We were somewhere in the Atlantic between New York and the Bermuda Triangle, aboard the S.S.Rotterdam as part of one of their semi-annual Jazz Cruises. The group included Dave, myself, and a rhythm section composed mostly of Dave's sons. Our mission was to play two concerts in exchange for room and board, at least for me. \n\nNow it's about half an hour before concert time, and after we've set up the equipment and run through the more complicated numbers, we have about five minutes to get together on a ballad -- not enough time to rehearse the changes with the rest of the troops, who haven't played it before. \n\nInspiration. Look how we're 2000 miles out to sea, everyone's on a holiday, who's to know, why not just do it as a duet? No problems with changes, we worry about the ending when we get there, and we're home free. \n\nWhat happened when we got to it turned out to be kind of mind-blowing.  With just the two of us playing, an almost eerie feeling of freedom occurred which seldom happens when there are other instruments to be considered.  Dave and I have always had a bit of ESP happening musically between us, and this turned out to be the ideal situation in which it could flourish.  All manner of possibilities opened up. I could play a totally illegal note at any point and Dave would instantly come up with a voicing making it sound like the most perfect note imaginable. Counter-lines, quiet, reflective musings, unabashed romantic wailing -- everything worked. On the second concert we did another ballad the same way and the same feeling happened. Then we did a third concert, just for the ship's crew ( partly a Noble Gesture on our part and partly because Peter Flynn, the road manager, was looking to get next to one of the ship's nurses ). We played &quot;You Go To My Head&quot; -- same way, same feeling, and the loosest and most relaxed of the three. \n\nDuring all this, BBC-TV was filming and taping all the concerts for a British TV series.  Later we listened to the tape, a bit apprehensively because things that feel good while you're playing don't always work out on tape.  But by God it sounded good.  Rough, a few honest mistakes -- nevertheless, the emotional quality was there. \n\nAfter a few days of mourning the fact that somehow we'd never stumbled into doing a duet in all the years we spent together, we resigned ourselves to the fact that the duets would become a sort of footnote, heard only by the passengers and crew of the Rotterdam and possibly by audiences at future concerts Dave and I might play with various groups. \n\nThen, a few weeks later, we realized that we were both momentarily between record contracts, which occurs about as often as a solar eclipse. So the first time Dave and I were both in New York at the same time ( about as often as a lunar eclipse ), we went into a studio for two days. And here's the album. \n\nThe tunes are listed elsewhere -- mostly things Dave and I have been playing over the years, except this time there ain't but the two of us. \n\nOne number in particular -- &quot;Koto Song&quot; -- is a more spaced-out version than formerly, the approach being to make random sounds for a while and wander gradually into the melody. ( The percussive sounds at the beginning, for those of you out there who are curious, are made by closing keys on the horn without blowing into it -- one of several things I've wanted to try for years but somehow never got around to. I mention this mainly because in this day and age many unusual sounds are produced electronically and are pretty much taken for granted. Not so in this case; it's your straight medieval sound, batteries not included. ) \n\nThe last tune on the album, &quot;You Go To My Head&quot; is taken from the original BBC tape, partly so you can hear how and where the duet idea began and partly because Dave and I have a very warm feeling about it.  The technical quality, obviously, is different from the studio tracks, but enough of the emotional feeling comes through to explain why Dave and I hung in there together for a number of years through various ups and downs.  For the use of the tape, we're very grateful to the BBC staff -- notably John Duncan, producer, Dennis Cartwright, sound engineer, Martyn Douglas, BBC Records, Margaret McCall, BBC-TV and Veronica Young of the BBC New York office. \n\nSpeaking of a number of years, here is a bunch of pictures from some of them -- mostly self-explanatory -- once you accept the fact that when Dave and I began we looked enough alike to occasionally be mistaken for one another. Since then we've headed in quite different directions, visage-wise -- Dave in the direction of Grandfather Walton, me veering more towards Dorian Gray. The foursome on board ship consists of the incurably photogenic Brubeck and the incomparable, regal lola Brubeck; the perplexed gnomish apparition is me, and the Scott Fitzgerald type on the end is John Snyder, boy wonder of the record business, who put this whole thing together. \n\nThe ship, of course, is the Rotterdam, towards which, and all who sail upon her, we're most grateful. ~ Paul Desmond \n\nDave Brubeck &amp; Paul Desmond - The Duets Tracks:\n01  Alice In Wonderland 4:04   \n02  These Foolish Things 5:09 \n03  Blue Dove 4:34\n04  Stardust 4:45\n05  Koto Song 5:56\n06  Balcony Rock 2:16 \n07  Summer Song 3:18\n08  You Go To My Head 7:32","torrent":{"xt":"urn:btih:77cdc2e778ce3964fdc571ee81602792191558cf","amp;dn":"Dave+Brubeck+%26+Paul+Desmond+-+The+Duets+%281975%29+%5BJazz%5D%5Bmp3+192%5D%5Bh","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77cdc2e778ce3964fdc571ee81602792191558cf","infoHashBuffer":{"type":"Buffer","data":[119,205,194,231,120,206,57,100,253,197,113,238,129,96,39,146,25,21,88,207]},"announce":[],"urlList":[]}}