{"title":"Neil Gaiman &amp; Dave McKean - The wolves in the walls [CBR]","uid":4897667,"size":29486249,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:7811e6c1c928a21260471401ab6af32498f5e79e&amp;dn=Neil+Gaiman+%26+Dave+McKean+-+The+wolves+in+the+walls+%5BCBR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ill88eagle","files":-1,"time":1242430268,"description":"Neil Gaiman &amp; Dave McKean - The wolves in the walls [CBR]\n\nTruth be told, Neil Gaiman and Dave McKean's picture book The Wolves in the Walls is terrifying. Sure, the story is fairytale-like and presented in a jaunty, casually nonsensical way, but it is absolutely the stuff of nightmares. Lucy hears wolves hustling, bustling, crinkling, and crackling in the walls of the old house where her family lives, but no one believes her. Her mother says it's mice, her brother says bats, and her father says what everyone seems to say, &quot;If the wolves come out of the walls, it's all over.&quot; Lucy remains convinced, as is her beloved pig-puppet, and her worst fears are confirmed when the wolves actually do come out of the walls.\n\nUp to this point, McKean's illustrations are spectacular, sinister collages awash in golden sepia tones evocative of the creepy beauty in The City of Lost Children. The wolves explode into the story in scratchy pen-and-ink, all jaws and eyes. The family flees to the cold, moonlit garden, where they ponder their future. (Her brother suggests, for example, that they escape to outer space where there's &quot;nothing but foozles and squossucks for billions of miles.&quot;) Lucy wants to live in her own house...and she wants the pig-puppet she left behind.\n\nEventually she talks her family into moving back into the once-wolfish walls, where they peek out at the wolves who are watching their television and spilling popcorn on slices of toast and jam, dashing up the stairs, and wearing their clothes. When the family can't stand it anymore, they burst forth from the walls, scaring the wolves, who shout, &quot;And when the people come out of the walls, it's all over!&quot; The wolves flee and everything goes back to normal...until the tidy ending when Lucy hears &quot;a noise that sounded exactly like an elephant trying not to sneeze.&quot; Adult fans of this talented pair will revel in the quirky story and its darkly gorgeous, deliciously shadowy trappings, but the young or faint of heart, beware! (Ages 9 and older)","torrent":{"xt":"urn:btih:7811e6c1c928a21260471401ab6af32498f5e79e","amp;dn":"Neil+Gaiman+%26+Dave+McKean+-+The+wolves+in+the+walls+%5BCBR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7811e6c1c928a21260471401ab6af32498f5e79e","infoHashBuffer":{"type":"Buffer","data":[120,17,230,193,201,40,162,18,96,71,20,1,171,106,243,36,152,245,231,158]},"announce":[],"urlList":[]}}