{"title":"The Third Jesus: The Christ We Cannot Ignore by Deepak Chopra","uid":4099954,"size":398618205,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:78432e2f09ab3d8bdc37d426f22f6ff598127a9e&amp;dn=The+Third+Jesus%3A+The+Christ+We+Cannot+Ignore+by+Deepak+Chopra&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"absintheparty","files":102,"time":1206530580,"description":"Who is Jesus Christ?\n\nIn The Third Jesus, bestselling author and spiritual leader Deepak Chopra provides an answer to this question that is both a challenge to current systems of belief and a fresh perspective on what Jesus can teach us all, regardless of our religious background. There is not one Jesus, Chopra writes, but three.\n\nFirst, there is the historical Jesus, the man who lived more than two thousand years ago and whose teachings are the foundation of Christian theology and thought. Next there is Jesus the Son of God, who has come to embody an institutional religion with specific dogma, a priesthood, and devout believers. And finally, there is the third Jesus, the cosmic Christ, the spiritual guide whose teaching embraces all humanity, not just the church built in his name. He speaks to the individual who wants to find God as a personal experience, to attain what some might call grace, or God-consciousness, or enlightenment.\n\nWhen we take Jesus literally, we are faced with the impossible. How can we truly ?love thy neighbor as thyself?? But when we see the exhortations of Jesus as invitations to join him on a higher spiritual plane, his words suddenly make sense.\n\nUltimately, Chopra argues, Christianity needs to overcome its tendency to be exclusionary and refocus on being a religion of personal insight and spiritual growth. In this way Jesus can be seen for the universal teacher he truly is?someone whose teachings of compassion, tolerance, and understanding can embrace and be embraced by all of us.","torrent":{"xt":"urn:btih:78432e2f09ab3d8bdc37d426f22f6ff598127a9e","amp;dn":"The+Third+Jesus%3A+The+Christ+We+Cannot+Ignore+by+Deepak+Chopra","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78432e2f09ab3d8bdc37d426f22f6ff598127a9e","infoHashBuffer":{"type":"Buffer","data":[120,67,46,47,9,171,61,139,220,55,212,38,242,47,111,245,152,18,122,158]},"announce":[],"urlList":[]}}