{"title":"EA Sports UFC v1.6.847112","uid":12647551,"size":567423576,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:7948728b4e1ec4c19af438d053dc69151a5c5c59&amp;dn=EA+Sports+UFC+v1.6.847112&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":4,"uploader":".BONE.","files":4,"time":1446078257,"description":"Enter the Octagon with EA SPORTING ACTIVITIES UFC. Gather your favored UFC boxers, toss down in competitive combat, as well as take part in live events from the real world of the UFC. Every takedown issues in your pursuit for the championship.\r\n\r\nTRAIN YOUR ULTIMATE FIGHTER\r\n\r\nPick from over 70 UFC boxers– from champs like Jon Jones, to promising celebrities. Update each competitorâ™s distinct set of special moves and placed them to the test versus the UFCâ™s ideal. Make gold and collect brand-new competitors with every pulse-pounding battle.\r\n\r\nBATTLE YOUR WAY TO THE LEADING\r\n\r\nClimb up via the ranks of the UFC as your group of boxers depresses the competitors. Open new opponents and also remarkable incentives with every high-octane suit, as well as face off versus UFC symbols in decisive boss fights.\r\n\r\nACTION-PACKED GAMEPLAY\r\n\r\nContend in real-time events that accompany the real-world UFC and also earn exclusive rewards. The action keeps including updates driven by real-world UFC occasions and you, the EA SPORTS UFC area.\r\n\r\nAS REAL AS IT GETS\r\n\r\nEncounter a cutting edge dealing with engine with compelling 3D gameplay as well as intuitive, finely tuned touch controls. EA SPORTS UFC supplies stunning console-worthy visuals and also a real HD-quality experience on your mobile device.\r\n\r\nThis app has no ads and is offline.\r\n\r\nWhatâ™s New:\r\nGet your fight gloves ready – weâ™ve added 8 new Legendary fighters to the game! Enter the Octagon® with UFC Hall of Famers and former champs like Chuck Liddell and Rampage Jackson. Plus:\r\n\r\nEnter 2 Legends Live Events and play epic matchups from UFC history, like BJ Penn vs. Matt Hughes\r\nExperience a new Legend fighter every day in our Fighter Showcase\r\nNew packs featuring Legend abilities","torrent":{"xt":"urn:btih:7948728b4e1ec4c19af438d053dc69151a5c5c59","amp;dn":"EA+Sports+UFC+v1.6.847112","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7948728b4e1ec4c19af438d053dc69151a5c5c59","infoHashBuffer":{"type":"Buffer","data":[121,72,114,139,78,30,196,193,154,244,56,208,83,220,105,21,26,92,92,89]},"announce":[],"urlList":[]}}