{"title":"Starship Vectors edited by Allan Kaster","uid":14992262,"size":257782500,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:794ba64ffae524e8c25e018499badca7f56309d3&amp;dn=Starship+Vectors+edited+by+Allan+Kaster&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Cybotage","files":8,"time":1466332225,"description":"Starships come in many shapes and sizes. Their crews and passengers are an eclectic lot. They venture into the deep voids of space on their assigned missions. Sometimes they succeed and sometimes they do not. This collection tells the stories of the crews and passengers aboard six of these starships.\r\n\r\nElizabeth Bear and Sarah Monette's &quot;Boojum&quot; introduces a living starship crewed by pirates who barely understand how to keep her going. They are a collection of colorful and improbable characters. The ship herself may be the easiest to understand.\r\n\r\nNancy Kress's &quot;Shiva in Shadow&quot; takes place on two starships with the same crew. The original ship launches a probe containing uploaded personalities of its three crewmembers. Both crews work on similar scientific problems and have similar personal interactions. You'd think things would come out pretty much the same.\r\n\r\nIn &quot;The Political Officer&quot;, by Charles Coleman Finlay, the crew aboard a military starship must contend with both the enemy and a political officer.\r\n\r\nGwyneth Jones's &quot;The Tomb Wife&quot; is creepy and touching. The navigator of the interstellar freighter, Pirate Jenny, hears a ghost from an alien tomb in its cargo hold.\r\n\r\nRobert Reed's &quot;The Remoras&quot; takes place on a huge ship that travels slowly through the galaxy. A passenger becomes fascinated with the genetically-altered humans who live on and maintain the ship's hull. Without telling her husband, she decides to investigate their lifestyle in greater depth.\r\n\r\nStephen Baxter's &quot;Mayflower II&quot; begins with a starship with a thousand coldly-selected crew fleeing a planetary invasion. It settles into its 20,000 year voyage to another galaxy. Some of the crew are immortal; others are not.\r\n\r\nRead by Tom Dheere and Nicola Barber\r\nFormat: MP3\r\nBitrate: 64 Kbps","torrent":{"xt":"urn:btih:794ba64ffae524e8c25e018499badca7f56309d3","amp;dn":"Starship+Vectors+edited+by+Allan+Kaster","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"794ba64ffae524e8c25e018499badca7f56309d3","infoHashBuffer":{"type":"Buffer","data":[121,75,166,79,250,229,36,232,194,94,1,132,153,186,220,167,245,99,9,211]},"announce":[],"urlList":[]}}