{"title":"The Scarlet Empress (1934) Xvid 1cd - Marlene Dietrich Collectio","uid":9938548,"size":922968064,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:795945c8823091ab4808cdf426005a6c15b25d92&amp;dn=The+Scarlet+Empress+%281934%29+Xvid+1cd+-+Marlene+Dietrich+Collectio&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"SaM","files":-1,"time":1397190941,"description":"The Scarlet Empress (1934) Xvid 1cd - Marlene Dietrich Collection [DDR]\n\nThe Scarlet Empress is a 1934 historical drama film made by Paramount Pictures about the life of Catherine the Great. It was directed and produced by Josef von Sternberg from a screenplay by Eleanor McGeary, loosely based on the diary of Catherine arranged by Manuel Komroff. Substantial historical liberties are taken.\n\nThe film stars von Sternberg's lover Marlene Dietrich as Catherine, supported by John Davis Lodge, Sam Jaffe, Louise Dresser, and C. Aubrey Smith. Dietrich's daughter Maria Riva plays Catherine as a child.\n\n    CAST:-\n    Marlene Dietrich as Princess Sophie Friederike Auguste von Anhalt-Zerbst-Dornburg, later Empress \n\nCatherine II\n    John Davis Lodge as Count Alexey Razumovsky\n    Sam Jaffe as Grand Duke Peter, later Emperor Peter III\n    Louise Dresser as Empress Elizaveta Petrovna\n    C. Aubrey Smith as Christian August, Prince of Anhalt-Zerbst (father of Catherine)\n    Gavin Gordon as Captain Grigory Grigoryevich Orlov\n    Olive Tell as Joanna Elisabeth of Holstein-Gottorp (mother of Catherine)\n    Ruthelma Stevens as Elizaveta Vorontsova, mistress of Peter III\n    Davison Clark as Archimandrite Simeon Todorsky / Arch-Episcopope\n    Erville Alderson as Chancellor Alexey Bestuzhev-Ryumin\n    Philip Sleeman as Jean Armand de Lestocq\n    Marie Wells as Marie Tshoglokof\n    Hans Heinrich von Twardowski as Ivan Shuvalov\n    Gerald Fielding as Lieutenant Dimitri\n    Maria Riva as Sophia (child)\n\nDirected by Josef von Sternberg\nProduced by Emanuel Cohen, Josef von Sternberg\nWritten by Catherine II (diary)\nMusic by Bernhard Kaun\nRunning time 104 minutes\n\nSYNOPSIS:- The Scarlet Empress (1934)\nSophia Frederica (Dietrich) is the daughter of a minor German prince and an ambitious mother. She is brought to Russia by Count Alexei (Lodge) at the behest of Empress Elizabeth (Dresser) to marry her nephew, Grand Duke Peter (played as a half-wit by Jaffe in his film debut). The overbearing Elizabeth renames her Catherine and reinforces the demand the new bride issue an heir to the throne.\n\nUnhappy in her marriage, Catherine finds solace with the womanizing Alexei, first and foremost a paramour of the much-older Elizabeth. Rebuffed at this discovery, she takes lovers among the Russian Army to court its favor. When the old Empress dies seventeen years into their marriage, Peter ascends to the Russian throne and takes steps against his wife. Soon Catherine plots and exercises a coup, beginning a reign as Empress that will leave her known to history as Catherine the Great.\n\nThe film is notable for its attentive lighting and the expressionist art design von Sternberg creates for the Russian palace. In film critic Robin Wood's words:\n a hyperrealist atmosphere of nightmare with its gargoyles, its grotesque figures twisted into agonized contortions, its enormous doors that require a half-dozen women to close or open, its dark spaces and ominous shadows created by the flickerings of innumerable candles, its skeleton presiding over the royal wedding banquet table.\n\nThe Scarlet Empress was one of the last mainstream Hollywood motion pictures to be released before the Hays Code was strictly enforced, but was &quot;condemned&quot; by the Catholic Legion of Decency as &quot;morally objectionable&quot;.\n\nThe Scarlet Empress was described as one of Marlene Dietrich's most frank and suggestive films, which portrays Russia's future queen Catherine the Great as an oversexed, sexually-depraved dominatrix. The historic film is filled with erotic images and motifs. It also contains depictions of torture.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 855 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: English\nAudio Languages: English\nRunTime 77 mins\nSubtitles: None\nRipped by: Trinidad [DDR]\nDuration: 77 mins","torrent":{"xt":"urn:btih:795945c8823091ab4808cdf426005a6c15b25d92","amp;dn":"The+Scarlet+Empress+%281934%29+Xvid+1cd+-+Marlene+Dietrich+Collectio","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"795945c8823091ab4808cdf426005a6c15b25d92","infoHashBuffer":{"type":"Buffer","data":[121,89,69,200,130,48,145,171,72,8,205,244,38,0,90,108,21,178,93,146]},"announce":[],"urlList":[]}}