{"title":"Twilight and Philosophy Audio and Pdf","uid":8256359,"size":175366096,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:7a5177b5e18e2ac9d244cdad9bca86e612def2dd&amp;dn=Twilight+and+Philosophy+Audio+and+Pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"hombrep","files":-1,"time":1363275546,"description":"The first look at the philosophy behind Stephenie Meyer's bestselling Twilight series\nBella and Edward, and their family and friends, have faced countless dangers and philosophical dilemmas in Stephenie Meyer's Twilight novels. This book is the first to explore them, drawing on the wisdom of philosophical heavyweights to answer essential questions such as: What do the struggles of &quot;vegetarian&quot; vampires who control their biological urge for human blood say about free will? Are vampires morally absolved if they kill only animals and not people? From a feminist perspective, is Edward a romantic hero or is he just a stalker? Is Jacob &quot;better&quot; for Bella than Edward?\n\nAs absorbing as the Meyer novels themselves, Twilight and Philosophy:\n\nGives you a new perspective on Twilight characters, storylines, and themes\nHelps you gain fresh insights into the Twilight novels and movies\nFeatures an irresistible combination of vampires, romance, and philosophy\nTwilight and Philosophy is a must-have companion for every Twilight fan, whether you're new to the series or have followed it since the beginning.\n\nEditorial Reviews\nFrom the Back Cover\nWhat can vampires tell us about the meaning of life?\nIs Edward a romantic hero or a dangerous stalker?\n\nIs Bella a feminist? Is Stephenie Meyer?\n\nHow does Stephenie Meyer's Mormonism fit into the fantastical world of Twilight?\n\nIs Jacob &quot;better&quot; for Bella than Edward?\n\nThe answers to these philosophical questions and more can be found inside Twilight and Philosophy: Vampires, Vegetarians, and the Pursuit of Immortality. With everything from Taoism to mind reading to the place of God in a world of vampires, this book offers some very tasty philosophy for both the living and the undead to sink their teeth into. Whether you're on Team Edward or Team Jacob, whether you loved or hated Breaking Dawn, this book is for you!\n\nAbout the Author\nRebecca Housel coedited X-Men and Philosophy. A former professor of English and popular culture in western New York, she now serves on editorial advisory boards for the Journal of Popular Culture and the Journal of American Culture. Also an author of middle-grade fiction, she is currently working on a new young adult novel.\nJ. Jeremy Wisnewski is an assistant professor of philosophy at Hartwick College, the coeditor of X-Men and Philosophy, and the editor of Family Guy and Philosophy and The Office and Philosophy.\n\nWilliam Irwin is a professor of philosophy at King's College. He originated the philosophy and popular culture genre of books as coeditor of the bestselling The Simpsons and Philosophy and has overseen recent titles, including Batman and Philosophy, House and Philosophy, and Watchmen and Philosophy.\n\nProduct Details\nPaperback: 272 pages\nPublisher: Wiley; 1 edition (September 22, 2009)\nLanguage: English\nISBN-10: 0470484233\nASIN: B00B1LD6HQ","torrent":{"xt":"urn:btih:7a5177b5e18e2ac9d244cdad9bca86e612def2dd","amp;dn":"Twilight+and+Philosophy+Audio+and+Pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a5177b5e18e2ac9d244cdad9bca86e612def2dd","infoHashBuffer":{"type":"Buffer","data":[122,81,119,181,225,142,42,201,210,68,205,173,155,202,134,230,18,222,242,221]},"announce":[],"urlList":[]}}