{"title":"Black in Blue: African-American Police Officers and Racism [blac","uid":8762241,"size":1529470,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7b540f262f98715dcc266df69eca8d10c13d8abd&amp;dn=Black+in+Blue%3A+African-American+Police+Officers+and+Racism+%5Bblac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"blackatk","files":-1,"time":1375265980,"description":"\nPublication Date: April 2, 2004 | With A special thanks to &quot;wetworx12&quot; - The bitter, race-baiting troll laden with who inspired this upload | filetype: pdf |\n\n\nFrom New York to Los Angeles, police departments across the country are consistently accused of racism. Although historically white police precincts have been slowly integrating over the past few decades, African-American officers still encounter racism on the job. Bolton and Feagin have interviewed fifty veteran African-American police officers to provide real-life and vivid examples of the difficulties and discrimination these officers face everyday inside and outside the police station from barriers in hiring and getting promoted to lack of trust from citizens and members of black community.\n\n\nEditorial Reviews\nFrom Booklist\nSociologists Bolton and Feagin offer a penetrating look at the tensions within police departments as more and more black officers join what was previously an exclusive and insular workforce. Focusing on 16 different law-enforcement agencies in the South, the authors offer personal accounts by 50 veteran black officers on the day-to-day stress of balancing relationships with distrustful white officers steeped in racial stereotypes and relationships with black communities that often view them as traitors. The authors provide the historical context of the policing of black communities since slavery and the continued disproportionate police attention paid to nonwhite communities, as well as previous sparse research on black police officers. But the most compelling elements of the book are the visceral accounts by black officers facing ongoing hostility and racism from initial training through efforts for advancement. They also offer redeeming accounts of sensitizing fellow officers and humanizing treatment of black communities. Readers interested in law-enforcement and racial issues will appreciate this look at efforts to desegregate police operations and how much more work is needed. Vanessa Bush\nCopyright Â© American Library Association. All rights reserved\nReview\n\n&quot;In their thoughtful qualitative analysis, Bolton and Feagin tackle an important, though largely overlooked topic--the lived experiences of Black police officers. Their research exposes the personal and social costs of men in blue engaging in business as usual.&quot; - Katheryn Russell-Brown, University of Florida\n\n\n\nFile Size: 610 KB\nPrint Length: 305 pages\nPage Numbers Source ISBN: 0415945186\nPublisher: Routledge; 1 edition (April 2, 2004)\nSold by: Amazon Digital Services, Inc.\nLanguage: English\nASIN: B000OT8C48\n\n\n &lt;a href=&quot;\nhttp://www.amazon.com/Black-Blue-African-American-Officers-ebook/dp/B000OT8C48/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Black-Blue-African-American-Officers-ebook/dp/B000OT8C48/&lt;/a&gt;\n\n\n\n\nTags: black, african american, african studies, police, law enforcement, criminal justice, lapd, nypd, cpd politican science, oppression, double standards, abuse, profiling, disproportionate force, oversaturation, driving while black, legal , law, disparity, oppression, eurocentric, caucasian, wasp, white american, bias, rodney king, self-hate , ghetto, ghettoization, blue wall, ","torrent":{"xt":"urn:btih:7b540f262f98715dcc266df69eca8d10c13d8abd","amp;dn":"Black+in+Blue%3A+African-American+Police+Officers+and+Racism+%5Bblac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b540f262f98715dcc266df69eca8d10c13d8abd","infoHashBuffer":{"type":"Buffer","data":[123,84,15,38,47,152,113,93,204,38,109,246,158,202,141,16,193,61,138,189]},"announce":[],"urlList":[]}}