{"title":"Mr Mister-5 cd","uid":5326699,"size":410011503,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7bc5973e36997d83c8de1197e615a6547019ff25&amp;dn=Mr+Mister-5+cd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"flitigalisa","files":72,"time":1265039469,"description":" &lt;a href=&quot;http://thepiratebay.se/user/flitigalisa&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://thepiratebay.se/user/flitigalisa&lt;/a&gt;\n\nMr. Mister was an American pop rock band of the 1980s. The band's name came from an inside joke about a Weather Report record called Mr. Gone where they referred to each other as &quot;Mister This&quot; or &quot;Mister That&quot;, and eventually selected &quot;Mr. Mister.&quot; Mr. Mister may be considered as representative of the melodic sound of 1980s pop rock. The band consisted of Richard Page on vocals and bass guitar, Steve George on keyboards, Pat Mastelotto on acoustic and electronic drums and Steve Farris on guitars.\n\nWhen the first Mr. Mister album, I Wear the Face, was released in 1984, Page was offered the chance to replace Bobby Kimball as lead singer of Toto, and later was offered Peter Cetera's place in Chicago; he refused both offers. \nThe second album, 1985's Welcome to the Real World, with lyrics from Page's cousin John Lang, was the breakthrough for Mr. Mister, with three top 10 singles, two of which hit #1 on the U.S. pop charts (most notably &quot;Broken Wings&quot;, which was inspired by the book of the same title by Khalil Gibran). They had several #1 MTV videos and performed at the first MTV Spring Break show in 1986. Mr Mister had several Grammy Award nominations, including the 1986 Grammy for &quot;Best Pop Band&quot; (which was awarded to the &quot;We Are the World&quot; ensemble, USA for Africa).\nDuring this time, Mr. Mister toured with other popular acts including Don Henley, The Bangles, Eurythmics, Tina Turner, and Adam Ant. The band's third album was Go On..., which the band said was &quot;some of the best stuff we ever did,&quot; showing a much more mature band and a sound that hinted at progressive rock] Nevertheless, Go On... was not a commercial success.\nMr. Mister also did one song from the movie &quot;Stand and Deliver&quot;.\nGuitarist Steve Farris left around 1989, replaced by Buzz Feiten and later Trevor Rabin. The band began working on a fourth album, Pull, with session guitarists, but were dropped by their label before it could be released, and the band decided to break up. The album remains unreleased to this day, although one track (&quot;Waiting in My Dreams&quot;) later appeared on a 2001 greatest hits collection by the band. However, in December 2008 Page told the internet radio station 95.7 StarFM about plans to release Pull on his new website: &quot;I'm in the process of getting it back from the record company and publish it on the website.&quot; After a Jan. 2009 podcast interview with Page, Inside MusiCast posted a portion of a follow-up e-mail from Page stating &quot;The Pull album might be released. We're talking to the record company about it now.&quot; \n","torrent":{"xt":"urn:btih:7bc5973e36997d83c8de1197e615a6547019ff25","amp;dn":"Mr+Mister-5+cd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7bc5973e36997d83c8de1197e615a6547019ff25","infoHashBuffer":{"type":"Buffer","data":[123,197,151,62,54,153,125,131,200,222,17,151,230,21,166,84,112,25,255,37]},"announce":[],"urlList":[]}}