{"title":"Zero Girl (Sam Kieth)","uid":5487488,"size":71248634,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:7c4d1c8d80d9bfd730db32db69577749d8a54acf&amp;dn=Zero+Girl+%28Sam+Kieth%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"brodahisou","files":-1,"time":1270811984,"description":"Zero Girl is the story of a high-school misfit coming of age. Young Amy Smootster is a high school social outcast and has never been the most popular girl in school. She can speak to insects and believes that circles are good and squares evil. Awkward and different, she doesn't quite fit into any social circle, and she likes it that way. But strange things seem to happen when Amy is around - the spontaneous appearance of puddles of water, for instance - and it has made her the target of relentless bullies. With the aid of a sympathetic guidance counselor, Tim, whom she develops a mad crush on, Amy explores the meaning of her surreal abilities and discovers her place in the world. \n\nZero Girl: Full Circle is set fifteen years later and focuses on Tim's daughter, Nikki.\n\nThe series contains one reference to Kieth's most famous work, The Maxx: Tim describes that he bought his yellow bug from &quot;that chick named Julie&quot; (a character in The Maxx). When Amy asks for clarification, Tim replies &quot;that's another story.&quot;\n\nWritten and illustrated by Sam Kieth and published by Homage Comics.\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:7c4d1c8d80d9bfd730db32db69577749d8a54acf","amp;dn":"Zero+Girl+%28Sam+Kieth%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c4d1c8d80d9bfd730db32db69577749d8a54acf","infoHashBuffer":{"type":"Buffer","data":[124,77,28,141,128,217,191,215,48,219,50,219,105,87,119,73,216,165,74,207]},"announce":[],"urlList":[]}}