{"title":"Las Brujas de Mayfair-01 La Hora de las Brujas - Anne Rice [Eboo","uid":6919046,"size":4728936,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7c8a01f07310e52c1f1f7c66ce146fbd8e07296e&amp;dn=Las+Brujas+de+Mayfair-01+La+Hora+de+las+Brujas+-+Anne+Rice+%5BEboo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"virana","files":-1,"time":1325149706,"description":"Las brujas de Mayfair es la saga mas famosa de Anne Rice luego de las CrÃƒÂ³nicas VampÃƒÂ­ricas. Se trata de una trilogÃƒÂ­a donde se narra la historia de una familia de brujas que viven en la ciudad de Nueva OrleÃƒÂ¡ns.\n\nLa historia abarca trece generaciones de mujeres con habilidades extraordinarias y poderes sobrenaturales, que poseen un extraÃƒÂ±o vÃƒÂ­nculo con un espÃƒÂ­ritu que esta a su servicio.\n\nEl personaje central de esta historia es la Doctora Rowan Mayfair, quien hasta los momentos no tiene conocimiento alguno sobre su origen mÃƒÂ­stico, tambiÃƒÂ©n se encuentra Michael Curry, un hombre que tras un trÃƒÂ¡gico accidente  obtiene un extraÃƒÂ±o poder sobrenatural, y una misiÃƒÂ³n que no consigue recordar.\n\nDesde Donnelaith, en Escocia, hasta la adorada ciudad natal de Rice, Nueva OrleÃƒÂ¡ns, pasando por Santo Domingo, en esta historia convergen la pasiÃƒÂ³n y el misticismo que puede ofrecer cada lugar y cada personaje. Los tres libros ordenados cronolÃƒÂ³gicamente son:\n\n01 La Hora de las Brujas es la primera entrega de la saga, donde Anne Rice relata la historia de Rowan Mayfair, una bella neurocirujano consciente de sus poderes especiales, encuentra a un ahogado en la costa de California y consigue devolverlo a la vida. Ambos se enamoran ferozmente y establecen una apasionada alianza para desentraÃƒÂ±ar el misterio del pasado de ella y dominar un don maligno que le ha sido conferido a el tras su accidente.  Rowan, aunque no lo sabe aÃƒÂºn, desciende de una dinastÃƒÂ­a de brujas que se remonta al siglo XVII y cuya historia empezÃƒÂ³ con una escocesa quemada en la hoguera.\n","torrent":{"xt":"urn:btih:7c8a01f07310e52c1f1f7c66ce146fbd8e07296e","amp;dn":"Las+Brujas+de+Mayfair-01+La+Hora+de+las+Brujas+-+Anne+Rice+%5BEboo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c8a01f07310e52c1f1f7c66ce146fbd8e07296e","infoHashBuffer":{"type":"Buffer","data":[124,138,1,240,115,16,229,44,31,31,124,102,206,20,111,189,142,7,41,110]},"announce":[],"urlList":[]}}