{"title":"60 GUNSMOKE VINTAGE RADIO SHOWS","uid":7259779,"size":652826608,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:7c8acbac79c6f19a717de56df5455dc50101e629&amp;dn=60+GUNSMOKE+VINTAGE+RADIO+SHOWS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"uk_spuddybuddy","files":1,"time":1336687280,"description":"In the late 1940s, CBS chairman William S. Paley, a fan of The Adventures of Philip Marlowe radio serial, asked his programming chief, Hubell Robinson, to develop a hardboiled Western series, a show about a &quot;Philip Marlowe of the Old West.&quot; Robinson instructed his West Coast CBS Vice-President, Harry Ackerman, who had developed the Philip Marlowe series, to take on the task.\n\nAckerman and his scriptwriters, Mort Fine and David Friedkin, created an audition script called &quot;Mark Dillon Goes to Gouge Eye&quot; based on one of their Michael Shayne radio scripts, &quot;The Crooked Wheel&quot;. Two auditions were created in 1949. The first was very much like a hardboiled detective series and starred Michael Rye (credited as Rye Billsbury) as Dillon; the second starred Straight Arrow actor Howard Culver in a more Western, lighter version of the same script. CBS liked the Culver version better, and Ackerman was told to proceed.\n\nBut there was a complication. Culver's contract as the star of Straight Arrow would not allow him to do another Western series. The project was shelved for three years, when MacDonnell and Meston discovered it creating an adult Western series of their own.\n\nMacDonnell and Meston wanted to create a radio Western for adults, in contrast to the prevailing juvenile fare such as The Lone Ranger and The Cisco Kid. Gunsmoke was set in Dodge City, Kansas during the thriving cattle days of the 1870s. Dunning[3] notes, &quot;The show drew critical acclaim for unprecedented realism.&quot;\n\n[edit] Radio cast and character biographies\n60 complete radio shows","torrent":{"xt":"urn:btih:7c8acbac79c6f19a717de56df5455dc50101e629","amp;dn":"60+GUNSMOKE+VINTAGE+RADIO+SHOWS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c8acbac79c6f19a717de56df5455dc50101e629","infoHashBuffer":{"type":"Buffer","data":[124,138,203,172,121,198,241,154,113,125,229,109,245,69,93,197,1,1,230,41]},"announce":[],"urlList":[]}}