{"title":"Arturo Perez-Reverte - The Fencing Master","uid":6534250,"size":916118,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7d04c828c0e1d55e952d4695f3bb26f51e29864f&amp;dn=Arturo+Perez-Reverte+-+The+Fencing+Master&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"_F1_","files":-1,"time":1310462553,"description":"Arturo Perez-Reverte, &quot;The Fencing Master&quot; \n Publisher: Mariner Books | ISBN: 0156029839 | edition 2004 | PDF | 405 pages | 1 mb\n\n Spain's bestselling novelist follows three polished and erudite thrillers (The Flanders Panel; The Club Dumas; The Seville Communion) with a fourth that combines the classic art of fencing, 19th-century Spanish monarchical politics and the eternal lure of the femme fatale. Don Jaime Astarloa, aging and solitary, is Madrid's greatest fencing master, eking out a threadbare living in this age of the pistol by teaching the sons of the nobility. In the hot summer of 1868, while rumors abound in Madrid of possible insurrection and the forced abdication of Queen Isabelle II, Don Jaime is visited by a beautiful young woman calling herself Adela de Otero, who offers him double his usual fee to teach her a secret, famously difficult sword thrust. At first Don Jaime refuses to consider a woman as a student; but with her intricate knowledge of fencing and the mysterious, tiny scar at the corner of her mouth, Adela wins him over and proves to be an expert fencer, gifted, disciplined and determined. Soon she is winning Don Jaime's heart as well. Thus is set into motion a complex succession of plots and counterplots analogous to the thrust and parry of a fencing match. P?rez-Reverte is a master of lushly atmospheric suspense, and his prose is as spellbinding in the fencing gallery as it is in the arcane realm of honor and loyalty that shapes Don Jaime's world.","torrent":{"xt":"urn:btih:7d04c828c0e1d55e952d4695f3bb26f51e29864f","amp;dn":"Arturo+Perez-Reverte+-+The+Fencing+Master","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d04c828c0e1d55e952d4695f3bb26f51e29864f","infoHashBuffer":{"type":"Buffer","data":[125,4,200,40,192,225,213,94,149,45,70,149,243,187,38,245,30,41,134,79]},"announce":[],"urlList":[]}}