{"title":"Mia Doi Todd...Cosmic Ocean Ship(2011)[FLAC]","uid":6472804,"size":236934150,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7d87746ce5d3af28d5c6176a6e403e02c3913f9a&amp;dn=Mia+Doi+Todd...Cosmic+Ocean+Ship%282011%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":14,"time":1308207965,"description":" &lt;a href=&quot;http://image.allmusic.com/00/amg/cov200/drp900/p988/p98829gm6s0.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://image.allmusic.com/00/amg/cov200/drp900/p988/p98829gm6s0.jpg&lt;/a&gt;\n\n Cosmic Ocean Ship [2011]City Zen / 005\n\n[img]http://i128.photobucket.com/albums/p180/SonAfterDark/tracklistlatest.png[/img]\n\n1 Paraty -Todd 3:56 \n2 My Baby Lives in Paris -Todd 2:59 \n3 Under the Sun -Todd 5:05 \n4 Skipping Stones -Todd 3:58 \n5 Summer Lover -Todd 4:26 \n6 La Havana -Todd 4:04 \n7 Canto de LemanjÃƒÂ¡ -De Moraes, Powell 6:32 \n8 The Rising Tide -Todd 3:27 \n9 All My City -Todd 3:30 \n10 Gracias a la Vida -Parra 4:06 \n\nCosmic Ocean Ship, Mia Doi Todd's ninth album, is an aural travelogue that reflects her inner and geographical journeys, evoking the spirit of summertime no matter what musical atmosphere she employs in order to do so. The set contains eight originals and a pair of expertly chosen covers that touch on love, its loss, renewal, leavings, and arrivals; it was released on Todd's City Zen imprint, and produced by multi-instrumentalist Jonathan Wilson, with a small group of players. Todd uses her voice, guitars, ukulele, percussion, and carvaquinho to explore Latin, Brazilian, and her own Los Angeles brand of alt-folk. The Brazilian influence makes itself felt on album opener &quot;Paraty,&quot; named for the old colonial port town three hours south of Rio. Todd's nylon-string guitar, Gabe Noel's bass, and Andres Renteria's hand percussion introduce this gorgeous bossa that transforms itself seamlessly into a jazzy samba after the first two verses when Wilson's electric guitar and a drum kit are layered into the mix. Todd sings in a breezy, sensual voice of the pleasures of the town's lazy, summery atmosphere. &quot;My Baby Lives in Paris&quot; harks back to Todd's longtime fascination with Joni Mitchell. While not as rhythmically fluid as one of Mitchell's tunes, the lyrics that touch on time, place, and metaphors of imprinted emotional memory are saturated with her influence. The lithe Latin rhythms of &quot;Under the Sun&quot; are countered by Todd's open, folksy vocal, which suggests Sandy Denny in her phrasing. &quot;Summer Lover,&quot; in waltz time, is reminiscent of the Laurel Canyon sound of the early '70s, and in the piano, guitars, basslines, and shimmering drums, one can hear the trace of a Mitchell arrangement. The reading of Baden Powell's classic &quot;Canto de LemanjÃƒÂ¡&quot; is introduced by Todd's voice in layered echoes, before her nylon-string guitar enters, augmented by bowed cello, intermittent percussion, and spacy reverb. She does a provocative reading of the tune that breaks open into a psychedelic samba. The set closes with Violeta Parra's &quot;Gracias a la Vida,&quot; a sparse, haunting number sung in Spanish, accompanied by carvaquinho and percussion accentuating Todd's mournful, moving vocal. Cosmic Ocean Ship is Todd's most &quot;exotic&quot; recording, but it's easily one of her most ambitious, focused, and satisfying as well\n\ncd ripped by EAC\n\nplease seed\n &lt;a href=&quot;\nhttp://dickthespic.org/2011/05/26/mia-doi-todd/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/2011/05/26/mia-doi-todd/&lt;/a&gt;","torrent":{"xt":"urn:btih:7d87746ce5d3af28d5c6176a6e403e02c3913f9a","amp;dn":"Mia+Doi+Todd...Cosmic+Ocean+Ship%282011%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d87746ce5d3af28d5c6176a6e403e02c3913f9a","infoHashBuffer":{"type":"Buffer","data":[125,135,116,108,229,211,175,40,213,198,23,106,110,64,62,2,195,145,63,154]},"announce":[],"urlList":[]}}