{"title":"TO RIVERDALE AND BACK AGAIN (1990) (Archie Comics) (Konky)","uid":8072834,"size":126114839,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:7de442f52148fb30524e9a303a867ff10da75177&amp;dn=TO+RIVERDALE+AND+BACK+AGAIN+%281990%29+%28Archie+Comics%29+%28Konky%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"STFmaryville","files":-1,"time":1359311995,"description":"This torrent contains:\n\nARCHIE COMICS PRESENTS - TO RIVERDALE AND BACK AGAIN Special (1990)\n\nPlease seed and share with our friends here on TPB!\n\n------\n\nFrom Wikipedia:\n\n&quot;Archie: To Riverdale and Back Again&quot; was a live-action television movie based on comic book characters published by Archie Comics. It was produced by DiC and premiered on NBC Sunday Night at the Movies in 1990.\n\nThe concept behind the movie was to combine the long-standing familiarity of Archie and the gang from the comics with adult issues.\n\nPlot\n\nArchie Andrews, fifteen years after graduating from Riverdale High, has become a successful lawyer and is getting ready to marry his fiancee, Pam, and move to &quot;the big city.&quot; Before doing that, however, he returns home to Riverdale for his high school reunion.\n\nArchie and company are all now in their early thirties, with the trials and tribulations one might expect to have happened to such a group over the years:\n\nBetty, a grade school teacher, is constantly bossed around by her crummy boyfriend, Robert.\n\nVeronica, having lived in France since graduation, has been married (and divorced) four times.\n\nJughead, now a psychiatrist, is also a divorce with a son, Jordan. Jughead carries emotional baggage that manifests itself in a terrible fear of women. (A running gag in the movie is Jughead's desperation to avoid seeing Big Ethel during his visit to Riverdale.) This is played for laughs at the end when at the reunion it turns out that Big Ethel is no longer the gangly, awkward teenager she once was but is now a striking beauty.\n\nMoose and Midge have gotten married and become chiropractors. They also have a son, Max, who hits it off with Jordan.\n\nWhen Archie sees Betty and Veronica for the first time in fifteen years, all his old feelings for them come flooding back, threatening his engagement - and it doesn't help that the girls renew their pursuit of Archie, heedless of the fact that he has a fiancee.\n\nMeanwhile, Archie also tries to keep gym owner Reggie, helped along by an uncharacteristically menacing Mr. Lodge, from evicting Pop Tate from his soda shop. Archie ultimately saves the Chock'lit Shoppe, though he loses Pam in the bargain, and decides to stay in Riverdale.\n\nCast\n\nAlmost all of the characters in the movie are regular or recurring characters in the originating comics:\n\nChristopher Rich as Archie Andrews\nLauren Holly as\tBetty Cooper\nKaren Kopins as\tVeronica Lodge\nSam Whipple as &quot;Jughead&quot; Jones\nGary Kroeger as\tReggie Mantle\nJames Noble as Hiram Lodge\n\nThe NBC movie, broadcast during the May sweeps period, was seen as a pilot for a possible series. Despite well-received performances from the actors and actresses portraying the Archie characters, the movie finished a disappointing 51st in the Nielsen ratings, beaten by the primetime premiere of the Kevin Costner/Sean Connery remake of &quot;The Untouchables&quot; on CBS and the powerful combination of Married With Children and In Living Color on FOX.\n\nComic book version\n\nArchie Comics published a 64-page one-shot comic book adaptation of the TV movie which coincided with its premiere. Stan Goldberg and Mike Esposito drew the sections of the book featuring the characters in flashback as teens, while Gene Colan drew characters as adults, in a less cartoony style. John Byrne drew the cover.","torrent":{"xt":"urn:btih:7de442f52148fb30524e9a303a867ff10da75177","amp;dn":"TO+RIVERDALE+AND+BACK+AGAIN+%281990%29+%28Archie+Comics%29+%28Konky%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7de442f52148fb30524e9a303a867ff10da75177","infoHashBuffer":{"type":"Buffer","data":[125,228,66,245,33,72,251,48,82,78,154,48,58,134,127,241,13,167,81,119]},"announce":[],"urlList":[]}}