{"title":"NoMeansNo -1995- The Worldhood Of The World","uid":5001071,"size":374741372,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7deb19a5016b74e045591f4cbee7d45e4e73d569&amp;dn=NoMeansNo+-1995-+The+Worldhood+Of+The+World&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"kislithepothead","files":23,"time":1247518065,"description":"\nIt kicks into sudden life with the a cappella overdub then searing rock charge of &quot;Joy,&quot; and with that as a sudden, focused spark of life, NoMeansNo again proves they still easily have what it takes with the mighty fine The Worldhood of the World (As Such). Following up the intense, strong Why Do They Call Me Mr. Happy? might have been a challenging task for some bands, but NoMeansNo keeps the quality high and the playing loud and good throughout the album's nearly hour length. There's a little more emphasis on the directness of the singing this time out, while the guitars in particular sound less-immediately overwhelming. It's not quite a toning down, more a way of finding a new balance, and certainly the midsong breaks and epic rave-up stomp of songs like &quot;He Learned How to Bleed&quot; are hardly power ballads. If anything, there's a slippery, more fun embrace of poppiness than ever before -- check out the near-prime Cheap Trick sass of &quot;Humans,&quot; the near-HÃƒÂ¼sker DÃƒÂ¼-like level of anthemic punk in &quot;Tuck It Away,&quot; or the almost rockabilly-into-swing attitude of &quot;Predators.&quot; Nearly every song shoots along at a fast clip, but there is a period of slower beats and riffs -- &quot;My Politics&quot; starts off a bit calmer and even hits a reggae midsection before turning back into a monstrous rock slash, while &quot;State of Grace&quot; finds slower moments to its advantage. If there's a point of sheer, overwhelming musical power, &quot;Lost,&quot; with its complex construction and arrangement -- showing the stop-on-a-dime rhythm skills of the group just as well as their vocal and lyrical intensity -- is the number. Building up to at least two separate and equally compelling climaxes, it's another in the series of high points from a truly remarkable band.  --Ned Raggett, AMG\n\n\nReleased \tOctober 1995\nRecorded \t1995\nGenre \t\tPunk rock\nLength \t\t51:19\nLabel \t\tAlternative Tentacles\nProducer \tNomeansno\n\n\nPersonnel\n\n* Tom Holliston - Guitar, Vocals\n* John Wright - Vocals, Drums, Keyboards\n* Rob Wright - Vocals, Bass\n\n\nThis is NMR, probably from a nifty russian site, thanks to the original uploader.\n\nEnjoy.","torrent":{"xt":"urn:btih:7deb19a5016b74e045591f4cbee7d45e4e73d569","amp;dn":"NoMeansNo+-1995-+The+Worldhood+Of+The+World","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7deb19a5016b74e045591f4cbee7d45e4e73d569","infoHashBuffer":{"type":"Buffer","data":[125,235,25,165,1,107,116,224,69,89,31,76,190,231,212,94,78,115,213,105]},"announce":[],"urlList":[]}}