{"title":"GTS Enterprise","uid":11604351,"size":63673377,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:7e0e0707f20eee25f27cd40181e60abec8379e96&amp;dn=GTS+Enterprise&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":1,"time":1417390166,"description":"Our Basic GTS Enterprise includes the following additional features:\nAdditional web-interface support (source code included):\nUser &quot;Role&quot; administration support.\nCustom StatusCode descriptions administration support.\n&quot;System Administrator&quot; account support providing the ability to create new accounts through the web-interface.\n&quot;System Information&quot; page which summarizes basic GTS system attributes\nA &quot;Lite&quot; version of the Event Notification Rules-Engine feature which provides the ability to send notification based on chosen criteria (minor code changes may be necessary to implement additional notification criteria).\nGTS DB administration utility (binary) with user interface.\nConfiguration Assistant utility (binary) to help with simple configuration changes (Linux platforms required).\nAdditional configured reports:\nTrip Detail Report - Displays the start time/location, and stop time/location, of various &quot;trips&quot; made within the selected date range.\nGeozone/Geofence Report - Displays the arrival times and departure times of various travelled geozones/geofences, with the total amount of time spent within each geozone/geofence.\nGeozone/Geofence Arrival Report - Displays the time spent within each geozone/geofence.\nGeozone/Geofence Departure Report - Displays the departure time and driving time between each geozone/geofence\nIgnition Detail/Summary Reports - Displays the time between various Ignition On and Ignition Off events within the selected date range.\nDigital Input Detail Report - Displays the time between various Digitial Input on and off events within the selected date range.\nTemperature Monitor Report - (requires temperature sensor support) Displays a report and graphs of temperature values.\nOBD Fault Code Report - (requires J1939/CANBUS support) Displays engine diagnostice fault codes.\nOBD Detail Report - (requires J1939/CANBUS support) Displays engine diagnostice detail information.\nPeriodic Service Report - (requires vehicle or GPS-based odometer) Displays periodic maintenance/service information.\nDistance Traveled Report - (requires vehicle or GPS-based odometer) Displays the distance travelled for various devices within the selected date range.\nFuel Usage Summary Report - (requires J1939/CANBUS support) Displays the Engine hours, Total fuel used, Idle hours, Idle fuel used, Work hours, Work fuel used, PTO hours, PTO fuel used, Miles driven, and Fuel economy for devices within the selected date range.\nUser Login Report - Displays the login times for various users within the account.\nAccount Login Report - (System Admin only) Displays the last login times for various accounts within the system.\nUnassigned Devices Report - (System Admin only, Requires device communication server support) Displays a list of devices which have attempted to send data to the server, but have not yet been assinged to an account/device record.\nSession Connection Status Report - Displays the wireless data usage estimates for various devices.\nAdditional documentation.\nAutostartup scripts (on reboot) for Fedora and CentOS.\nWeb-service support for accessing the GTS database and querying report, mapping, and database information in XML format.\nOutbound SMS gateway support for general email-to-sms services, Multitech SMS gateway hardware, &quot;Kannel&quot;, &quot;TextAnywhere&quot;, and &quot;Clickatell&quot;.\nIncluded device communication server (DCS) support:\n(these DCS modules are included with the basic GTS Enterprise. All other supported DCS modules are priced separately)\nSanav GC-101 TCP/UDP-mode protocol (personal tracker) [can be purchase from ElectronGPS]\nSanav GX-101 TCP/UDP-mode protocol [can be purchase from ElectronGPS]\nSanav GS-818 TCP/UDP-mode protocol [can be purchase from ElectronGPS]\nSanav CT-24 TCP/UDP-mode protocol (personal tracker) [can be purchase from ElectronGPS]\nAstra Telematics devces (AT240, AT110, AT210 - DCS supported by Astra).\nCelltracGTSâ„¢/Free for Android phones.\nCelltracGTSâ„¢/Pro for Android phones.\nAspicore GSM Tracker protocol (cell-phone tracking).\nTAIP (Trimble ASCII Interface Protocol).\nMost TK102/TK103 device protocols.\nDevice Communication Server support for &quot;Unassigned Devices&quot; to keep track of incoming communication from remote GPS tracking units that have not yet been assigned to an Account/Device.\nPurchase includes 30 days of technical/configuration support. (Continued upgrade support, and remote installation, via &quot;ssh&quot;, on selected Linux distributions also available for additional fee).\nThe above list describes the items included with the Basic GTS Enterprise.\nThe Basic GTS Enterprise installation is required when using any of the additional add-on modules described below, as they utilize the additional features provided by the Basic GTS Enterprise. \n\nSee the Feature Comparison chart below for a comparison of the various module features. \n\n\n\nEvent Notification Rules Engine (ENRE) \n(see also the Feature Comparison chart below) \n\nAs a separately priced add-on to the above Basic GTS Enterprise, we can provide a full commercial version of our Event Notification Rules Engine (ENRE) which includes the following features:\nEvent Notification Rules-Engine support module (binary) license, which can analyze incoming events and send notifications based on certain pre-defined criteria, device digital-input changes, analog inputs, or other conditions provided by the device.\nThe Event Notification Rules-Engine module can also be used for selecting specific icons to display on a map based on the specific type of event. Such as displaying a specific icon for &quot;ignition on&quot; events, etc.\nGeoCorridor (route-based) geofencing support.\nAdditional web-interface for creating event rules.\nDocumentation for creating and using event rules.\nAssistance in setting up various types of 'Rules'.\nPurchase includes 30 days of technical/configuration support. (Continued upgrade support also available for an additional fee)","torrent":{"xt":"urn:btih:7e0e0707f20eee25f27cd40181e60abec8379e96","amp;dn":"GTS+Enterprise","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e0e0707f20eee25f27cd40181e60abec8379e96","infoHashBuffer":{"type":"Buffer","data":[126,14,7,7,242,14,238,37,242,124,212,1,129,230,10,190,200,55,158,150]},"announce":[],"urlList":[]}}