{"title":"Ketugadu 2015 Telugu DvDscr AAC-SSM {Incl Sample}","uid":12492677,"size":813348998,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7e7350f25d6a404c3e0b4d65b34a69a93faaa9a8&amp;dn=Ketugadu+2015+Telugu+DvDscr+AAC-SSM+%7BIncl+Sample%7D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SSM2015","files":5,"time":1443204177,"description":"SSMovie.co presents:\r\n\r\nKetugadu 2015 Telugu DvDscr AAC-SSM {Incl Sample}\r\n\r\nScreens:\r\n \nhttp://ssmovie.co/ketugadu-full-movie-2015-telugu/\r\n\r\nMovie Review:\r\n\r\nA hero who lifts costly things and makes a luxurious living is a familiar character in Indian cinema.  Such a hero becoming a saviour of the damsel in distress, too, is a familiar premise.  'Ketugadu' begins on this note and goes on to deliver a hunt and chase drama, peppered with liberal doses of Sapthagiri and Praveen.\r\n\r\nTejas of 'Ulavacharu Biryani' fame is Chandu, who steals costly cars with Praveen in tandem.  Chandu bumps into a beautiful girl (played by Chandini Chowdhary) and falls in love with her instantly.  After a club dance he played too busily, he misses her.  After two scenes, he bumps into her again, this time the meeting lands him in trouble.\r\n\r\nChandini is the sister of Prakash, played by Rajeev Kanakala.  Prakash is a rich businessman who also acts like a don.  With his terrible suave body language, he tries to reinvent himself.  Chandini is supposed to have been abducted by Tejas, but there is more to it than meets the eye.\r\n\r\nPrakash refuses to take his sister back when Chandu, who now wants to get rid of Chandini, calls him up.  The sister is shell-shocked. She may be grief-stricken but we really don't feel it.\r\n\r\nFrom this point, the lead pair have to be on the run from two or more characters.\r\n\r\nTejas plays a character that demands of him to be uni-dimensional.  He has macho looks and when it comes to showing an expression in a romantic scene, he comes a cropper. \r\n\r\nChandini comes with a good screen presence but she needs to cone her acting skills better.\r\n\r\nThe film needed to have something exciting to keep the audience glued.  After it becomes clear that Prakash has ulterior motives, the director introduces a string of comedy scenes.  After introducing Ajay as a tough man, he is treated to comedy scenes along with Sapthagiri.\r\n\r\nComing to Sapthagiri, he shows his spark yet again. He surely has a knack of delivering funny lines in his own inimitable style.  Some interesting ideas would have lead to investing imagination in the scenes involving the two.\r\n\r\nThe hero's car thief's side is thought to be so important that there is a song while he is on his way to steal a car that changes the game.\r\n\r\nRajeev Kanakala needed some more scenes so that the villainism would have helped build the right tempo.  On the whole, his character makes an impact and helps to take the story forward in an interesting way.\r\n\r\nIntroducing Ajay's character and the characters of Prithviraj (as the funny don, Bolero Babu) is a good idea.  They add some degree of excitement to the story.\r\n\r\nIn the script, some cliched elements could have been done away with.  For example, the buxom humour, the gay humour and such. \r\n\r\nAll the actors fit the bill and pass muster.  The technical aspects are apt.  While the music is OK, the cinematography is good","torrent":{"xt":"urn:btih:7e7350f25d6a404c3e0b4d65b34a69a93faaa9a8","amp;dn":"Ketugadu+2015+Telugu+DvDscr+AAC-SSM+%7BIncl+Sample%7D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e7350f25d6a404c3e0b4d65b34a69a93faaa9a8","infoHashBuffer":{"type":"Buffer","data":[126,115,80,242,93,106,64,76,62,11,77,101,179,74,105,169,63,170,169,168]},"announce":[],"urlList":[]}}