{"title":"The.English.Teacher.2013.HDRip.XviD-AQOS","uid":8864361,"size":811605081,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7ee0e4caea899f4de033045a273491e92706ec7f&amp;dn=The.English.Teacher.2013.HDRip.XviD-AQOS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"R0thschild","files":5,"time":1377821509,"description":"Genre: Comedy | Drama\nYear: 2013\nCountry: USA\nRuntime: 93 min\nDirector: Craig Zisk\nCast: Julianne Moore,Michael Angarano,Lily Collins,Greg Kinnear,Fiona Shaw,Nikki Blonsky\n\n.: Plot :.\nLinda Sinclair (Julianne Moore) is a forty-year-old unmarried high school English teacher in the small town of Kingston, Pennsylvania. She shares a small apartment with two Siamese cats and her rich collection of great literature. She maintains no close personal relationships aside from those she has with her favorite authors and stories. Her life is far less complicated than the dramas she devours on the page, and she likes it that way. But Linda's simple life turns an unexpected page when former star pupil Jason Sherwood (Michael Angarano) returns to Kingston after trying to make it as a playwright in New York. Now in his 20s, Jason is on the verge of abandoning art, pressured by his overbearing father, Dr. Tom Sherwood (Greg Kinnear), to face reality and go to law school. Linda can't stand the thought of Jason giving up on his dreams so she decides to mount his play - a dark, angst-ridden, ambitious work - as a Kingston High School production, with flamboyant drama teacher Carl Kapinas (Nathan Lane) directing. As Linda, now well out of her normal comfort zone, takes further risks in life and love, the stage is set for highly comic downfall. With the play, her reputation, and her teaching career on the line, Linda finds an unlikely ally in herself. Amidst the ruins of her formerly perfect life, can she find a way to her own unique storybook ending?","torrent":{"xt":"urn:btih:7ee0e4caea899f4de033045a273491e92706ec7f","amp;dn":"The.English.Teacher.2013.HDRip.XviD-AQOS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ee0e4caea899f4de033045a273491e92706ec7f","infoHashBuffer":{"type":"Buffer","data":[126,224,228,202,234,137,159,77,224,51,4,90,39,52,145,233,39,6,236,127]},"announce":[],"urlList":[]}}