{"title":"Live Yardbirds! Featuring Jimmy Page[ORIGINAL RECORDING REISSUED","uid":4736629,"size":342910963,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7ee788d2aa79f54edf279850070293c45403cfe8&amp;dn=Live+Yardbirds%21+Featuring+Jimmy+Page%5BORIGINAL+RECORDING+REISSUED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"thewall68","files":20,"time":1235362114,"description":"Releaser: thewall\n\nExtractor: EAC 0.99 prebeta 4  \nRead Mode: Secure with NO C2, accurate stream, disable cache.\nCodec: Flac 1.2.1;  Level 8  \nSource: Original CD \nArtwork:  Full Scans 300dp.\n\n\nMarch 30, 1968, and the Yardbirds had come to the Lower East Side's Anderson Theatre to make what was ultimately to be their farewell concert in New York. That had fallen on evil times, this most progressive of the English rhythm 'n blues bands that had coalesced around the old Crawdaddy Club in Richmond. And now they were entering the twilight, with rumors of an imminent break-up following them wherever they would go. Gone were the screaming girls, the anguished teenyboppers who would plaster themselves all over the stage as soon as Keith Relf stepped toward the microphone; gone also were the hit singles, the flash of a Clapton or Beck, the incredibly progressive drive that was so much a part of them during the good years. All that was left was the rhythm section of McCarty/Dreja, Keith's voice and harp and a good-credentials-but-who-is-he-anyway lead guitarist named Jimmy Page.\n\nAnd so, for the hordes of fans who faithfully made the pilgrimage to Second and Fourth on that star-crossed night, the question was whether or not the Yardbirds would be able to get it on in the way most of the remembered; like the way Clapton sort of nudged that perfect four-second break in &quot;Here 'Tis&quot; or all those insane stops and starts in &quot;I'm Not Talking&quot;; or maybe &quot;Happenings Ten Years Time Ago&quot; which is definitely so far ahead of its time.\n\nWhich meant that now, on this Saturday night, you were sitting in your seat about halfway down and over to the left, breathing in that very particular atmosphere which comes when you know you're on the verge of an event, aimlessly staring around an old vaudeville museum piece from a timeless, far away era, to the stage, up to the galleries, just killing time....\n\nWell, getting the benefit of three years' hindsight to look back at the occasion, let me tell you that you're in for one of those maniac rock 'n roll times, which you're going to carry out of that theatre and tell all your friends about, and which they're about to tell all their friends, and so on, until you have on your hands a concert which approaches legend. LEGEND! You know, like the time when the Rolling Stones played at the Academy of Music, or the Shangri-Las came to St. Augustine's, or the Beatles first appeared on Ed Sullivan, or... (blow the dust off; a little rustle of the rock 'n roll history pages) ...maybe even when the MC5 played that day in a Chicago park. You know the kind. Even if you weren't there, you probably still went through each and every one of them, feeling all the little imperceptible ways those performances changed the world around you.\n\nBut this night, it was the Yardbirds' turn. Like on the group's first series of albums, the machines of loving grace had long been set up, all prepared to perform their god-given function, which was to take down in meticulous detail the events about to transpire, as unobtrusively as possible. All the wires were checked, amps switched on, the house lights beginning to dim, the crowd instinctively bringing its hands together, the surge forward: (mumble mumble) &quot;live on Epic Records at the Anderson Theatre The Yardbirds!&quot; And then there was Keith walking out, a little stiff (is he getting older?), and it's his voice that's next--&quot;Thank you very much indeed thank you we're gonna start off with a thing called 'The Train Kept A-Rollin'.'&quot; And then they've begun.\n\nAnd from the very start, you know it's about to happen. The Greatest Concert Ever, at least of this week, and if you think of the Yardbirds like I do... which is to say that there were groups that came out of England and there were Groups That Came Out Of England and the Yardbirds were a GTCOOE... well, you get the picture. Jimmy Page, already in the process of forming the New Yardbirds (which would eventually become a combination called Led Zeppelin, and if you listen to &quot;I'm Confused&quot; on the first side, you'll understand how that little number works), plays guitar on this album like you would not believe. There's a point toward the end of &quot;I'm A Man&quot; where he literally becomes possessed by strange, unknowable forces, and if you don't believe me, it comes somewhere during the second break. He also bows his instrument like a violin on two separate occasions, and the sound is as sweet as if it were a Stradivarius in his hands.\n\nLet's not forget Keith, either. As a master of ceremonies, he always knew that subtle set of tricks to keep the crowd moving with him from song to song, to deliver each patterned phrase with a kind of flourish and genuine sincerity, disarming even the staunchest of Cliff Richard's fans. There are times when he sounds bitter here, a little tired of running on the music business treadmill for so long; and there are others when he comes off as hopeful, refreshed and pleased by the exciting reception, buoyed up for another time. Musically, his voice and harp have never sounded better, taking on a live edge that sometimes got lost on his more restrained studio stuff, and he weaves through each separate part of the group with the natural air of a born leader. This is his band, you remember, nursed carefully along the whole road and no matter all the hard times that have gone down, are going down, will be yet to come, he's proud of them.\n\nFor Jim McCarty and Chris Dreja, this was similarly their finest moment, standing in the shadows and keeping the whole structure from toppling over. Dreja played bass as he once had played rhythm guitar, a stable mass held taut by a single string, and McCarty's precise and militaristic rhythms kept close watch on him. You never noticed them much, until you happened to look, and it was always reassuring to find them both right there, driving along like twin steam shovels.\n\nBut even though none of the group could probably yet admit it, there was a feeling of finality to the night that couldn't be denied, a notion that the Yardbirds as we had known them were soon to be no more. They played most of their older hits during the course of the show, gleaming standards that had easily stood the test of time, had been refined to the point of perfection. There was some new stuff--like Garnett Mimms' &quot;My Baby,&quot; or Jimmy's new showpiece of &quot;White Summer&quot;--but they were somehow outside the pale of the Yardbirds, not actually a part of their accepted world. Keith must have noticed it: &quot;Nostalgia,&quot; he comments at the end of &quot;Over Under Sideways Down,&quot; the crowd cheering mightily as if building on it. Even then, though, the standard Yardbird brands of nostalgia were still a generation ahead of their time. Which is why, in case you were wondering, we're all here today.\n\nThis is it, folks. This One You've Been Waiting For. The Yardbirds: Live At The Anderson Theatre. March 30, 1968.\n\n\nThis is the album you've been waiting to hear on CD. Lovingly remastered and repackaged using the original color cover artwork, &quot;Live Yardbirds! Featuring Jimmy Page&quot; presents The Yardbirds' Anderson Theatre concert in New York from March 30, 1968 in the best possible quality.\n\n\nDont get bootlegs or audience tapes of this show! For the first time, the entire Yardbirds performance from that night has been presented on one disc. Get it now!\n\n\n\nTrack Listings\n\n\n1. Train Kept A-Rollin' (Sound Check)\n2. Dazed And Confused (Sound Check)\n3. The Train Kept A-Rollin'\n4. You're A Better Man Than I/Heart Full of Soul\n5. Heart Full Of Soul\n6. Dazed And Confused\n7. My Baby\n8. Over, Under, Sideways, Down\n9. Drinking Muddy Water\n10. White Summer (Page Solo Instrumental)\n11. I'm A Man (12 minutes) \n\n\n\n\ncolombo-reloaded.org","torrent":{"xt":"urn:btih:7ee788d2aa79f54edf279850070293c45403cfe8","amp;dn":"Live+Yardbirds%21+Featuring+Jimmy+Page%5BORIGINAL+RECORDING+REISSUED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ee788d2aa79f54edf279850070293c45403cfe8","infoHashBuffer":{"type":"Buffer","data":[126,231,136,210,170,121,245,78,223,39,152,80,7,2,147,196,84,3,207,232]},"announce":[],"urlList":[]}}