{"title":"L'Etranger - 85 days in font","uid":4308355,"size":2089059134,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7f193fb6f387d5b1e52122987264b18a82d28fff&amp;dn=L%5C%27Etranger+-+85+days+in+font&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pascalbrown","files":1,"time":1216677054,"description":"L&amp;#039;Etranger - 85 days in Font\n\nwww.unclesomebody.com\n\n\nIt&amp;#039;s finally finished. My random assortment of footage has been put together in a true &quot;will it blend&quot; fashion and the answer is a resounding yes. The New Yorker reviewed an early copy and said this of L&amp;#039;Etranger; &quot;without doubt, the greatest film about bouldering in Fontainebleau to come out in 2008 and also be completely free&quot;. With reviews like that you should be in no doubt that you&amp;#039;re not going to be disappointed.\n\nIn order to watch the trailer you need to go to; http://www.vimeo.com/1341149\n\nThis film is basically a view on how I spent my days in font. It&amp;#039;s not all encompassing, nor is it a true look into the psyche behind a goal orientated individual. If you want that, then please check out my blog and read through some of the older posts. That was the place I tended to vocalise all my thoughts whilst I was in font. In many ways this film is almost like a companion to my blog and it serves as a visual reference for my days spent in the forest. My film crew consisted of only myself, and my tripod did a faithful job of keeping the camera still. I&amp;#039;ve learned a lot by making this film and the major thing I have realised is that you can&amp;#039;t make a great film if you are filming, directing, and (most importantly) concentrating on climbing. It&amp;#039;s simply not possible to do all these things well if you are trying to do them simultaneously. I did have the occasional helping hand from Sara when she came down, which sometimes made things easier and sometimes led to my frustration, which was really stupid and immature of me. I am indebted to your help Sara. What I have made is a faithful representation of my trip and I hope that it allows you to see some things you haven&amp;#039;t seen before. Fontainebleau is a truly amazing place and so far my favourite bouldering area in the world. I hope that this film motivates you in some way to go there and enjoy the incredible boulders and the great vibe of the forest. I also hope that there is at least one boulder problem in this film that you either haven&amp;#039;t seen before, or haven&amp;#039;t seen climbed before. If there is someone who has seen them all climbed by someone before then you should get a prize, so contact me for it!\n\nThe governing principle of freeconomics is that you make money by giving things away for free. Take a look around my site and you won&amp;#039;t see any ads, which should lead you to the conclusion that my freeconomics application isn&amp;#039;t very thorough! The reason is that I&amp;#039;m not really trying to make any money out of all this!\n\nNow the interesting bit. So far so good, I hope. Since I&amp;#039;m trying to stick to this principle of freeconomics I&amp;#039;m opening up the option for you to make a donation to me after you&amp;#039;ve received/watched the video. Basically, if you think it was worthless you can send me an abusive email detailing exactly why you thought so (which will help me for next time!). If you think it was worth some monetary amount then you are free to send me whatever amount you like via paypal, cheque, cash, or even via another medium like a free lunch, sweets, fresh sushi, etc. It&amp;#039;s all up to you, and I&amp;#039;ll certainly harbour no ill feelings against you if you simply decide to do nothing (this is the expected reference level).\n\nI would have made this film with or without an audience to present it to, and it is only because I think there might be some interest that I am releasing it to the world. I hope I&amp;#039;m not wrong!\n\nThis film wouldn&amp;#039;t have been possible without certain people who helped make my trip to Fontainebleau a reality. I owe Neil, Christine, and Thomas big time for allowing me to stay at their amazing home, Maisonbleau. If you are going to font, then have a look at their website for accommodation. Also, I want to thank my mum, who puts up with all my climbing quirks, says nothing when she returns from holiday to find a board in her garage, and always supports me even though she thinks I should get a job and develop a career. A million thanks to Sara for so much that words can&amp;#039;t convey. You&amp;#039;ve got the best of me. The other people I should thank are those that inspired me even though I haven&amp;#039;t even met some of them! Kevin Lopata, Antoine Vandeputte, Dave Graham, Richard Simpson, Jerry Moffatt, Ben Moon, Danny and Sam Cattell, and of course Mr Camus.\n\nIf you want a few technical details about the flick (some people are that way inclined) then here is the run down. I shot it all with a Canon HV20 using it&amp;#039;s 24p feature. This is a great HDV camera and if you&amp;#039;re watching the HD version I&amp;#039;m sure you&amp;#039;ll see just how great the quality is. I&amp;#039;ve edited it using a combination of Sony Vegas Pro and Adobe After Effects.\n\nProblem List;\nAerodynamite 7B+\nCarnage 7B+\nLa Berezina 7C\nBerezina Carnage 7C+\nLa Balance sans 7C+\nBicep Mou 7B\nNoir Desire 7C\nChatterton 7B/8A\nMisericorde 7C+\nVoyage au centre de la terre 7B\nGargantoit 7A+\nMegalight 7B\nXXX Direct/Usbek 7C\nLes Nombriliste 7A+\nCoup de Patte 7C\nNeverland 8A\nOuzo 8A\nLa Coccinelle 8A\nFata Morgana 8A\nLa Danse des Balrogs 8A+ (Actually at Branson, Switzerland)\nPartage 8A+\nGourmandise 8B\n\nPEACE! Thanks for watching. Check out my website; www.unclesomebody.com","torrent":{"xt":"urn:btih:7f193fb6f387d5b1e52122987264b18a82d28fff","amp;dn":"L%5C%27Etranger+-+85+days+in+font","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f193fb6f387d5b1e52122987264b18a82d28fff","infoHashBuffer":{"type":"Buffer","data":[127,25,63,182,243,135,213,177,229,33,34,152,114,100,177,138,130,210,143,255]},"announce":[],"urlList":[]}}