{"title":"Lord of The Rings BBC","uid":14350457,"size":180606535,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:803e09e081c2c927641e0d27ab07db8b59e06a15&amp;dn=Lord+of+The+Rings+BBC&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Beanhh123","files":78,"time":1461018999,"description":"Unabridged BBC Dramatization of the abridged The Lord of the Rings Thirteen CDs, 13 hours In ancient times the Rings of Power were crafted by the Elven-smiths, and Sauron, The Dark Lord, forged the One Ring, filling it with his own power so that he could rule all others. But the One Ring was taken from him, and though he sought it throughout Middle-earth, it remained lost to him. After many ages it fell, by chance, into the hands of the hobbit, Bilbo Baggins. From his fastness in the Dark Tower of Mordor, Sauron's power spread far and wide. He gathered all the Great Rings to him, but ever he searched far and wide for the One Ring that would complete his dominion. On his eleventy-first birthday Bilbo disappeared, bequeathing to his young cousin Frodo the Ruling Ring and a perilous quest -- to journey across Middle-earth, deep into the shadow of the Dark Lord, and destroy the Ring by casting it into the Cracks of Doom. The Lord of the Rings tells of the great quest undertaken by Frodo and the Fellowship of the Ring: Gandalf the Wizard, the hobbits Merry, Pippin, and Sam, Gimli the Dwarf, Legolas the Elf, Boromir of Gondor, and a tall, mysterious stranger called Strider. This outstanding BBC radio version of &quot;The Lord of the Rings&quot; includes Ian Holm as Frodo, Michael Hordern as Gandalf, Robert Stephens as Aragorn, and John Le Mesurier as Bilbo","torrent":{"xt":"urn:btih:803e09e081c2c927641e0d27ab07db8b59e06a15","amp;dn":"Lord+of+The+Rings+BBC","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"803e09e081c2c927641e0d27ab07db8b59e06a15","infoHashBuffer":{"type":"Buffer","data":[128,62,9,224,129,194,201,39,100,30,13,39,171,7,219,139,89,224,106,21]},"announce":[],"urlList":[]}}