{"title":"Milemarker - 4 Albums (1998-2005) [FLAC]","uid":8257399,"size":1074355707,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:80c583ad43bef0ee7dd040757bff47173b9d383c&amp;dn=Milemarker+-+4+Albums+%281998-2005%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"politux","files":-1,"time":1363292314,"description":"\n  Milemarker - 4 Albums (1998-2005) [FLAC]\n\n  Released: 1998-2005\n  Genre: Pop/Rock\n  Style: Alternative, Experimental\n  Codec: FLAC\n  Bit Rates: ~ 800 - 1,000 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n  \n  1998 - Future Isms\n  2001 - Anaesthetic \n  2002 - Satanic Verses\n  2005 - Ominosity\n\n  Combining a theatrical stage approach, scabrous, angular guitars, and a vaguely political aesthetic, Milemarker formed as a three-piece in the summer of 1997 when drummer Ben Davis moved from Washington, D.C., to Chapel Hill, where he hooked up with longtime friends, guitarist Dave Laney and bassist Al Burian. When their various other bands broke up at the end of the summer, Milemarker became the trio's primary focus, and they expressed their renewed intent on recording and touring.\n\n  Uninterested in re-creating their live show on record, Milemarker's initial recordings are lo-fi excursions overflowing with samples, loops, and a variety of manipulated sounds. Their first full-length, Non Plus Ultra (Paralogy), was released in early 1998, after which they were accompanied on tour by roommate Roby Newton, who handled the band's light show and tape loops. The show includes snippets of ranting evangelical preachers played as background noise while the band is clad in shirts bearing the names of the four riders of the apocalypse, prompting one audience member to congratulate them on spreading the &quot;Christian message.&quot;\n\n  The band's second album, Future Isms (Stick Figure), was released at the end of the year and moved the band toward re-creating their hardcore live sound, which now included immolation of the drum set. The album actually features Laney on drums and Davis playing keyboards, but after a brief tour without Davis, during which Sean Husick joined the band on drums, Davis returned to the band. In the fall of 1999, the band recorded their third album, Frigid Forms Sell (Lovitt/Jade Tree), with producer Brian McTernan (Cave-In, the Explosion) at Salad Days in Washington, D.C., as a five-piece, with Husick joining the band as its permanent drummer, Newton on keyboards and vocals, and Davis doing a little of everything. But Davis was left behind as the band toured Europe and the U.S. (twice) and is then left in Chapel Hill when the rest of the band moved to Chicago.\n\n  Signing with Jade Tree, and with McTernan again producing, the band recorded their most accomplished album to date, Anaesthesia, in March of 2001. They toured Japan during the summer, after which, Husick quit the band to pursue a solo career. He was replaced on drums by Noah Leger.","torrent":{"xt":"urn:btih:80c583ad43bef0ee7dd040757bff47173b9d383c","amp;dn":"Milemarker+-+4+Albums+%281998-2005%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80c583ad43bef0ee7dd040757bff47173b9d383c","infoHashBuffer":{"type":"Buffer","data":[128,197,131,173,67,190,240,238,125,208,64,117,123,255,71,23,59,157,56,60]},"announce":[],"urlList":[]}}