{"title":"Wilco - 2007 - Sky Blue Sky  [EAC - FLAC]","uid":4633218,"size":318571257,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:81248f63d5adf1419c3e2c719b370adbacc5904c&amp;dn=Wilco+-+2007+-+Sky+Blue+Sky++%5BEAC+-+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"bludStain","files":-1,"time":1231461735,"description":"Wilco - 2007 - Sky Blue Sky\n\nReview    by Mark Deming\n\nIn 1999, Wilco willingly abdicated their position as one of the leading acts in the alt-country movement to dive head-first into the challenging waters of experimental pop with their album Summerteeth, and moved even further away from their rootsy origins with Yankee Hotel Foxtrot and A Ghost Is Born, winning the group a new and enthusiastic audience along the way. So it might amuse a number of the band's earlier fans that in many respects Wilco's sixth studio album, Sky Blue Sky, sounds like the long-awaited follow-up to 1996's Being There -- while it lacks the ramshackle shape-shifting and broad twang of that earlier album, Sky Blue Sky represents a shift back to an organic sound and approach that suggests the influence of Neil Young's Harvest and the more polished avenues of '70s soft rock. Sky Blue Sky also marks Wilco's first studio recordings since Nels Cline and Pat Sansone joined the group, and they certainly make their presence felt -- with Cline, Wilco has its strongest guitarist to date, and while his interplay with Sansone on numbers like &quot;Impossible Germany&quot; and &quot;Walken&quot; lacks the skronky muscle of his more avant-garde work of the past, it's never less than inspired and he works real wonders with Jeff Tweedy's lovely melodies. Sansone's keyboard work also shines, adding soulful accents to &quot;Side with the Seeds&quot; and Mellotron on &quot;Leave Me (Like You Found Me),&quot; as does Mikael Jorgensen's piano and organ, and overall this is Wilco's strongest album as an ensemble to date. Tweedy's vocals boast a clarity and nuance that reveals he's grown in confidence and skill as a singer, and the songs recall Summerteeth's beautiful but unsettling mix of lovely tunes and lyrics that focus on troubled souls and crumbling relationships. Between the pensive &quot;Be Patient with Me,&quot; the lovelorn &quot;Hate It Here,&quot; and &quot;On and On and On&quot;'s pledge that &quot;we'll stay together&quot; squared off against the resignation of &quot;Please don't cry/We're designed to die,&quot; Sky Blue Sky isn't afraid to go to the dark places, but Tweedy and his bandmates also find plenty of beauty, inspiration, and real joy along the way, and the album's open, natural sound is an ideal match for the material. Sky Blue Sky may find Wilco dipping their toes into roots rock again, but this doesn't feel like a step back so much as another fresh path for one of America's most consistently interesting bands.\n\nTracks\n01  Either Way     Tweedy     3:07\n02  You Are My Face     Cline, Tweedy     4:38\n03  Impossible Germany     Tweedy, Wilco     5:58\n04  Sky Blue Sky     Tweedy     3:23\n05  Side with the Seeds     Jorgensen, Tweedy     4:16\n06  Shake It Off     Tweedy     5:42\n07  Please Be Patient with Me     Tweedy     3:19\n08  Hate It Here     Tweedy, Wilco     4:33\n09  Leave Me (Like You Found Me)     Tweedy     4:10\n10  Walken     Tweedy, Wilco     4:27\n11  What Light     Tweedy     3:35\n12  On and On and On     Tweedy, Wilco     6:33 ","torrent":{"xt":"urn:btih:81248f63d5adf1419c3e2c719b370adbacc5904c","amp;dn":"Wilco+-+2007+-+Sky+Blue+Sky++%5BEAC+-+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81248f63d5adf1419c3e2c719b370adbacc5904c","infoHashBuffer":{"type":"Buffer","data":[129,36,143,99,213,173,241,65,156,62,44,113,155,55,10,219,172,197,144,76]},"announce":[],"urlList":[]}}