{"title":"Jimmy Fallon - The Bathroom Wall (2002) [320]","uid":7443077,"size":88473844,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8137d7f08baa6dfeeed575db27d0d779dfaf3069&amp;dn=Jimmy+Fallon+-+The+Bathroom+Wall+%282002%29+%5B320%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rambam1776","files":-1,"time":1342280874,"description":"When Jimmy Fallon released his album of comedic songs and stand-up routines in late summer 2002, it was perfect timing. His &quot;It Boy&quot; status had no sign of stopping either; he had graced the covers of Interview, SPIN, and Paper. He served as host for both the 2001 MTV Movie Awards and the 2002 MTV Video Music Awards. His SNL co-starring spot next to Tina Fey on &quot;Weekend Update&quot; showcased Fallon's role as the ideal celebrity: both charming and dorky. Yeah, he wasn't exactly in the league of Adam Sandler, but he was well underway in making a club of his own. The Bathroom Wall is basically Fallon's own mix tape of high school fights, bad athletic performances, and collegiate experimentation combined with a dose of rock &amp; roll mayhem. First single, &quot;Idiot Boyfriend,&quot; struts with soul, nerdy appeal; Fallon's Mick Jagger falsetto is loose and sweet. &quot;(I Can't Play) Basketball&quot; slices and dices funk and hip-hop, Beastie Boys-style, but it's the pop-punk snarl of &quot;Road Rage&quot; that finds Fallon in his finest musical moment. It's very Brit-pop, like Blur, with crashing guitars and quick-stepped percussion. Fallon's tale of being &quot;that&quot; driver on the road is hilarious, and vocally, he's not that bad. Realistically, it's known that Sandler can't sing a lick, so Fallon has him beat by just a bit. His stand-up routines are equally amusing. His impersonations of John Travolta, Jerry Seinfeld, Robin Williams, and Cheers' Cliff Claven are uncanny on &quot;Troll Doll Celebrities.&quot; &quot;Troll Doll Jingles&quot; finds Fallon mimicking U2's &quot;Desire,&quot; Counting Crows' &quot;Mr. Jones,&quot; and Dave Matthews Band's &quot;So Much to Say,&quot; but the spoof of Coldplay's &quot;Yellow&quot; is absolutely right on. Other highlights on The Bathroom Wall are &quot;Chris Rock Was My R.A.&quot; and Fallon's homage to '80s music on &quot;Hammertime.&quot; Those who remember teen angst and the awkwardness of becoming an adult will find humor in The Bathroom Wall. Fallon taps into what all made you laugh and smile during those weird days.\n\n01 - Idiot Boyfriend\n02 - (I Can't Play) Basketball\n03 - Drinking In The Woods\n04 - Road Rage\n05 - Snowball\n06 - Hope Everyone Enjoyed Homecoming This Year\n07 - Troll Doll Celebrities\n08 - Dorms, Shower Baskets &amp; The Walk Of Shame\n09 - Roommates\n10 - Hotplates, Four Digit Numbers &amp; The Little Fridge\n11 - Chris Rock Was My RA\n12 - Gotta Get A Fake I.D.\n13 - Troll Doll Jingles\n14 - Hammertime","torrent":{"xt":"urn:btih:8137d7f08baa6dfeeed575db27d0d779dfaf3069","amp;dn":"Jimmy+Fallon+-+The+Bathroom+Wall+%282002%29+%5B320%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8137d7f08baa6dfeeed575db27d0d779dfaf3069","infoHashBuffer":{"type":"Buffer","data":[129,55,215,240,139,170,109,254,238,213,117,219,39,208,215,121,223,175,48,105]},"announce":[],"urlList":[]}}