{"title":"Psycho-Oncology, Second Edition","uid":8212099,"size":8365965,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:83a5c850206feb3aff83dfa2162c42b56fce2720&amp;dn=Psycho-Oncology%2C+Second+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"imarion","files":-1,"time":1362260605,"description":"Psycho-Oncology, Second Edition By Jimmie C. Holland, William S. Breitbart, Paul B. Jacobsen, Marguerite S. Lederberg, Matthew J. Loscalzo, Ruth McCorkle\n2010 | ISBN : 019536743X | 720 pages | PDF | 8 MB\n\n\nOriginally published by Oxford in 1998, Psycho-Oncology was the first comprehensive text in the field and remains the gold standard today. The second edition reflects the explosion of information and major advances in psychological, psychiatric, and social aspects of cancer treatment and research since the book's inception. Spearheaded by Dr. Jimmie Holland, who is widely recognized as the founder of the field of psycho-oncology, the book's editors are a veritable who's who of psycho-oncology, reflecting the interdisciplinary nature and global reach of this growing field.\n\nSome of the highlights of the revision include new or expanded coverage of topics including cognitive dysfunction caused by chemotherapy, major 'somatopsychic' symptoms caused by proinflammatory cytokines, evidence-based clinical practice guidelines from around the world, survivorship issues, psychotherapeutic interventions, and psychopharmacologic interventions. Developed in collaboration with the American Psychosocial Society and the International Psycho-oncology Society, this fully updated text will be of interest to psychiatrists, psychologists, mental health counselors, oncologists, hospice workers, and social workers. ","torrent":{"xt":"urn:btih:83a5c850206feb3aff83dfa2162c42b56fce2720","amp;dn":"Psycho-Oncology%2C+Second+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83a5c850206feb3aff83dfa2162c42b56fce2720","infoHashBuffer":{"type":"Buffer","data":[131,165,200,80,32,111,235,58,255,131,223,162,22,44,66,181,111,206,39,32]},"announce":[],"urlList":[]}}