{"title":"VA - American Roots Of The British Invasion (2002)","uid":8654446,"size":269264679,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:83a72d7b95ca7d108930d3d46f61a4744cfbb59b&amp;dn=VA+-+American+Roots+Of+The+British+Invasion+%282002%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":26,"time":1373180936,"description":"This is the same torrent that was uploaded to Demonoid in August 2011.\n\n\nVarious Artists - American Roots Of The British Invasion (2002)\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/41D15SHPQJL._SL500_AA300_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/41D15SHPQJL._SL500_AA300_.jpg&lt;/a&gt;\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com) DVD-ROM: LG GDR816B\nTracks have full tags (including embedded thumbnail)\nAMG Review.txt\ninfo.txt (which is simply these notes included in the torrent)\n\nAll Music Album Review (by Richie Unterberger):\n\nThese are the original versions of 20 American songs, mostly but not all rock &amp; roll, covered by British Invasion bands in the mid-'60s, usually but not always for hits. To do a comprehensive survey of original versions of British Invasion classics, you'd need a few shelves of CDs. But this does have many of the better ones, and even if the stylistic threads connecting them are thin other than the British Invasion connection, it's a pretty great listen, taking in various strands of high-grade American rock &amp; roll from the 1950s and first half of the 1960s. Although just about all of this stuff appears on more than one compilation (and sometimes on many compilations), there are still many listeners who know the British Invasion covers of many of the songs, but not the originals. For instance, there is Chan Romero's &quot;Hippy Hippy Shake&quot; covered by the Swinging Blue Jeans (and the Beatles, though their version didn't come out officially until the 1990s); the Shirelles' &quot;Boys,&quot; done on the Beatles' first album; the Donays' girl group classic &quot;Devil in His Heart,&quot; done on the Beatles' second album; Barbie Gaye's peppy 1957 rock &amp; roller &quot;My Boy Lollipop,&quot; covered by Millie Small; Bessie Banks' soul-pop ballad &quot;Go Now,&quot; a hit for the Moody Blues; and Dr. Feelgood's &quot;Mr. Moonlight,&quot; covered by the Beatles. And more: Bobby Day's &quot;Over and Over&quot; was done by the Dave Clark Five, Evie Sands' fetching girl group-ish &quot;I Can't Let Go&quot; by the Hollies, and Del Shannon's dramatic ballad &quot;I Go to Pieces&quot; by Peter &amp; Gordon. Getting more obscure, Little Willie John's &quot;Leave My Kitten Alone&quot; was indeed recorded by the Beatles in 1964, but that cover wasn't released for three decades. Getting less obscure, the Isley Brothers' &quot;Twist and Shout,&quot; Maurice Williams &amp; the Zodiacs' &quot;Stay,&quot; Little Richard's &quot;Long Tall Sally,&quot; and John Lee Hooker's &quot;Boom Boom&quot; were all big hits in the United States before being taken up by British bands. There are also a couple of interesting detours outside of rock in Buck Owens' Bakersfield country classic &quot;Act Naturally,&quot; done by the Beatles, and Buffy Sainte-Marie's &quot;Universal Soldier,&quot; which gave Donovan an American hit. For the original versions of Beatles songs specifically, there are actually a few more on the 1986 Rhino LP Beatle Originals, including some important songs that don't appear on this CD, like Buddy Holly's &quot;Words of Love&quot; and Arthur Alexander's &quot;Anna (Go to Him).&quot; Still, a very fun CD this is, whether you're looking for the original versions or not. It seems kind of suspect, though, that Gene Pitney's &quot;Pretty Flamingo&quot; was the &quot;original&quot; for Manfred Mann's cover; Manfred Mann recorded that tune in March of 1966, the same year Pitney put it on an album.\n\nTaken from: &lt;a href=&quot;\nhttp://www.allmusic.com/album/american-roots-of-the-british-invasion-r597717/review&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/album/american-roots-of-the-british-invasion-r597717/review&lt;/a&gt;\n\nAmazon.com's page: &lt;a href=&quot; http://www.amazon.com/dp/B000069HJK&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.amazon.com/dp/B000069HJK&lt;/a&gt;\n\nTrack List:\n\n01. The Shirelles - Boys\n02. Maurice Williams And The Zodiacs - Stay\n03. Chan Romero - Hippy Hippy Shake\n04. The Isley Brothers - Twist And Shout\n05. The Donays - Devil In His Heart\n06. Barbie Gaye - My Boy Lollipop\n07. Little Willie John - Leave My Kitten Alone\n08. Larry Williams - Slow Down\n09. John Lee Hooker - Boom Boom\n10. Del Shannon - I Go To Pieces\n11. Little Richard - Long Tall Sally\n12. Bessie Banks - Go Now\n13. Dr. Feelgood &amp; The Interns - Mr. Moonlight\n14. Carl Perkins - Honey Don't\n15. The G-Clefs - I Understand (Just How You Feel)\n16. Buck Owens - Act Naturally\n17. Buffy Sainte-Marie - Universal Soldier\n18. Bobby Day - Over And Over\n19. Evie Sands - I Can't Let Go\n20. Gene Pitney - Pretty Flamingo\n","torrent":{"xt":"urn:btih:83a72d7b95ca7d108930d3d46f61a4744cfbb59b","amp;dn":"VA+-+American+Roots+Of+The+British+Invasion+%282002%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83a72d7b95ca7d108930d3d46f61a4744cfbb59b","infoHashBuffer":{"type":"Buffer","data":[131,167,45,123,149,202,125,16,137,48,211,212,111,97,164,116,76,251,181,155]},"announce":[],"urlList":[]}}