{"title":"Wadada Leo Smith - Reflectativity (2000)","uid":6922602,"size":273256925,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:851ae2598adfcdfd557b8ac4fff9a45964ca3e05&amp;dn=Wadada+Leo+Smith+-+Reflectativity+%282000%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mariorg","files":-1,"time":1325328519,"description":"Tzadik Records: TZ 7060 &lt;a href=&quot;\nhttp://www.tzadik.com/volume.php?VolumeID=60&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tzadik.com/volume.php?VolumeID=60&lt;/a&gt;\n\n* Anthony Davis: Piano\n* Malachi Favors Magoustous: Bass\n* Wadada Leo Smith: Trumpet, Flugel Horn\n &lt;a href=&quot;\nhttp://adagio.calarts.edu/~wls/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://adagio.calarts.edu/~wls/&lt;/a&gt; &lt;a href=&quot;\nhttp://adagio.calarts.edu/~wls/pages/reflect.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://adagio.calarts.edu/~wls/pages/reflect.html&lt;/a&gt;\n\nReviews\n~~~~~~~\nBy Thom Jurek &lt;a href=&quot;\nhttp://www.allmusic.com/album/reflectativity-2000-r151685&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/album/reflectativity-2000-r151685&lt;/a&gt;\n\nThis new version of Wadada Leo Smith's classic Reflectativity from 1972 -- now a\nmemorial for Duke Ellington -- shows his compositional strengths as fully\ndeveloped, even at that time. Yet, in this piece, he reworks his own notation to\nopen up his lyrical side over his improvisational dimension. His unusual\nnotation -- which resembles Anthony Braxton's of the period and later -- was\nactually a system being worked out over the range of multi-tonalities and\nimprovisational possibilities within the erected framework. In this manner,\nwhere mode and harmonics establish a base and architecture, lyrical invention\nand dissonance find room to extend the original line and idea from both above\nthe meter and below. Rhythm becomes an idea and a question within these\ncontrasts, and is resolved by the rhythm section (sans drums). For his\ncollaborators on this date, Smith relied on the tried and true talents of old\nfriends: pianist/composer Anthony Davis and bassist Malachi Favors\nMaghostus. Over 18 minutes, the piece unfolds an interior world where sound,\nimage, and ambivalence encounter what is unknown in musical language and attempt\nto deal with it -- if not resolve its issues. And this is the case with the\nother three compositions on this set. Smith looks for a way into a place where\nhis written score breaks itself and, at that point (listen closely to the end of\nthe first four minutes of &quot;Fisherman T WMUKL-D&quot;), music begins to present itself\nto the trio as a field of language to develop and systemize according to the\nstrengths of each individual improviser -- all of whom are responsible for the\nrestraint necessary to allow each of the other members to find his place in that\nsystem while erecting their own in relation to the work. Jazz and blues provide\nsome hint as to where that language should come from, and European classical\nmusic where it may have tried to go and failed miserably; theatrical music (or\nmusical dramatics) is another source, but none holds the entire root language\n(contained within the developing system itself and opening onto another field of\nlanguage -- not of music, but of sound and color). The swinging opening theme\n&quot;Hanabishi&quot; illustrates this, where quotes from Thelonious Monk are juxtaposed\nagainst children's themes and &quot;Revelie&quot; on the trumpet. Next, Smith moves into\nMiles Davis' mid-'60s modalism in search of a key to leave the building he\ncreated. Davis is pushing at all the windows and doors, Maghostus burrowing into\nthe floorboards, and Smith going right for the attic. They meet in midair, where\nall of them realize that the space inside is far bigger than it is outside. It's\nnot physically possible to be sure, but sonically, there are no limits to inner\nspace; equations don't have to add up to a squared whole. Hence the piece moves,\nbounces, and wends its way not so much horizontally but vertically, carving out\na music from the air; intersections and reverberations become the same thing in\na non-meat terrain where Fats Waller can meet Bach's Fugues and Cage's &quot;Atlas\nEclipticalis.&quot; Smith's Reflectativity is easily his most adventurous and\nconsistent album since 1979's Divine Love.\n\n--\n\nBy Derek Taylor &lt;a href=&quot;\nhttp://www.onefinalnote.com/reviews/s/smith-wadada-leo/golden-quartet.asp&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.onefinalnote.com/reviews/s/smith-wadada-leo/golden-quartet.asp&lt;/a&gt;\n\nBy Daniel Piotrowski &lt;a href=&quot;\nhttp://jazztimes.com/articles/12363-wadada-leo-smith-s-golden-quartet-wadada-leo-smith&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://jazztimes.com/articles/12363-wadada-leo-smith-s-golden-quartet-wadada-leo-smith&lt;/a&gt;","torrent":{"xt":"urn:btih:851ae2598adfcdfd557b8ac4fff9a45964ca3e05","amp;dn":"Wadada+Leo+Smith+-+Reflectativity+%282000%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"851ae2598adfcdfd557b8ac4fff9a45964ca3e05","infoHashBuffer":{"type":"Buffer","data":[133,26,226,89,138,223,205,253,85,123,138,196,255,249,164,89,100,202,62,5]},"announce":[],"urlList":[]}}