{"title":"Lula Cortes &amp; Ze Ramalho - Paebiru (1975)","uid":4657786,"size":137393021,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:853e90f76b3d69cb5fc4e843c1dc3a07afadbd79&amp;dn=Lula+Cortes+%26+Ze+Ramalho+-+Paebiru+%281975%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"brosiv","files":15,"time":1232272902,"description":"1. Trilha de SumÃƒÂ© - Lula Cortes, CÃƒÂ´rtes, Lula\n2. Culto ÃƒÂ  Terra\n3. Bailado das Muscarias\n4. Harpa Dos Ares\n5. NÃƒÂ£o Existe Molhado Igual Ao Pranto - Lula Cortes, CÃƒÂ´rtes, Lula\n6. Omm\n7. Raga Dos Raios\n8. Nas Paredes de Pedra Encantada - Lula Cortes, Alagoano, Mote &quot;Mar\n9. MarÃƒÂ¡cas de Fogo - Lula Cortes, CÃƒÂ´rtes, Lula\n10. LouvaÃƒÂ§ÃƒÂ£o a IemanjÃƒÂ¡\n11. Regato da Montanha\n12. Beira Mar\n13. Pedra Templo Animal - Lula Cortes, CÃƒÂ´rtes, Lula\n14. Trilha de SumÃƒÂ©\n\n\n___________________________________________________________________________________\n\nAlthough finding South American classics in the US has never been easy-music sung in other languages have suffered from such fate forever-a trove of great music by Caetano, Nascimento and Gilberto Gil are available. The same has not been the case for a parallel sound that also stemmed from the Tropicalia years. \n\nAlong with the tremendous work from those listed above, the late sixties and early seventies produced-outside of Sao Paulo and Rio-a number of albums whose value was never properly recognized beyond a certain &quot;in-the-know&quot; crowd, in their native land. \n\nPeople like Alceu Valenca, Paulo Bargunca and Geraldo Azevedo, to name a few, forged a style which powerfully combined the sound of Brazil's Northeastern music with the psychedelic vibes coming from UK's bands like Incredible String Band. \n\nIn the last few years, a couple of independent labels (particularly Argentina's obscure Mariposa label) have released a number of great old albums from such &quot;movement.&quot; Among such forgotten gems, Paebiru ranks among the very best, and Lula Cortes and Ze Ramalho as two of its most important composers. \n\nThe music contained here is a Folk amalgam of the influences I've already cited. Meditative and pastoral at times, yet prone to explore fierce and dark corridors where Bahia's rhythms, lysergic fantasies and Eastern touches conspire to create a incomparable experience. \n\nIf you are adventurous enough to find great music in places that may not gain from ample recognition, this is one album to visit and spend some time with. Whether Devendra Banhart ever heard it or not, he can be considered a young son of Paebiru.\n\nby Juan Mobili\n\n\n___________________________________________________________________________________\n\nas.brosiv","torrent":{"xt":"urn:btih:853e90f76b3d69cb5fc4e843c1dc3a07afadbd79","amp;dn":"Lula+Cortes+%26+Ze+Ramalho+-+Paebiru+%281975%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"853e90f76b3d69cb5fc4e843c1dc3a07afadbd79","infoHashBuffer":{"type":"Buffer","data":[133,62,144,247,107,61,105,203,95,196,232,67,193,220,58,7,175,173,189,121]},"announce":[],"urlList":[]}}