{"title":"Pro HTML5 Programming","uid":11551334,"size":8706474,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:856767c81ec1c7eee5c15efe3b39376f8879c2c2&amp;dn=Pro+HTML5+Programming&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"elissa.swansi009","files":-1,"time":1416781133,"description":"2 edition 2011 | 352 Pages | ISBN: 143023864X | EPUB + PDF | 5 MB + 8 MB\n\n\nHTML5 is here, and with it, web applications have acquired power, ease, scalability, and responsiveness like never before. With this book, developers will learn how to use the latest cutting-edge HTML5 web technologyï¿½ï¿½available in the most recent versions of modern browsersï¿½ï¿½to build web applications with unparalleled functionality, speed, and responsiveness.\n\nThis new edition includes major revisions for WebSockets functionality, reflecting the new W3C specification. It also features new chapters covering the drag-and-drop API as well as SVG.\nExplains how to create real-time HTML5 applications that tap the full potential of modern browsers\nProvides practical, real-world examples of HTML5 features in action\nCovers all the new HTML5 APIs to get you up-to-speed quickly with HTML5\nFully updated to include the latest revisions of the WebSocket API, and much more.\n\nWhat youï¿½ï¿½ll learn\nHow the HTML5 specification has evolved\nHow to develop cutting-edge web applications using new HTML5 features like WebSockets, geolocation, web storage, Canvas, and audio/video\nWhich features are available in modern browsers\n\nWho this book is for\nWeb designers and developers who want to use the latest cutting-edge technology available in current browsers\nDevelopers who want to create dynamic, HTML5 web applications\nDevelopers who want to know which HTML5 features are supported by modern browsers","torrent":{"xt":"urn:btih:856767c81ec1c7eee5c15efe3b39376f8879c2c2","amp;dn":"Pro+HTML5+Programming","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"856767c81ec1c7eee5c15efe3b39376f8879c2c2","infoHashBuffer":{"type":"Buffer","data":[133,103,103,200,30,193,199,238,229,193,94,254,59,57,55,111,136,121,194,194]},"announce":[],"urlList":[]}}