{"title":"(NEW) Challenge of the Gobots 1 of 4","uid":4466299,"size":5041489967,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:858d31370b39651de647f8857663642e21357228&amp;dn=%28NEW%29+Challenge+of+the+Gobots+1+of+4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"aforce24","files":11,"time":1224926628,"description":"This is from a new series I bought online, quality isn't great but watchable. The guy I bought it from simply threw all the episodes on disc in no particular order, and with nothing as far as splitting one episode from another. So using AVS Video Editor I've separated each episode into its own chapter. Episodes included are 20,21,29,30,55,26,16,10,20,64,33,40,7,66\n\nPlot\n\nThousands of years ago on the planet that came to be known as GoBotron, there lived a race of human-like beings. At some point in time, whether by natural causes or by catastrophe, this humanoid race was threatened with extinction.\n\nOne surviving humanoid became known as the Last Engineer. The other surviving humanoid is referred to as the Master Renegade. The Last Engineer, who had already supplemented his body with mechanical parts, devised the &quot;Gobot form&quot; for the surviving people of the planet, large robot bodies capable of turning into other vehicles.\n\nIn the last quarter of the 20th Century, the planet Earth became involved in the conflict between Leader-1's Guardians and Cy-Kill's Renegades. During one of these battles, one of Leader-1's lieutenants, Turbo, became severely damaged. Unwilling to let his friend and teammate die, Leader-1 began his quest to find the legendary Last Engineer. Leader-1 found the person he believed to be the Last Engineer, but Leader-1 had unwittingly released the Master Renegade (though he did repair Turbo to gain the Guardians' trust). The Guardians later found the true Last Engineer, who was instrumental in frustrating the alliance between Cy-Kill's Renegades and the Master Renegade.\n\nThe Master Renegade later escaped the custody of the Renegades, and plagued both factions, notably attacking the UniCom colony of New Earth.","torrent":{"xt":"urn:btih:858d31370b39651de647f8857663642e21357228","amp;dn":"%28NEW%29+Challenge+of+the+Gobots+1+of+4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"858d31370b39651de647f8857663642e21357228","infoHashBuffer":{"type":"Buffer","data":[133,141,49,55,11,57,101,29,230,71,248,133,118,99,100,46,33,53,114,40]},"announce":[],"urlList":[]}}