{"title":"Decline and Fall (2014) by John Michael Greer","uid":10448262,"size":475509,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8592a208ecfc5d04592bad44bf6e60864c368dc5&amp;dn=Decline+and+Fall+%282014%29+by+John+Michael+Greer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"notuboo","files":-1,"time":1403985614,"description":"Decline and Fall - The End of Empire and the Future of Democracy in 21st Century America (2014) by John Michael Greer.epub\n\nAlthough he was writing nearly a century ago, William Butler Yeats could just as easily be describing the United States today. The decline and fall of America's global empire is the central feature of today's geopolitical landscape, and the nature of our response to it will determine much of our future trajectory, with implications that reach far beyond the limits of one nation's borders.\n\nDecline and Fall: The End of Empire and the Future of Democracy in 21st Century America challenges the conventional wisdom of empire. Using a wealth of historical examples combined with groundbreaking original analysis, author John Michael Greer:\n\n    *Shows how the United States has backed itself into a blind corner in the pursuit of political and economic power\n    *Explores the inevitable consequences of imperial collapse\n    *Proposes a renewal of democratic institutions as the only constructive way forward\n\nBy shifting the conversation from whether today's American empire should survive to whether it can survive, and arguing persuasively that the answer to the latter question is &quot;no,&quot; Decline and Fall makes an invaluable contribution to the body of speculative post-industrial literature. This book is a must-read for anyone concerned about the state of the Union, or who believes that the time has come to reinvent the American Dream.\n\n304 pages\nPublisher: New Society Publishers (April 8, 2014)\nLanguage: English\nISBN-10: 0865717648\nISBN-13: 978-0865717640","torrent":{"xt":"urn:btih:8592a208ecfc5d04592bad44bf6e60864c368dc5","amp;dn":"Decline+and+Fall+%282014%29+by+John+Michael+Greer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8592a208ecfc5d04592bad44bf6e60864c368dc5","infoHashBuffer":{"type":"Buffer","data":[133,146,162,8,236,252,93,4,89,43,173,68,191,110,96,134,76,54,141,197]},"announce":[],"urlList":[]}}