{"title":"Out of My Hair - Drop the Roof [1995]","uid":9408383,"size":370694591,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:85b95b41782b2cb43e38d196f40e6a1c14e0607d&amp;dn=Out+of+My+Hair+-+Drop+the+Roof+%5B1995%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"GenXRock","files":-1,"time":1388214603,"description":"Out of My Hair was a British pop/alternative rock band, active in mid 1990s. The band consisted of Simon Eugene, also known as Comfort (vocals, guitar, bass, piano, keyboards), Sean Elliot (guitar), Kenny Rumbles (drums) and George Muranyi (keyboards).\n\nThe early version of the band was formed in 1991 by Eugene. Early membership included Barny C. Rockford (who later became a member of The Auteurs) on drums. The band performed several gigs in the UK and Amsterdam, but did not release any records.\nIn late 1993 Eugene, feeling that &quot;the chemistry of the band didn't seem right&quot;,[2] decided to reform it. Elliot remained on guitar, Rockford was replaced by Kenny Rumbles, Eugene replaced Jake on bass and John George joined the band as another guitarist.\nIn June 1994 their first single was released, featuring two songs: &quot;In the Groove Again&quot; and &quot;River of Gold&quot;. In late 1995 the band released their only full album, Drop The Roof. The album was first released in Japan, where it gained a relatively significant success. A UK release followed in early 1996, but it failed to become popular.\nDuring those years Out of my Hair performed with David Bowie, Crash Test Dummies and Barenaked Ladies as a support band.[1]\nIn spite of some positive criticism, and a success of the &quot;In the Groove Again&quot; single, the band remained unknown to the wide public and quietly disappeared around 1997.","torrent":{"xt":"urn:btih:85b95b41782b2cb43e38d196f40e6a1c14e0607d","amp;dn":"Out+of+My+Hair+-+Drop+the+Roof+%5B1995%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85b95b41782b2cb43e38d196f40e6a1c14e0607d","infoHashBuffer":{"type":"Buffer","data":[133,185,91,65,120,43,44,180,62,56,209,150,244,14,106,28,20,224,96,125]},"announce":[],"urlList":[]}}