{"title":"T3 India - April 2016 (gnv64)","uid":14219126,"size":33554356,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:85d0384e395b38c9400d784cf751805135b0d0bd&amp;dn=T3+India+-+April+2016+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"gnv65","files":5,"time":1460023039,"description":"T3 India - April 2016\r\nEnglish | 116 pages | True PDF | 31.6 mb\r\n\r\nFeatures\r\n030 GADGET GURU - This month, GaGu gets really geeky with reccomendations for earphones and PS4\r\n033 AGENDA - We’ve gone wearable mad! Head to Agenda for Garmin’s HUD cycling glasses, a pair of smart running shorts, a vitamin pen and a smartbandcontrolled robot dog\r\n042 LET TECH ENTERTAIN YOU! - Make your movies and music more spectacular than ever with the ultimate in posh AV gadgetry\r\n070 COMPLETE GUIDE TO… THE INTERNET OF THINGS - Discover the gadgets that’ll connect your life to your world\r\n\r\nHYPE\r\n012 PREVIEW - The sexiest new gear in the world, including Audi’s crazy hydrogen hybrid, LG G5 and more\r\n027 PEOPLE - Donny T: a man in the limelight right now for absolutely no good reason. So let’s fi nd out what sort of tech makes this oddball US Pressy-candidate tick\r\n028 STYLE - Remember LA Gear’s LA Lights shoes? Well, we’ve found the grown-up equivalent\r\n032 TALKING TECH - Duncan Bell loses signal (and his mind) in rural Wales\r\n\r\nSELECT\r\n078 GALAXY S7 EDGE - Is Samsung’s latest Galaxy S smartphone worth the price? We take a look\r\n082 REDMI NOTE 3 - Can Xiaomi’s latest device claim the affordable smartphone crown?\r\n088 SMACKDOWN - If you’re on the hunt for a slick, pro-level laptop, you’d do a lot worse than to invest in one of these humdingers. But should you go for the Surface Book or the Macbook Pro? Fight!\r\n090 ENTERTAINMENT - It’s all go this month, with Far Cry Primal sorting out your gaming needs, an app that could negate you having to go to the gym ever again, and a must-hear live album from Nine Inch Nails and David Bowie\r\n\r\nELITE\r\n105 INTRODUCING THE BEST BUYER’S GUIDE KNOWN TO MAN - From phones to tablets, and camera to cars, our selection of the very best\r\n\r\nEssentials\r\n007 GAMECHANGER\r\n057 SUBSCRIPTIONS\r\n114 MONEY NO OBJECT\r\ntells you what to buy\r\n \nhttp://s14.postimg.org/rv7d63l9d/T3_India_April_2016.jpg","torrent":{"xt":"urn:btih:85d0384e395b38c9400d784cf751805135b0d0bd","amp;dn":"T3+India+-+April+2016+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85d0384e395b38c9400d784cf751805135b0d0bd","infoHashBuffer":{"type":"Buffer","data":[133,208,56,78,57,91,56,201,64,13,120,76,247,81,128,81,53,176,208,189]},"announce":[],"urlList":[]}}