{"title":"Commander Keen Complete PC Collection Version 1.1 FIXED","uid":3830145,"size":6247178,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8614593f93b39b42330108c27146b250bf5dc6f5&amp;dn=Commander+Keen+Complete+PC+Collection+Version+1.1+FIXED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"preservedforposterity","files":4,"time":1191545959,"description":"Commander Keen Complete PC Collection Version 1.1 FIXED\nA Preserved for Posterity Release\nOctober 4, 2007\n\nThis is a bug-fixed release of Version 1.0. Originally\nthe installer created shortcuts to the documentation\nfiles as: FILENAME.DOC.PIF. The proper method is to\ncreate these files as: FILENAME.PIF. An oversight on\nmy part, as having two known extensions back to back\ncan cause certain virus scanners to complain of a\n&quot;hidden extension&quot; (and YES - you should be very WARY\nof hidden extensions - they are potentially dangerous,\nespecially if they are .vbs, .exe, .com, etc.). I hope\nthat I have rectified all of the problems, if not,\nleave me a comment describing any problems you may\nencounter, and I&amp;#039;ll mention your &quot;username&quot; in the\nnext version ;-) Also, to fully uninstall version\n1.0, after using the ADD/REMOVE programs CONTROL PANEL\nAPPLET to remove version 1.0, manually delete the folder:\nProgram FilesDOS ApplicationsApogeeCommander Keen Complete\nif it is still there. This version (1.1) should do a proper\nuninstall as well.\nThanks - PfP\n\n\nThis is a collection of all seven of the original\nCommander Keen PC Games, PLUS the GameBoy Color\nversion, titled simply &quot;Commander Keen&quot;. This\ncollection has been assembled with the modern PC in\nmind, and thus the first seven games may be played\nunder emulation via DOSBox 0.72, partial emulation\nvia VDMSound 2.1.0, or directly via the Windows\nCommand Interpreter. These three options should\nensure that almost any PC will be able to properly\nexecute the games. The eighth game in the series\nis playable on the PC via the included GameBoy\nColor Emulator. In an attempt to make this as simple\nas possible, this installer will install the games\nand create the following program group:\nSTART&gt;PROGRAMS&gt;GAMES&gt;DOS&gt;APOGEE&gt;\nCOMMANDER KEEN COMPLETE\nWith the following subgroups:\nCMD\nDocumentation\nDOSBox\nGBC\nVDMSound\nThe icons in the CMD group will launch the games via\nthe Windows Command Interpreter. The icons in the\nDOSBox group will launch the games via DOSBox emulation.\nThe icons in the GBC group will launch the GameBoy Color\nversion via a GBC emulator. Note that the original and\ntwo hacked versions are included for the GameBoy Color\nemulation. The icons in the VDMSound group will launch\nthe games via VDMSound partial emulation. The icons in\nthe Documentation group are the little bits of info that\nwere included with the files that I used to create this\ninstaller. Obviously, for the VDMSound shortcuts to work,\nVDMSound has to be installed, but don&amp;#039;t worry, it&amp;#039;s\ninstaller will launch as part of this setup (during the\nVDMSound setup, select all options or &quot;Complete Install&quot;).\nIf VDMSound is not compatible with your system (or\nOperating System), you can simply cancel the VDMSound\nsetup and the rest of this setup will complete - the icons\nin the VDMSound group just won&amp;#039;t function. The required\nDOSBox files are automatically installed as part of this\nsetup - no need to worry if you already have DOSBox\ninstalled - everything will work out just fine.\n\n\n\nThe following text is &quot;borrowed&quot; from: &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Commander_Keen&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Commander_Keen&lt;/a&gt;\n\nCommander Keen is a series of video games developed\nby id Software in the early 1990s, which was successful\nat replicating the side-scrolling action of the NES\nSuper Mario Bros. games in MS-DOS. The cartoon-style\nplatformers are notable for their pioneering use of EGA\ngraphics and shareware distribution, and because they\nwere the first games by id Software (which went on to\ndevelop blockbusters like Doom and Quake). The games were\nalso exciting to the PC gaming community of the time\nbecause of John Carmack&amp;#039;s revolutionary smooth-scrolling\ngraphics engine. Although developed by id, most of the\nCommander Keen games were published by Apogee Software,\nan already established MS-DOS shareware game publisher.\nTom Hall is Commander Keen&amp;#039;s designer and the creator of\nKeen&amp;#039;s universe.\n\nEpisodes:\nSeven official Commander Keen games were released for the\nPC under MS-DOS. They are divided in mini-series, and are\nconsidered &quot;episodes&quot; of the full series. Under the Apogee\nversion of the shareware model, usually the first episode\nof a series was available at no charge. The eighth game in\nthe series is available exclusively for the Game Boy Color.\n\n\nCommander Keen in Invasion of the Vorticons\n\n1. &quot;Marooned on Mars&quot;\n(first released as shareware on December 14, 1990).\nWhile Commander Keen is exploring Mars, the Vorticon steal\nfour vital components of his ship and hide them in Martian\ncities, each guarded by a Vorticon soldier. In this episode,\nKeen acquires his trademark pogo stick and meets a variety\nof Martian aliens and robots. \n\n2. &quot;The Earth Explodes&quot; \nKeen returns to Earth only to find the Vorticon mothership\nhovering above, with its ray cannons locked on to eight of\nEarth&amp;#039;s greatest wonders, including the Egyptian pyramids and\nthe Sydney Opera House. Keen has to find and deactivate each of\nthe cannons to save Earth. Unlike the first game which had a\nhappy and friendly atmosphere, almost everything in this game\nis hostile towards Keen, from the floating machine gun robots\nto the electrified floors. The engine has a couple of extra\nfeatures such as light switches and moving platforms, making\nthis game the hardest of the trilogy. \n\n3. &quot;Keen Must Die!&quot; \nKeen travels to the Vorticon homeworld in search of the\nmysterious Grand Intellect that has directed the Vorticons\ntoward Earth. The game features the cities, parks, and suburbs\nof the Vorticons, and their women, children, pets, and mechanical\ntoys make up the enemies. The Vorticon alphabet is also decoded\nin a school house, allowing for the player to travel to the other\nin-game locations and read the Vorticon signs. \n\nInterlude\n\n3.5. &quot;Keen Dreams&quot; aka The &quot;Lost Episode&quot;\n(published as shareware by Softdisk) \nAfter refusing to eat his vegetables, Billy is sent to bed by\nhis parents. He falls asleep, only to awaken in a strange\nvegetable kingdom led by the evil potato king Boobus Tuber,\nwho has imprisoned other sleeping children there. In the dream\nworld, Keen does not have his trademark raygun and pogo stick,\nbut has to defend himself with &quot;Flower Power&quot; seeds that\ntemporarily turn enemies into flowers. \n\nCommander Keen in Goodbye Galaxy!\n\n4. &quot;Secret of the Oracle&quot;\n(first released as shareware on December 15, 1991) \nKeen&amp;#039;s newly finished homemade faster-than-light radio picks up\na plot by the Shikadi to destroy the galaxy. He rushes to the\nplanet Gnosticus IV to consult the Keepers of the Oracle, but\ndiscovers that they have been taken captive. Thus, the gameplay\ncenters on Keen finding and rescuing the eight elders. This\nepisode features huge levels and a wide variety of enemies,\nsuch as rocks that only move when your back is turned, and\nimproved game mechanics. \n\n5. &quot;The Armageddon Machine&quot; \nAfter getting information from the Oracle, Keen lands on a\nmassive Shikadi space station, the Omegamatic, nicknamed the\nArmageddon Machine, and seeks out the mysterious Gannalech.\nThe gameplay centers on Keen advancing through the Omegamatic\nto deactivate it. \n\nCommander Keen in Aliens Ate My Babysitter!\n\n6. Aliens Ate My Babysitter!\n(published commercially only by FormGen,\nwho resold it to Apogee; now discontinued) \nWhen Keen&amp;#039;s babysitter Molly is abducted by the Bloogs, Keen\nmust come to her rescue by fighting his way through the\ninhabitants of the planet Fribbulus Xax. This is the last\nepisode of the original Keen series. \n\nCommander Keen (GBC)\n\nIn 2001, Activision published a completely new Commander Keen\ngame for the Game Boy Color, simply titled Commander Keen. The\ngame, although developed with id&amp;#039;s permission, did not involve\nany of the original Keen developers, but was instead a David A.\nPalmer Productions game. Most fans of the original games found\nthis game to be a disappointment, as it strayed from the\noriginal gameplay and looks. Tom Hall, creative director and\ndesigner of the original Commander Keen series, does not\nconsider this game to be a sequel. \n\nPfP - October 4, 2007","torrent":{"xt":"urn:btih:8614593f93b39b42330108c27146b250bf5dc6f5","amp;dn":"Commander+Keen+Complete+PC+Collection+Version+1.1+FIXED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8614593f93b39b42330108c27146b250bf5dc6f5","infoHashBuffer":{"type":"Buffer","data":[134,20,89,63,147,179,155,66,51,1,8,194,113,70,178,80,191,93,198,245]},"announce":[],"urlList":[]}}