{"title":"Lost Horizon (1937) DVD9 - Subs-Eng-Sp-Portuguese-Chinese-Thai-K","uid":11629937,"size":7031003136,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:86606c5e26e6eb1f01b7cd6939ee692e8fb96322&amp;dn=Lost+Horizon+%281937%29+DVD9+-+Subs-Eng-Sp-Portuguese-Chinese-Thai-K&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"SaM","files":-1,"time":1417668281,"description":"Lost Horizon (1937) DVD9 - Subs-Eng-Sp-Portuguese-Chinese-Thai-Korean - Ronald Coleman [DDR]\n\nLost Horizon is a 1937 American drama-fantasy film directed by Frank Capra. The screenplay by Robert Riskin is based on the 1933 novel of the same title by James Hilton.\nThe film exceeded its original budget by more than $776,000, and it took five years for it to earn back its cost. \nThe serious financial crisis it created for Columbia Pictures damaged the partnership between Capra and studio head Harry Cohn, as well as the friendship between Capra and screenwriter Riskin, whose previous collaborations had included Lady for a Day, It Happened One Night, and Mr. Deeds Goes to Town.\n\n    CAST:-\n    Ronald Colman as Robert Conway\n    Jane Wyatt as Sondra Bizet\n    H.B. Warner as Chang\n    Sam Jaffe as High Lama\n    John Howard as George Conway\n    Edward Everett Horton as Alexander P. Lovett\n    Thomas Mitchell as Henry Barnard\n    Margo as Maria\n    Isabel Jewell as Gloria Stone\n    David Clyde as Club Steward\n    David Torrence as Prime minister\n    Hugh Buckler as Lord Gainsford\n    Val Duran as Talu\n    Milton Owen as Fenner\n    Richard Loo as Shanghai airport official\n    Willie Fung as Bandit leader\n    Victor Wong as Bandit leader\n\nDirected by Frank Capra\nProduced by Frank Capra\nScreenplay by Robert Riskin\nMusic by Dimitri Tiomkin\nRunning time 133 minutes\n\nMOVIE PLOT:- Lost Horizon (1937)\nBefore returning to England to become the new Foreign Secretary, writer, soldier and diplomat Robert Conway (Ronald Colman) has one last task in 1935 China: to rescue 90 Westerners in the city of Baskul. He flies out with the last few evacuees, just ahead of armed revolutionaries.\n\nUnbeknownst to the passengers, the pilot has been replaced and their aircraft hijacked. It eventually runs out of fuel and crashes deep in the Himalayan Mountains, killing their abductor. The group is rescued by Chang (H.B. Warner) and his men and taken to Shangri-La, an idyllic valley sheltered from the bitter cold. The contented inhabitants are led by the mysterious High Lama (Sam Jaffe).\n\nInitially anxious to return to civilization, most of the newcomers grow to love Shangri-La, including paleontologist Alexander Lovett (Edward Everett Horton), swindler Henry Barnard (Thomas Mitchell) and bitter, terminally ill Gloria Stone (Isabel Jewell), who miraculously seems to be recovering. Conway is particularly enchanted, especially when he meets Sondra (Jane Wyatt), who has grown up in Shangri-La. However, Conway's younger brother George (John Howard), and Maria (Margo), another beautiful young woman they find there, are determined to leave.\n\nConway eventually has an audience with the High Lama and learns that his arrival was no accident. The founder of Shangri-La is said to be hundreds of years old, preserved, like the other residents, by the magical properties of the paradise he has created, but is finally dying and needs someone wise and knowledgeable in the ways of the modern world to keep it safe. Having read Conway's writings, Sondra believed he was the one; the Lama had agreed with her and arranged for Conway's abduction. The old man names Conway as his successor and then peacefully passes away.\n\nGeorge refuses to believe the Lama's fantastic story and is supported by Maria. Uncertain and torn between love and loyalty, Conway reluctantly gives in to his brother and they leave, taking Maria with them, despite being warned that she is much older than she appears. After several days of grueling travel, she becomes exhausted and falls face down in the snow. When they turn her over, they discover that she had become extremely old and died. Her departure from Shangri-La had restored Maria to her true age. Horrified, George loses his sanity and jumps to his death.\n\nConway continues on and eventually meets up with a search party sent to find him, although the ordeal has caused him to lose his memory of Shangri-La. On the voyage back to England, he remembers everything; he tells his story and then jumps ship. The searchers track him back to the Himalayas, but are unable to follow him any further. Conway manages to return to Shangri-La.\n\nPRODUCTION NOTES:-\nFrank Capra had read the James Hilton novel while filming It Happened One Night, and he intended to make Lost Horizon his next project. When Ronald Colman, his first and only choice for the role of Robert Conway, proved to be unavailable, Capra decided to wait and made Mr. Deeds Goes to Town instead.\n\nHarry Cohn authorized a budget of $1.25 million for the film, the largest amount ever allocated to a project up to that time. According to a 1986 Variety interview with Frank Capra, Jr., his father had wanted to shoot the film in color, but because the only suitable stock footage he intended to incorporate into the film, such as scenes from a documentary about the Himalayas, was in black and white, he was forced to change his plans. In 1985, Capra, Sr. claimed the decision to film in black and white was made because three-strip Technicolor was new and fairly expensive, and the studio was unwilling to increase the film's budget so he could utilize it.\n\nFrom the beginning, Capra ran into difficulties that resulted in serious cost overruns. Principal photography began on March 23, 1936, and by the time it was completed on July 17, the director had spent $1.6 million. Contributing to the added expenses was the filming of snow scenes and aircraft interiors at the Los Angeles Ice and Cold Storage Warehouse, where the low temperature affected the equipment and caused lengthy delays. The Streamline Moderne sets representing Shangri-La, designed by Stephen Goosson, had been constructed adjacent to Hollywood Way, a busy thoroughfare by day, which necessitated filming at night and heavily added to overtime expenses. Many exteriors were filmed on location in Palm Springs, Lucerne Valley, the Ojai Valley, the Mojave Desert, the Sierra Nevada Mountains, and in what is now Westlake Village, adding the cost of transporting cast, crew, and equipment to the swelling budget.\n\nCapra also used multiple cameras to cover every scene from several angles, and by the time shooting ended, he had used 1.1 million feet of film. For one scene lasting four minutes, he shot 6,000 feet, the equivalent of one hour of screen time. He spent six days filming Sam Jaffe performing the High Lama's monologues, then reshot the scenes twice, once with Walter Connolly because it was felt Jaffe's makeup was unconvincing and he looked too young for the role. A total of 40 minutes of footage featuring the High Lama eventually was trimmed to the 12 that appeared in the final cut. Filming took one hundred days, 34 more than scheduled. The film's final cost, including prints and promotional advertising, was $2,626,620, and it remained in the red until it was reissued in 1942.\n\nThe first cut of the film was six hours long. The studio considered releasing it in two parts, but eventually decided the idea was impractical. Working with editors Gene Havlick and Gene Milford, Capra managed to trim the running time to 3Â½ hours for the first preview in Santa Barbara on November 22, 1936. Following a showing of the screwball comedy Theodora Goes Wild, the audience was not receptive to a drama of epic length. Many walked out, and those who remained laughed at sequences intended to be serious. The feedback was mostly negative, and Capra was so distraught, he fled to Lake Arrowhead, and remained in seclusion there for several days. He later claimed he burned the first two reels of the film, an account disputed by Milford, who noted setting the nitrate film on fire would have created a devastating explosion.\n\nFollowing the disastrous preview, Capra made extensive cuts and, on January 12, 1937, reshot scenes involving the High Lama written by Sidney Buchman, who declined screen credit for his work. The new footage placed more emphasis on the growing desperation of the world situation at the time. Still unhappy with the film's length, Harry Cohn intervened; he cancelled the February 1 opening and edited the film himself. When it premiered in San Francisco on March 2, it was 132 minutes long. During the film's initial release in selected cities, it was a roadshow attraction, with only two presentations per day and tickets sold on a reserved-seat basis. Because the box office returns were so low, the studio head deleted an additional 14 minutes before the film went into general release the following September. Due primarily to the cuts made without his approval, Capra later filed a lawsuit against Columbia, citing &quot;contractual disagreements,&quot; among them, the studio's refusal to pay him a $100,000 semi-annual salary payment due him. A settlement was reached on November 27, 1937, with Capra collecting his money and being relieved of the obligation of making one of the five films required by his contract. In 1985, the director claimed Cohn, whom he described as the &quot;Jewish producer,&quot; trimmed the film simply so theaters could have more daily showings and increase the film's chance of turning a profit.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 6153 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 29.970\nAudio Codec:  AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: English\nRunTime 133 mins\nSubtitles: Eng, Espanol, Portuguese, Chinese, Thai, Korean\nRipped by: Trinidad [DDR]","torrent":{"xt":"urn:btih:86606c5e26e6eb1f01b7cd6939ee692e8fb96322","amp;dn":"Lost+Horizon+%281937%29+DVD9+-+Subs-Eng-Sp-Portuguese-Chinese-Thai-K","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86606c5e26e6eb1f01b7cd6939ee692e8fb96322","infoHashBuffer":{"type":"Buffer","data":[134,96,108,94,38,230,235,31,1,183,205,105,57,238,105,46,143,185,99,34]},"announce":[],"urlList":[]}}