{"title":"Digital Anarchy Beauty Box Video 3.0.6.WIN MAC [ChingLiu]","uid":9323903,"size":85581485,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8680c616a708d1a69adf0e1ce8055cb1e7d92d3e&amp;dn=Digital+Anarchy+Beauty+Box+Video+3.0.6.WIN+MAC+%5BChingLiu%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"Ching_Liu","files":-1,"time":1386598942,"description":"Great features of Beauty Box Video 3.0 Plugin\n\nBeauty Box Video 3.0 is the makeup artist who you don't have the time or budget to afford. Our skin retouching video plugin for After Effects, Final Cut Pro, Premiere Pro and OpenFX applications is simple to use. This video effects software saves hours of your production time while making your client look years younger. \n\n-Better Masking: We're now using multiple algorithms to determine what the skin tone is. This creates a much better mask, and better retouching as a result.\n-Faster Rendering: A complete rewrite of the skin smoothing algorithm means Beauty Box Video is up to 300% faster on ATI and Nvidia cards.\n-Shine Removal: Get rid of hot spots caused by shiny skin and bright lights! This feature dramatically reduces the effect of poor lighting conditions.\n-Preset Styles: These now dozens of presets Styles to add effects and color corrections to your footage. It's a very easy way of giving your footage a stylized look, whether you're just adding a bit of glow or want a 'day to night' effect.\n-Support for Final Cut Pro X: Beauty Box Video now fully supports Final Cut Pro X, along with earlier versions of FCP. \n-Better Performance in Premiere Pro: The new algorithm brings improved stability and speed in Premiere Pro.\n-Assimilate Scratch and Sony Vegas: Beauty Box Video for OpenFX host apps like Sony Vegas Pro, Sony Movie Studio, and Assimilate Scratch are available now! Other OpenFX apps will be officially supported soon.\n\nAmazing Skin Smoothing controls\n\nThe Skin Smoothing controls in the Beauty Box Video plugin work together to smooth over wrinkles and blemishes in your subject's skin tones. Smoothing Amount is the main control. The higher you set Amount, the more skin smoothing you will have. The Skin Smoothing effect is also a new technology. It keeps the important features of the face sharp while reducing or eliminating wrinkles and blemishes. Built-in sharpening keeps important details like facial features.\n\nThe magic automatic buttons\n\nThe two magic buttons: Analyze Frame and Analyze All. This is where the real work happens, yet you barely have to do anything with this video plugin. Click Analyze Frame to sample a frame and set the skin tones that will be smoothed throughout your footage. Alternately, click Analyze All to set multiple frames as the sample point. It's an automatic process that gives great results.\n\nChange the results quickly\n\nThere are many easy ways to use the Beauty Box skin retouching plugin. Use the two Analyze buttons to automatically create a smoothing mask. Make adjustments to the skin smoothing effects with the Skin Smoothing tools. Make changes to the mask itself with built-in Mask tools to draw, edit or import a custom mask. Or use fine-tuning controls like Add Grain to preserve important details like facial features. It's all easy to do.\n\nNew in v3.0.6\n\n-Better Masking: We're now using multiple algorithms to determine what the skin tone is. This creates a much better mask, and better retouching as a result.\n-Faster Rendering: A complete rewrite of the skin-smoothing algorithm means Beauty Box is up to 300% faster on ATI and Nvidia cards.\n-Shine Removal: Get rid of hot spots caused by shiny skin and bright lights! This feature dramatically reduces the effect of poor lighting conditions.\n-Preset Styles: These now dozens of presets Styles to add effects and color corrections to your footage. It's a very easy way of giving your footage a stylized look, whether you're just adding a bit of glow or want a 'day to night' effect.\n-Support for Final Cut Pro X: Beauty Box now fully supports Final Cut Pro X, along with earlier versions of FCP.\n-Better Performance in Premiere Pro: The new algorithm brings improved stability and speed in Premiere Pro.\n-Assimiate Scratch and Sony Vegas: Beauty Box Video for OpenFX host apps like Sony Vegas Pro, Sony Movie Studio, and Assimilate Scratch are available now! Other OpenFX apps will be officially supported soon.\n\nTechnical specs\n\nThese charts explain which Operating Systems are supported by Beauty Box Video, as well as the host applications that are supported.\n\nWhile we try to keep these charts up to date, with so many new versions of OSes and applications coming out sometimes we forget to add something. All of our products are kept up to date and run in the latest versions of the OS or host application. \n\nCreative Cloud is also supported\n &lt;a href=&quot;\nhttp://bayimg.com/kadLNAAfP&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/kadLNAAfP&lt;/a&gt;\n\nLanguage : English\n\nHomepage :  &lt;a href=&quot;\nhttp://www.digitalanarchy.com/beautyVID/main.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.digitalanarchy.com/beautyVID/main.html&lt;/a&gt;","torrent":{"xt":"urn:btih:8680c616a708d1a69adf0e1ce8055cb1e7d92d3e","amp;dn":"Digital+Anarchy+Beauty+Box+Video+3.0.6.WIN+MAC+%5BChingLiu%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8680c616a708d1a69adf0e1ce8055cb1e7d92d3e","infoHashBuffer":{"type":"Buffer","data":[134,128,198,22,167,8,209,166,154,223,14,28,232,5,92,177,231,217,45,62]},"announce":[],"urlList":[]}}