{"title":"Namibia Genocide and the Second Reich BBC","uid":10536317,"size":524490752,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:86c62f71b0d338e3350477986a9bb1e95d611d93&amp;dn=Namibia+Genocide+and+the+Second+Reich+BBC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"theangelofold","files":1,"time":1405172486,"description":"This is a 2005 BBC documentary. \n\n100 hundred years ago, three quarters of the Herero people of the then German colony of South West Africa (Namibia) were killed, many in concentration camps. Today, the descendants of the survivors are seeking reparations from the German government. This film tells for the first time this forgotten story and its links to German racial theories.\n\nDescribed by the BBC as the story of Germany's forgotten genocide. This powerful documentary by David Adetayo Olusoga took a sensitive and uncompromising look at the tragic circumstances leading to the massacre of three quarters of the Namibia population in German concentration camps built in Africa. The programme included graphic reconstructions and did not shirk from showing disturbing scenes which revealed the savagery of european colonial ideology put into practise.\n\nThe documentary also showed the 2004 footage of Germany's ambassador to Namibia expressing regret for their killing of thousands of Namibia's Hereros during the colonial era. Unsurprisingly, the Germans refused to agree to the justifiable calls for reparations. The programme also explored the current call for land reforms where most of Namibia's commercial land is still owned by european farmers who make up 6 percent of the country's population of 1.8 million.\n\nThroughout it included interviews and powerful testimony from African survivors, descendants and reparation movement representatives thus making this a compelling programme which both educated the audience whilst treating the sensitive subject matter with the respect it deserved.","torrent":{"xt":"urn:btih:86c62f71b0d338e3350477986a9bb1e95d611d93","amp;dn":"Namibia+Genocide+and+the+Second+Reich+BBC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86c62f71b0d338e3350477986a9bb1e95d611d93","infoHashBuffer":{"type":"Buffer","data":[134,198,47,113,176,211,56,227,53,4,119,152,106,155,177,233,93,97,29,147]},"announce":[],"urlList":[]}}