{"title":"Knitalong: Celebrating the Tradition of Knitting Together","uid":9194373,"size":3820065,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:86e66dd7795352d6cdc1e5d35b6499c0f9cbdf6f&amp;dn=Knitalong%3A+Celebrating+the+Tradition+of+Knitting+Together&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"KnitLady","files":-1,"time":1384454216,"description":"The immensely popular knitalongÂ—an organized event where people knit together for a common goalÂ—has only grown with the explosion of the Internet. YesterdayÂ’s wartime Red Cross sock drives have evolved into todayÂ’s meet-ups at locales as diverse as cafes, state fairs, and major league ballparks, as well as international online gatherings; in fact, at any given time tens of thousands of people worldwide are involved in knitalongs, organized around a particular yarn, a favorite social cause, an intriguing project, a special event, or myriad other themes. Authors Larissa Brown and Martin John Brown present an inspiring look at centuries of people knitting together, and why knitters find the interaction so meaningful and worthwhile. Along the way, they offer 20 projects especially suited for different types of knitalongs. The Barn Raising Quilt and the Traveling Scarf, for instance, call on individual knitters to collaborate on a single project; while the Pinwheel Blanket and the Meathead Hat encourage a community of knitters to improvise on the same pattern to come up with a variety of results. Also included is essential information about finding, joining, and starting knitalongs. Hundreds of knitters participated in the knitalongs hosted by the authors as part of their research, and this book will inspire thousands more to get involved in the knitalong movement. The only book that celebrates this tradition of community and purpose, Knitalong is sure to have a powerful impact.","torrent":{"xt":"urn:btih:86e66dd7795352d6cdc1e5d35b6499c0f9cbdf6f","amp;dn":"Knitalong%3A+Celebrating+the+Tradition+of+Knitting+Together","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86e66dd7795352d6cdc1e5d35b6499c0f9cbdf6f","infoHashBuffer":{"type":"Buffer","data":[134,230,109,215,121,83,82,214,205,193,229,211,91,100,153,192,249,203,223,111]},"announce":[],"urlList":[]}}