{"title":"Talk Normal: Stop the Business Speak, Jargon and Waffle","uid":8300411,"size":5276627,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8771c7a411ab95e824f8918e03b5634f93ff1231&amp;dn=Talk+Normal%3A+Stop+the+Business+Speak%2C+Jargon+and+Waffle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bookzilla","files":1,"time":1364253556,"description":"-epub\n\nMost large companies have entire departments devoted to communications, but company mission statements and press releases are becoming harder to understand. With the humorous and sometimes poignant style of foolishness that plagues the world of &quot;The Office&quot; and the comic strip &quot;Dilbert,&quot; Talk Normal addresses the ineffectiveness of corporate jargon and business communication. Tim Phillips covers everything from the advent of the nine-syllable word &quot;operationalizational&quot; to indecipherable press releases, to the fluff people put in their resumes. \n\nDespite being based on the author's experience in a British environment, readers from any culture can easily draw parallels to their own workplace. Phillips discusses universal problems such as the inability to make a point, evasiveness and talking a lot of hot air.\n \nIn the same entertaining, satirical manner as his increasingly popular blog of the same name, Phillips takes a candid look at how ineffective business language has become. Full of excruciating examples of how not to write or speak, Talk Normal helps readers improve their communication at work while navigating the nightmare of management-speak.\n\n2011","torrent":{"xt":"urn:btih:8771c7a411ab95e824f8918e03b5634f93ff1231","amp;dn":"Talk+Normal%3A+Stop+the+Business+Speak%2C+Jargon+and+Waffle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8771c7a411ab95e824f8918e03b5634f93ff1231","infoHashBuffer":{"type":"Buffer","data":[135,113,199,164,17,171,149,232,36,248,145,142,3,181,99,79,147,255,18,49]},"announce":[],"urlList":[]}}