{"title":"Anne Lamott - Traveling Mercies: Thoughts on Faith (pdf)","uid":8622187,"size":3508198,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:879126b14d9f73f380493f3ad7713829e7ebad5b&amp;dn=Anne+Lamott+-+Traveling+Mercies%3A+Thoughts+on+Faith+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pharmakate","files":-1,"time":1372405151,"description":"Anne Lamott - Traveling Mercies: Some Thoughts on Faith (Anchor, 1998). \n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\nBrilliant, personal exploration of Christian faith minus the bullshit.\n\ndescription:\n\nAnne Lamott claims the two best prayers she knows are: &quot;Help me, help me, help me&quot; and &quot;Thank you, thank you, thank you.&quot; She has a friend whose morning prayer each day is &quot;Whatever,&quot; and whose evening prayer is &quot;Oh, well.&quot; Anne thinks of Jesus as &quot;Casper the friendly savior&quot; and describes God as &quot;one crafty mother.&quot;\n\nDespite--or because of--her irreverence, faith is a natural subject for Anne Lamott. Since Operating Instructions and Bird by Bird, her fans have been waiting for her to write the book that explained how she came to the big-hearted, grateful, generous faith that she so often alluded to in her two earlier nonfiction books. The people in Anne Lamott's real life are like beloved characters in a favorite series for her readers--her friend Pammy, her son, Sam, and the many funny and wise folks who attend her church are all familiar. And Traveling Mercies is a welcome return to those lives, as well as an introduction to new companions Lamott treats with the same candor, insight, and tenderness. \n\nLamott's faith isn't about easy answers, which is part of what endears her to believers as well as nonbelievers. Against all odds, she came to believe in God and then, even more miraculously, in herself. As she puts it, &quot;My coming to faith did not start with a leap but rather a series of staggers.&quot; At once tough, personal, affectionate, wise, and very funny, Traveling Mercies tells in exuberant detail how Anne Lamott learned to shine the light of faith on the darkest part of ordinary life, exposing surprising pockets of meaning and hope.","torrent":{"xt":"urn:btih:879126b14d9f73f380493f3ad7713829e7ebad5b","amp;dn":"Anne+Lamott+-+Traveling+Mercies%3A+Thoughts+on+Faith+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"879126b14d9f73f380493f3ad7713829e7ebad5b","infoHashBuffer":{"type":"Buffer","data":[135,145,38,177,77,159,115,243,128,73,63,58,215,113,56,41,231,235,173,91]},"announce":[],"urlList":[]}}