{"title":"My Name is Julia Ross 1945 DvdRip Mp4 Lee1001","uid":10309735,"size":608768186,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:87ec2112bea40fb4dafdf90cd7bf90e2f0e72979&amp;dn=My+Name+is+Julia+Ross+1945+DvdRip+Mp4+Lee1001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"xultfoad","files":2,"time":1402167061,"description":"My Name is Julia Ross 1945 DvdRip Mp4 Lee1001\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0037932/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0037932/&lt;/a&gt; &lt;a href=&quot;\nhttps://en.wikipedia.org/wiki/My_Name_Is_Julia_Ross&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://en.wikipedia.org/wiki/My_Name_Is_Julia_Ross&lt;/a&gt;\nMy Name is Julia Ross is the first of a series of film noir directed by Joseph H. Lewis and is the film that Lewis likes to consider as the 'real' beginning of his career.\n\nHaving toiled industriously on nonsense for years, B-movie king Lewis was at last given a chance, by Columbia's Harry Cohn, with a slightly higher budget and infinitely more malleable material. Taking a job as secretary to Whitty, Foch soon finds herself in deadly peril: drugged and removed to a remote Cornish manse, she awakes to discover that she has been given another woman's name, not to mention a husband in the shape of Whitty's psychotic son Macready. So far, so bad, but things worsen when she hears her incarcerators plotting her demise as a fake suicide. \n\nHandling the various plot twists with ease and eliciting superior performances from his three leads, Lewis repeatedly displays his ability to convey mood and meaning through visuals: Burnett Guffey's camera prowls nervously through shadowy interiors, Macready's madness is vividly evoked by his endless knife-playing. A small, dark gem in the Rebecca tradition, it may not be as startlingly original or adventurous as Lewis's later Gun Crazy or The Big Combo, but it knocks Penn's remake Dead of Winter, for six.\n\nThink of this as the 1945 equivalent of the modern-day US indie hit. This ultra low-budget B-movie thriller set new standards in small-scale film-making and so impressed makers Columbia Pictures that Lewis's shooting schedule was almost doubled. Foch stars as the title character, an US woman in London who takes on a job as secretary for a wealthy family and falls into mortal danger when she is kidnapped by the clan to double as their son's wife,\n\nVIDEO\nSize.... 580mb\nDuration.... 01:05:02\nCodec....... avc1\nFrame Width.... 720\nFrame Height.... 480\nData Rate.... 1119kbps\nFrame Rate.... 23F/S\nAUDIO\nBit Rate.... 122kbps\n2 Channel Stereo\nAudio Sample Rate.... 48 KHz\nBits Per Sample 16 Bit/Sample","torrent":{"xt":"urn:btih:87ec2112bea40fb4dafdf90cd7bf90e2f0e72979","amp;dn":"My+Name+is+Julia+Ross+1945+DvdRip+Mp4+Lee1001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87ec2112bea40fb4dafdf90cd7bf90e2f0e72979","infoHashBuffer":{"type":"Buffer","data":[135,236,33,18,190,164,15,180,218,253,249,12,215,191,144,226,240,231,41,121]},"announce":[],"urlList":[]}}