{"title":"U2 - The Best Of 1980-1990 &amp; B-Sides (1998) WMA320","uid":6157693,"size":302899017,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8805e0ea674e410c741402c5107cc95fa30e5d68&amp;dn=U2+-+The+Best+Of+1980-1990+%26+B-Sides+%281998%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1297097259,"description":"Though some of these greatest hits have been played a zillion times on the radio, there's nothing wrong with hearing such grandoise monsters as &quot;Pride,&quot; &quot;New Year's Day&quot; and &quot;Sunday Bloody Sunday&quot; on one disc. Surprisingly, it's the hits from one of the greatest albums in rock history, The Joshua Tree, that come off as the most boring on this CD. More interesting are less played, ethereal numbers like &quot;Bad,&quot; &quot;Unforgettable Fire&quot; and the lively &quot;I Will Follow.&quot; There's certainly a fire that was present in early U2, passion and meaning within the songs, coupled with an arena-ready feel that fans and journalists have come to love and respect. \n\nU2 flaunts a surprisingly soulful side of itself on such greats as &quot;When Love Comes to Town,&quot; &quot;Desire&quot; and &quot;Angel of Harlem,&quot; heard toward the end of disc one where the band kind of lets its hair down. &quot;All I Want is You&quot; is a tender U2 beauty on which the band clicks on all levels; it's almost spiritual-sounding. Bono's sincere voice sounds like gold amid the Edge's sparkling, chiming guitar work. A gorgeous string section lovingly closes the song out. Let disc one continue to play after the last song to hear &quot;October&quot; (from October), an extremely beautiful piano instrumental. Quiet and peaceful, &quot;October&quot; is as good and memorable as the songs that proceeded it, despite its hidden, non-hit status. \n\nThe included 1980s b-sides are as great as U2 have ever sounded -- get this compilation because of them. All these closeted gems make a convincing case that U2 may have been at the top of its game back then, despite future classics in the 1990s. &quot;The Three Sunrises&quot; is a jangly and tuneful song that perfectly captures a different side to U2. &quot;Spanish Eyes&quot; has a rougher sound and a hugely ecstatic shout of &quot;Love!&quot; from Bono. The original mix of &quot;Sweetest Thing&quot; also benefits from a rougher-edged recording. Four very solid and inspired cover songs enhance disc two, one of which is a tremendously rocking version of Patti Smith's &quot;Dancing Barefoot,&quot; which ends with searing guitar licks and Larry Mullen Jr.'s timely, thumping drums. &quot;Love Comes Tumbling&quot; and the instrumental &quot;Bass Trap&quot; have mesmerizing and mysterious qualities that are timelessly fresh. Some of the b-sides such as &quot;Walk to the Water&quot; and &quot;Luminous Times&quot; have a deep and mystical sense of serenity and longing. &quot;Silver and Gold&quot; reveals an amazing ability by Bono to create a tune all by himself. The guy could probably make a pretty amazing solo album if he so chose. Still, U2 are a definite entity whose sum is stronger than its parts, despite the massive talent that each member possesses. If the past is any indication, the next ten years with these guys should be just as awesome as it's always been. When U2 are great (which is nearly all the time), the band stands as one of the best ever. In terms of songs, longevity, great ideas and integrity, these guys simply reign supreme. \n\nby Sal Nudo\n\nTRACKLIST:\nDisc 1:\n01 - Pride (In The Name Of Love).wma                             \n02 - New Year's Day.wma                                          \n03 - With Or Without You.wma                                     \n04 - I Still Haven't Found What I'm Looking For.wma              \n05 - Sunday Bloody Sunday.wma                                    \n06 - Bad.wma                                                     \n07 - Where The Streets Have No Name.wma                          \n08 - I Will Follow.wma                                           \n09 - The Unforgettable Fire.wma                                  \n10 - Sweetest Thing (The Single Mix).wma                         \n11 - Desire.wma                                                  \n12 - When Love Comes To Town.wma                                 \n13 - Angel Of Harlem.wma                                         \n14 - All I Want Is You.wma   \n\nDisc 2:\n01 - The Three Sunrises.wma                                      \n02 - Spanish Eyes.wma                                            \n03 - Sweetest Thing.wma                                          \n04 - Love Comes Tumbling.wma                                     \n05 - Bass Trap.wma                                               \n06 - Dancing Barefoot.wma                                        \n07 - Everlasting Love.wma                                        \n08 - Unchained Melody.wma                                        \n09 - Walk To The Water.wma                                       \n10 - Luminous Times (Hold On To Love).wma                        \n11 - Hallelujah Here She Comes.wma                               \n12 - Silver And Gold.wma                                         \n13 - Endless Deep.wma                                            \n14 - A Room At The Heartbreak Hotel.wma                          \n15 - Trash, Trampoline And The Party Girl.wma \n\nWMA 320Kbps 44100Hz STEREO\n","torrent":{"xt":"urn:btih:8805e0ea674e410c741402c5107cc95fa30e5d68","amp;dn":"U2+-+The+Best+Of+1980-1990+%26+B-Sides+%281998%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8805e0ea674e410c741402c5107cc95fa30e5d68","infoHashBuffer":{"type":"Buffer","data":[136,5,224,234,103,78,65,12,116,20,2,197,16,124,201,95,163,14,93,104]},"announce":[],"urlList":[]}}