{"title":"Micro-Manufacturing Engineering and Technology by Yi Qin","uid":6160759,"size":17220423,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:88fe02699de2d1e8e1879c638f74e7d5b605cd38&amp;dn=Micro-Manufacturing+Engineering+and+Technology+by+Yi+Qin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"abuel-3bbas","files":1,"time":1297204536,"description":"Product Description\nThis book presents applicable knowledge of technology, equipment and applications, and the core economic issues of micromanufacturing for anyone with a basic understanding of manufacturing, material, or product engineering.\n\nIt explains micro-engineering issues (design, systems, materials, market and industrial development), technologies, facilities, organization, competitiveness, and innovation with an analysis of future potential.\n\nThe machining, forming, and joining of miniature / micro-products are all covered in depth, covering: grinding/milling, laser applications, and photo chemical etching; embossing (hot &amp; UV), injection molding and forming (bulk, sheet, hydro, laser); mechanical assembly, laser joining, soldering, and packaging.\n\n. Presents case studies, material and design considerations, working principles, process configurations, and information on tools, equipment, parameters and control\n. Explains the many facets of recently emerging additive / hybrid technologies and systems, incl: photo-electric-forming, liga, surface treatment, and thin film fabrication\n. Outlines system engineering issues pertaining to handling, metrology, testing, integration &amp; software\n. Explains widely used micro parts in bio / medical industry, information technology and automotive engineering.\n. Covers technologies in high demand, such as: micro-mechanical-cutting, lasermachining, micro-forming, micro-EDM, micro-joining, photo-chemical-etching, photo-electro-forming, and micro-packaging\n\nProduct Details\nHardcover: 432 pages\nPublisher: William Andrew; 1 edition (July 28, 2010)\nLanguage: English\nISBN-10: 0815515456\nISBN-13: 978-0815515456","torrent":{"xt":"urn:btih:88fe02699de2d1e8e1879c638f74e7d5b605cd38","amp;dn":"Micro-Manufacturing+Engineering+and+Technology+by+Yi+Qin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88fe02699de2d1e8e1879c638f74e7d5b605cd38","infoHashBuffer":{"type":"Buffer","data":[136,254,2,105,157,226,209,232,225,135,156,99,143,116,231,213,182,5,205,56]},"announce":[],"urlList":[]}}