{"title":"Roger Nichols &amp; The Small Circle Of Friends - Same (1968) MP","uid":9625982,"size":74808931,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8915f1bf846a4cc469790e172d5bda68b12c1a54&amp;dn=Roger+Nichols+%26amp%3B+The+Small+Circle+Of+Friends+-+Same+%281968%29+MP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"AaronVincent","files":13,"time":1392593000,"description":"A true sleeper in the context of California pop. As a songwriter, Roger Nichols wrote with such luminaries as Paul Williams and Tony Asher (fresh from his collaboration with Brian Wilson on Pet Sounds, who co-wrote several of the selections here). The album is a lot of things at once. Soft pop, a smattering of rock, and a heavy dose of easy listening. The group itself has a great vocal blend. Nichols is joined by Murray MacLeod and his sister, Melinda. The three voices combined create a wonderful, soft sheen, equally effective on the ballads (Bacharach's &quot;Don't Go Breakin' My Heart&quot;) and uptempo numbers (&quot;Don't Take Your Time&quot;). There is an extremely gorgeous version of the Goffen &amp; King song &quot;Snow Queen,&quot; which is a graceful waltz, underpinned by the groups' superb vocals. The credits on the album are a virtual who's who of California pop at the time. Among those who helped out on the project on one way or another are Lenny Waronker, Van Dyke Parks, Bruce Botnick, and Randy Newman. Superbly produced by Tommy LaPuma, the album unfortunately didn't do very well at the time of its release, which is an incredible injustice. The music, though, holds up extremely well today, and is an authentic slice of California pop. Delicious.","torrent":{"xt":"urn:btih:8915f1bf846a4cc469790e172d5bda68b12c1a54","amp;dn":"Roger+Nichols+%26amp%3B+The+Small+Circle+Of+Friends+-+Same+%281968%29+MP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8915f1bf846a4cc469790e172d5bda68b12c1a54","infoHashBuffer":{"type":"Buffer","data":[137,21,241,191,132,106,76,196,105,121,14,23,45,91,218,104,177,44,26,84]},"announce":[],"urlList":[]}}