{"title":"The 50 Best Sights in Astronomy and How to See Them","uid":6795374,"size":7138636,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:893c90f3be8efa967f69bd721e72539681e19b08&amp;dn=+The+50+Best+Sights+in+Astronomy+and+How+to+See+Them&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"freaktorrent07","files":-1,"time":1320428679,"description":"\nAuthor(s):\tFred Schaaf\nPublisher:\tWiley\nDate:   \t2007-07-27\nPages:  \t288\nFormat: \tPDF\nISBN10: \t0471696579\nISBN13: \t9780471696575\n\n Fred Schaaf is one of the most experienced astronomical observers of our time. For more than two decades, his view of the sky--what will be visible, when it will be visible, and what it will look like--has encouraged tens of thousands of people to turn their eyes skyward.&quot;\n--David H. Levy, Science Editor, Parade magazine, discoverer of twenty-one comets, and author of Starry Night and Cosmic Discoveries\n\n&quot;Fred Schaaf is a poet of the stars. He brings the sky into people's lives in a way that is compelling, and his descriptions have all the impact of witnessing the stars on a crystal clear dark night.&quot;\n--William Sheehan, coauthor of Mars: The Lure of the Red Planet and The Transits of Venus\n\nThe night sky holds endless fascination for anyone who chooses simply to look up and observe, but with so much to see, it can be difficult to know where to start. This remarkable book introduces you to the fifty best sights in astronomy and tells you exactly how to see them. In no time at all, you will learn how to find and appreciate the Orion group of constellations; the Summer Triangle; Venus, Jupiter, and Mars; the best meteor showers; man-made satellites; star clusters; novae; variable stars; and more.\n\nThe sights are presented according to the field of view necessary to see them. Your eyes and a clear night sky are all you need to view the sights in the first part of the book, before moving on to those that can be observed through binoculars and, finally, a telescope. Concise descriptions and explanations of these spectacular visual wonders will deepen your appreciation of them and spur further exploration. You will also find the essential basic information on astronomical observation you need to get started, including observing conditions, techniques, telescopes, and astronomical measurements.\n\nOnce you start gazing, you'll see that the sky really is the limit--and discovering its amazing treasures will become your lifetime passion.","torrent":{"xt":"urn:btih:893c90f3be8efa967f69bd721e72539681e19b08","amp;dn":"+The+50+Best+Sights+in+Astronomy+and+How+to+See+Them","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"893c90f3be8efa967f69bd721e72539681e19b08","infoHashBuffer":{"type":"Buffer","data":[137,60,144,243,190,142,250,150,127,105,189,114,30,114,83,150,129,225,155,8]},"announce":[],"urlList":[]}}