{"title":"IconLover 5.35 By NASWARI+ZOHAIB","uid":8601968,"size":16699369,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8992201a10b7a1941e40fa82d433df8359a01569&amp;dn=IconLover+5.35+By+NASWARI%2BZOHAIB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"NZupload","files":-1,"time":1371909003,"description":"Program name: IconLover\nSoftware version: 5.35\nLatest version: 5.34\nOfficial site: Aha-Soft\nLanguage: English + Russian\nTreatment: Complete\nType of medicine: crack\n\nSystem requirements:\nWindows Â®: 95/98/ME/2000/NT/XP/2003/Vista/7/8\n\nDescription:\nIconLover - easy to use software for creating and editing graphic icons and cursors. With pomschyu this tool you will be able to express their creative nature and create your own special icons and cursors, convert the finished images to icons, to give a unique look to your desktop, adjust the image lists. You will be able to create or edit a new icon or cursor using the built-in application of tools for editing. In addition to using standard tools, the program provides a variety of effects, such as the imposition of the shadows, setting tone and color saturation, rotation, transparency, change colors, etc. Create or edit icons and cursors you can export in one of the supported formats.\n\nIconLover, you can:\nManage icons, cursors, icons and lists blanks\nCreate a semi-transparent icons, buttons, static and animated cursors for Windows\nCreate and edit icons in standard and custom sizes, with color depths up to 32-bit True Color\nCreate icons for programs, websites, the desktop\nCreate large icons for Windows Vista and Windows XP\nGradient and chess fill in the process of drawing\nUse layers in the draft icons\nUse a drop shadow, opacity, smoothing, negative, grayscale, colorize, rotate, roll and mirror effects\nImport and export ICO, BMP, JPEG, ANI, CUR, GIF, PNG, TGA, WMF, WBMP, XPM, XBM and Adobe Photoshop PSD formats\nCollect icons in the collection, for clarity\nExtract icons from executable files and libraries in Windows\nChange the icons in exe-files\nSearch icons on your drives\nDownload icons from the sites, collections of icons\nConvert or modify the set of icons at once\nCustomize desktop and folder.","torrent":{"xt":"urn:btih:8992201a10b7a1941e40fa82d433df8359a01569","amp;dn":"IconLover+5.35+By+NASWARI%2BZOHAIB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8992201a10b7a1941e40fa82d433df8359a01569","infoHashBuffer":{"type":"Buffer","data":[137,146,32,26,16,183,161,148,30,64,250,130,212,51,223,131,89,160,21,105]},"announce":[],"urlList":[]}}