{"title":"Tom Bearden with Richard Hoagland - Hyperdimensional Physics","uid":5574248,"size":52321481,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:8a936db81e393093723e0b05dc1cddb76591fc91&amp;dn=Tom+Bearden+with+Richard+Hoagland+-+Hyperdimensional+Physics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"geogaddi000","files":-1,"time":1274343841,"description":"Coast to Coast AM: Monday Night / Tuesday Morning, September 21st 1998\n\nHost:\nArt Bell\n\nGuests:\nRichard C. Hoagland, Tom Bearden\n\nLongitudinal waves, scalar weapons based on hyperdimensional physics, weapons, weather control\n\n-----------------------------\n &lt;a href=&quot;\nhttp://www.phoenixarchives.com/contact/1999/0199/011299.pdf&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.phoenixarchives.com/contact/1999/0199/011299.pdf&lt;/a&gt;\n\n&quot;A Native American named Speaking Wind just spoke on Art Bell's radio program on Dec. 1998.  He discussed Earth Changes and spoke extensively on H.A.A.R.P. and weather control.  Thirteen days later, on Dec. 22nd, he was found dead from a &quot;heart attack&quot;. (??)  Was he intentionally deaded for saying too much?\n\nOn Wednesday night, Dec. 30 1998, Art did a show with Richard Hoagland and two other guests who thoroughly chastised what Mr. Hoagland was doing and saying.  Richard was called a liar, and worse.  It appears unmistakable that he is on to something that the Elite do not want you and I to know about, AT ANY COST!\n\nArt also read a fax from a scientist, who wished to remain anonymous, who has appeared on the show before.  This man, a personal friend of Mr. Hoagland, has been put on notice that if he speaks any further about weather control or things that are about to come down on the people in the very near future, HE WILL BE DEAD WITHIN 48 HOURS!  The man said in the fax that he agreed with Richard and went on to say, &quot;It's this simple- if I wish to live for even 48 hours, I cannot go into that (weather control) or other things... Nothing you or I or anyone else can do can change what's coming down now.&quot;  Could this be Tom Bearden, who appeared on Art's show on September 21, 1998?  Check the website for a very enlightening article by Tom on &quot;Scalar Electromagnetics and Weather Control&quot; at http://www.mail-archive.com/&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;aecddadcc2eec2c7dddaddcbdcd880cfc1c280cdc1c3&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;/msg73370.html\n\n-----------------------------\n &lt;a href=&quot;\nhttp://web.archive.org/web/20070119114716/http://www.virtuallystrange.net/ufo/updates/1999/jan/m02-016.shtml&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://web.archive.org/web/20070119114716/http://www.virtuallystrange.net/ufo/updates/1999/jan/m02-016.shtml&lt;/a&gt;\n\nNote - The following is a transcript of the Art Bell/Richard\nHoagland discussion of a warning letter received by Richard and\npresented on the Art Bell program of 12-30/31-98.\n\nB. All right. I'm going to begin this segment with Richard. Now\nas you know Richard Hoagland, over the past, I don't know it's\nover a month or two has been documenting what he believes to be\nweather control occurrences. With radar photographs, this is\npart of what A.M. Stephens, Mr. Stephens is going to be talking\nabout but I have something that I want to bring up and I'm going\nto let the audience be the judge of what we're going to be into\nhere. In passing and possibly not at all connected with any of\nthis is the fact that a man named Speaking Wind, a Native\nAmerican. Ah, who was on my program literally just days ago and\ntalked extensively about HAARP, about weather control. Ah, about\nthe whole thing had a massive heart attack and is now dead with\nin days of doing the program. That much you may have found out\nif you where on listining last night on the program. Now Richard\nhas been pursuing these radar images of what would appear to be,\nsome sort of weather control. Now I'm not a expert on radar but\non his site, you will see multiple images most of them near\nmilitary bases of, of weather patterns that are illuminating\nwhat appears to be ah attempt at weather control or in fact\nweather control. And I think we're into something very dangerous\nhere and I'm goin to read something in a moment from sombody\nthat I've had on the air before who I'm not going to identify\nfor obvious reasons. Ah, but Richard would you characterize this\nperson without identifying this person, please would you\ncharacterize the person.\n\nH. This is a very serious, individual, a technical individual\nwho has great expertise in the area of what I've termed\nHyperdimensional Physics and the extensions of Maxwell's\noriginal work. He has had a background in black opps area.\n\nB. Very heavlly credentialed.\n\nH. Heavlly credentialed, very serious, not a frivolous person,\nnot a flight of fancy person, not a paranoid person.\n\nB. Ah ump, I agree with that completely. Thats my personal\nassessment to the audience. We're not going to give this\nperson's name for obvious reasons. I'm going to read you part of\nwhat he sent to Richard, leaving a couple details that would\nidentify this person out, and you can make up your own mind\nabout what, what it all means. Richard I'm not obviously for\nobvious reasons I'm not going to read, not going to read this\nentire thing.\n\nH. Sure\n\nB. But I'm going to read enough so the audience understands what\nwe're up against here.\n\nB. All right here we go. This was a response to Richard from\nthis person we both respect. This credentialed person Richard\nhad writtened to this credentialed person with respect to the,\nradar images that are on the Enterprise Mission. com site.\n\nDear Richard,\n\nAgree with much of what you have said but it doesn't change\nthings for me at all. As you know I have a completely different\nnotion of inquotes &quot;aliens&quot; and that whole scene. Very little\nchange from the old 1978 briefing presentation except the\nPhysics got better. In my view we ourselves created them from\nthe collective unconscious. So the critters remain rather\n&quot;insane&quot;, in quotes, like a waking nightmare. Hell, thats\nprecisely what they are. No longer any concern of mine as that\nhas been overridden by events. NOW LISTEN VERY CLOSELY (Bell\nadvises)! It's this simple. If I wish to live for even 48 hours\nI cannot go into that or other things, he's referring now to\nthese, this weather control business. Let me repeat that. If I\nwish to live for even 48 hours I can't go into that or the other\nthings. Or go high profile publicly. I won't do anyone any good\nwinding up dead very abruptly. Bluntly in my estimation my life\nexpectancy right now is about June of '99 if I fortunate.\nPerhaps even only May if certain others here in the Rogue US\nGroups have there way, maybe sooner. That's it. Nothing anyone\ncan do to prevent or effect that as a old soldier of - I omitted\na age here, a few days ago I accept the inevitable. It doesn't\nchange what I have to try to do in what little time I have left.\nTime to do the McArther bit and just fade away. Most everyone\nelse may not be very far behind anyway. Nothing you or I or\nanyone else can do can change what's coming down now. All the TV\nshows and radio talk shows and such cannot change one hairs\nbreath. Only the Little Nation can avert it. Perhaps I give it a\n50 a 75 percent probability no higher but would not argue that\n50 percent is more correct. (pause)... let me see if I can go\non. alright I can. None of the conspiracies, alien plots, plans,\nmaneuvering, politics, Clintonestas, rogues, UFO researchers,\npontificators, intell. agencies, armed forces, scientific\ncommunties, etc. have any further effect on any of this. It's\nreally simple. We have a pending strategic strike unparalleled\nin all history now rapidly coming upon us. It's in place and\ncounting down and the initial preparation period has already\nbegun. At this point there are only two players in the game and\nthe US is not either one of them. Nothing the entire United\nStates can do can change anything at this point period. And\nthats where I'm going to stop. There is more. But I respect this\nindividual, very highly. He is a credentialed individual and he\nis scared out of his mind. It is his view if he were to proceed,\nto go on the air with Richard his life would be over inside of\n48 hours. Richard is that a fair assessment and reading?\n\nH. Except for the characterization of scared out of his mind. I\nthink that more of a measured, there, there is so much blood in\nthe body as Jody, Carter once said, President Carter's Press\nSecretery Jody Powell.\n\nB. Um hm\n\nH. And this individual has decided not to waste it on this\neffort but to focus instead in low profile on those areas where\nhe thinks he can make a difference.\n\n\n-----------------------------\n &lt;a href=&quot;\nhttp://web.archive.org/web/20040825105205/http://www.geocities.com/Athens/Oracle/9007/SacredGround.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://web.archive.org/web/20040825105205/http://www.geocities.com/Athens/Oracle/9007/SacredGround.html&lt;/a&gt;\n\nA Message to the World\nfrom Robert Ghost Wolf\n\nHolding Sacred Ground\n\n&quot;Many dramas have entered our world since December of 1998. We are truly experiencing The Winds of Change I wrote about last year and presented as highlights on Art Bell's Coast-to-Coast radio show. From the sudden demise of my friend Speaking Wind, to the passing over of several elders who have played important roles in my life -- Elders who have been my friends as well as my teachers -- Elders who were Warriors of Peace. Two of them were Hopi, Chief Dan Evehema, and Thomas Banyacya.\n\nSince the drama with &quot;the Miami Circle&quot;, both myself and my friend Richard C. Hoagland have been the targets of very serious attacks. Richard fell prey to a sudden heart attack surrounded by strange circumstances not too unlike that of my friend Speaking Wind, who did not survive. When one person falls victim of a calamity we can shrug it off to circumstance; when two fall, our eyes must begin to open. When we see it occur as I have with 9 people within our circles since December of 1998 I know I am not paranoid.\n\nI myself have been the target for unfounded lies and vicious and slanderous reports spread throughout the internet by questionable sources, who portrayed themselves as would-be vigilantes. I have had to stand and watch as my computer equipment was destroyed by virus attacks that came through the Internet. I witnessed my website hacked on more than one occasion. I have seen my personal friends and my family members threatened and maligned as well. It has been a year so far of receiving grand lessons in practicing forgiveness, and keeping focused on my contract to the Service of the Light. In many ways it is what I now call The Year of the Tiger.\n\nThe Year of the Tiger -- where the tyrants of darkness, in losing ground, have resorted to playing very nasty and diabolical games. The war of dark and light continues to be waged, and the dark is not doing as well as it expected. They are resorting to desperate measures. Heroes are being cut down and anger and aggression have become the chosen pathway. This energy and attitude is being spread across the airwaves and in the published media like a nasty virus.&quot;\n\n\n&quot;People, the time for a leisurely and blissful path to enlightenment is passed. We are at the threshold of the emergence of the Fifth World. Have you felt The Eye of the Tiger upon you yet?\n\nWe are, for the most part, experiencing the full effects of the purification that we have for so long been told was coming. It is and will continue to escalate in a sort of waveform as we progress through this period into an even more prolific level of shifting energies. We are in the throes of perhaps the greatest transition that the universe and mankind has ever known.\n\nAs we enter the Fifth World which I have spoken about for years, we are experiencing frequency changes which are altering the pattern of everything. We are literally existing in a new physics; reality is no longer what it was twenty, even ten years ago, from the simple way a neuron reacts to the way in which we interact with each other as human beings.\n\nPart of the prophecies I have spoken about in my experiences with you tell of the breaking down or fracturing, or fractalizing of all life expression as we have known it....Social Structures, Religious Structures, Financial Structures, as well as Scientific beliefs. When the physics of reality itself transmutes into something new, the Laws of Cause and Effect no longer apply. That which was once looked upon as a sure and definitive pathway to the outcome no longer exists. We are now Voyagers into the Void. Yet it is a predictable outcome, and is a result of the old Laws of Cause and Effect.\n\nWhen consciousness is restricted to the point that it can no longer allow itself to be elastic and change with the evolution of the times and the species that express upon this plane, then imminent change is in order. What we are experiencing are shifts in frequency, dimension and physical structure to accommodate the emerging energy. It is so vast in its scope and yet so intrinsically simple. Something that has never been before is occurring to the whole of the Universe. We are transforming into a new species; we are preparing for a new consciousness, and another octave of physical expression.&quot;\n\n\n&quot;As a race we are experiencing transition on multiple levels at an ever increasing volume and rate of speed. We are experiencing change from the innermost structure of the atoms that comprise our molecular structure, to the very frequency upon which our consciousness expresses. We are mysteriously coming into harmony with something that IS not yet, but will be. It is a cycle of birthing. The chicken is coming out of the egg.\n\nWe are experiencing dimensional shifting as our entirety of perceived reality. We, as a species are moving through the metamorphosis of consciousness. From here we get to take the next step in our evolutionary process. We are standing witness to the Dance of Shiva, the Dance of Life and Death -- Lovers embraced in each others arms! Yet, we perpetuate the patterns of the Spell of Mortality --The greatest illusion of all!&quot;\n\n\nWELCOME TO THE AWAKENING!","torrent":{"xt":"urn:btih:8a936db81e393093723e0b05dc1cddb76591fc91","amp;dn":"Tom+Bearden+with+Richard+Hoagland+-+Hyperdimensional+Physics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a936db81e393093723e0b05dc1cddb76591fc91","infoHashBuffer":{"type":"Buffer","data":[138,147,109,184,30,57,48,147,114,62,11,5,220,28,221,183,101,145,252,145]},"announce":[],"urlList":[]}}