{"title":"Marcey Hamm Discography Healing Music [FLAC]","uid":11890563,"size":2537513797,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8af3724e459acb7b190a08b2e5420d0419c4068a&amp;dn=Marcey+Hamm+Discography+Healing+Music+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"elessedilgirl","files":84,"time":1430990474,"description":"Marcey Hamm was born in Oklahoma. She's a Nuclear Engineer, Software Engineer and Electronics Engineer. She wrote software programs for robotic systems and she has built her own computerized music studio that she finished about three days before she had a severe car accident.\n\nHer near death experience due to this automobile accident in 1985 was the catalyst that brought her to create music that heals. She explored every alternative healing possibility to heal herself.\n\nAfter her healing, she went into her studio for the first time since her car accident and her near death experience. All of a sudden, she felt tired and she leaned back in her chair for a short nap. And then she had an out-of-body-experience. Some 8 hours after this experience, she returned to her body and remarked that the lights on her display panel were flashing, indicationg that something has been recorded.\n\nShe played the &quot;music&quot; and it was the same music she experienced while out of her body. She called this music &quot;Inward Harmony&quot;.\n\nFor all of her other albums too, Marcey Hamm does not remember making the albums.\n\nWhat she remembers is the experiences that she had in a sleep state environment and when she woke up, the album was composed. Whatever she experiences in the sleep state is how she knows the purpose of the composition.\n\nPeople report sudden, almost miraculous, spontaneous feelings of well-being while listening to Marcey Hamm's CDs and tapes.\n\nHowever, Marcey Hamm does NOT claim to have any cure all here. Everyone is going to have their own experience with her music.\n\nHer music is here to help us live life fully and really be happy. Reportedly it has helped thousands of people worldwide.\n\nAlbums:\n\nAnthem to Soul\nCelestial Dance\nDream Partner\nInnocence\nInward Harmony\nMaitreya\nSampler I\nZ\n\nreference libFLAC 1.3.1 20141125\n\nAll tracks secure rips and AccurateRip verified. Rip logs included","torrent":{"xt":"urn:btih:8af3724e459acb7b190a08b2e5420d0419c4068a","amp;dn":"Marcey+Hamm+Discography+Healing+Music+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8af3724e459acb7b190a08b2e5420d0419c4068a","infoHashBuffer":{"type":"Buffer","data":[138,243,114,78,69,154,203,123,25,10,8,178,229,66,13,4,25,196,6,138]},"announce":[],"urlList":[]}}