{"title":"Dawn Of Ashes Full Discography","uid":5934440,"size":497821054,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8bc13d02ca52e3082a6ffa7d7ef4843b1acc8012&amp;dn=Dawn+Of+Ashes+Full+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"DeeMT","files":82,"time":1288900867,"description":"albums included:\n\ndawn of ashes ep (2001)\nsacred fever (2005)\ncut the flesh (2006)\nin the acts of violence (2007)\nthe crypt injection (2008)\ngenocide chapters (2010)\n\n\nIn the darkest form of incubated evil, a symbol has been born to strike immense fear into the hearts of mortal weakness. Kristof Bathory, Volkar Kael, Bahemoth and Othuum, four vile forms that control a new era where nightmares become reality and where the sounds of the macabre shall emerge from a catastrophic symphony, have resurrected the sounds and visions of horror, hatred, and suffering that is spewed forth in the form of extreme horror metal that is DAWN OF ASHES; a name that was created to reflect upon the birth of death and failure. Now the plague has come to corrupt the flesh of man.\n\nSince DAWN OF ASHES (DoA) formed in 2001, the band has made transitions in line-ups and sound to create their ideal artistic outlet. DoA did so by adding additional members and placing the element of live guitars and drums into the music, taking the group from the Industrial scene into the Extreme Metal scene. With DoAÃƒÂ­s new, solid line-up, the next installment from the group will summon new sights and sounds among the world with a blackened melodic-death metal sound.\n\nEnter December of 2009; DoA inked a worldwide deal with Metal Blade Records to release the groupÃƒÂ­s third full-length studio album, Genocide Chapters. The horrific act entered the studio in the winter of 2010 to record their Metal Blade debut with producer Fred Archambault, known for his work with Avenged Sevenfold, Death By Stereo, Eighteen Visions, and many more. Handling the cover art for Genocide Chapters is Machine-Room (My Dying Bride).\n\nThis cryptic act, based on horror inspired extreme metal, is comprised of four musicians whose passion for intense and macabre imagery, music, and live performances will soon be seen by the metal masses when Genocide Chapters is unleashed September 14, 2010. It is now time for DAWN OF ASHES to increase the brutality so prepare yourself for further devastation as the ashes will never rest upon the weak; the evil within this group will never die!\n\n\n\n &lt;a href=&quot;\nhttp://www.last.fm/music/Dawn+of+Ashes&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.last.fm/music/Dawn+of+Ashes&lt;/a&gt;\n\n\n\n\n\n\n\n\n\n\nhow did i get this:\nim leet, and i have my ways of getting advanced releases..\nalso support my friend chrixs0\n  &lt;a href=&quot;\nhttp://thepiratebay.se/user/chrixs0/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/chrixs0/&lt;/a&gt;\n\n\nit was through him i released a lot of my stuff in the past, but decided to get my own tpb account, some of you may have downloaded my early release of the last psyclon nine album, and my combichrist discography (up to 2009) as well as my dawn of ashes discography.\n\nenjoy my torrents, always high quality, always industrial and metal.\n\n\n\n\nThis album is a sharp turn from their industrial stuff, but still alright, not near as amazing in my opinion, as i all sounds like the basic metal that is mass produced today, but oh well.\n\n\n\n\n\n\n\n\n\ntags:\n\n\n\ndawn of ashes, dawn, of, ashes, sacred fever, cut the flesh, the crypt injecton, the gencide chapters, industrial, techno, combichrist, grendel, electro, TBM,tbm, terror, metal, black metal, dark electro","torrent":{"xt":"urn:btih:8bc13d02ca52e3082a6ffa7d7ef4843b1acc8012","amp;dn":"Dawn+Of+Ashes+Full+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8bc13d02ca52e3082a6ffa7d7ef4843b1acc8012","infoHashBuffer":{"type":"Buffer","data":[139,193,61,2,202,82,227,8,42,111,250,125,126,244,132,59,26,204,128,18]},"announce":[],"urlList":[]}}