{"title":"3DMGAME-The.Sims.4.Update.1.incl.Crack","uid":10993284,"size":281266162,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8c46a524161436c8ee5a6f2bd0d7fbe23710a43e&amp;dn=3DMGAME-The.Sims.4.Update.1.incl.Crack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":8,"uploader":"DoN_Vinny","files":163,"time":1410030975,"description":"[code]/////////////////////////////////////////\n/// ///\n/// #1 Exclusive release by 3DM ///\n/// ///\n/////////////////////////////////////////\n\nIstructions\n\nUsage: \n\n1, you need to install Orign client \nOrigin Download: https://www.origin.com/en-ie/download or https://download.dm.origin.com/origin/live/OriginSetup.exe \n2, register and log in to any one Origin account \n3, unzip \n4 Run Game  bin  TS4-Launcher.exe start the game \n\nCracked support genuine online community features \n\nTested XP 32-bit / Win 7 SP1 64-bit and Win 8.1 64 bit (I measured) \n\nBy GlowStorm @ 3DM technology group (thanks SkyBP @ 3DM technology group providing support) \n\n-------------------------------------------------- -------------------------------------------------- ---------------------------------- \n\n\nCrack patch update instructions \n\n1 repair Mosaic BUG \n2, support the official on the 1st archive retrieval \n\n-------------------------------------------------- -------------------------------------------------- ---------------------------------- \n\nOfficial Game Patch Update Description \n\nUpdate: 9/5/14 \n\nBug Fixes / Issues: \nIt has been brought to our attention that some of our cute and adorable babies have had difficulty expressing themselves without ... well ... distorting. There was an issue with some integrated chipsets causing the poor little ones to appear in their own &quot;unique&quot; way. We have corrected the problem and pulled everyone back together. Thank you for helping us identify, and track down this issue. \n\nUpdate: 9/2/14 \n\nSevere Issues / Crashes: \nFixed a crash in Build Mode by preventing the game from thinking fences were rooms. \nFixed a crash in Create A Sim that could occur after the you lock and unlock your computer. \n\nBug Fixes / Issues: \nFixed an issue with &quot;Shine on Men's Suit&quot;, &quot;Glitter and Abs&quot;, &quot;Big Hat of Shame&quot;, &quot;Star-Spangled Glasses&quot; and the &quot;Tiki Bar&quot;, not remembering their unlocked state upon reload. \nFixed several issues with Sims attempting to go on dates with the Reaper, resulting in non-responsive game states.The Reaper still loves ya baby, he is just too busy to go on a date with every lovelorn Sim that vies for his attention. \nFixed several issues where babies were incorrectly hibernating within household inventories resulting in several issues: \nYou can now exit Build Mode when not on your home lot if a baby was incorrectly left in the home lot inventory. \nGame no longer hangs if you attempt to split a household with a baby on the lot and in the household inventory. \nSplitting and merging households no longer results in unplayable households due to babies being left in household inventories. \nBabies are no longer left locked in the household inventory if all the other Sims in the household die. \nBabies no longer multiply if left in the Household Inventory while editing the lot via Manage Worlds. \nFixed an issue where Gallery households that have been merged with another household were preventing Live Mode from loading. \nAdding a new Sim to a played household via Create A Sim by going from Manage Worlds will now allow you to modify their face and body. \nLots with scaled objects (via the shift + [,] cheat) that are shared to the Gallery will now remember their enlarged state for others to enjoy. \n\nGallery Issues: \nFixed an issue where the game would become non-responsive when attempting to save a lot to the your library. \n\n-------------------------------------------------- -------------------------------------------------- ---------------------------------- \n\n\nSpecial note: \n\n1, the game directory __Installer  vc  vc2013  redist folder inside the VC2013 runtime Always make sure to install (double click to run vcredist_x86.exe to install) otherwise the game 100% can not run the registry may need another game running beneath the portal to download to \n\n2, letter no soft kill soft kill hack Please consciously prevent accidental deletion 3DMGAME.dll this crack file \n\n3, the game BUG various scenes flash back when switching, you can try to open the Task Manager to end all processes ali beginning, and then run the game. (If these processes over time and then automatically re-appear on the end of a process) \n[/code]\n-------------------------------------------------------------------------------\n[color=red][b]\n[code]Read Notes before asking something !!\n\nNOTES: \n - This version of game require &quot;Origins&quot; to be installed ,opened and logged in (fake account). \n - Open Origins and login then run game from Desktop shortcut. Before playing put it in offline mode\n - To change game language : go to game folder and run your desired .reg language file\n - Note after you use toilet in game your character will remain pixel-et,you must install patch to solve that issue. \n - To avoid game crash: always run game as Administrator and set Video settings to Medium or low. \n - If your game is not opening at all: install Visual C++ 2013 x64 and x86 version too.\n - Your game is crashing when you traveling or go on map mode: Do NOT use fast speed - PAUSE GAME before travel !!! \n- If Origins is asking for activation code or product code or invalid .par file: Your Antivirus has deleted or \n blocked file &quot;3dmgame.dll&quot; due to a False Positive: Install update patch with antivirus disabled and add game folder \n to exceptions ,open Origins and login ,run game from desktop shortcut \n\n-----------------------------\n- Language pack is included and crack is already applied\n- Only tested on 64-bit systems, 32-bit not guaranteed\n\n\nStep by step guide how i made it work:\n1. Version required: 3DMGAME-The Sims 4 Digital Deluxe Edition-3DM (recommended)\n or The SIMS 4-Deluxe Edition-SKIDROWCRACK\n2. Disable your antivirus or it will delete/ block the 3dmgame.dll file\n3. Extract this update and install Origin_Setup.exe\n4. Go to vcredist 2013 folder and install both exe's (x64 &amp; x86, x64 won't install on 32-bit systems)\n5. Now copy the folders and files from this folder (_installer, data, game etc) to the main game folder and overwrite the files ( 3DMGAME-The Sims 4 Digital Deluxe Edition-3DM)\n6. Go to Register language, ONLY APPLY 1 folder and apply your desired .reg language, apply 1 only not all of them\n7. Go to GameBin and right click on the TS4.exe file and go to compability tab and set compability mode to &quot;Windows XP SP3&quot;, and check the run as Administrator box, and apply\n8. In the same folder check if there is no there .par file then TS4.par, or else delete the other one\n9. CHECK IF THE 3dmgame.dll FILE IS STILL THERE\n10. Add the folder to your antivirus exceptions\n11. Open Origin and login to your (fake) account, and PUT IT IN OFFLINE MODE\n12. Now run TS4-Launcher.exe as admin and enjoy the game.\n\n------------------------------\n- This update fixes the pixalation bug\n- This update makes the game crash less often when traveling to other lot\n\nI can not guarantee you that this will work for all of you, but this should be working now\nIf you still are experiencing crashes do this: \n- Open Origin and go to \n Origin &gt;Application Settings &gt; Origin In Game and make sure all options off.\n- Close Origin (Leave running in background)\n\n[/code][/b][/color]\n\n\n[size=5][b][color=red]Your bin folder should look like this[/color][/b][/size] \n[img]http://i.imgur.com/2t0Ahch.png[/img]","torrent":{"xt":"urn:btih:8c46a524161436c8ee5a6f2bd0d7fbe23710a43e","amp;dn":"3DMGAME-The.Sims.4.Update.1.incl.Crack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c46a524161436c8ee5a6f2bd0d7fbe23710a43e","infoHashBuffer":{"type":"Buffer","data":[140,70,165,36,22,20,54,200,238,90,111,43,208,215,251,226,55,16,164,62]},"announce":[],"urlList":[]}}