{"title":"Moms in Control [DVDRip]","uid":11716728,"size":1899814763,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:8c86b5d50842a56b07e0385118b443d6134e7122&amp;dn=Moms+in+Control+%5BDVDRip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"H4ckuos","files":1,"time":1424614496,"description":"CAST\nAlena Croft, Anya Ivy, Codi Bryant, Dee Dee Lynn, Halle Von, Jezebelle Bond, Karmen Karma, Leigh Darby, Lezley Zen, Mia Malkova, Rebecca Moore, Stella Cox\n\nDESCRIPTION\nMoms In Control: Mia And The MILF Mia Malkova is in England to meet up with her long distance boyfriend Ryan Ryder. Concerned for the young couple, Ryan`s stepmom Rebecca Moore decides to give Mia some sex lessons, and everything else she needs to know to rock Ryan`s world. Don`t Forget Your Lunch, Honey Alena Croft came to ZZ Academy to bring her stepson Jessy Jones his lunch. She stopped in the washroom and surprise when she heard Jessy come in and start getting a blowjob from his girlfriend Halle Von! She decided to take it upon herself to teach Halle how it`s done! Shagging In The Shower Karmen karma decided to give the window washer, Tyler Nixon, an intense deep throat bj that only gets interrupted when her stepmother Jezebelle Bond decides to join in on the action! The two sexy sluts are sucking and fucking it until they`re cumming hard! Let`s Work It Out Together Tyler Nixon has never gotten along with his step sister Dee Dee Lynn. Family friend Lezley Zen decides the only way to ease the tension is with a little sexual healing! They take turns riding Tyler`s big cock until he finally blasts a cumshot all over both their faces! My Stepmom The Control Freak Stella Cox`s new step mom Leigh Darby has some serious control issues. She decided to join in when Stella was hooking up with her boyfriend Danny. Leigh was giving Stella about how to give blowjobs, titty fuck, and taking huge cocks deep in her tight pussy.\n &lt;a href=&quot;\nhttp://xxxhost.info/img-54e9d64c902de.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.info/img-54e9d64c902de.html&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.info/img-54e9d646aa35d.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.info/img-54e9d646aa35d.html&lt;/a&gt;","torrent":{"xt":"urn:btih:8c86b5d50842a56b07e0385118b443d6134e7122","amp;dn":"Moms+in+Control+%5BDVDRip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c86b5d50842a56b07e0385118b443d6134e7122","infoHashBuffer":{"type":"Buffer","data":[140,134,181,213,8,66,165,107,7,224,56,81,24,180,67,214,19,78,113,34]},"announce":[],"urlList":[]}}