{"title":"Hallmark-Let It Snow [2013]","uid":9279108,"size":733560186,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8cd4d50cc26099a78ffef7054c4d9e2f258943ce&amp;dn=Hallmark-Let+It+Snow+%5B2013%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"RayCort","files":1,"time":1385909155,"description":"Hallmark-Let It Snow [2013]\n\nAir Date: 30 Nov 2013\n\nSummary: The story of a driven hotel executive intending to transform a family owned lodge into the new winter, premier hot spot.\n\n When Falcon Resorts acquires family-owned Snow Valley Lodge from retiring owners Karla and Paul, driven executive Stephanie Beck must spend the week before Christmas in Maine, preparing a proposal on the property's renovations. Determined to impress Falcon's president, her detached father Ted, Stephanie reluctantly departs her warm Arizona home to immerse herself in the lodge's property and decide how to change it to fit the hip, young Falcon brand. While preparing to rebuild the Snow Valley Lodge from the ground up, Stephanie butts heads with her property guide, Brady Lewis, Karla and Paul's son, who has decided to leave his family's business over creative differences with his dad. \n\n A self-defined Grinch, Stephanie begins her stay at Snow Valley Lodge immune to Christmas sentiment. But as the lodge's festive traditions provide the Christmas Stephanie never had growing up with her distant father, Stephanie finds herself enjoying every minute. To complicate her professional duties even further, the combative feelings she felt toward Brady turn into romantic ones. With Stephanie's newfound Christmas spirit and unexpected holiday romance, she begins to question Falcon's overhaul. As her Christmas Eve deadline approaches, Stephanie must weigh her loyalty to her new friends against the complicated relationship with her father and decide if she should transform the lodge into a new winter hot spot, or embrace tradition and let it snow! \n\n\nCast: \n\nCandace Cameron Bure ... Stephanie Beck\n\nJesse Hutch ... Brady Lewis\n\nAlan Thicke ... Ted\n\nGabrielle Rose ... Karla\n\nDan Willmott ... Paul\n\n","torrent":{"xt":"urn:btih:8cd4d50cc26099a78ffef7054c4d9e2f258943ce","amp;dn":"Hallmark-Let+It+Snow+%5B2013%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8cd4d50cc26099a78ffef7054c4d9e2f258943ce","infoHashBuffer":{"type":"Buffer","data":[140,212,213,12,194,96,153,167,143,254,247,5,76,77,158,47,37,137,67,206]},"announce":[],"urlList":[]}}