{"title":"Ni.Liv.(aka.Nine.Lives).1957.Eng.Nor.Swe.sub.DVDrip.Royskatt","uid":4744813,"size":917416260,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8d9e2cc2c5fd62ae6e91610cb4748186c83ed8aa&amp;dn=Ni.Liv.%28aka.Nine.Lives%29.1957.Eng.Nor.Swe.sub.DVDrip.Royskatt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"royskatt","files":9,"time":1235839799,"description":"Genre: War\nAudio: Norwegian\nSubs: English/Swedish (Norwegian for non-hearing)\nIMDB: 8,0\n\n\nSubs (.srt-filer): Svensk/Engelsk + Norsk for hÃƒÂ¸rselshemmede.\n\nFilmen bygger pÃƒÂ¥ faktiske hendelser.\nJan Baalsrud er pÃƒÂ¥ et sabotasjeoppdrag fra England til Norge med 11 andre vinteren 1943, da fiskebÃƒÂ¥ten deres angripes av en tysk patruljebÃƒÂ¥t. Som eneste overlevende lykkes det Baalsrud ÃƒÂ¥ unnslippe og en farefull reise mot nÃƒÂ¸ytrale Sverige begynner. Etter flere uker i snÃƒÂ¸massene i de steile norske fjellene blir han snÃƒÂ¸blind og mÃƒÂ¥ til slutt skjÃƒÂ¦re av seg sine frostskadde tÃƒÂ¦r for ÃƒÂ¥ overleve.\n\nDen mest fremtredende norske filmregissÃƒÂ¸r etter 2. verdenskrig, Arne Skouen, har med denne filmen laget et mesterverk, som bÃƒÂ¥de ble OscarÃ‚Â®-nominert og siden kÃƒÂ¥ret til Norges beste film gjennom tidene. Det vidunderlige norske landskapet danner bakgrunn for den sanne historien om Jan Baalsruds utrolige flukt fra den tyske hÃƒÂ¦r. Jack Fjeldstad (Gull og grÃƒÂ¸nne skoger) spiller Baalsrud med imponerende overbevisning, og ble i 1985 slÃƒÂ¥tt til ridder av St. Olavordenen for sitt fremragende arbeid i norsk filmkunst. \n\n\nThe movie takes place during World War II and depicts the true story of Jan Baalsruds amazing escape from the German army from the coast of Northern Norway and across the border to the neutral country Sweden. Jan Baalsrud is on a sabotage mission from England to Norway together with 11 other soldiers in the winter of 1943 in a fishing boat when they are attacked by a German patrolboat. Jan Baalsrud is the only one who manages to escape and sets off towards Sweden through the enormous amounts of snow and the steep mountains of Norway. The local communities where he passes through help him despite the danger of being arrested and killed. Jan Baalsrud, snowblind and having to cut off his toes because of frost-damage survives alone in the mountains for weeks. The locals are constantly trying to get him over to Sweden, but German patrols and the winter storms delay their departure.\n\n\nRemember: Seeding = Sharing. Seed after downloaded this movie, and you help other to download also! \n\nENJOY","torrent":{"xt":"urn:btih:8d9e2cc2c5fd62ae6e91610cb4748186c83ed8aa","amp;dn":"Ni.Liv.%28aka.Nine.Lives%29.1957.Eng.Nor.Swe.sub.DVDrip.Royskatt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d9e2cc2c5fd62ae6e91610cb4748186c83ed8aa","infoHashBuffer":{"type":"Buffer","data":[141,158,44,194,197,253,98,174,110,145,97,12,180,116,129,134,200,62,216,170]},"announce":[],"urlList":[]}}