{"title":"Fifty Thinkers Who Shaped the Modern World - Stephen Trombley","uid":14550130,"size":2254739,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8db86955fdd10630e2ab5d08354f127a64b45d43&amp;dn=Fifty+Thinkers+Who+Shaped+the+Modern+World+-+Stephen+Trombley&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1462641754,"description":"Fifty Thinkers Who Shaped the Modern World profiles fifty landmark philosophers, scientists, political, social theorists and spiritual leaders whose ideas have defined the age we live in.\r\n\r\nStephen Trombley's Fifty Thinkers Who Shaped the Modern World traces the development of modern thought through a sequence of accessible profiles of the most influential thinkers in every domain of intellectual endeavour since 1789.\r\n\r\nNo major representative of post-Enlightenment thought escapes Trombley's attention: the German idealists Kant, Fichte, Schelling and Hegel; the utilitarians Bentham and Mill; the transcendentalists Emerson and Thoreau; Kierkegaard and the existentialists; founders of new fields of inquiry such as Weber, Durkheim and C.S. Peirce; the analytic philosophers Russell, Moore, Whitehead and Wittgenstein; political leaders from Mohandas K. Gandhi to Adolf Hitler; and - last but not least - the four shapers-in-chief of our modern world: the philosopher, historian and political theorist Karl Marx; the naturalist Charles Darwin, proposer of the theory of evolution; Sigmund Freud, the father of psychoanalysis; and the theoretical physicist Albert Einstein, begetter of the special and general theories of relativity and founder of post-Newtonian physics.\r\n\r\nFifty Thinkers Who Shaped the Modern World offers a crisp analysis of their key ideas, and in some cases a re-evaluation of their importance as we proceed into the 21st century","torrent":{"xt":"urn:btih:8db86955fdd10630e2ab5d08354f127a64b45d43","amp;dn":"Fifty+Thinkers+Who+Shaped+the+Modern+World+-+Stephen+Trombley","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8db86955fdd10630e2ab5d08354f127a64b45d43","infoHashBuffer":{"type":"Buffer","data":[141,184,105,85,253,209,6,48,226,171,93,8,53,79,18,122,100,180,93,67]},"announce":[],"urlList":[]}}