{"title":"Metallica - S&amp;M (1999) WMA320","uid":6176384,"size":342742749,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8e3f8de4ec13c718fc96ecbdac575f025b6a0b72&amp;dn=Metallica+-+S%26M+%281999%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1297785556,"description":"If you've ever considered buying any Metallica album, get this one first. It's essentially a greatest hits collection (which they never have officially released) with two new songs, -Human and No Leaf Clover. This album is simply incredible. The orchestra (conducted by Michael Kamen, who helped Metallica design &quot;Nothing Else Matters&quot;) and the band sound great together; saying anything less than that would be an injustice. Highlights from the album include &quot;The Call of Ktulu&quot;, an instrumental epic ballad based on an old H.P. Lovecraft story (check Amazon's book search on it), which is followed by &quot;Master of Puppets&quot;, another 8+minute classic which is arguably their best stand-alone single ever. Another terrific performance is done on &quot;The Thing That Should Not Be&quot;, another Lovecraft-inspired work that should be listened to in complete darkness. For whatever reason, Metallica left out an entire stanza on this song, which, considering the outstanding lyrics on this one, is quite a shame. &quot;Fuel&quot; is probably the best it's ever been and ever will be (and James knows it); the symphony really rocks here. &quot;Hero of the Day&quot;, one of the band's fewer &quot;slow&quot; songs, also sounds excellent, as do the next two ballads, &quot;Devil's Dance&quot; and &quot;Bleeding Me&quot;. Disc 2 also has its share of hits; &quot;Nothing Else Matters&quot; was just begging to be symphonized, and &quot;For Whom the Bell Tolls&quot; just plain rocks (though I wish they'd kept the bell rings at the beginning which made the song famous). &quot;Wherever I May Roam&quot; sounds brilliant with the symphony, and is probably the best orchestrated piece on the album. &quot;The Outlaw Torn&quot; is another song that is improved dramatically by the symphony. &quot;One&quot; is the pseudo-climax of the album, and done with such emotion that you feel as if you're actually at the concert- a fantastic piece of music, both lyrically and instrumentally. Again, I cannot overemphasize the sheer brilliance of this album. It's a shame that &quot;mainstream&quot; fans and critics can't see past Metallica's often-notorious reputation and witness the band's true genius. It's a great album, in any and all aspects. If you enjoyed this album as much as I did and want to here more of Metallica's work, I suggest the following albums: &quot;Master of Puppets&quot; (often considered its best) to hear the band's early sound; &quot;Metallica&quot; [Black Album](the best-selling) to witness their transition from 80s metal to 90s rock; and &quot;Load&quot; (probably the most maligned one) to see the &quot;final product&quot; Metallica evolved into. Only after listening to these three albums can you really decide for yourself whether they &quot;sold out&quot; or not. &quot;Kill 'em All&quot;, their debut album, may sound too gritty after listening to S&amp;M; you can probably skip &quot;Reload&quot;, since the all the good stuff from that is on S&amp;M; &quot;...And Justice For All&quot; is a well-formulated album that is ill-represented on S&amp;M and deserves more recognition. There are other albums, of course, but I personally wouldn't buy those without sampling the songs first (the quality level fluctuates dramatically). Hopefully, Metallica will do another album like this with a different set list. Can you imagine how great &quot;The Unforgiven&quot;, &quot;Orion&quot;, &quot;...And Justice For All&quot;, or &quot;Harvester of Sorrow&quot; would sound with a symphony? Anyway, that's all. Buy the album - you won't regret it. \n\nby Accolon\n\nTRACKLIST:\nDisc 1:\n01 - The Ecstacy Of Gold.wma                           \n02 - The Call Of Ktulu.wma                             \n03 - Master Of Puppets.wma                             \n04 - Of Wolf And Man.wma                               \n05 - The Thing That Should Not Be.wma                  \n06 - Fuel.wma                                          \n07 - The Memory Remains.wma                            \n08 - No Leaf Clover.wma                                \n09 - Hero Of The Day.wma                               \n10 - Devil's Dance.wma                                 \n11 - Bleeding Me.wma  \n\nDisc 2:\n01 - Nothing Else Matters.wma                          \n02 - Until It Sleeps.wma                               \n03 - For Whom The Bell Tolls.wma                       \n04 - Human.wma                                         \n05 - Wherever I May Roam.wma                           \n06 - Outlaw Torn.wma                                   \n07 - Sad But True.wma                                  \n08 - One.wma                                           \n09 - Enter Sandman.wma                                 \n10 - Battery.wma   \n\nWMA 320Kbps 44100Hz STEREO\n\nMARCELODRGZ","torrent":{"xt":"urn:btih:8e3f8de4ec13c718fc96ecbdac575f025b6a0b72","amp;dn":"Metallica+-+S%26M+%281999%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e3f8de4ec13c718fc96ecbdac575f025b6a0b72","infoHashBuffer":{"type":"Buffer","data":[142,63,141,228,236,19,199,24,252,150,236,189,172,87,95,2,91,106,11,114]},"announce":[],"urlList":[]}}