{"title":"Savatage-Hall of the Mountain King","uid":15562377,"size":38130636,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8edef927c8eba385a3cccd9a73ee4ff5c8feaad2&amp;dn=Savatage-Hall+of+the+Mountain+King&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Tipple2","files":12,"time":1471151007,"description":"Hall of the Mountain King is the fourth studio album by the American heavy metal band Savatage, released in 1987 under the direction of producer Paul O'Neill. It is their first album produced by O'Neill, who was assigned to the band after the tour in support of Fight for the Rock. This album shows the beginning of Savatage's exploration of progressive metal, in their search for new forms of musical expression. Many fans consider this album the original turning point in their musical identity, distinguishing between the old and new Savatage. It is not a concept album, but it has a constant tone (of darkness, in this case) and is more complex than their previous albums, with two entirely instrumental tracks that go beyond simple guitar riffs and solos, namely &quot;Prelude to Madness&quot; and &quot;Last Dawn&quot;. Through Paul O'Neill's connections, he brought in Ray Gillen of Badlands fame (credited as Ray Gillian) to perform a vocal duet at the end of &quot;Strange Wings&quot;\r\n\r\nThis was the first album to feature the album cover drawn by artist Gary Smith, who was responsible for lead guitarist Criss Oliva's airbrushed guitars at the time. Hall of the Mountain King reached position No. 116 in the US Billboard 200 albums chart.\r\n\r\nOn October 17, 1993, at around 3:30 a.m., Criss and his wife Dawn were driving north on Highway 301 on his way to the Fourth Annual Livestock Festival held in Zephyrhills, Florida, just north of Tampa. An oncoming car operated by a drunk driver crossed the median and struck Criss's 1982 Mazda RX-7 head-on, killing him instantly. The drunk driver, who had seven prior drunk driving (DUI) convictions, survived with minor injuries and was later found guilty of DUI manslaughter, DUI serious injury and vehicular homicide, and served 18 months in prison of a five-year sentence.\r\n\r\n&quot;Criss could play anything you could imagine. He could work a solo around a vocal without stepping on it, and he was one of the few guitarists who knew how to convey the emotion of the human voice with a guitar. He was a combination of the angst of Duane Allman on &quot;Layla,’ the excitement of Jimmy Page, the emotion of Eric Clapton, the raw feel of Joe Perry and the dexterity of Eddie Van Halen or Allan Holdsworth.&quot;\r\n—Paul O'Neill, Savatage producer\r\n\r\nThe thrash metal band Overkill wrote a song named &quot;R.I.P. (Undone)&quot; on their 1994 album W.F.O. that pays tribute to Criss Oliva.\r\n\r\nTrack List\r\n\r\n1. \t&quot;24 Hours Ago&quot;   \t\r\n2. \t&quot;Beyond the Doors of the Dark&quot;   \t\r\n3. \t&quot;Legions&quot;   \t\r\n4. \t&quot;Strange Wings&quot;   \t \t\r\n5. \t&quot;Prelude to Madness&quot; (Instrumental) \r\n6. \t&quot;Hall of the Mountain King&quot;   \t\r\n7. \t&quot;The Price You Pay&quot;   \r\n8. \t&quot;White Witch&quot; \r\n9. \t&quot;Last Dawn&quot; (Instrumental) \t\r\n10. \t&quot;Devastation&quot;","torrent":{"xt":"urn:btih:8edef927c8eba385a3cccd9a73ee4ff5c8feaad2","amp;dn":"Savatage-Hall+of+the+Mountain+King","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8edef927c8eba385a3cccd9a73ee4ff5c8feaad2","infoHashBuffer":{"type":"Buffer","data":[142,222,249,39,200,235,163,133,163,204,205,154,115,238,79,245,200,254,170,210]},"announce":[],"urlList":[]}}