{"title":"Lightnin Hopkins His Life and The Blues(epub)[rogercc]","uid":6978936,"size":1934304,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8f175341a8185bc8edf30404d5189fb36edfb72d&amp;dn=Lightnin+Hopkins+His+Life+and+The+Blues%28epub%29%5Brogercc%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rogercc1","files":1,"time":1327337508,"description":"Lightnin' Hopkins: His Life and Blues\nAuthor: Alan Govenar\nPublisher: Chicago Review Press (May 1, 2010) \nLanguage: English \nISBN-10: 1556529627 \nISBN-13: 978-1556529627\nPages: 352\nFormat: epub\n\nLightnin' Hopkins may have been the greatest Texas blues star of the 1960s era, but he didn't make it easy for anyone to tell the story of his life. Biographer Alan Govenar, who chronicles the guitarist's personal history in a new biography, Lightnin' Hopkins: His Life and Blues, admits up front that the bluesman's early years are filled with &quot;large blank spots&quot; and that even the most basic facts are open to dispute.\nGovenar documents the birth of a Sam Hopkins in Hopkins County, Texas, on March 15, 1911, but can't say for sure whether this is our future blues star - and the details hardly get clearer when Govenar arrives at later periods in the artist's life. Hopkins didn't help matters, offering conflicting stories to various parties, and rarely letting the truth get in the way of a good tale. Even his longtime &quot;marriage&quot; to &quot;Mrs. Hopkins&quot; (Antoinette Charles) is a puzzle. Yes, she does seem to have been married, but not necessarily to Lightnin' Hopkins.\nGovenar persists through this maze and succeeds in offering the most compelling and coherent account of this blues star yet published. This author, who has written extensively on Texas blues, is the perfect person to unravel the tangled threads here. He has tracked down Hopkins' boyhood buddies, family members, record producers and others to fill in the blanks and flesh out a fascinating story.\nHopkins' father was shot during a card game dispute - over a nickel - when the boy was 3. The only future that beckoned was farming cotton and corn, or constant brushes with the law. Hopkins served in a chain gang for a spell and years later would show the resulting scars on his ankles to those who cared to see. He taught himself to sing and play guitar and parlayed these skills into a career that took him far beyond the confines of rural Texas life.\nHopkins brought echoes of that upbringing with him, and that was the reason for much of his music's appeal. Govenar is especially good at navigating through Hopkins' performances and recordings. The latter are numerous and scattered among dozens of labels - Hopkins paid little attention to contracts and would usually make a record for anyone who paid him $100 per song. Many sound as though the guitarist made up the words as he went along. This skill in creating spontaneous blues on almost any topic may have been Hopkins' greatest talent.\n&quot;A bluesman is just different from any other man that walks this earth,&quot; was Hopkins' own description of what made him special. His audience would eventually cut across generations and demographics to a degree that even stunned Hopkins himself. He developed an ardent following among working-class African-Americans for his early recordings and performances. In time, rock-'n'-rollers, college students, hippies and other parties from all parts of the world flocked to his door.\nGovenar clearly is inspired by Hopkins' legacy and is a sympathetic biographer. He's also a skeptical one, as is necessary for anyone trying to unlock the mystery of Lightnin' Hopkins. Hopkins worked hard to craft his image. Everything from the flashy clothing to the oversize sunglasses were part of the intended effect. Govenar takes nothing at face value and, to his credit, never gets caught up in hero worship.\nMany gaps remain in our understanding of Hopkins. Much may never be explained, from the reasons for his incarcerations to the stories behind many songs. Yet Govenar has given us a more complete picture than we have ever had before and, for the time being, his book is the definitive guide to this iconic blues artist.\n\n","torrent":{"xt":"urn:btih:8f175341a8185bc8edf30404d5189fb36edfb72d","amp;dn":"Lightnin+Hopkins+His+Life+and+The+Blues%28epub%29%5Brogercc%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f175341a8185bc8edf30404d5189fb36edfb72d","infoHashBuffer":{"type":"Buffer","data":[143,23,83,65,168,24,91,200,237,243,4,4,213,24,159,179,110,223,183,45]},"announce":[],"urlList":[]}}