{"title":"The Ballad Of Cable Hogue 1970 Dvdrip Xvid","uid":6322303,"size":733861888,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8f1de0647f73aef51e206c0bbbe59fb468226023&amp;dn=The+Ballad+Of+Cable+Hogue+1970+Dvdrip+Xvid&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"sumguygreg","files":1,"time":1302977100,"description":"The Ballad of Cable Hogue is a 1970 motion picture directed by Sam Peckinpah and starring Jason Robards, Stella Stevens and David Warner.\nSet in the desert of Arizona during the transitional period when the frontier was closing, the movie follows three years in the life of Cable Hogue, a failed prospector. While unmistakably a Western, the movie is quite unconventional for the genre and for the director. It contains only a few brief scenes of violence and gunplay, relying more on a subtly crafted story that could better be characterized as comedic in nature.\n\nFor serious students of film, this movie is one of the great unknown gems that the rest of the world had forgotten about. Owing largely to studio politics revolving around Sam Peckinpah, the studio failed to promote the movie at the time, and almost nobody went to see it. Many film historians believe that with adequate studio support, it would have garnered at least a Best Actress nod for Stella Stevens.\n","torrent":{"xt":"urn:btih:8f1de0647f73aef51e206c0bbbe59fb468226023","amp;dn":"The+Ballad+Of+Cable+Hogue+1970+Dvdrip+Xvid","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f1de0647f73aef51e206c0bbbe59fb468226023","infoHashBuffer":{"type":"Buffer","data":[143,29,224,100,127,115,174,245,30,32,108,11,187,229,159,180,104,34,96,35]},"announce":[],"urlList":[]}}