{"title":"Opera 101:  A Complete Guide to Learning and Loving Opera","uid":9861480,"size":1051941265,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:8f37ed7285b3169f300ea8e8acc93575cfa71123&amp;dn=Opera+101%3A++A+Complete+Guide+to+Learning+and+Loving+Opera&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Robin1966","files":106,"time":1396305816,"description":"Audio Books : Educational : MP3/Variable : English\n\nOpera 101: A Complete Guide to Learning and Loving Opera (Audiobook) By Fred Plotkin, read by the author\nUnabridged edition 2006 | 18 hours and 15 mins | ISBN: n/a , ASIN: B002SQ4VDG | MP3 128 kbps | 970 MB\n\n\n\nOpera is the fastest growing of all the performing arts, attracting audiences of all ages who are enthralled by the gorgeous music, vivid drama, and magnificent production values. If you've decided that the time has finally come to learn about opera and discover for yourself what it is about opera that sends your normally reserved friends into states of ecstatic abandon, this is the book for you.\n\nOpera 101 is recognized as the standard text in English for anyone who wants to become an opera lover. It is a clear, friendly, and truly complete handbook for learning how to listen to opera, whether on the radio, on recordings, or live at the opera house. Fred Plotkin, an internationally respected writer and teacher about opera, who for many years was performance manager of the Metropolitan Opera, introduces listeners, whatever their level of musical knowledge, to all the elements that make up opera.\n\nThe major part of Opera 101 is devoted to an almost minute-by-minute analysis of 11 key operas, ranging from Verdi's thunderous masterpiece Rigoletto and Puccini's electrifying Tosca to works by Mozart, Donizetti, Rossini, Offenbach, Tchaikovsky, and Wagner, and to the psychological complexities of Richard Strauss's Elektra. Once you have completed Opera 101, you will be prepared to see and hear any opera you encounter, thanks to this book's unprecedented detail and enjoyable method of revealing the riches of opera.\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:8f37ed7285b3169f300ea8e8acc93575cfa71123","amp;dn":"Opera+101%3A++A+Complete+Guide+to+Learning+and+Loving+Opera","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f37ed7285b3169f300ea8e8acc93575cfa71123","infoHashBuffer":{"type":"Buffer","data":[143,55,237,114,133,179,22,159,48,14,168,232,172,201,53,117,207,167,17,35]},"announce":[],"urlList":[]}}