{"title":"Ardour Linux 64bit 3.5.380-dbg","uid":10651251,"size":122863367,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:8f3df9a49b41a2a91caa4161705e6204504927d6&amp;dn=Ardour+Linux+64bit+3.5.380-dbg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"aps2201","files":-1,"time":1406616897,"description":"Ardour 3.5.380 released\n\nMay 13th, 2014\n\nArdour 3.5.380 is (another) CRITICAL bug fix release. ALL USERS ARE RECOMMENDED TO UPGRADE. Additionally, ALL LINUX DISTRIBUTIONS SHOULD IMMEDIATELY UPGRADE/UPDATE TO THIS RELEASE. Distributing earlier versions of 3.5 at this point is irresponsible and risks our users' data.\n\nThis release includes several absolutely vital fixes for bugs could lead to audio and MIDI files being irreversibly deleted from disk. We do not know precisely how these losses happened - no user ever found a reliable recipe to recreate all of them - but reports from several different users did lead to a careful code review which uncovered some potential for file loss. One very repeatable loss of a MIDI file after unlinking a copy of a MIDI region was very definitely fixed.\n\nThere are a few other minor fixes and improvements described below.\n\nAs usual you can download it from the usual place, and as usual subscribers get this update without cost. Thanks to everyone for their support (and encouragement).\n\nOnce again, the OS X release situation has still not improved, though a demo 64 bit copy of this version is available (fully featured except that is has does no saving or restoring of plugin settings, and no plugin presets).\nAdditions &amp; Changes\n\n    do not crash when considering whether a directory called &quot;midi&quot; or &quot;mid&quot; might be a MIDI file\n    Clarify Audio/Video import options\n    Fix black-frame generation when exporting video\n    Add option to display the mixer in fullscreen\n    Generic MIDI control now correctly handles log-scaled parameters (fixes #5890)\n    Fix -d (disable all plugins) argument\n    Remove all explicit use of the gio library\n\nDevelopers\n\nRobin Gareus, Paul Davis, Adrian Knoth\n","torrent":{"xt":"urn:btih:8f3df9a49b41a2a91caa4161705e6204504927d6","amp;dn":"Ardour+Linux+64bit+3.5.380-dbg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f3df9a49b41a2a91caa4161705e6204504927d6","infoHashBuffer":{"type":"Buffer","data":[143,61,249,164,155,65,162,169,28,170,65,97,112,94,98,4,80,73,39,214]},"announce":[],"urlList":[]}}