{"title":"PJ Harvey 24 Bit Vinyl Pack","uid":8829303,"size":5060636389,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8f6d06016055b85b7b6d345414bffdc5b57640ee&amp;dn=PJ+Harvey+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"politux","files":-1,"time":1376923887,"description":"\n  PJ Harvey 24 Bit Vinyl Pack\n\n  Genre: Pop/Rock\n  Styles: Alternative, Indie Rock, Singer/Songwriter\n  Source: vinyl\n  Codec: FLAC\n  Bit Rates: ~ 2,600 - 3,100 kbps\n  Bit Depth: 24\n  Sampling Rate: 96,000 Hz\n\n  1992 Dry\n  1993 Rid of Me\n  1998 Is This Desire\n  2006 The Peel Sessions 1991-2004\n  2007 White Chalk\n  2011 Let England Shake\n\n  During the early-'90s alternative rock explosion, several female singer/songwriters rose to prominence, but few were as distinctive or as widely praised as Polly Jean Harvey. Over the course of three albums, Harvey established herself as one of the most individual and influential songwriters of the '90s, exploring themes of sex, love, and religion with unnerving honesty, dark humor, and a twisted theatricality. At the outset of her career, she led the trio PJ Harvey, which delivered her stark songs with bruisingly powerful, punkish abandon, as typified by the 1992 debut effort Dry. Following the noisy, uncompromising follow-up, Rid of Me, the trio fell apart, and PJ Harvey became the sole property of Polly Harvey. Her next record, 1995's To Bring You My Love, became her mainstream critical breakthrough, confirming her status as one of the cornerstone figures of '90s alternative rock.\n\n  Harvey grew up on a sheep farm in Yeovil, England, where she was raised by her quarryman father and her artist mother. As a child, she learned how to play guitar and saxophone, and when she was a teenager, she played in a variety of bands as a sideman. She formed PJ Harvey in 1991 with bassist Steve Vaughan and drummer Robert Ellis, and the trio recorded its debut record for under $5,000. The band signed with the British indie label Too Pure and released &quot;Dress&quot; that fall. &quot;Dress&quot; became a indie rock sensation, as did its follow-up, &quot;Sheela-Na-Gig,&quot; with both singles receiving lavish praise in the U.K. music press. Although Harvey was a reluctant interviewee, she cannily used the press to her advantage, whether it was through her candid interviews or startling, occasionally disturbingly sexy photo sessions, which subverted traditional concepts of female sexuality.\n\n  PJ Harvey's debut, Dry, was released in spring 1992 to considerable praise; it was distributed in America by Island Records. The trio followed it with an extensive tour, culminating with an appearance at that summer's Reading Festival. Shortly after the tour, Harvey moved to London, where she nearly suffered a nervous breakdown due to the extraordinary pressure and expectation surrounding her second album. The group hired former Big Black frontman Steve Albini (Pixies, Breeders) as the producer of their second album, Rid of Me. Albini imposed his trademark noisy, guitar-heavy sound on the record, which mirrored its harder-edged themes. Rid of Me was a major critical success and expanded Harvey's cult greatly. She supported the album with a tour featuring herself in a fake leopard-skin coat and a feather boa, signaling her developing interest in theatricality. At the end of the year, Harvey released 4-Track Demos, a collection of her original versions of the songs on Rid of Me.\n\n  Following the Rid of Me tour, Ellis and Vaughan parted ways with Harvey, and she recorded her third album as a solo artist, augmented by producer Flood, bassist Mick Harvey, and guitarists John Parish and Joe Gore. Harvey developed a richer, bluesier sound with the expanded band, and the resulting record, To Bring You My Love, was hailed as a masterpiece by many critics upon its February 1995 release. Thanks to considerable press attention, as well as strong support from MTV and modern rock radio for the single &quot;Down by the Water,&quot; To Bring You My Love became a moderate hit, entering the U.S. charts at number 40. Harvey spent all of 1995 touring the album, and spent the following year in relative seclusion. During 1996 she was relatively quiet, only appearing twice on record: once in a duet with Nick Cave on his Murder Ballads album -- the pair were reportedly romantically involved -- and later on Dance Hall at Louse Point, a collaborative album that found her teaming up with John Parish. Is This Desire? followed in 1998. Two years later, Harvey reunited with Ellis and Mick Harvey for Stories From the City, Stories From the Sea, which returned to her earlier, more aggressive style and was inspired by her six-month stay in New York City in 1999.\n\n  The album won the 2001 Mercury Prize, making Harvey the first female winner of that award. After extensive touring in support of the album, Harvey split her time over the next two years working on new material and collaborating with likeminded friends and contemporaries. She appeared on Gordon Gano's Hitting the Ground, Giant Sand's Cover Magazine, and John Parish's How Animals Move, but Harvey's most prominent collaboration was with the Queens of the Stone Age side project the Desert Sessions. She performed on more than half of 2003's Desert Sessions, Vols. 9-10, including the single Crawl Home. That summer, she also performed at the V Festival, previewing tracks from her new album, which she claimed was close to being finished. The album, Uh Huh Her, appeared in summer 2004, coinciding with another string of tour dates, including British and European festival appearances at Glastonbury, T in the Park, the Montreux Jazz Festival, and Spain's La Primavera festival. Stateside, Harvey was scheduled to join the revived Lollapalooza festival for select dates, joining Morrissey and Sonic Youth on the main stage. Upon the cancellation of that festival, however, she mounted a solo tour of the States with select opening acts. Three years later the ever-evolving musician released White Chalk, her first piano-based album. She then resumed her partnership with John Parish for another collaborative project, A Woman a Man Walked By, which arrived in 2009. For 2011's Let England Shake, Harvey took a more political and less personal approach to her songwriting, drawing on current events to add a fresh approach to her work with Parish and Mick Harvey.","torrent":{"xt":"urn:btih:8f6d06016055b85b7b6d345414bffdc5b57640ee","amp;dn":"PJ+Harvey+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f6d06016055b85b7b6d345414bffdc5b57640ee","infoHashBuffer":{"type":"Buffer","data":[143,109,6,1,96,85,184,91,123,109,52,84,20,191,253,197,181,118,64,238]},"announce":[],"urlList":[]}}