{"title":"The Accidental Prime Minister by Sanjaya Baru; the making and un","uid":9957247,"size":934239,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8fcddec68f81b2151ac83041db646cdc821960f5&amp;dn=The+Accidental+Prime+Minister+by+Sanjaya+Baru%3B+the+making+and+un&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ebookdentist","files":2,"time":1397464577,"description":"In 2004 Sanjaya Baru left a successful career as chief editor of the Financial Express to join Prime Minister Manmohan Singh as his media adviser in UPA 1. Singh offered him the job with the words, 'Sitting here, I know I will be isolated from the outside world. I want you to be my eyes and ears. Tell me what you think I should know, without fear or favor.\n\nThe Accidental Prime Minister is Baru's account of what it was like to 'manage' public opinion for Singh while giving us a riveting look at Indian politics as it happened behind the scenes. As Singh's spin doctor and trusted aide for four years, Baru observed up close Singh's often troubled relations with his ministers, his cautious equation with Sonia Gandhi and how he handled the big crises from managing the Left to pushing through the nuclear deal. In this book he tells all and draws for the first time a revelatory picture of what it was like for Singh to work in a government that had two centers of power.\n\nInsightful, acute and packed with political gossip, The Accidental Prime Minister is one of the great insider accounts of Indian political life and a superb portrait of the Manmohan Singh era.\n\nBook name: The Accidental Prime minister: Making and Unmaking of Manmohan Singh\nAuthor: Sanjaya Baru\nPages: 320\nFormats: epub and mobi\n\nUploaded as a back-up for own use.\n","torrent":{"xt":"urn:btih:8fcddec68f81b2151ac83041db646cdc821960f5","amp;dn":"The+Accidental+Prime+Minister+by+Sanjaya+Baru%3B+the+making+and+un","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8fcddec68f81b2151ac83041db646cdc821960f5","infoHashBuffer":{"type":"Buffer","data":[143,205,222,198,143,129,178,21,26,200,48,65,219,100,108,220,130,25,96,245]},"announce":[],"urlList":[]}}