{"title":"[Edward Cox]The Relic Guild(azw, epub, lrf, mobi){Zzzzz}","uid":11192186,"size":4079165,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8ffd14567aad4db0486a8d41608a4a0b778fc6e4&amp;dn=%5BEdward+Cox%5DThe+Relic+Guild%28azw%2C+epub%2C+lrf%2C+mobi%29%7BZzzzz%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zombie_rox","files":5,"time":1413013176,"description":"Magic caused the war. Magic is forbidden. Magic will save us. It was said the Labyrinth had once been the great meeting place, a sprawling city at the heart of an endless maze where a million humans hosted the Houses of the Aelfir. The Aelfir who had brought trade and riches, and a future full of promise. But when the Thaumaturgists, overlords of human and Aelfir alike, went to war, everything was ruined and the Labyrinth became an abandoned forbidden zone, where humans were trapped behind boundary walls 100 feet high. Now the Aelfir are a distant memory and the Thaumaturgists have faded into myth. Young Clara struggles to survive in a dangerous and dysfunctional city, where eyes are keen, nights are long, and the use of magic is punishable by death. She hides in the shadows, fearful that someone will discover she is touched by magic. She knows her days are numbered. But when a strange man named Fabian Moor returns to the Labyrinth, Clara learns that magic serves a higher purpose and that some myths are much more deadly in the flesh. The only people Clara can trust are the Relic Guild, a secret band of magickers sworn to protect the Labyrinth. But the Relic Guild are now too few. To truly defeat their old nemesis Moor, mightier help will be required. To save the Labyrinth - and the lives of one million humans - Clara and the Relic Guild must find a way to contact the worlds beyond their walls.\n\nProduct Description\nAbout the Author\nEdward Cox began writing stories at school as a way to pass time in boring lessons. With his first short story published in 2000, Edward spent much of the next decade earning a BA first class with honours in creative writing, and a Master degree in the same subject. He then went on to teach creative writing at the University of Bedfordshire. Currently living in Essex with his wife and daughter, Edward is mostly surrounded by fine greenery and spiders the size of his hand. THE RELIC GUILD is his first completed novel, and it is the result of more than ten years of obsessive writing. \n\nPublisher: Gollancz (18 September 2014)\nLanguage: English\nISBN-10: 1473200296\nISBN-13: 978-1473200296","torrent":{"xt":"urn:btih:8ffd14567aad4db0486a8d41608a4a0b778fc6e4","amp;dn":"%5BEdward+Cox%5DThe+Relic+Guild%28azw%2C+epub%2C+lrf%2C+mobi%29%7BZzzzz%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ffd14567aad4db0486a8d41608a4a0b778fc6e4","infoHashBuffer":{"type":"Buffer","data":[143,253,20,86,122,173,77,176,72,106,141,65,96,138,74,11,119,143,198,228]},"announce":[],"urlList":[]}}