{"title":"Kasey_Chambers-The_Captain-CD-FLAC-1999-flacme","uid":9258634,"size":304236539,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:90da16db1f4aa1dbe6d7fcedbf4e950d94c9c100&amp;dn=Kasey_Chambers-The_Captain-CD-FLAC-1999-flacme&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":-1,"time":1385596713,"description":"In &quot;Southern Kind of Life,&quot; a song on her debut album, The Captain, Kasey Chambers convincingly describes a rural Southern upbringing -- poverty stricken and Bible dominated -- and since she performs in a style associated with the Appalachians as developed into commercial country music, it's easy to assume she's singing about the American South. But she isn't; she's singing about the Nullarbor Plain in south-central Australia, where she grew up, apparently listening to a lot of country records. The result is a style that will remind some listeners of Dolly Parton and others of Lucinda Williams, as Chambers, backed by her father and produced by her brother, both of them members of the family's Dead Ringer Band, sings in a breathy voice that breaks expressively. Her tunes tend to be either &quot;I am&quot; songs of self-description like &quot;Southern Kind of Life&quot; and &quot;Cry Like a Baby,&quot; accounts of romantic difficulties, or celebrations of life on the road. Though she has a gift for wordplay that favors internal rhyme, her imagery can be trite (&quot;You got the car and I got the break&quot;), and her compositions are less interesting in themselves than in the performances she gives them. Like many young artists, she is still a compendium of her influences rather than a distinct figure unto herself, but The Captain is a sincere effort steeped in the kind of country/folk/rock style that made Lucinda Williams a critical success in the late '90s, and it is likely to attract similar attention.\n\n Tracklist\n\nCry Like A Baby \t4:00 \t\nThe Captain \t4:32 \t\nThis Flower \t2:50 \t\nYou Got The Car \t4:05 \t\nThese Pines \t4:04 \t\nDon't Talk Back \t4:48 \t\nSouthern Kind Of Life \t4:01 \t\nMr. Baylis \t3:46 \t\nThe Hard Way \t2:55 \t\nLast Hard Bible \t2:23 \t\nDon't Go \t3:01 \t\nWe're All Gonna Die Someday \t2:09 \t","torrent":{"xt":"urn:btih:90da16db1f4aa1dbe6d7fcedbf4e950d94c9c100","amp;dn":"Kasey_Chambers-The_Captain-CD-FLAC-1999-flacme","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90da16db1f4aa1dbe6d7fcedbf4e950d94c9c100","infoHashBuffer":{"type":"Buffer","data":[144,218,22,219,31,74,161,219,230,215,252,237,191,78,149,13,148,201,193,0]},"announce":[],"urlList":[]}}