{"title":"The C.I.A. Doctors Human Rights Violations by American Psychiatr","uid":10798214,"size":8103484,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:911564ef31be2e693f2eace20b0a759d62e79da4&amp;dn=The+C.I.A.+Doctors+Human+Rights+Violations+by+American+Psychiatr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"gard0802","files":1,"time":1408313899,"description":"The C.I.A. Doctors, (Manitou Communications, 2006), uncovers the truth about violations of human rights by American Psychiatrists in the twentieth century. Documents obtained through the Freedom of Information Act and cross-referenced research published in leading medical journals expose the existence of mind altering experiments on unwitting human subjects, paid for by the U.S. government, the U.S. Military and the C.I.A. These experiments which inlcude LSD experiments, sensory deprivation, electroconvulsive treatment, brain electrode implants, radiation experiments and prostitution rings were perpetrated not by a few renegage doctors but by leading psychiatrists, psychologists, neurosurgeons, universities, medical schools and maximum security prisons on American soil. Dr. Ross takes you on a mind-blowing fact finding adventure into the secret world of espionage and Manchurian Candidates. Given our situations in Guantanamo and Abu Graib the only question left unanswered is what are the U.S. Government, psychiatrists and medical schools doing today? The C.I.A. Doctors was originally published as BLUEBIRD: Deliberate Creation of Multiple Personality by Psychiatrists in 2000.","torrent":{"xt":"urn:btih:911564ef31be2e693f2eace20b0a759d62e79da4","amp;dn":"The+C.I.A.+Doctors+Human+Rights+Violations+by+American+Psychiatr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"911564ef31be2e693f2eace20b0a759d62e79da4","infoHashBuffer":{"type":"Buffer","data":[145,21,100,239,49,190,46,105,63,46,172,226,11,10,117,157,98,231,157,164]},"announce":[],"urlList":[]}}