{"title":"G.S. Jennsen - Dissonance (Aurora Renegades #2)","uid":14672520,"size":153247616,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:91befd7b3be2bcf1265589c30df2d6ffe1d587fd&amp;dn=G.S.+Jennsen+-+Dissonance+%28Aurora+Renegades+%232%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Cybotage","files":1,"time":1463886825,"description":"G.S. Jennsen - Dissonance (Aurora Renegades #2) (Aurora Rhapsody #5)\r\n\r\n\r\n\r\n\r\n&quot;Know this: you need not be afraid. They own the fear. They fear us because they believe we are powerful, and they are correct to do so.&quot;\r\n\r\nThe technology behind Project Noetica is on the loose. Prevos - individuals and AIs sharing a single body - are spreading across the galaxy. Now two opposing but inexorably related forces, the Order of the True Sentients and the Zelones cartel, led by Olivia Montegreu, threaten to plunge the galaxy into chaos.\r\n\r\nOTS believes Prevos are monsters who endanger humanity, and it intends to destroy them by any means necessary. Underworld despot Olivia Montegreu, now a radically enhanced Prevo, is its doomsday warnings made flesh.\r\n\r\nAs society splinters from within and the Earth Alliance falls to reactionaries, a formidable new player emerges on the galactic stage, one not afraid to do whatever it takes to protect all sentient life - human, artificial and Prevo.\r\n\r\nThe Metigen surged forward to engulf her in light. I see you, Alexis Solovy.\r\n\r\nA galactic playground where the Metigens harness the elemental forces of space to destroy entire star systems. An alien species those same Metigens shelter from a terrifying enemy. Alex and Caleb's exploration of the portal network reveals profound mysteries, but each one leads to more questions.\r\n\r\nKillers and saviors. Deceivers and protectors. Destroyers and creators. Could the Metigens truly be all these things? The search for answers leads Alex and Caleb to the most shocking revelation of all - the true face of the enemy.\r\n\r\nIt is a time of accelerating technological change and shifting allegiances as the old rules fall away and the old balance of power is upended. A new world rises - one of unshackled AIs, indestructible starships, ethereal quantum spaces and potent new weapons - and the race is on to determine who will control its future. \r\n\r\n\r\n\r\n\r\n\r\nNarrator: Pyper Down\r\nLength: 10 hrs and 35 mins \r\nFormat: M4A\r\nBitrate: 32 Kbps\r\nUnabridged Audiobook\r\nRelease Date:05-16-16\r\nPublisher: Hypernova Publishing","torrent":{"xt":"urn:btih:91befd7b3be2bcf1265589c30df2d6ffe1d587fd","amp;dn":"G.S.+Jennsen+-+Dissonance+%28Aurora+Renegades+%232%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91befd7b3be2bcf1265589c30df2d6ffe1d587fd","infoHashBuffer":{"type":"Buffer","data":[145,190,253,123,59,226,188,241,38,85,137,195,13,242,214,255,225,213,135,253]},"announce":[],"urlList":[]}}