{"title":"(CoLoMbO ElEcTrOnIc) Meg - Psychodelice 2008 (320k)","uid":4173687,"size":120760833,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:91d738f2b2f076cfb35a2e2a9a7dc0dc265bd507&amp;dn=%28CoLoMbO+ElEcTrOnIc%29+Meg+-+Psychodelice+2008+%28320k%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"vinonovello85","files":15,"time":1210009277,"description":"Title: Meg - Psychodelice\nYear: 2008\nGenre: electronic\nMp3 Bitrate: 320kbps\nCovers: front/back/cd\n------------------------------------------------------------------------------------------------------\nLa Meg che, con il suo debutto discografico aveva incantato pubblico e critica, torna ora con un album altrettanto sorprendente; ma se il precedente lavoro era l&amp;#039;intensa espressione di una dolcezza penetrante e soffusa, questo nuovo manifesta tematiche assolutamente rinnovate.\nDelegando a brani come &quot;Succhio luce&quot; ed &quot;E&amp;#039; troppo facile&quot; il ruolo di rappresentare un ideale trait d&amp;#039;union con il passato, &quot;Psychodelice&quot; esplora, infatti, atmosfere pop, dance ed elettroniche proponendo un lato di Meg assolutamente inedito.\nMa, inedito non ÃƒÂ¨ certo il talento dell&amp;#039;artista napoletana che, quindi, dimostra di trovarsi completamente a suo agio anche in questi scenari sonori riuscendo ad imbastire intensitÃƒ  e suggestione anche nelle nuove canzoni.\n&quot;Impossibile trasmissione&quot;, &quot;Napoli cittÃƒ  aperta&quot; e &quot;Distante&quot; (autentico capolavoro) sono, appunto, episodi davvero sontuosi (ed a tratti sorprendenti) che, grazie anche alle sapienti manipolazioni di Stefano Fontana (alias Stylophonic) hanno un respiro talmente cosmopolita da essere plausibili anche per molti dancefloor internazionali.\nIl tutto, poi, guarnito da splendide liriche (spesso intimiste o legate ad inquietudine interiore) e da un raffinato alternarsi tra melodia e ritmo: elementi che rimarcano fortemente lo spessore espressivo ed il lavoro di ricerca che stanno alla base di questo disco. Di questo, bellissimo disco: ulteriore testimonianza del cristallino talento di Meg. (tratto da rockit.it)\n-------------------------------------------------------------------------------------------------\n\nMeg (Maria Di Donna) was born in Napoli, in a family where music is an important part of the emotional and sentimental education. Her parents listen to any kind of music, and this thing, together with the study of the pianoforte since she was a child, will inevitably influence her following artistic production. In 1994 , during the national occupation of italian universities and students demonstrations, she joins the band 99 Posse. This is a real tourningpoint for her and for the band&amp;#039;s life. So she takes part in the writing of four among the most fundamental albums of the italian avantguard music panorama ( &quot;Cerco tiempo&quot;, &quot;Corto Circuito&quot;, &quot;La vida que vendrÃƒ &quot;, &quot;NA_99_10&quot; ). Embracing with non-chalanche the underground music moviment and the top charts at the same time. In 2001 she works with Marco Messina on the soundtrack for the theatre show of Krypton&amp;#039;s experimental company &quot;Dentro la tempesta&quot;, based on &quot;The tempest&quot; by William Shakespeare. The duo was called Nous. They play live the soundtrack during the shows and Meg performes in the play the role of Ariel. In 2002 the cd by Nous &quot;La Tempesta&quot; was published. Throughout the years, many are the collaborations with various musicians, such as Subsonica, Tiro Mancino, Roy Paci, Pino Daniele, Speaker Cenzou, Retina.it, Technophonic Chamber Orchestra. In 2004 she gives birth to her first solo homonym album, &quot;Meg&quot;. Here, she has fun in composing, writing and playing and programming, creating her own audioworld, exploring all the deep emotional parts of herself , in a fresh, experimental, &quot;multiformis&quot; way. New collaborations in 2006: with ZU, Gnu Quartet and Katia Labeque. Today, 2007, she has just finished her new album co-produced with Stefano Fontana - a.k.a Stylophonic - out after summer!\n------------------------------------------------------------------------------------------------\nplease seed and enjoy us @ colombo.bt","torrent":{"xt":"urn:btih:91d738f2b2f076cfb35a2e2a9a7dc0dc265bd507","amp;dn":"%28CoLoMbO+ElEcTrOnIc%29+Meg+-+Psychodelice+2008+%28320k%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91d738f2b2f076cfb35a2e2a9a7dc0dc265bd507","infoHashBuffer":{"type":"Buffer","data":[145,215,56,242,178,240,118,207,179,90,46,42,154,125,192,220,38,91,213,7]},"announce":[],"urlList":[]}}