{"title":"Magic School Bus Lands on Mars","uid":6881401,"size":400680960,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:91f6c5f3093d9d0eaee689d04c0fff2fa4296faa&amp;dn=Magic+School+Bus+Lands+on+Mars&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"katnap","files":-1,"time":1323676928,"description":"1st-5th Grade Software for Mac &amp; PC (C)2000.\n\nFrom Amazon: Ms. Frizzle missed her calling: she should work for NASA. From engaging games to fascinating facts to stunning photographic images from Mars, this interplanetary adventure doesn\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\'t miss a single detail. As the bus adeptly dodges satellites while it screams away from the Sun, it\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\'s obvious that this will be anything but a normal field trip with Ms. Frizzle and the gang.\n\nOnce the Magic School Bus settles, kids can play inside or venture onto the surface of Mars. Both areas are cluttered with gizmos that yield either a game, an experiment, or a compelling fact. (Did you know that Mars\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\'s moons are named for the Greek words meaning fear and panic? We didn\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\'t.) There\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\'s a lot to learn here: kids can put objects like watermelons and marshmallows into the Pressure-O-Meter to see what happens to them in the atmosphere, or try to land a module on Mars while coping with fuel loss and Martian gravity. There\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\'s even a rover-building station that hones deductive skills as kids decide whether a solar panel or a battery will work best to power their vehicle during the Martian night.\n\nAttention to detail is what launches Magic School Bus Lands on Mars into the rarefied atmosphere of educational CD-ROMs that entertain as well as they teach; new players can enter how old they are on Earth and learn their Martian age, then later play Mind over Mars, a robot-hosted game show that dishes up tough Mars-related trivia questions and--better yet--elaborates on the answers.\n\nAs Ms. Frizzle zips about Mars\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\'s surface in her jetpack, we can\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\'t help but wish NASA would recruit the Friz to get all of us excited about space exploration again. The woman has the right stuff. (For ages 6 to 10.)","torrent":{"xt":"urn:btih:91f6c5f3093d9d0eaee689d04c0fff2fa4296faa","amp;dn":"Magic+School+Bus+Lands+on+Mars","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91f6c5f3093d9d0eaee689d04c0fff2fa4296faa","infoHashBuffer":{"type":"Buffer","data":[145,246,197,243,9,61,157,14,174,230,137,208,76,15,255,47,164,41,111,170]},"announce":[],"urlList":[]}}