{"title":"Sherlock Holmes (2009)[SUBTITULADO].avi","uid":5440648,"size":1339083440,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:926a44e8b2e4c3537d08b9b68d277b9f8ffa639b&amp;dn=Sherlock+Holmes+%282009%29%5BSUBTITULADO%5D.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"eldiego90","files":-1,"time":1268866498,"description":"Sherlock Holmes (pelÃƒÂ­cula) con subtÃƒÂ­tulos en espaÃƒÂ±ol latino\n\n\n\nArgumento  \n\n\nLa pelÃƒÂ­cula empieza con una persecuciÃƒÂ³n para encontrar a Lord Blackwood, lÃƒÂ­der de una secta oscura con poderes inexplicables. Holmes y Watson son los primeros en entrar a la cripta donde Blackwood (Mark Strong) realiza un ritual de sacrificio. El dÃƒÂºo llega a tiempo y arrestan a Blackwood luego de una pelea con los guardianes. Dos meses despuÃƒÂ©s, Watson invita a Holmes al Royal para presentarle a su prometida, Mary Morstan (Kelly Reilly); luego de que Holmes pruebe sus habilidades de deducciÃƒÂ³n con ella, Watson y Mary se retiran ofendidos: Acto seguido, Holmes compite en una lucha de boxeo sin guantes contra un profesional al que, a pesar de eso, le propina una paliza. MÃƒÂ¡s tarde, Watson arriva a Baker Street, donde tiene un encontrÃƒÂ³n con Holmes. Finalmente Holmes despierta al dÃƒÂ­a siguiente acosado por Irene Adler (Rachel McAdams) quien le pide que busque a un pigmeo llamado Reordon. La busqueda de dicho personaje viene acompaÃƒÂ±ada de una serie de eventos que hacen del caso uno de los mÃƒÂ¡s siniestros que el detective londinense haya enfrentado. En primer lugar, Blackwood, despuÃƒÂ©s de ser ejecutado, reaparece como espectro, despuÃƒÂ©s de abandonar su tumba, en la que encuentran a Reordon en lugar de Blackwood.\n\nAmbos, junto con un vagabundo llamado Tanner, viajan a la fÃƒÂ¡brica Nine Elms para rendir cuentas con Blackwood pero caen en una trampa en el matadero, donde deben salvar a Irene, Watson persigue a Blackwood pero la fÃƒÂ¡brica explota y todos son heridos, Sherlock realiza un ritual pagano para descubrir el mÃƒÂ©todo del villano dando asÃƒÂ­ la conclusiÃƒÂ³n del asesinato de los miembros del Parlamento, es arrestado y llevado donde un traidor estadounidense llamado Coward, finalmente Sherlock escapa con Watson y Adler y pelean contra los matones de Dredger para desactivar el arma oculta en el Parlamento,lo cual muestra una clara analogÃƒÂ­a con la ConspiraciÃƒÂ³n de la PÃƒÂ³lvora. El clÃƒÂ­max ocurre en Tower Bridge, donde Sherlock mata a Blackwood, tras lo que Irene revela para quiÃƒÂ©n trabajaba, el Profesor Moriarty.\n\nReparto\n \n\nRobert Downey Jr. como Sherlock Holmes: Downey se encontraba de visita en las oficinas de Joel Silver con su esposa, la productora de cine Susan Downey, cuando se enterÃƒÂ³ sobre el proyecto. Ritchie estimÃƒÂ³ inicialmente que Downey era demasiado viejo para el papel. Sin embargo, Ritchie decidiÃƒÂ³ darle la oportunidad de hacerle el casting en el papel de Holmes, Downey le dijo a la BBC que &quot;creo que Guy y yo vamos a estar bien adaptados para trabajar juntos. Cuanto mÃƒÂ¡s miro en los libros, ÃƒÂ©l mÃƒÂ¡s fantÃƒÂ¡stico se vuelve. Holmes es un bicho raro.&quot; \nLa esposa de Downey le dijo &quot;Si lees la descripciÃƒÂ³n del personaje - maniatico y algo chiflado - podrÃƒÂ­a ser una descripciÃƒÂ³n de tÃƒÂ­.&quot; La intenciÃƒÂ³n de Downey de centrarse mÃƒÂ¡s en Holmes en su lado patriÃƒÂ³tico y su bohemia, y considerÃƒÂ³ que su trabajo sobre Chaplin lo ha preparado para darle a ÃƒÂ©l un acento InglÃƒÂ©s. Ritchie siente que su acento es &quot;impecable&quot;. Tanto Downey y Ritchie son los entusiastas de las artes marciales, y han improvisado gran parte de la &quot;baritsu&quot; introducido en el 1901 en The Adventure of the Empty House.\n\nJude Law como Dr.Watson: Es el mejor amigo de Holmes y su aliado, cirujano y un veterano de guerra. \n\nRachel McAdams como Irene Adler: una mujer fatal de Nueva Jersey que una vez venciÃƒÂ³ a Holmes, que gana a regaÃƒÂ±adientes su respeto y que mantiene una tempestuosa relaciÃƒÂ³n con el detective. \n\nMark Strong como Lord Blackwood: El malo de la pelicula. Miembro de una organizaciÃƒÂ³n masÃƒÂ³nica. \n\nKelly Reilly como Mary Morstan: Watson desea irse a vivir con ella, causando un conflicto con Holmes. \n\nEddie Marsan como Inspector Lestrade \n\nHans Matheson como Lord Coward \n\nJames Fox como Sir Thomas \n\nRobert Stone como Prizefighter \n\nWilliam Hope como John Standish \n\nDavid Garrick como McMurdo \n\nWilliam Houston como Constable Clark \n\nRobert Maillet como Dredger \n\nTerry Taplin como Groundskeeper \n","torrent":{"xt":"urn:btih:926a44e8b2e4c3537d08b9b68d277b9f8ffa639b","amp;dn":"Sherlock+Holmes+%282009%29%5BSUBTITULADO%5D.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"926a44e8b2e4c3537d08b9b68d277b9f8ffa639b","infoHashBuffer":{"type":"Buffer","data":[146,106,68,232,178,228,195,83,125,8,185,182,141,39,123,159,143,250,99,155]},"announce":[],"urlList":[]}}