{"title":"TTC - Big History--The Big Bang, Life on Earth, and the Rise of ","uid":4162163,"size":1056449651,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:927fd70aa21401aebaf72be1a1073d0c00e329f2&amp;dn=TTC+-+Big+History--The+Big+Bang%2C+Life+on+Earth%2C+and+the+Rise+of+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"BhangWalla","files":50,"time":1209425105,"description":"\nTTC - Big History: The Big Bang, Life on Earth, and the Rise of Humanity\nThe Teaching Company\n(48 lectures, 30 minutes/lecture)\nCourse No. 8050\n\nImagine you are traveling through time. Consider the following episodes:\n\n    * At 13.7 billion years ago, the Universe suddenly appears, growing from the size of an atom to the size of a galaxy in a fraction of a second.\n    * At 10 billion years ago, hydrogen atoms and helium atoms fuse at the center of a supernova to create the building blocks of the physical world.\n    * At 4.6 billion years ago, a cloud of matter collapses to produce a star?our Sun. Earth and the other planets in our solar system form out of the remaining bits of matter swirling around the new star.\n    * At 67 million years ago, an asteroid collides with the Earth, wiping out the dinosaurs, and leaves territory open for the rise of a minor order of organisms, the early mammals.\n    * At 100,000?60,000 years ago, a species of hominines?bipedal ape-like creatures? begins to move out of its home territory in Africa and into the Asian continent.\n    * Today, the descendants of those first hominines?homo sapiens?live in nearly every ecological niche. We fly through the air in planes, communicate instantaneously over immense distances, and develop theories about the creation of the Universe.\n\nEach of these scenarios is just one episode in an ever-evolving story: the history of everything. It&amp;#039;s a story you&amp;#039;ll hear?in its monumental entirety?in Big History: The Big Bang, Life on Earth, and the Rise of Humanity.\n\nTaught by historian David Christian, Big History offers a unique opportunity to view human history in the context of the many histories that surround it. Over the course of 48 thought-provoking lectures, he&amp;#039;ll serve as your guide as you traverse the sweeping expanse of cosmic history?13.7 billion years of it?starting with the big bang and traveling through time and space to the present moment.\n\nA Grand Synthesis of Knowledge\n\nHave you ever wondered: How do various scholarly discourses?cosmology, geology, anthropology, biology, history?fit together?\n\nBig History answers that question by weaving a single story from a variety of scholarly disciplines. Like traditional creation stories told by the world&amp;#039;s great religions and mythologies, Big History provides a map of our place in space and time. But it does so using the insights and knowledge of modern science, as synthesized by a renowned historian.\n\nThis is a story scholars have been able to tell only since the middle of the last century, thanks to the development of new dating techniques in the mid-1900s. As Professor Christian explains, this story will continue to grow and change as scientists and historians accumulate new knowledge about our shared past.\n\nEight &quot;Thresholds&quot;\n\nTo tell this epic, Professor Christian organizes the history of creation into eight &quot;thresholds.&quot; Each threshold marks a point in history when something truly new appeared and forms never before seen began to arise.\n\nStarting with the first threshold, the creation of the Universe, Professor Christian traces the developments of new, more complex entities, including:\n\n    * The creation of the first stars (threshold 2)\n    * The origin of life (threshold 5)\n    * The development of the human species (threshold 6)\n    * The moment of modernity (threshold 8).\n\nIn the final lectures, you&amp;#039;ll even gain a glimpse into the future as you review speculations offered by scientists about where our species, our world, and our Universe may be heading.\n\nGetting the &quot;Big&quot; Picture\n\nWhile you may have heard parts of this story before in courses on geology, history, anthropology, biology, cosmology, and other scholarly disciplines, Big History provides more than just a recap. This course will expand the scope of your perspective on the past and alter the way you think about history and the world around you.\n\n&quot;Because of the scale on which we look at the past, you should not expect to find in it many of the familiar details, names, and personalities that you&amp;#039;ll find in other types of historical teaching and writing,&quot; explains Professor Christian. &quot;For example, the French Revolution and the Renaissance will barely get a mention. They&amp;#039;ll zoom past in a blur. You&amp;#039;ll barely see them. Instead, what we&amp;#039;re going to see are some less familiar aspects of the past. ... We&amp;#039;ll be looking, above all, for the very large patterns, the shape of the past.&quot;\n\nThanks to this grand perspective, you&amp;#039;ll uncover the remarkable parallels and connections among disciplines that remain to be explored when you view history on a large scale. How is the creation of stars like the building of cities? How is the big bang like the invention of agriculture? These are the kinds of connections you&amp;#039;ll find yourself pondering as you undergo the grand shift in perspective afforded by Big History.\n\nFascinating Facts\n\nAlong the way, you&amp;#039;ll encounter intriguing tidbits that put the grand scale of this story in perspective, such as:\n\n    * The entire expanse of human civilization?5,000 years?makes up a mere 2 percent of the human experience.\n    * Approximately 98 percent of human history occurred before the invention of agriculture.\n    * All the matter we know of in the Universe is likely to be no more than 1 billionth of the actual matter that was originally created.\n    * The Earth&amp;#039;s Moon was probably created by a collision between the young Earth and a Mars-sized protoplanet.\n    * At present, we cannot drill deeper than about 7 miles into the Earth, which is just 0.2% of the distance to the center (4,000 miles away).\n    * Between 1000 C.E. and 2000 C.E., human populations rose by a factor of 24.\n    * Traveling in a jet plane, it would take 5 million years to get from our solar system to the next nearest star.\n\nThe Story We Tell about Ourselves\n\n&quot;To understand ourselves,&quot; says Professor Christian, &quot;we need to know the very large story, the largest story of all.&quot; And that, perhaps, is one of the greatest benefits of Big History: It provides a thought-provoking way to help us understand our own place within the Universe.\n\nFrom humankind&amp;#039;s place within the context of evolutionary history to our impact on the larger biosphere?both now and in our species&amp;#039; past?this course offers a broad yet nuanced examination of our place in creation. It also poses a profound question: Is it possible that our species is the only entity created by the Universe with the capacity to ponder its mysteries?\n\nThere is, perhaps, no more profound question to ask, and no better guide on this quest for understanding than Professor Christian. A pioneer in this approach to understanding history, Professor Christian has made big history his personal project for more than two decades. Working with experts in a variety of fields, he designed and taught some of the first big history courses, and has published widely on the topic.\n\nAccept his invitation to get the big picture on Big History, and prepare for a journey through time and across space, from the first moments of existence to the distant reaches of the far future.\n\nDavid Christian, D.Phil.\nProfessor of History\nSan Diego State University\nDavid Christian is Professor of History at San Diego State University, where he teaches courses on big history, world environmental history, Russian history, and the history of Inner Eurasia. From 1975 to 2000, he taught Russian history, European history, and world history at Macquarie University in Sydney.\n\nProfessor Christian was born in New York and grew up in Nigeria and Britain. He completed his B.A. in History at Oxford University, his M.A. in Russian History at The University of Western Ontario, and his D.Phil. in 19th-Century Russian History at Oxford University. As a graduate student, he spent a year in Leningrad (now St. Petersburg) during the Brezhnev era.\n\nIn the late 1980s, Professor Christian developed an interest in understanding the past on very large scales. With the help of colleagues in astronomy, geology, biology, anthropology, and prehistory, he began an experimental history course that started with the origins of the Universe and ended in the present day. Within two years, after his students persuaded him that it was a shame not to deal with the future after studying 13 billion years of history in 13 weeks, he introduced a final lecture on prospects for the future. In 1992, he wrote an article describing this approach as ?big history.? The label seems to have stuck, as similar courses have independently appeared elsewhere, and there are now several courses in big history at European, Russian, Australian, and North American universities.\n\nIn addition, Professor Christian has written on the social and material history of 19th-century Russian peasantry, in particular on aspects of diet and the role of alcohol. In 1990, he completed a study of the role of vodka in Russian social, political, and economic life. Professor Christian?s recent publications include: Imperial and Soviet Russia: Power, Privilege and the Challenge of Modernity (Macmillan/St. Martin?s, 1997); A History of Russia, Central Asia and Mongolia, Vol. 1: Inner Eurasia from Prehistory to the Mongol Empire in The Blackwell History of the World (Blackwell, 1998); Maps of Time: An Introduction to Big History (University of California Press, 2004), which won the 2005 World History Association Book Prize and has been translated into Spanish and Chinese; and This Fleeting World: A Short History of Humanity (Berkshire Publishing, 2007).\n\nProfessor Christian is a member of the Australian Academy of the Humanities and the Royal Holland Society of Sciences and Humanities. He is Affiliates Chair for the World History Association and was one of the editors of the Berkshire Encyclopedia of World History. He also participated in the creation of the world history website World History for Us All (http://worldhistoryforusall.sdsu.edu/dev/default.htm).\n\nLecture One............ What Is Big History?\nLecture Two............ Moving across Multiple Scales\nLecture Three.......... Simplicity and Complexity\nLecture Four........... Evidence and the Nature of Science\nLecture Five........... Threshold 1?Origins of Big Bang Cosmology\nLecture Six............ How Did Everything Begin?\nLecture Seven.......... Threshold 2?The First Stars and Galaxies\nLecture Eight.......... Threshold 3?Making Chemical Elements\nLecture Nine........... Threshold 4?The Earth and the Solar System\nLecture Ten............ The Early Earth?A Short History\nLecture Eleven......... Plate Tectonics and the Earth?s Geography\nLecture Twelve......... Threshold 5?Life\nLecture Thirteen....... Darwin and Natural Selection\nLecture Fourteen....... The Evidence for Natural Selection\nLecture Fifteen........ The Origins of Life\nLecture Sixteen........ Life on Earth?Single-celled Organisms\nLecture Seventeen...... Life on Earth?Multi-celled Organisms\nLecture Eighteen....... Hominines\nLecture Nineteen....... Evidence on Hominine Evolution\nLecture Twenty......... Threshold 6?What Makes Humans Different?\nLecture Twenty-One..... Homo sapiens?The First Humans\nLecture Twenty-Two..... Paleolithic Lifeways\nLecture Twenty-Three... Change in the Paleolithic Era\nLecture Twenty-Four.... Threshold 7?Agriculture\nLecture Twenty-Five.... The Origins of Agriculture\nLecture Twenty-Six..... The First Agrarian Societies\nLecture Twenty-Seven... Power and Its Origins\nLecture Twenty-Eight... Early Power Structures\nLecture Twenty-Nine.... From Villages to Cities\nLecture Thirty......... Sumer?The First Agrarian Civilization\nLecture Thirty-One..... Agrarian Civilizations in Other Regions\nLecture Thirty-Two..... The World That Agrarian Civilizations Made\nLecture Thirty-Three... Long Trends?Expansion and State Power\nLecture Thirty-Four.... Long Trends?Rates of Innovation\nLecture Thirty-Five.... Long Trends?Disease and Malthusian Cycles\nLecture Thirty-Six..... Comparing the World Zones\nLecture Thirty-Seven... The Americas in the Later Agrarian Era\n\nPDF included\n\nPlease help seed,\n\nMore related material:    &lt;a href=&quot;\nhttp://thepiratebay.se/user/BhangWalla&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/BhangWalla&lt;/a&gt;\t\t","torrent":{"xt":"urn:btih:927fd70aa21401aebaf72be1a1073d0c00e329f2","amp;dn":"TTC+-+Big+History--The+Big+Bang%2C+Life+on+Earth%2C+and+the+Rise+of+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"927fd70aa21401aebaf72be1a1073d0c00e329f2","infoHashBuffer":{"type":"Buffer","data":[146,127,215,10,162,20,1,174,186,247,43,225,161,7,61,12,0,227,41,242]},"announce":[],"urlList":[]}}