{"title":"MTV - The RW/RR Challenge S18 - The Ruins","uid":8057733,"size":6121937834,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9295b83b61b3aad51f6001b6785193b59b9cb349&amp;dn=MTV+-+The+RW%2FRR+Challenge+S18+-+The+Ruins&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zed1234","files":-1,"time":1359004847,"description":"MTV - Real World Road Rules Challenge Season 18 - The Ruins\n\nTwenty-eight competitors have been tapped to compete in an exciting new Real World/Road Rules Challenge. We're pitting grizzled and greedy former winners, henceforth known as &quot;Champions,&quot; to do battle against a team of equally greedy newcomers and past Challenge losers we've dubbed &quot;Challengers.&quot; They will meet in exotic Thailand to see who can face the rigors of The Ruins.\n\nAlthough players will compete at teams, they will also bank winnings into individual bank accounts as they compete in nine intense challenges and a thrilling finale. There is $300,000 up for grabs and, as always, the players will do whatever it takes to get their cut of the Challenge prize.\n\nNot everyone will last until the end to earn a share of the wealth. After each weekly challenge, one man and one woman from each team will compete in &quot;The Ruins&quot; -- a head-to-head battle between two competitors, where one man and one woman will be eliminated. The winner of &quot;The Ruins&quot; not only stays in the game, but pockets the loser's bank account, making them richer -- as well as a bigger target in the eyes of the other players. The loser? Well, the loser goes home flat broke.\n\nAvoiding &quot;The Ruins&quot; depends on how well teams do in the challenges. Before each challenge, each team will nominate six people -- three men and three women from their ranks -- to be eligible for &quot;The Ruins.&quot; After every challenge, the winning team will split $20,000 evenly. Then, the winning team's lucky six nominees will be &quot;the match-makers&quot; who will select which man and woman from each team will be sentenced to &quot;The Ruins.&quot; The selected men will have their &quot;Ruins&quot; competition and so will the women. The losers will be sent packing.\n\nAs with any Challenge, the competitor who plays their cards right and forms the best alliances will find they have the power. Those who do not may just find themselves in &quot;The Ruins.&quot; However, in Thailand, going into the elimination round is a risk that could pay off, as the winner ends up acquiring their opponent's bank account.\n\nOnly the players that make it to the end will walk away with the cash they've banked and compete in the finale. Plus, the winners of the finale will earn an additional grand prize!\n\nUltimately, friendships will be put to the test, hearts will be broken and battles will rage -- both on and off the playing field -- as players do whatever it takes to be crowned the winners of The Ruins!\n\nRelease Notes:\nEpisodes resolution: 768x432\nReunion resolution: 640x480\nThe Shit They Should Have Shown resolution: 640x480","torrent":{"xt":"urn:btih:9295b83b61b3aad51f6001b6785193b59b9cb349","amp;dn":"MTV+-+The+RW%2FRR+Challenge+S18+-+The+Ruins","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9295b83b61b3aad51f6001b6785193b59b9cb349","infoHashBuffer":{"type":"Buffer","data":[146,149,184,59,97,179,170,213,31,96,1,182,120,81,147,181,155,156,179,73]},"announce":[],"urlList":[]}}