{"title":"Osho_Bodhidharma The Greatest Zen Master-09.avi","uid":15223166,"size":225173798,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:92f18a9ea94f12bdb9e11a9ac5262b1001cc61cd&amp;dn=Osho_Bodhidharma+The+Greatest+Zen+Master-09.avi&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"drugarica","files":1,"time":1467751573,"description":"Bodhidharma: The Greatest Zen Master\r\nChapter #9\r\nChapter title: Dead men don't bleed\r\n9 July 1987 am in Gautam the Buddha Auditorium\r\nLength: \t118 mins\r\nBELOVED BHAGWAN,\r\nBODHIDHARMA'S WAKE-UP SERMON.\r\nTHE ESSENCE OF THE WAY IS DETACHMENT. AND THE GOAL OF THOSE WHO PRACTICE IS FREEDOM FROM APPEARANCES. THE SUTRAS SAY, &quot;DETACHMENT IS ENLIGHTENMENT BECAUSE IT NEGATES APPEARANCES.&quot;      ...THE THREE REALMS ARE GREED, ANGER AND DELUSION. TO LEAVE THE THREE REALMS MEANS TO GO FROM GREED, ANGER AND DELUSION BACK TO MORTALITY, MEDITATION AND WISDOM. THE SUTRAS SAY, &quot;BUDDHAS HAVE ONLY BECOME BUDDHAS WHILE LIVING WITH THE THREE POISONS AND NOURISHING THEMSELVES ON THE PURE DHARMA.&quot; THE THREE POISONS ARE GREED, ANGER AND DELUSION ....\r\nTHE GREAT VEHICLE IS THE GREATEST OF ALL VEHICLES. IT'S THE CONVEYANCE OF BODHISATTVAS, WHO USE EVERYTHING WITHOUT USING ANYTHING, AND WHO TRAVEL ALL DAY WITHOUT TRAVELLING. SUCH IS THE VEHICLE OF BUDDHAS. THE SUTRAS SAY, &quot;NO VEHICLE IS THE VEHICLE OF BUDDHAS.&quot;      ...THE SUTRAS SAY, &quot;THE CAVE OF FIVE AGGREGATES IS THE HALL OF ZEN, THE OPENING OF THE INNER EYE IS THE DOOR OF THE GREAT VEHICLE.&quot; WHAT COULD BE CLEARER?\r\nNOT THINKING ABOUT ANYTHING IS ZEN. ONCE YOU KNOW THIS, WALKING, STANDING, SITTING OR LYING DOWN, EVERYTHING YOU DO IS ZEN. TO KNOW THAT THE MIND IS EMPTY IS TO SEE THE BUDDHA. THE BUDDHAS OF THE TEN DIRECTIONS HAVE NO MIND. TO SEE NO MIND IS TO SEE THE BUDDHA.\r\nTO GIVE UP YOURSELF WITHOUT REGRET IS THE GREATEST CHARITY. TO TRANSCEND MOTION AND STILLNESS IS THE HIGHEST MEDITATION. MORTALS KEEP MOVING WHILE ARHATS STAY STILL. BUT THE HIGHEST MEDITATION SURPASSES THAT OF BOTH MORTALS AND ARHATS. PEOPLE WHO REACH SUCH UNDERSTANDING FREE THEMSELVES FROM ALL APPEARANCES WITHOUT EFFORT AND CURE ALL ILLNESSES WITHOUT TREATMENT. SUCH IS THE POWER OF GREAT ZEN.\r\n\r\nBodhidharma is more clear and transparent than any other enlightened person. But the experience of enlightenment is such that you can still commit mistakes. This is something to be understood","torrent":{"xt":"urn:btih:92f18a9ea94f12bdb9e11a9ac5262b1001cc61cd","amp;dn":"Osho_Bodhidharma+The+Greatest+Zen+Master-09.avi","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92f18a9ea94f12bdb9e11a9ac5262b1001cc61cd","infoHashBuffer":{"type":"Buffer","data":[146,241,138,158,169,79,18,189,185,225,26,154,197,38,43,16,1,204,97,205]},"announce":[],"urlList":[]}}