{"title":"Catherine Coulter - FBI Series - 13 Knockout 2009","uid":11538051,"size":351151035,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:93367819eafeae1babb071dc71dca35a069d43e9&amp;dn=Catherine+Coulter+-+FBI+Series+-+13+Knockout+2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":-1,"time":1416640404,"description":"Written by CATHERINE COULTER\nFormat: MP3\nUnabridged\n\nSeven-year-old Autumn Backman has a gift: she can communicate telepathically with others. Not everyone, mind you, but with a select few with whom she shares a special kinship. When Autumn and her mother, Joanna, take her father's ashes to be buried in the family plot in Brickers Bowl, Georgia, she witnesses a horrifying sight: her grandmother and two uncles, burying a pile of dead bodies in the middle of the night. They head to Titusville, Virginia to seek the help of an old family friend, but Autumn senses they need assistance on a grand scale. Using her telepathic powers, Autumn calls a man she'd only seen on TV: FBI Agent Dillon Savich.\n\nBut before Savich and his wife and partner, Agent Lacey Sherlock, can get on-scene, Autumn and Joanna flee, fearing the retribution of her Uncle Blessed. A huge manhunt ensues, with Titusville Sheriff Ethan Merriweather racing to reach the girl before Blessed can get his hands on her. Blessed's got big things planned for Autumn and her gift, and he'll stop at nothing to force her into his growing army of exploited children. Savich, Sherlock, and Merriweather face their most elusive foes to keep Autumn out of harm's way - before it's too late","torrent":{"xt":"urn:btih:93367819eafeae1babb071dc71dca35a069d43e9","amp;dn":"Catherine+Coulter+-+FBI+Series+-+13+Knockout+2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93367819eafeae1babb071dc71dca35a069d43e9","infoHashBuffer":{"type":"Buffer","data":[147,54,120,25,234,254,174,27,171,176,113,220,113,220,163,90,6,157,67,233]},"announce":[],"urlList":[]}}