{"title":"Nanomaterials for Sustainable Energy - Quan Li","uid":15481196,"size":23980585,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:93dbcaee37889d18a7ee1ae9079345016d314f6a&amp;dn=Nanomaterials+for+Sustainable+Energy+-+Quan+Li&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1470257651,"description":"Nanomaterials for Sustainable Energy - Quan Li (Springer, 2016).pdf\r\n\r\nThis book presents the unique mechanical, electrical, and optical properties of nanomaterials, which play an important role in the recent advances of energy-related applications. Different nanomaterials have been employed in energy saving, generation, harvest, conversion, storage, and transport processes very effectively and efficiently. Recent progress in the preparation, characterization and usage of 1D, 2D nanomaterials and hybrid architectures for energy-related applications and relevant technologies and devices, such as solar cells, thermoelectronics, piezoelectronics, solar water splitting, hydrogen production/storage, fuel cells, batteries, and supercapacitors is covered. Moreover, the book also highlights novel approaches in nanomaterials design and synthesis and evaluating materials sustainability issues. Contributions from active and leading experts regarding important aspects like the synthesis, assembly, and properties of nanomaterials for energy-related applications are compiled into a reference book. As evident from the diverse topics, the book will be very valuable to researchers working in the intersection of physics, chemistry, biology, materials science and engineering. It may set the standard and stimulates future developments in this rapidly emerging fertile frontier of nanomaterials for energy","torrent":{"xt":"urn:btih:93dbcaee37889d18a7ee1ae9079345016d314f6a","amp;dn":"Nanomaterials+for+Sustainable+Energy+-+Quan+Li","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93dbcaee37889d18a7ee1ae9079345016d314f6a","infoHashBuffer":{"type":"Buffer","data":[147,219,202,238,55,136,157,24,167,238,26,233,7,147,69,1,109,49,79,106]},"announce":[],"urlList":[]}}