{"title":"The Ritual Murder Libel and the Jew","uid":4374140,"size":587355,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:942f1cf4e6ebaf42893d92e7b1fc0824cadb6651&amp;dn=The+Ritual+Murder+Libel+and+the+Jew&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"CuriousGeorge","files":1,"time":1220315593,"description":"THE REPORT BY CARDINAL LORENZO GANGANELLI\n(POPE CLEMENT XIV.)\n\nEDITED BY\nCECIL ROTH\nD.Phil., F.R.Hist.S.\n\nTHE WOBURN PRESS\nLONDON\n\nCONTENTS\nPAGE\nPREFACE ... ... ... ... ... ... ... ... 15\nTHE REPORT OF CARDINAL GANGANELLI:\nITALIAN TEXT ... ... ... ... ... ... 39\nTHE REPORT OF CARDINAL GANGANELLI:\nTRANSLATION ... ... ... ... ... ... 67\nAPPENDICES :\nA. Encyclical of Pope Innocent IV. against\nthe Blood Accusation ... ... ... ... 97\nB. Other Pronouncements on the Blood\nAccusation ... ... ... ... ... ... 99\nC. Protests against the Kiev Ritual Murder\nAccusation, 1912 ... ... ... ... ... 101\nD. British Opinion and Der StÃƒÆ’Ã‚Â¼rmer ... ... ... 106\nSELECT BIBLIOGRAPHY ... ... ... ... ... ... 110\nILLUSTRATIONS\nLorenzo Ganganelli (Pope Clement XIV.) Frontispiece\nLetter of Cardinal Merry del Val at page 32 [sic; 36]\n\n\nPREFACE\nTHE RITUAL MURDER LIBEL\nI\nON Easter Eve, 1144, the dead body of a young skinner's-apprentice, named William, was found in a wood near Norwich. Modern enquirers, after careful examination of the facts, have concluded that the child probably lost consciousness in consequence of a cataleptic fit, and was buried prematurely by his relatives. It was bruited about, however, that in fact he was a victim of the Jews, who had enticed him away from his family and crucified him, after synagogue service on the second day of Passover, in mockery of the Passion of Jesus. In consequence, a wave of religious frenzy swept the city. The body was buried with all solemnity at the Cathedral, where miracles were said to be wrought at the graveside. That the Jews escaped massacre was mainly due to the cool-headedness of the Sheriff, who permitted them to seek refuge in the royal castle and (realising that in the prevailing state of public opinion impartiality was not to be expected) refused to allow judicial proceedings to be opened against them. However, long after they ventured out,\nthey continued to be in danger, and at least one of the leading members of the community was murdered. For many years after, when the Jew had long been a stranger to England,the relics of William of Norwich were popularly venerated as those of a martyr.1\n\nThis was the first instance known to Western history of the infamous Ritual Murder\nAccusation, which has caused such untold misery to the Jewish people from that day to this.2 This absurdity, in its final development, is based upon the hypothesis that the Jews require and employ human blood for purposes\n1 A. Jessop and M. R. James: The Life and Miracles of St. William of Norwich, by Thomas of Monmouth(Cambridge, 1896).\n\n2 Socrates, the fifth-century ecclesiastical historian, reports something vaguely similar as having occurred at Inmestar, in Syria, about 415: while according to Josephus a similar libel was current at the time of Jesus with regard to the Temple worship. Anterior to the episode of William of Norwich, however, here is an\napparent blank of 700 years.","torrent":{"xt":"urn:btih:942f1cf4e6ebaf42893d92e7b1fc0824cadb6651","amp;dn":"The+Ritual+Murder+Libel+and+the+Jew","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"942f1cf4e6ebaf42893d92e7b1fc0824cadb6651","infoHashBuffer":{"type":"Buffer","data":[148,47,28,244,230,235,175,66,137,61,146,231,177,252,8,36,202,219,102,81]},"announce":[],"urlList":[]}}