{"title":"Burst Angel Serie Completa - Tutti i Torrent [DVDmux ITA JAP Ac3","uid":6097777,"size":197452,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:949ea9197ba14e31ef04d4154f539809e555f09c&amp;dn=Burst+Angel+Serie+Completa+-+Tutti+i+Torrent+%5BDVDmux+ITA+JAP+Ac3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"l.diliberto","files":2,"time":1294845728,"description":"Burst Angel Serie Completa - Tutti i Torrent [DVDmux ITA JAP Ac3] TNT Village\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=235805&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=235805&lt;/a&gt;\n\n.: Plot :.\n\nIn a chaotic future Tokyo, a young aspiring chef is employed by four beautiful mercenaries. \n\n.: Trama :.\n\nQuattro ragazze molto particolari sono le Burst Angels, un gruppo di agenti privati tuttofare che aiutano i propri clienti a risolvere le situazioni piÃƒÂ¹ difficili.\nJo ÃƒÂ¨ una strana ragazza dai capelli bianchi: parla poco e sembra vivere in un mondo tutto suo, ma quando c:ÃƒÂ¨ da combattere nessuna ÃƒÂ¨ come lei.\nAmy sembra una comunissima bambina di undici anni ma in realtÃƒÂ  ÃƒÂ¨ un genio dei computer e grazie alla sua intelligenza, e alla sua lingua tagliente, ÃƒÂ¨ diventata un idolo per molti utenti della grande rete.\nMeg ÃƒÂ¨ invece bella e prosperosa ma ha il difetto di mettersi sempre nei guai costringendo Jo e le amiche a fare l:impossibile per salvarla. Ma non sottovalutatela perchÃƒÂ© nasconde molte sorprese!\nInfine Sei, la piÃƒÂ¹ grande del gruppo: ÃƒÂ¨ figlia di una potente famiglia cinese immigrata in Giappone ed ÃƒÂ¨ lei la mente del gruppo. Quattro ragazze speciali che si sono unite per combattere il crimine e proteggere gli innocenti.\nE lo fanno con lo stile che le contraddistingue: azioni, inseguimenti e sparatorie sono quindi all:ordine del giorno per loro. E quando la situazione si fa piÃƒÂ¹ difficile ecco arrivare la loro arma definitiva Django il robot guidato da Jo che ÃƒÂ¨ in grado di affrontare ogni nemico grazie al suo potente arsenale.\n\nA queste quattro aggiungiamo anche Kyouhei, un giovane studente di cucina che fa l:errore di rispondere ad un loro annuncio di lavoro e diventa il cuoco ufficiale delle Burst Angels, le ragazze terribili che si aggirano per le strade di una Tokyo del futuro dove la tecnologia ÃƒÂ¨ diventata sempre piÃƒÂ¹ al centro della vita delle persone. Col numero di crimini in costante ascesa e sempre meno arresti, delle vigilanti come Jo e amiche sono l:unica speranza per la gente comune e anche Kyouhei saprÃƒÂ  fare la sua parte, non solo in cucina... \n\n.: Cover :.\n &lt;a href=&quot;\nhttp://img131.imageshack.us/img131/6482/busterangelmainphoto7oi.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img131.imageshack.us/img131/6482/busterangelmainphoto7oi.jpg&lt;/a&gt;\n\n.: Crediti :.\n\nTitolo originale: Bakuretsu Tenshi\nTitolo: Buster Angel\nAnno: 2003\nGenere: Serie TV Fantascienza\nSTAFF: Director: Koichi Ohata - Scenario: Fumihiko Shimo - Music: Masara Nishida\nCharacter Design: Kanetoshi Kamimoto,Osamu Horiuchi - Art director: Aki Makoto,Toshikazu Ishiwata\nMechanical design: Kanetake Ebikawa - Character Conceptual Design: Ugetsu Hakua\nDirector of Photography: Sei Kitaoka - 3-D Director: Tomoaki Kaneko\n3D CG Supervision: Tomohiro Kawahara - Art Board: Takeshi Itou\nAssistant director: Yasunori Urata - Color design: Keiko Kai - Editing: Mutsumi Takemiya\nMusic producer: Keiichi Nozaki - Planning: Masafumi Fukui,Shinichiro Ishikawa,Shouji Murahama\nPlanning Cooperation: Takayasu Hatano - Producer: Naomi Nishiguchi,Takashi Imamoto,Toshi Hatanaka\nProduction Design: Seiji Uda - Recording: Satoshi Uno\nSeries Composition: Fumihiko Shimo - Set Design: Tomoyuki Aoki - Sound director: Yota Tsuruoka\nSound Effects: Minoru Yamada - Technical director: Masanori Suzuki - Visual Effects: Nobu Iie\nCAST: Kyohei: Massimo Di Benedetto - Jo: Renata Bertolas - Meg: Emanuela Pacotto\nAmy: Jolanda Granato - Sei: Deborah Magnaghi - Ryang: Claudio Moneta\nNumero episodi: 24 episodi\nDurata approssimativa episodi: 25 minuti\n\n========================================\n\n.: Dati tecnici medi del ripping per ogni episodio :.\n\nDimensione: 400 mega\nDurata: 23' 30'' circa\n\nVideo Codec: XviD\nVideo Bitrate: 1450 kb/s\nRisoluzione: 704x400\n\nLingue: Italiano / Giapponese\nAudio Codec: ac3\nAudio Bitrate: 448 kb/s (6 ch) CBR ","torrent":{"xt":"urn:btih:949ea9197ba14e31ef04d4154f539809e555f09c","amp;dn":"Burst+Angel+Serie+Completa+-+Tutti+i+Torrent+%5BDVDmux+ITA+JAP+Ac3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"949ea9197ba14e31ef04d4154f539809e555f09c","infoHashBuffer":{"type":"Buffer","data":[148,158,169,25,123,161,78,49,239,4,212,21,79,83,152,9,229,85,240,156]},"announce":[],"urlList":[]}}