{"title":"The New Mendicants - Into the Lime (2014) [FLAC]","uid":9530754,"size":223976266,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:94cb83aa12bc260230b49a6d68a3c6e1b1ba8488&amp;dn=The+New+Mendicants+-+Into+the+Lime+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"politux","files":-1,"time":1390838909,"description":"\n  The New Mendicants - Into the Lime (2014) [FLAC]\n\n  Genre: Pop/Rock\n  Style: Indie Pop\n  Source: WEB\n  Codec: FLAC\n  Bitrate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 Sarasota \n  02 A Very Sorry Christmas \n  03 Cruel Annette \n  04 Follow You Down \n  05 Shouting Match\n  06 If Only You Knew Her \n  07 High On the Skyline \n  08 By the Time It Gets Dark \n  09 Out of the Lime \n  10 Lifelike Hair \n\n  Some pairings make perfect sense right from the start. When Norman Blake (Teenage Fanclub) and Joe Pernice (Pernice Brothers) announced in 2013 that they had started a new band together, fans of classic, harmony-driven guitar pop recognized a winning formula. Arriving in early 2014, the New Mendicants' debut LP Into the Lime contains all of the classy songcraft, jangling guitars, and big harmonies fans expected and it almost comes as a relief that the two beloved songsmiths didn't use this project as a platform for some other sort of wild artistic experimentation. Along with drummer Mike Belitsky of the Sadies (the only native Canadian in this Toronto-based trio), Blake and Pernice play to their strengths, delivering ten strong new songs that echo not just their own bands, but classic '60s influences like the Hollies and the Byrds. From the opening organ/piano riff of &quot;Sarasota,&quot; the band's arrangements are subtly thrilling, yet comfortably laid-back. There's a very relaxed, unhurried atmosphere to the album which speaks of the members' many years of friendship and combined studio experience. The sublime &quot;Cruel Annette&quot; blend the two singers' styles into something new to both, while the gentle &quot;If You Only Knew Her&quot; comes across like a blend of Chad and Jeremy's wistful classic &quot;A Summer Song&quot; and Nick Lowe's stately late-career output. Several of the album's songs were originally intended to soundtrack the film adaptation of Nick Hornby's novel A Long Way to Fall, but even when the Mendicants are singing about suicide and depression, ","torrent":{"xt":"urn:btih:94cb83aa12bc260230b49a6d68a3c6e1b1ba8488","amp;dn":"The+New+Mendicants+-+Into+the+Lime+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94cb83aa12bc260230b49a6d68a3c6e1b1ba8488","infoHashBuffer":{"type":"Buffer","data":[148,203,131,170,18,188,38,2,48,180,154,109,104,163,198,225,177,186,132,136]},"announce":[],"urlList":[]}}