{"title":"T. H. White - The Once and Future King [King Arthur]","uid":10201705,"size":2197631,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:94defcd2c1b2b9677136d868659704d570beee8b&amp;dn=T.+H.+White+-+The+Once+and+Future+King+%5BKing+Arthur%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"workerbee","files":-1,"time":1400781075,"description":"\nT. H. White - The Once and Future King (HarperVoyager, 1996).\n\nISBN 9780006483014 | 832 pages | ePUB / MOBI\n\n\nTHE ONCE AND FUTURE KING is a sequence of novels retelling the Arthurian legend written by T. H. White (1906-1964).  It was first published in 1958 and is mostly a composite of earlier works written between 1938 and 1941.  \n\nMost of the book takes place on the isle of Gramarye, and chronicles the raising and education of King Arthur, his rule as a king, and the romance between Sir Lancelot and Queen Guinevere.  It ends immediately before Arthur's final battle against his illegitimate son, Mordred.  The central theme is an exploration of human nature regarding power and justice, as the boy Arthur becomes king and attempts to quell the prevalent &quot;might makes right&quot; attitude with his idea of chivalry.  But in the end, even chivalry comes undone since its justice is maintained by force.  Though White admitted the book's source material was loosely derived from Malory's &quot;Le Morte d'Arthur&quot;, he reinterpreted the epic events, filling them with renewed meaning for a world recovering from World War II.\n\nThe title comes from the inscription that, according to Le Morte d'Arthur, was said to be written upon King Arthur's tomb: Hic iacet Arthurus, rex quondam, rexque futurus (&quot;Here lies Arthur, king once, and king to be&quot;).\n\nThe book is divided into five parts, all contained in this volume:\n  - The Sword in the Stone (1938)\n  - The Witch in the Wood (1939)\n  - The Ill-Made Knight (1940)\n  - The Candle in the Wind (1958)\n  - The Book of Merlyn (published posthumously in 1977)\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                                      &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!\n\n","torrent":{"xt":"urn:btih:94defcd2c1b2b9677136d868659704d570beee8b","amp;dn":"T.+H.+White+-+The+Once+and+Future+King+%5BKing+Arthur%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94defcd2c1b2b9677136d868659704d570beee8b","infoHashBuffer":{"type":"Buffer","data":[148,222,252,210,193,178,185,103,113,54,216,104,101,151,4,213,112,190,238,139]},"announce":[],"urlList":[]}}