{"title":"DVD-Lab Pro 2.19 Portable [Win - Eng] [g8ni_92] [TNTVillage]","uid":4802179,"size":28392886,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:95e1b3a177d831f9a07c32307bbb161c051c5acf&amp;dn=DVD-Lab+Pro+2.19+Portable+%5BWin+-+Eng%5D+%5Bg8ni_92%5D+%5BTNTVillage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"g8ni92tntvillage","files":1,"time":1238080013,"description":"DVD-Lab Pro 2.19 Portable [Win - Eng] [g8ni_92] [TNTVillage]\n\nAbout this Torrent -&gt; http://www.tntvillage.scambioetico.org/index.php?act=showrelease&amp;id=163615\n\nAll My Releases -&gt; http://www.tntvillage.scambioetico.org/index.php?act=allreleases&amp;st=0&amp;filter=g8ni_92&amp;cat=0\n\nMy Software -&gt; http://www.tntvillage.scambioetico.org/index.php?act=allreleases&amp;st=0&amp;filter=g8ni_92&amp;cat=10\n\n\n\n\n:::-&gt;Info&lt;-:::\n\n-ENGLISH\n\nThe DVD-lab PRO version 2 is a next step in DVD authoring (See Comparison) for advanced users who need accessible and easy to learn tool with full range of DVD features.\nMost of the existing tools are either very expensive and hard to master or are limited in implementing DVD specifications. Many tools that are often marketed as advanced or for professional use are actually only more expensive consumer applications with pre-cooked DVD structure and questionable user interface.\nDVD-lab PRO is based on the idea of original DVD-lab. Instead of insulting the users with an overdone flashy interface, DVD-lab and DVD-lab PRO put strong emphasis on the usability of it. The Modern Windows GUI can be tweaked and reorganized to everybody taste even across multiple monitors.\nDVD-lab PRO is also one of the very few applications on the market that grows with your requirements and knowledge. Users of other applications usually either outgrow them very soon or they need to study a long time before they are able to create even simple project.\nWe put a lot of effort to the DVD-lab PRO so it offers benefits of both worlds. It is easy to start making first DVD's but it doesn't stop there. As you continue to master the craft you will realize that DVD-lab PRO offers an unlimited range of design flexibility and delivers the goods even for most demanding designers.\n\n-ITALIANO\n\nDVD-lab ÃƒÂ¨ una nuova utilitÃƒÂ  di authoring DVD che combinando un'interfaccia professionale e moderna ad un facile utilizzo, permette all'utente piena e libera creativitÃƒÂ .\n\nDvd-lab ÃƒÂ¨ stato costruito su un modello molto potente di Developer Studio-Like . Questo per un buon motivo. Contrariamente alle altre autoritÃƒÂ  di authoring di DVD di questo tipo, potete completamente riorganizzare l'interfaccia come lo desiderate.. Tutte le finestre possono essere raccolte permettendo cosÃƒÂ¬ di lavorare al meglio con schermi multipli.Tutto ciÃƒÂ² costituisce una macchina polifunzionale moto potente. Il programma vi sorprenderÃƒÂ  per la sua velocitÃƒÂ  e leggerezza. Spostarsi nel Film, aggiungere capitoli si realizza in un attimo. Durante la compilazione del progetto potete svolgere altre attivitÃƒÂ , compreso il lavorare sul progetto di un altro DVD. DVD- Lab Integra un'utilitÃƒÂ  di creazione dei menÃƒÂ¹ , un modulo di gestione delle connessioni e un modulo di scrittura del DVD.Non trascura gli aspetti avanzati del DVD da lei creato, nello stesso tempo la protegge con una potente automazione.. Per esempio: DVD-lab puÃƒÂ² eseguire l' Auto-indirizzamento dei pulsanti del Menu, tuttavia si puÃƒÂ² cambiare questa caratteristica e impostarla in manuale.\n\nI video :\nPotete inserire nel progetto fino a 99 clips video. Il programma supporta le estensioni convenzionali MPEG (.mpv et .mpa) (o le converte nel caso di .mpg o .vob) , supporta i rapporti 4:3 e 16:9, PAL o NTSC.\n\nL'Audio :\nSono supportati i formati MPEG, AC-3, DTS, WAV, AIFF , lo stereo a 2 canali, il Dolby Digital 6 canali (5+1).\n\nLe diapositive :\nIn DVD-lab le sequenze di foto, fino a 99 immagini, sono trattate come un particolare tipo di film . Un Progetto puÃƒÂ² contenere un numero illimitato di immagini. Ogni immagine puÃƒÂ² avere una durata di default o specifica. Si puÃƒÂ² anche utilizzare un file audio. La durata delle immagini si puÃƒÂ² adattare al file audio.\n\nI menu :\nUna utilitÃƒÂ  menu ÃƒÂ¨ parte integrante di DVD-Lab. PuÃƒÂ² essere aggiunto del testo con pieno controllo dei caratteri e delle ombre, utilizzare il Drag &amp; Drop,inserire pulsanti, immagini con sfondo e altri oggetti . Si dispone di un nutrito gruppo di immagini di sfondo E1, E2 e P, si possono cambiare i colori e le trasparenza delle immagini di sfondo dei menu e questo separatamente per ognuno dei menu lo stesso ÃƒÂ¨ possibile per i comandi d'automazione applicabili ai differenti oggetti dei menu. Si possono creare differenti tipi di menu e riutilizzarli quando lo si desidera in un altro DVD .\n\nLe connessioni :\nSi necessita di un progetto complesso composto da molti video e menu? Nessun problema, la finestra &quot;Connessioni &quot; vi aiuta ad organizzare in modo visuale i flussi del DVD. Collegare insieme i Film come si desidera , inserire delle pause e rendere visibile l'insieme del progetto.multi-tasking\n\nMulti-tasking :\nI processi lunghi, come la compilazione, sono fatti in sottofondo in modo di consentire altre operazioni come compilare un progetto e allo stesso tempo lavorare su di un altro.\nEccezionali manipolazioni avanzate :\nTuute le operazioni sensibile sono eseguite come un processo separato da quello principale, in modo da salvaguardare in caso di problemi il progetto.\nAssistenti per uno sviluppo veloce del progetto : consentono di lavorare piÃƒÂ¹ velocemente, allo stesso tempo non limitano la creativitÃƒÂ .\n\nCreazione automatica dei capitoli :\nSi possono creare i capitoli manualmente, facilmente e rapidamente, ma possono essere utilizzati tools come &quot;Auto-Chapters&quot; e &quot;Cut Scene Detection&quot;. Questo permetterÃƒÂ  di essere certi di inserire esattamente il capitolo all'inizio della scena selezionata.\nMenus di selezione capitoli : questo assistente eseguirÃƒÂ  la selezione automatica dei menu per accedere ai capitoli.\n\nMenu Template(maschera dei menu) :\nSi possono creare dei propri modelli di menu e riutilizzarli in altri progetti.\n\nMenu Transitions :\nDVD-lab ÃƒÂ¨ il primo software d' authoring a consentire le transizioni dei menu. Degli effetti di volta pagina , sfondi con effetto fuoco casuale , dei passaggi da un menu all'altro per mezzo di zoom, e altri effetti.\n\nMenu effetti :\nTuute le immagini estratte dai video per essere utilizzate nei menu sono automaticamente deinterlacciate divenendo piÃƒÂ¹ nitide e senza bordi frastagliati. Si possono anche applicare agli oggetti dei filtri per aumentarene la nitidezza e il contrasto. Molto interessante ÃƒÂ¨ ciÃƒÂ² che si puÃƒÂ² realizzare con l'utilitÃƒÂ  &quot; Gen-EFX&quot;. Migliaio di effetti a portata di mano, dai piÃƒÂ¹ semplici ai piÃƒÂ¹ complessi a seconda del caso per creare degli sfondi interessanti.\n\nNTSC Safe :\nL' utilitÃƒÂ  &quot;NTSC safe&quot; de DVD-lab produce un'ottima uscita dei colori simulando (e facendolo vedere!) la tensione del Segnale di Video come apparirebbe sullo schermo TivÃƒÂ¹ dell'osservatore. (Video Signal Voltage).\n\nAccorciare il film :\nSi puÃƒÂ² facilmente tagliare la fine del filmato senza riconvertirlo (la qualitÃƒÂ  originaria ÃƒÂ¨ conservata). Molto utile quando la registrazione di un video es. TV va oltre la durata del Filmato.\n\n:::-&gt;Scheda tecnica del Software&lt;-:::\n\nDimensione: 27 MB\nLingua: Multi - Italiano\nGenere: DVD Creator\nData: 2006-08-28 (fonte versiontracker)\nSviluppatore: Mediachance\nSito Ufficiale: LINK\nLicenza: Shareware\nPrezzo: $245.00\nVersione: 2.19\nRequisiti minimi di sistema:\n    * Sistema operativo Windows Vista/XP\n    * HDD: 50MB\n\nInfo Installazione:\n1) Avviare l'eseguibile.\n2) Enjoy\n\n:::-&gt;Note&lt;-:::\n\nNon necessita di cura in quanto il programma ÃƒÂ¨ stato registrato in precedenza\n\nTestato, Funzionante 100%\n\nScansionato con KIS 2009 Aggiornato il 25/03/09\n\nENJOY BY\ng8ni_92","torrent":{"xt":"urn:btih:95e1b3a177d831f9a07c32307bbb161c051c5acf","amp;dn":"DVD-Lab+Pro+2.19+Portable+%5BWin+-+Eng%5D+%5Bg8ni_92%5D+%5BTNTVillage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95e1b3a177d831f9a07c32307bbb161c051c5acf","infoHashBuffer":{"type":"Buffer","data":[149,225,179,161,119,216,49,249,160,124,50,48,123,187,22,28,5,28,90,207]},"announce":[],"urlList":[]}}