{"title":"Bad Samaritans - The Myth of Free Trade and the Secret History o","uid":4518775,"size":179237456,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:968a621a892dcd7e7715ae08394a94ce03d123ec&amp;dn=Bad+Samaritans+-+The+Myth+of+Free+Trade+and+the+Secret+History+o&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"spyrule","files":1,"time":1227079433,"description":"Bad Samaritans: The Myth of Free Trade and the Secret History of Capitalism\nBy Ha-Joon Chang\n\n\nReviewed by Paul Blustein\n\nBookstore shelves are loaded with offerings by economists and commentators seeking to explain, in accessible prose, why free-trade-style globalization is desirable and even indispensable for countries the world over. Now comes the best riposte from the critics that I have seen. Readers who are leery of open-market orthodoxy will rejoice at the cogency of Bad Samaritans. Ha-Joon Chang has the credentials -- he&amp;#039;s on the economics faculty at Cambridge University -- and the storytelling skill to make a well-informed, engaging case against the dogma propagated by globalization&amp;#039;s cheerleaders. Believers in free trade will find that the book forces them to recalibrate and maybe even backpedal a bit.\n\nI doubt, however, that the book will win many converts -- and it shouldn&amp;#039;t. That&amp;#039;s because Chang goes way overboard in advancing his central argument, which is that poor countries can get rich only by doing pretty much the exact opposite of what they are told by the World Bank, the International Monetary Fund and the World Trade Organization -- the &quot;bad&quot; Samaritans to which the title refers.\n\nChang&amp;#039;s model for development is one he grew up in, the South Korean miracle of the 1960s, &amp;#039;70s and &amp;#039;80s. He describes in evocative terms the poverty of his parents&amp;#039; generation, the deprivations of his boyhood (no flush toilet in the family home, for example, even though his father was an elite civil servant) and the high-tech luxuries that today&amp;#039;s Koreans take for granted.\n\nIn the process of achieving this breathtakingly rapid improvement in living standards, he notes, South Korea departed dramatically from free-market principles. The country set up high barriers to protect its fledgling industries, such as steel and autos, and offered subsidies to help promising firms flourish. Other Asian countries, notably Japan and Taiwan, developed in similar ways.\n\nThe dirty secret of capitalism, as Chang explains, is that much the same is true of the modern industrial economies of the West, including Britain and the United States. Although advocates of free trade typically extol the British as the pioneers of open markets, London lowered tariffs in the mid-19th century only after its industries had firmly established their lead over rivals. Likewise, U.S. tariffs remained high throughout America&amp;#039;s industrialization. So why, Chang asks, should today&amp;#039;s poor nations be required to develop differently?\n\nChang acknowledges that &quot;the mere co-existence of protectionism and economic development does not prove that the former caused the latter.&quot; But, he asserts, &quot;Free trade economists have to explain how free trade can be an explanation for the economic success of today&amp;#039;s rich countries, when it simply had not been practiced very much before they became rich.&quot; A fair point, and Chang scores some more when he recounts the widespread unemployment and subpar growth that occurred in countries such as Mexico and Ivory Coast after their governments, under pressure from the &quot;bad Samaritans,&quot; lowered barriers that were sheltering their industries.\n\nBut were the Samaritans &quot;bad&quot; to prescribe such policies? Consider Zambia, a country I visited recently, which followed World Bank advice in the 1990s to open its markets to foreign clothing. Unfortunately, the local industry was woefully uncompetitive, having survived in a protected market by selling shoddy, expensive apparel to the local population and showing no sign of success at exporting. So it quickly collapsed amid a flood of imports, resulting in 10,000 lost jobs. Sad as that was for the workers, millions of Zambians can now afford decent clothing (much of which is used and has been donated by Americans to various organizations, shipped to Africa in bulk and sold cheaply by street vendors). That&amp;#039;s probably a very good trade-off for the poor. Did it help put Zambia on the path to prosperity? No, and for that the World Bank should be embarrassed -- for being overoptimistic Samaritans, not bad ones.\n\nChang counters that short-term benefits such as cheaper clothing should be sacrificed for the sake of long-term development. That means nurturing manufacturers with long periods of protection and subsidies, like the 30 years Toyota got in Japan. He insists that this approach can work even in destitute countries. &quot;A backyard motor repair shop in [Mozambique&amp;#039;s capital] Maputo simply cannot produce a Beetle, even if Volkswagen were to give it all the necessary drawings and instruction manuals,&quot; he writes. &quot;But this does not mean that Mozambicans should not produce something like a Beetle -- one day. . . . After all, a backyard auto repair shop is exactly how the famous Korean car maker, Hyundai, started in the 1940s.&quot;\n\nLamentably, the book gives short shrift to the debacles that show the pitfalls of industrial planning. India&amp;#039;s experience in the 1950s and &amp;#039;60s was a revealing example; its poor are still paying a dreadful price for the government&amp;#039;s excessive investment in steel plants, fancy hospitals and universities instead of elementary schools and small clinics. Chang also glosses over the objection that industrial planning is doomed to fail in countries lacking the strengths that Japan, Korea and Taiwan had -- well-educated populations and talented, mostly incorruptible civil servants.\n\nIronically, in an incisive chapter on privatization, he cites the poor training and low ethical standards among government officials in many developing countries as a good reason to avoid selling off state enterprises that will require effective regulation. &quot;Privatization sometimes works well, but can be a recipe for disaster, especially in developing countries that lack the necessary regulatory capabilities,&quot; he writes. Well, if such governments can&amp;#039;t regulate properly, how can they successfully oversee the creation of world-class auto industries?\n\nChang&amp;#039;s book deserves a wide readership for illuminating the need for humility about the virtues of private markets and free trade, especially in the developing world. But heaven help Mozambique if the book is taken too seriously in Maputo. \n\n\n\n\n9 MP3&amp;#039;s, 9hrs 15 min @ 48kbps","torrent":{"xt":"urn:btih:968a621a892dcd7e7715ae08394a94ce03d123ec","amp;dn":"Bad+Samaritans+-+The+Myth+of+Free+Trade+and+the+Secret+History+o","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"968a621a892dcd7e7715ae08394a94ce03d123ec","infoHashBuffer":{"type":"Buffer","data":[150,138,98,26,137,45,205,126,119,21,174,8,57,74,148,206,3,209,35,236]},"announce":[],"urlList":[]}}