{"title":"Rascal Flatts - Bless The Broken Road","uid":4827253,"size":130183172,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:969ffbfccc8aeedcef80f929112596d6f0624d44&amp;dn=Rascal+Flatts+-+Bless+The+Broken+Road&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"2nafish","files":-1,"time":1238994941,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Bless the Broken Road&quot; is the title a song that has been recorded by several American country music artists. It was co-written by Marcus Hummon and members of the country music group Nitty Gritty Dirt Band in 1994, and recorded by Hummon a year later. Since then, Melodie Crittenden, Sons of the Desert, Geoff Moore, Selah, and Rascal Flatts have all recorded the song as well. Of the multiple versions that exist, Rascal Flatts' version is the highest-charting, becoming a Number One hit on the Billboard country music charts in 2005 and earning the songwriters a Grammy Award for Best Country Song.\n\n&quot;Bless the Broken Road&quot; is a mid-tempo ballad. Both Marcus Hummon's rendition and the Rascal Flatts version feature similar instrumentation, backed largely by piano, with the Rascal Flatts also containing a mandolin. The lyric centralizes on the narrator, who describes the various attempts to find his lover, having experienced heartbreak before finally finding her. He explains in the chorus, &quot;God blessed the broken road / That led me straight to you&quot;.\n\nCo-written by Marcus Hummon, Jeff Hanna, and Bobby Boyd, &quot;Bless the Broken Road&quot; was originally recorded by the Nitty Gritty Dirt Band on their 1994 album Acoustic. One year later, Hummon covered the song for his debut album All in Good Time.\n\nThe first version to be released as a single was released in 1998 by Melodie Crittenden under the title &quot;Broken Road&quot;. This version was a #42 single on the Billboard Hot Country Singles &amp; Tracks (now Hot Country Songs) charts. The same year, country band Sons of the Desert recorded their own version of the song, for a planned second album for Epic Records. This album, however, was not released, due to a dispute between the band and their label. One year later, Geoff Moore recorded the song as well.\n\nThe highest-charting rendition is by the country music group Rascal Flatts, who cut the song for their Feels Like Today album. Released in 2005, their version spent five weeks at Number One on the Hot Country Singles &amp; Tracks charts. It also won a Grammy Award for Best Country Song. That same year, Crittenden recorded the song a second time, as a member of the Christian group Selah. This version was a Top Five hit on the Billboard Hot Christian Songs charts.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:969ffbfccc8aeedcef80f929112596d6f0624d44","amp;dn":"Rascal+Flatts+-+Bless+The+Broken+Road","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"969ffbfccc8aeedcef80f929112596d6f0624d44","infoHashBuffer":{"type":"Buffer","data":[150,159,251,252,204,138,238,220,239,128,249,41,17,37,150,214,240,98,77,68]},"announce":[],"urlList":[]}}