{"title":"Himmlers Black Order 1923-45","uid":8588415,"size":120416983,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:971442ede02a1118da1f13de05df1d9be0fe43e1&amp;dn=Himmlers+Black+Order+1923-45&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Djofullinn","files":1,"time":1371582663,"description":"The popular mythology of the SS has a clouded story which is so complicated as to almost defy belief: a tale of intrigue and nepotism, of archeology and Teutonism, of art and symbolism. The story of &quot;Himmler's Black Order&quot; is one of an organisation led by a man motivated by the belief that he was the spiritual reincarnation of the Saxon King Heinrich I, founder of the German Reich. It is the story of street fighters and convicted criminals becoming Ministers of State and police commanders; the story of charitable works and mass extermination being administered from the same building; the story of boy generals directing vast heterogeneous armies on devastating campaigns of conquest. Here, indeed, fact is stranger than fiction. This book covers in detail the origins, development and organisation of both the Waffen-SS and the Allemeine-SS. The latter has been sorely neglected in post-war literature, yet it was the real body of the SS from which the more famous branches grew. The wide-ranging effects which the SS had on the police, racial policies, German history, education, the economy and public life are all described. Sections are also devoted to uniforms and regalia which were carefully designed to set Himmler's men apart as a new elite in Third Reich society. The SS at war is considered, and a balance struck between the substantial battlefield achievements of the Waffen-SS and the atrocities of SS and police forces in the occupied territories. The little-known story of the Germanic-SS, staffed by foreigners in Western Europe, is also related.\n &lt;a href=&quot;\nhttp://www.amazon.com/Himmlers-Black-Order-1923-45-Lumsden/dp/0750940506/ref=sr_1_fkmr0_1?ie=UTF8&amp;qid=1371573516&amp;sr=8-1-fkmr0&amp;keywords=himmler%C2%B4s+black+order+lumsden&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Himmlers-Black-Order-1923-45-Lumsden/dp/0750940506/ref=sr_1_fkmr0_1?ie=UTF8&amp;qid=1371573516&amp;sr=8-1-fkmr0&amp;keywords=himmler%C2%B4s+black+order+lumsden&lt;/a&gt;","torrent":{"xt":"urn:btih:971442ede02a1118da1f13de05df1d9be0fe43e1","amp;dn":"Himmlers+Black+Order+1923-45","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"971442ede02a1118da1f13de05df1d9be0fe43e1","infoHashBuffer":{"type":"Buffer","data":[151,20,66,237,224,42,17,24,218,31,19,222,5,223,29,155,224,254,67,225]},"announce":[],"urlList":[]}}