{"title":"QuikQuak.RaySpace.AU.VST.v2.90.incl.KeyGen.UB.OSX.READ.NFO-NEMES","uid":3949186,"size":18742862,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:972b793e19a29e5410e537add10041bf13d4f4d6&amp;dn=QuikQuak.RaySpace.AU.VST.v2.90.incl.KeyGen.UB.OSX.READ.NFO-NEMES&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"profetas","files":178,"time":1198723892,"description":"  RaySpace is a completely new acoustic room simulator. This unique reverb \n  creates up to five channels of surround-sound reverb, all calculated in \n  real-time. The characteristics of the room shape, height, positions and \n  materials can all be adjusted while you listen, making RaySpace a very \n  inspirational and spontaneous tool. All reflections are modelled, not \n  just early reflections, and are calculated with speed-of-sound accuracy. \n  The 3D view and the parametric equaliser complete the audio and visual \n  feedback of room designs! With full automation, source and listener \n  positions can be &amp;#039;walked&amp;#039; though the rooms, ideal for patching dialogue \n  in radio plays or films. All impulse responses can be exported in high \n  resolution for use in convolution reverbs. From concert halls to \n  bathrooms, cathedrals to sewers, you can go anywhere you desire!\n\n  How does it work?\n  DBT (Diffuse Bubble Tracing) is a highly efficient algorithm that \n  analyses the entire room in a fraction of a second. It traces &amp;#039;bubbles&amp;#039; \n  at the speed of sound, bouncing off the walls until they hit the \n  listener. The angle they hit determines the pan and surround position \n  they play from. With hundreds of these sound bubbles the listener is \n  immersed in an incredibly rich environment.\n\n  Shall we play?\n  With the ability to draw any shape room you like, there are millions of \n  different reverbs to be made! Have the sound playing as you draw, and \n  listen to the room taking shape. Change the wall absorbency and \n  scattering to simulate different materials from highly dampened and \n  rough, to very bright and shiny. Use the 3D view to spin and pan around \n  your room, adjusting the height as you go. The four band parametric EQ \n  can alter the returned sound immensely, creating just the right tone \n  for your track. All good fun, with a serious result, with a great sound \n  and a decent price.\n  Check out the demos!!!","torrent":{"xt":"urn:btih:972b793e19a29e5410e537add10041bf13d4f4d6","amp;dn":"QuikQuak.RaySpace.AU.VST.v2.90.incl.KeyGen.UB.OSX.READ.NFO-NEMES","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"972b793e19a29e5410e537add10041bf13d4f4d6","infoHashBuffer":{"type":"Buffer","data":[151,43,121,62,25,162,158,84,16,229,55,173,209,0,65,191,19,212,244,214]},"announce":[],"urlList":[]}}