{"title":"Dave Barrys History of the Millennium","uid":5624199,"size":259062709,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:97b0e2b5d5767e91002e636420f926e2dced363a&amp;dn=Dave+Barrys+History+of+the+Millennium&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"g-roid","files":-1,"time":1276406854,"description":"Dave Barry\nDave Barry's History of the Millennium\n\nRead by: Patrick Frederic\n\nA brilliantly funny exploration of the tumultuous years just past, from the Pulitzer Prize-winning humorist.\n \nThucydides, Gibbon, Tuchman, McCullough-to the names of the world's great historians must now be added that of Dave Barry, who has taken a long, hard look at our new millennium (so far) and, when he stopped hyperventilating, written it all down, because nobody would believe it otherwise.\n \nIn November 2000, the skies darken over Florida as hundreds of thousands of lawyers parachute into the state, while in 2002, the federal budget surplus mysteriously disappears (&quot;Everybody looks high and low for it, but the darned thing is GONE!&quot;). In April 2003, no WMD have been found, but investigators do discover three barrels of lard, described by U.S. intelligence analysts as &quot;a heart attack waiting to happen,&quot; while in 2004, an already troubled nation receives an even greater blow: the sight of Janet Jackson's nipple. In 2005, Katrina, Cindy, Harriet, Martha, Paris, Michael Jackson-women just got crazy that year-while in November 2006 ... well, something happened, it'll come back to us.\n \nPLUS, an added bonus-Dave Barry's complete history of the millennium so recently (and unlamentedly) gone: Crusaders! Vikings! Peter Minuit's purchase of Manhattan for $24, plus $167,000 a month in maintenance fees!\n\nFilled with facts and commentary that will amaze your friends and confound your enemies (yes, we mean you, Osama!), this is the book that will finally earn Dave Barry his second Pulitzer Prize. And about darned time, too.\n\nAmong Dave Barry's recent bestselling books are his novels &quot;Big Trouble&quot; and &quot;Tricky Business&quot;; the nonfiction &quot;Dave Barry's Money Secrets&quot;; the two Peter Pan prequels, written with Ridley Pearson, &quot;Peter and the Starcatchers&quot; and &quot;Peter and the Shadow Thieves&quot;; and his Christmas story &quot;The Shepherd, the Angel and Walter the Christmas Miracle Dog&quot;. Barry lives in Coral Gables, Florida. Visit his website at: www.davebarry.com \n\nPatrick Frederic's career includes guest appearances on &quot;Chappelle's Show&quot; as well as the father in Jack Handey's series of short films, &quot;Fuzzy Memories&quot;, for &quot;Saturday Night Live&quot;. His voice can be heard on the animated TV series &quot;Daria and Celebrity Deathmatch&quot;.\n \nApproximately 4.5 hours, from 4 CDs at 128 kbps in MP3 format. \n","torrent":{"xt":"urn:btih:97b0e2b5d5767e91002e636420f926e2dced363a","amp;dn":"Dave+Barrys+History+of+the+Millennium","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97b0e2b5d5767e91002e636420f926e2dced363a","infoHashBuffer":{"type":"Buffer","data":[151,176,226,181,213,118,126,145,0,46,99,100,32,249,38,226,220,237,54,58]},"announce":[],"urlList":[]}}