{"title":"Singin in the Rain [DVD5 - Eng Fra Ita - MultiSub] TNT Village","uid":6429048,"size":4418502656,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:97c321d87753831704f11261d0e6d53f7876e438&amp;dn=Singin+in+the+Rain+%5BDVD5+-+Eng+Fra+Ita+-+MultiSub%5D+TNT+Village&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"l.diliberto","files":11,"time":1306578880,"description":"Singin in the Rain [DVD5 - Eng Fra Ita - MultiSub] TNT Village\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=253173&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=253173&lt;/a&gt;\n\n.: Plot :.\n\nDon Lockwood (Gene Kelly) is a popular silent film star with humble roots as a singer, dancer and stunt man. Don barely tolerates his vapid, shallow leading lady, Lina Lamont (Jean Hagen), though their studio, Monumental Pictures, links them romantically to increase their popularity. Lina herself is convinced they are in love, despite Don's protestations otherwise.\nOne day, to escape from overenthusiastic fans, Don jumps into a passing car driven by Kathy Selden (Debbie Reynolds). She drops him off, but not before claiming to be a stage actress and sneering at his undignified accomplishments. At first, she pretends not to know who he is, but later in the film, she admits that she knew who he was all along and is also a big fan. Later, at a party, the head of Don's studio, R.F. Simpson (Millard Mitchell), shows a short demonstration of a Vitaphone talking picture (&quot;...My voice has been recorded on a record...&quot;) which pays homage to the original 1921 DeForest Phonofilm demonstration featuring DeForest himself explaining the system, but his guests are unimpressed. To Don's amusement and Kathy's embarrassment, she pops out of a mock cake right in front of him as part of the entertainment; Kathy, it turns out, is only a chorus girl. Furious at Don's teasing, she throws a real cake at him, only to hit Lina right in the face. Later, after weeks of searching, Don makes up with Kathy after he finds her working in another Monumental Pictures production, and they begin to fall in love.\nAfter a rival studio has an enormous hit with its first talking picture, 1927's The Jazz Singer, R.F. decides he has no choice but to convert the new Lockwood and Lamont film, The Dueling Cavalier, into a talkie. The production is beset with difficulties that reportedly reflect what actually took place during the early days of talking pictures. By far the worst problem is Lina's grating voice........ \n\n.: Trama :.\n\nIl film ÃƒÂ¨ ambientato alla fine degli anni Venti, nel periodo di passaggio dal cinema muto al sonoro. L'attore Don Lockwood, acclamata star del muto, con un passato di ballerino, musicista e stuntman, non sopporta la propria partner sullo schermo, la bionda e svampita Lina Lamont. Il successo dei primi film sonori costringe R.F. Simpson, il produttore della Monumental Pictures, a trasformare &quot;The dueling Cavalier&quot;, l'ultimo film della coppia, in un film parlato, ma l'idea si rivela impraticabile a causa del tono di voce gracchiante e fastidioso di Lina.\nDopo uno screen test fallimentare, il ballerino Cosmo Brown, il migliore amico di Don, suggerisce di trasformare il film in un musical, &quot;The dancing Cavalier&quot;, nel quale Lina verrebbe doppiata dalla giovane attrice e cantante Kathy Selden, di cui Don si ÃƒÂ¨ nel frattempo innamorato........\n\n.: Cover :.\n &lt;a href=&quot;\nhttp://img35.imageshack.us/img35/7621/cantandosottolapioggia.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img35.imageshack.us/img35/7621/cantandosottolapioggia.jpg&lt;/a&gt;\n\n.: Crediti :.\n\nCountry: United States\nYear: 1952\nGenre: musical\nProducer: Arthur Freed\nPhotography: Harold Rosson\nDirector: Gene Kelly, Stanley Donen\nSubject &amp; Screenplay: Adolph Green, Betty Comden\nMusic: Nacio Herb Brown, Roger Edens, Al Goodhart, Al Hoffman\n\nStarring: Gene Kelly\nDonald O'Connor\nDebbie Reynolds\nJean Hagen\nMillard Mitchell \n\n0=============================0\n\n.: Caratteristiche del DVD :.\n\nMovie length: About 98 min\nLanguages: (Mono) English, Francais, Italiano\nSubtitles: English, French, Italian, Dutch, Arabic, Spanish, Portuguese, German, Romanian, Bulgarian, English for deaf people, italiano per non udenti\nVideo Format: 4:3, 1.33:1\nCompression: none, nessuna\nPrograms used: DVDFab 7.0.7.0\nStructure: menu, movie","torrent":{"xt":"urn:btih:97c321d87753831704f11261d0e6d53f7876e438","amp;dn":"Singin+in+the+Rain+%5BDVD5+-+Eng+Fra+Ita+-+MultiSub%5D+TNT+Village","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97c321d87753831704f11261d0e6d53f7876e438","infoHashBuffer":{"type":"Buffer","data":[151,195,33,216,119,83,131,23,4,241,18,97,208,230,213,63,120,118,228,56]},"announce":[],"urlList":[]}}