{"title":"Leonard Cohen-Songs from the Road (2010) DVD9(multi subs) NLT-Re","uid":6060146,"size":6031530517,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:97cd11554984bef81be6fadfec41106251eb6e23&amp;dn=Leonard+Cohen-Songs+from+the+Road+%282010%29+DVD9%28multi+subs%29+NLT-Re&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Nlt-Release-XX-Men","files":-1,"time":1293087302,"description":"Leonard Cohen-Songs from the Road (2010) DVD9(multi subs) NLT-Release\n\n[img]http://img138.imageshack.us/img138/4279/leonardcohena.jpg[/img]\n\nLeonard Cohen is een Canadese dichter, folksinger songwriter en schrijver. \n\nHij is vooral bekend door hits als Suzanne, Hallelujah, en So Long, \n\nMarianne. \nCohen werd geboren in een Joods middenklassegezin in MontrÃƒÆ’Ã‚Â©al. Als tiener leerde hij gitaar spelen en formeerde een country/folkgroep genaamd the \nBuckskin Boys. Hij studeerde letteren aan de McGill-universiteit met als \ndoel dichter te worden en debuteerde in 1956 met Let Us Compare Mythologies.\nReeds in 1961 was hij in Canadese poÃƒÆ’Ã‚Â«ziekringen een bekende naam. In 1967 \nverhuisde Cohen naar de Verenigde Staten, waar hij een reputatie als \nsinger-songwriter vestigde. Cohen is in 2008 opgenomen in de Rock and Roll \nHall of Fame.Songs From The Road is een verzameling van de meest memorabele momenten van Leonard Cohen's eerste tour sinds 15 jaar! Het album bevat 12 bijzondere livetracks die zijn opgenomen op verschillende lokaties over de hele wereld. \nExtra:\nDeze DVD versie bevat naast de 12 livetracks ook exclusief bonusmateriaal. \nDit materiaal bestaat uit een 20 minuten durende backstage opname met onder \nandere interviews met alle bandleden. De interviews zijn afgenomen door \nLorca Cohen, de dochter van Leonard.\n****************************************************************\n\nLeonard Cohen is a Canadian poet, folk singer songwriter and writer. He is \nbest known for hits such as Suzanne, Hallelujah and So Long, Marianne.Cohen was born into a Jewish middle class family in Montreal. As a teenager he learned to play guitar and formed a country / folk group called the Buckskin Boys. He studied literature at McGill University in order to become a poet and debuted in 1956 with Let Us Compare Mythologies. Already in 1961 he was a familiar name Canadian poetry circles. In 1967 Cohen moved to the United States, where he was an established reputation as a singer-songwriter. Cohen in 2008 included in the Rock and Roll Hall of Fame.Songs From The Road is a collection of the most memorable moments of Leonard Cohen's first tour since 15 years! The album contains 12 special live tracks recorded at various locations around the world.\nExtra:\nThis DVD version contains the 12 live tracks along with exclusive bonus material. This material consists of a 20-minute recording with backstage interviews with all band members. The interviews were conducted by Lorca Cohen, the daughter of Leonard.\n\nTracklist:\n01. Lover, Lover, Lover (Ramat Gan Stadium, Tel Aviv, Israel, September 24, \n\n2009)\n02. Bird On The Wire (Clyde Auditorium, Glasgow, Scotland, November 6, 2008)\n03. Chelsea Hotel (Royal Albert Hall, London, England, November 17, 2008)\n04. Heart With No Companion (Oberhausen Arena, Oberhausen, Germany, November \n\n2, 2008)\n05. That Don't Make It Junk (O2 Arena, London, England, November 13, 2008)\n06. Waiting For The Miracle (Hp Pavilion, San Jose, California, November 13, \n\n2009)\n07. Avalanche (Gothenburg Scandinavium, Gothenburg, Sweden, October 12, \n\n2008)\n08. Suzanne (Mena Arena, Manchester, England, November 30, 2008)\n09. The Partisan (Hartwall Arena, Helsinki, Finland, October 10, 2008)\n10. Famous Blue Raincoat (O2 Arena, London, England, November 13, 2008)\n11. Hallelujah (Coachella Music Festival, Indio, California, April 17, 2009)\n12. Closing Time (John Labatt Centre, London, Ontario, May 24, 2009)\nSony Legacy\nMuziek\n92 minuten\n\nBron: Retail \nTaal: Engels\nBeeldformaat: 1.78:1 / Anamorphic\nAudio: DD5.1 / DD2.0 / PCM \nOndertitels: Nederlands, Engels, Frans, en anders \n\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD9 \nBron : Retail\n \nOndertitels : Anders\nNederlands (instelbaar)\nEngels (instelbaar)\n \nGenre : Muziek\n \nWeblink : http://www.leonardcohen.com/ \n\nVoor de nieuwste films en muziek ga je naar NLT.Ons-Forum het forum voor de \n\nNederlands Ondertitelde Torrents:\nhttp://www.nlt.ons-forum.nl\n\nEnjoy the music\n\nBy XX-Men\n\n","torrent":{"xt":"urn:btih:97cd11554984bef81be6fadfec41106251eb6e23","amp;dn":"Leonard+Cohen-Songs+from+the+Road+%282010%29+DVD9%28multi+subs%29+NLT-Re","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97cd11554984bef81be6fadfec41106251eb6e23","infoHashBuffer":{"type":"Buffer","data":[151,205,17,85,73,132,190,248,27,230,250,223,236,65,16,98,81,235,110,35]},"announce":[],"urlList":[]}}