{"title":"The F Word (2005) Season 1","uid":3765611,"size":4002074624,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:987fa48bc5b4a3a711dc1c96b0952dc4efc9d565&amp;dn=The+F+Word+%282005%29+Season+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"tyler_jet","files":9,"time":1186502853,"description":"Each episode is centred on Ramsay preparing a three-course meal at the F-Word restaurant for 50 guests.The theme tune for the show is the F-word by babybird The Times&amp;#039; restaurant critic Giles Coren acts as a field correspondent. Food writer Rachel Cooke also provides several reports on healthy eating. Regular segments within an episode include:\n\nConversation with celebrity diners like Sharon Osbourne, Martine McCutcheon, Joan Collins, and Jonathan Ross. Ramsay often invited them into the kitchen to learn a recipe or cooking skill. \nTwo (or three) commis squaring off to earn a position at one of Ramsay&amp;#039;s restaurants. 12 commis chefs appeared in the series out of a thousand applicants. \nRamsay raised turkeys in his garden, so that his children gained a better understanding of where their food came from. Chef and television presenter Hugh Fearnley-Whittingstall regularly offered tips on raising free range turkeys. The turkeys were named after other celebrity chefs, for example, Ainsley, Antony and Nigella. \nAs part of the &quot;Get Women Back in the Kitchen&quot; campaign, Ramsay visited several English households to help women who wanted to improve their culinary skills. \nPudding (dessert) challenge, usually between Ramsay and a celebrity guest. The winner had the honour of serving his or her pudding to the guests at the F-Word restaurant. \nGiles Coren and Rachel Cooke examined several food and restaurant related issues from male fertility to misleading packaging in supermarkets. Coren&amp;#039;s segments also featured him sampling more unusual foods such as squirrel meat and horse milk. ","torrent":{"xt":"urn:btih:987fa48bc5b4a3a711dc1c96b0952dc4efc9d565","amp;dn":"The+F+Word+%282005%29+Season+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"987fa48bc5b4a3a711dc1c96b0952dc4efc9d565","infoHashBuffer":{"type":"Buffer","data":[152,127,164,139,197,180,163,167,17,220,28,150,176,149,45,196,239,201,213,101]},"announce":[],"urlList":[]}}