{"title":"Rod Stewart-Maggie May(1971)-Wushan.avi","uid":4809074,"size":97161034,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:99f514fdb0fc9ffe33104cb77f17c6fbc924ece7&amp;dn=Rod+Stewart-Maggie+May%281971%29-Wushan.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"wushan","files":1,"time":1238307330,"description":"\n                                   Maggie May\n\n                             Single by Rod Stewart\n\n                   from the album Every Picture Tells a Story\n\n\n&quot;Maggie May&quot; is a song written by singer Rod Stewart and Martin Quittenton and recorded by Stewart in 1971 for his album Every Picture Tells A Story.\n\n&quot;Maggie May&quot; expresses the ambivalence and contradictory emotions of a young man involved in a relationship with an older woman, and is thought to have been written from Stewart's own experience.\n\nIn October 1971, the song went to number one in the UK and simultaneously topped the charts in the United States. Every Picture Tells a Story achieved the same status at the same time, a feat achieved by only a handful of performers, notably The Beatles, John Lennon, George Harrison, Paul McCartney, Simon and Garfunkel, and BeyoncÃƒÂ©.\n\nThe song was Stewart's first substantial hit as a solo performer and launched his solo career. It remains one of his best-known songs. A famous live performance of the song on Top of the Pops saw The Faces joined onstage by DJ John Peel, who pretended to play the mandolin. Stewart himself was amused by the song's success, saying, &quot;I still can't see how the single is such a big hit. It has no melody. Plenty of character and nice chords, but no melody\n\nThe song re-entered the UK charts in December 1976, but only reached number 31.\n\nIn 2004, Rolling Stone ranked the song #130 on their list of The 500 Greatest Songs of All Time.\n\n\n                            ***Maggie May.***\n\n\n                               Enjoy!!!","torrent":{"xt":"urn:btih:99f514fdb0fc9ffe33104cb77f17c6fbc924ece7","amp;dn":"Rod+Stewart-Maggie+May%281971%29-Wushan.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99f514fdb0fc9ffe33104cb77f17c6fbc924ece7","infoHashBuffer":{"type":"Buffer","data":[153,245,20,253,176,252,159,254,51,16,76,183,127,23,198,251,201,36,236,231]},"announce":[],"urlList":[]}}