{"title":"Gnomoria v0.9.7","uid":9640569,"size":177519376,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9a785c026302c4e1cbbb9310d4518de132cab634&amp;dn=Gnomoria+v0.9.7&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"karasyan1337","files":-1,"time":1392919987,"description":"Gnomoria is a sandbox village management game where you help lead a small group of gnomes, who have set out on their own, to thrive into a bustling kingdom! Anything you see can be broken down and rebuilt elsewhere. Craft items, build structures, set traps and dig deep underground in search of precious resources to help your gnomes survive the harsh lands. Build your kingdom and stockpile wealth to attract wandering gnomads to your cause, but be wary of also attracting enemies!\n\nKey Features:\n\n- Procedurally generated world - Every game is different\n- Fully destructible environment - Everything can be mined, dug, chopped and rebuilt or used for crafting\n- Open sandbox gameplay - Play how you want - manage a peaceful town or build up military and fend off invasions.\n- Crafting - Tons of items to craft at different workshops\n- Mechanisms - Construct elaborate contraptions using parts like hatches, levers, steam engines\n\nv0.9.7\nGeneral\nCorner walls are no longer required for privacy status\nTracked stock items - Create groups of items to track real time quantity on the HUD.  Groups can be created in the Tracked Items tab of the Stocks window. Previous Food and Drink quantities have been integrated into this method.\nKingdom and Stock windows are now resizable\nWindow position and sizes are stored in the settings.ini file to preserve window settings across multiple game sessions\nAlarm HUD element to indicate when your Kingdom is currently under alarm\nRemoved the pop up delay in the right click context menu\n\nFixed\nCrash sending a merchant to trade with items that are no longer available\nCrash viewing ambassador after he dies\nPersonal Quarters being considered &quot;not private&quot; after loading, forcing it to be redesignated to keep the ambassador\nDoors within a Personal Quarter but at the edge not being considered for privacy\nForeign Kingdoms getting into a state where it stopped sending merchants or ambassadors\n\nSystem requirements:\n\nOS: Windows XP, Vista, 7, 8\nProcessor: 2.0 GHz\nMemory: 1 GB\nHard Disk Space: 200 MB\nVideo Card: 128 MB Video Memory\nDirectX: 9.0c or Greater\n\nInstallation:\n\n1. Unzip\n2. Place Gnomoria folder anywhere on your drive\n3. PLAY!\n\nKeep in mind that XNA Framework 4.0 and .NET Framework 4.0 is NOT included!\nYou can help the developer and buy the game on steam here:    &lt;a href=&quot;\nhttp://store.steampowered.com/app/224500/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.steampowered.com/app/224500/&lt;/a&gt;\t\t","torrent":{"xt":"urn:btih:9a785c026302c4e1cbbb9310d4518de132cab634","amp;dn":"Gnomoria+v0.9.7","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a785c026302c4e1cbbb9310d4518de132cab634","infoHashBuffer":{"type":"Buffer","data":[154,120,92,2,99,2,196,225,203,187,147,16,212,81,141,225,50,202,182,52]},"announce":[],"urlList":[]}}