{"title":"Computing for Ordinary Mortals (2009) epub","uid":9924481,"size":1264906,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9ab7ca34ffdfb1b07fac6bd5f45b7b22567858b4&amp;dn=Computing+for+Ordinary+Mortals+%282009%29+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bookzilla","files":1,"time":1397044010,"description":"Computing isn't only (or even mostly) about hardware and software; it's also about the ideas behind the technology. In Computing for Ordinary Mortals, computer scientist Robert St. Amant explains this &quot;really interesting part&quot; of computing, introducing basic computing concepts and strategies in a way that readers without a technical background can understand and appreciate.\n\n Each of the chapters illustrates ideas from a different area of computing, and together they provide important insights into what drives the field as a whole. St. Amant starts off with an overview of basic concepts as well as a brief history of the earliest computers, and then he traces two different threads through the fabric of computing. One thread is practical, illuminating the architecture of a computer and showing how this architecture makes computation efficient. St. Amant shows us how to write down instructions so that a computer can accomplish specific tasks (programming), how the computer manages those tasks as it runs (in its operating system), and how computers can communicate with each other (over a network). The other thread is theoretical, describing how computers are, in the abstract, machines for solving problems. Some of these ideas are embedded in much of what we do as humans, and thus this discussion can also give us insight into our own daily activities, how we interact with other people, and in some cases even what's going on in our heads.\n","torrent":{"xt":"urn:btih:9ab7ca34ffdfb1b07fac6bd5f45b7b22567858b4","amp;dn":"Computing+for+Ordinary+Mortals+%282009%29+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ab7ca34ffdfb1b07fac6bd5f45b7b22567858b4","infoHashBuffer":{"type":"Buffer","data":[154,183,202,52,255,223,177,176,127,172,107,213,244,91,123,34,86,120,88,180]},"announce":[],"urlList":[]}}