{"title":"Women Who Become Men: Albanian Sworn Virgins","uid":11744629,"size":790020,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9abba36acbfa3a8fe807bbf0cc8f55fdb94084a2&amp;dn=Women+Who+Become+Men%3A+Albanian+Sworn+Virgins&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1425949240,"description":"Most people conceive of gender as a culturally informed response to a biological imperative. But such rigid notions are overturned by certain women in remote regions of Albania who elect to 'become' men simply for the advantages that accrue to them as a result. They crop their hair, wear men's clothes, roll their own cigarettes, drink brandy and carry guns. In short, their lives are much freer and less regimented than other members of their sex - but at a cost. These women must foreswear sexual relationships, marriage and children. They have been dubbed 'Sworn Virgins'.\n\nWhat is interesting is that in this region of the Balkans, simply to dress as a man and to behave as a man will earn these women the same respect accorded a man. This is no mean advantage in an area known for sexual inequality and where so many men have suffered violent, premature deaths, thereby heightening the need for more household heads. Traditionally as heads of household, men are revered and the women who attend them utterly subservient. But unlike 'normal' women, Sworn Virgins can inherit and manage property, and, in fact, may even be raised to assume the male role by parents who have no male heirs.\n\nBased on extensive interviews, this book tells the frank and engrossing stories of these women, but also sets their lives within the wider context of a country undergoing radical upheaval and social transformation","torrent":{"xt":"urn:btih:9abba36acbfa3a8fe807bbf0cc8f55fdb94084a2","amp;dn":"Women+Who+Become+Men%3A+Albanian+Sworn+Virgins","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9abba36acbfa3a8fe807bbf0cc8f55fdb94084a2","infoHashBuffer":{"type":"Buffer","data":[154,187,163,106,203,250,58,143,232,7,187,240,204,143,85,253,185,64,132,162]},"announce":[],"urlList":[]}}