{"title":"Axialis Icon Workshop v.6.0 Corporate Edition (Retail) + serial","uid":3398256,"size":11127613,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9b077f656d480a416e3dafc68063929742a805c9&amp;dn=Axialis+Icon+Workshop+v.6.0+Corporate+Edition+%28Retail%29+%2B+serial&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"useros","files":1,"time":1129630543,"description":"Axialis Icon Workshop v.6.0 Corporate Edition (Retail)\n\n\nAxialis IconWorkshop is the first icon editor which permits to create Windows&amp;reg; and Macintosh&amp;reg; icons. You can easily create icons for both systems. IconWorkshop creates Windows&amp;reg; icons up to XP and Macintosh&amp;reg; icons up to 256x256 Tiger&amp;reg; (Mac OS 10.4).\n\nWindows&amp;reg; XP and Mac OSX come with a generations of icons using variable transparency. This feature permits to create beautiful icons with smooth borders and shadows. You need a professional tool to create such icons. Axialis IconWorkshop has been designed with one goal in mind: &quot;Icon Quality&quot;.\n\nEnjoy the powerful editor which permits to create the various image formats of an icon from an original drawing without quality loss.\n\n\nCreate attractive icons using Image Objects &amp;reg;\n\nThe first Axialis Object Pack for icons has been included in IconWorkshop. It is a library of 150 image objects which will permit you to create an unlimited number of icons with various glossy effects and shapes simply using drag &amp; drop.\n\nThe images come in 256x256 high-quality PNG format. It permits to easily create icons containing various sizes up to 256x256 for Windows XP&amp;reg;, Vista&amp;reg; and MacOS&amp;reg;.\n\n\nConvert icons between Macintosh&amp;reg; and Windows&amp;reg;\n\nMacintosh&amp;reg; designers are prolific, especially when it comes to icon creation. Use IconWorkshop to read Mac icons and convert them to Windows&amp;reg;. It reads all kind of Mac icons up to Tiger&amp;reg; (OSX 10.4).\n\nIf you're a software developer, you'll enjoy the ability to create applications for both Windows and Macintosh platforms by converting your icons. If you're simply a Windows user you'll be able to use Mac icons on your XP desktop.\n\nThis new version includes a feature which permits to convert icons between the two systems in batch-processing mode (several icons are converted in one fast operation).\n\nIconWorkshop fully supports MacBinary file format. It permits to easily transfer icons between Macintosh&amp;reg; and Windows&amp;reg;.\n\n\nAutomatically create icons from images\n\nAxialis IconWorkshop features a powerful editor. But sometimes it's easier to create an icon from an existing image. Basically, you can import all kind of existing images: PSD, PNG, BMP, JPEG, GIF...\n\nAn exclusive feature permits to create an icon, with its several image formats, in just one operation! All is done automatically: Alpha channel is preserved, palettes are calculated for 256 color formats and even 16 color formats with transparency are generated.\n\n\nExport icons to images to illustrate your applications\n\nIf you create applications, you know that images are required to create an attractive user interface. IconWorkshop permits to export any image included in an icon (Windows/Mac) to an external bitmap file. You'll be able to easily use these images in your program to create beautiful toolbars for example.\n\nUse a professional tool\n\nPowerful Editor\n\nIconWorkshop features an editor with advanced functions: Easily create images formats using one command, import/export images, resize, ajust with numerous filters, change hue, contrast, lightness, drop shadows and more...\n\nCreate composite icons using drag &amp; drop\n\nAn exclusive feature permits to create composite icons using mouse drag &amp; drop only. Just place your different objects in the icon using the mouse and create all the image formats in a snap!\n\nIntegrated workspace\n\nIconWorkshop features a fully integrated workspace. This is the way today's professional applications are made. Additionally it has been developped in C++ using Microsoft&amp;reg; MFC which is the industry standard in software engineering. It results in a fast and strong-coded application.\n\nSome icon software available today are made of several programs resulting in applications which are difficult to use. In IconWorkshop, all features are immediately available on screen. It permits you to work efficiently and be more productive than ever. The multi-documents interface permits you to work with several and different types of document windows (icon projects, libraries, images, file explorers...).\n\nAdvanced Help\n\nAn exhaustive help system has been implemented including getting started lessons, how-to procedures and the reference manual. Also a contextual help permits to get help when using dialog boxes.\n\nCompatible with graphic industry standards\n\nYou can import PSD images with layers from Photoshop&amp;reg; and easily create a multi-resolution icon from a program or company logo.\n\nNow use a Photoshop plug-in to transfer images directly in memory and make your icon in a few clicks. No more temporary PSD file.\n\nBatch Procedures\n\nNumerous batch procedures have been implemented in IconWorkshop to automatically perform operations on a large number of files. For example, you can create icons from a set of PNG files (ICO files are created). You can also automatically convert several icons between Macintosh&amp;reg; and Windows&amp;reg; OS in seconds.\n\nLibrarian &amp; Explorer with previews\n\nUse a powerful librarian to easily manage all your media and icon files. This is a dockable window (which can be hidden) where you can store, move, copy and extract all the files you're using in your work (images, icons, libraries).\n\nAlso, A built-in file explorer permits to browse your disks and find files including images and all files containing icons. This advanced explorer permits to display files in thumbnail mode. By a simple click you open any file in a viewer or editor window","torrent":{"xt":"urn:btih:9b077f656d480a416e3dafc68063929742a805c9","amp;dn":"Axialis+Icon+Workshop+v.6.0+Corporate+Edition+%28Retail%29+%2B+serial","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b077f656d480a416e3dafc68063929742a805c9","infoHashBuffer":{"type":"Buffer","data":[155,7,127,101,109,72,10,65,110,61,175,198,128,99,146,151,66,168,5,201]},"announce":[],"urlList":[]}}