{"title":"Soda Stereo - Signos (1986) WMA320","uid":6112375,"size":100894116,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9b0fdc00edb1a05362d1472c83d61e8020cc768f&amp;dn=Soda+Stereo+-+Signos+%281986%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"MARCELODRGZ","files":-1,"time":1295408253,"description":"A fines de 1986 Soda Stereo realizÃƒÂ³ su primera gira latinoamericana, llamada Gira Signos, aÃƒÂºn dentro de la presentaciÃƒÂ³n de Nada Personal. La banda se presentÃƒÂ³ en Colombia (6-7-9-18 de noviembre en BogotÃƒÂ¡ y 8 de noviembre en MedellÃƒÂ­n), PerÃƒÂº (14-15-16 de noviembre en Lima, 12 de noviembre en Arequipa y 13 de noviembre en Trujillo) y Chile, con los temas de Nada Personal y con un ÃƒÂ©xito considerable. Por entonces el rock latino tenÃƒÂ­a escasa adhesiÃƒÂ³n entre los jÃƒÂ³venes de AmÃƒÂ©rica Latina (con la ÃƒÂºnica excepciÃƒÂ³n de Argentina y Uruguay) y las bandas de cada paÃƒÂ­s no acostumbraban realizar giras internacionales.\n\nEl ÃƒÂ©xito fue especialmente masivo en Chile, donde realizaron cuatro recitales en Santiago (21-23-24-25 de noviembre) y uno en ValparaÃƒÂ­so (22 de noviembre), durante la dictadura de Augusto Pinochet. Un testigo los recuerda asÃƒÂ­:\n\nRecuerdo casi como si hubiera sido ayer ese dÃƒÂ­a, noviembre 25 de 1986. En esa ÃƒÂ©poca los conciertos se hacÃƒÂ­an los dÃƒÂ­as viernes o sÃƒÂ¡bados. Viernes era ese dÃƒÂ­a. HacÃƒÂ­a un calor de mierda, y la fila para entrar el estadio iba ya en cuatro cuadras. Con mi mejor pantalÃƒÂ³n Smile amasado y mis Plumas del color de moda, me fumaba un Advance corto que compartÃƒÂ­amos con mi primo y un compaÃƒÂ±ero de curso, con parÃƒÂ¡ de cancheros buscando alguna mina pa' engrupir. A las 19 se abriÃƒÂ³ el estadio y empezamos a entrar. Una mina nos pidiÃƒÂ³ que la dejÃƒÂ¡ramos colarse que andaba con dos amigas,  !!!listo tres pa' tres!!!, y nos cambiÃƒÂ¡bamos cigarros. Todos tenÃƒÂ­amos galerÃƒÂ­a y quedamos inmediatamente arriba del escenario. Adentro, los vendedores trataban de pasar con la bandeja llena de vasos de Free, tarea casi imposible. Era el segundo de los Free Concert, el primero habÃƒÂ­a sido G.I.T., pero nada se comparaba con la efervescencia que llenaba el entonces Estadio Chile. Se apagaron las luces y a las 20:30, Gustavo, Zeta y Charly, comenzaban a tocar. CrÃƒÂ©anme que fue increÃƒÂ­ble.\nCerati cuenta la historia desde su propio punto de vista:\n\nEl caso de Chile fue muy sorpresivo, porque vinimos dos o tres meses antes de tocar por primera vez, y lo que ocurriÃƒÂ³ en ese tiempo fue tremendo. Incluso antes de ViÃƒÂ±a del Mar (en febrero el 87), que fue como la explosiÃƒÂ³n final. Para nosotros era muy interesante porque era la primera vez que salÃƒÂ­amos del paÃƒÂ­s. En Argentina la cosa fue mucho mÃƒÂ¡s progresiva, tocamos en muchos lugares y vivimos la escena under. Luego de Chile estÃƒÂ¡bamos muy felices, porque querÃƒÂ­amos la fama, vender muchos discos y creÃƒÂ­amos que ÃƒÂ©ramos el mejor grupo del mundo. En el fondo es muy raro no poder salir del hotel y toda esa locura, uno pensaba que estaba viviendo como una pelÃƒÂ­cula de Los Beatles, y nos divertÃƒÂ­amos.\nEn PerÃƒÂº el grupo tambiÃƒÂ©n obtuvo un ÃƒÂ©xito sorprendente para una banda de rock:\n\nEn noviembre de 1986 Soda Stereo llegÃƒÂ³ a PerÃƒÂº por primera vez y revolucionÃƒÂ³ el mercado. Sus ventas fueron enormes y sus (tres) presentaciones en el Coliseo Amauta, inolvidables. Aquella vez escuchÃƒÂ© gritos, chillidos, berridos y hasta gemidos. Vi llantos, desmayos e innumerables besos volados. Histeria colectiva creo que le llaman. Fue, verdaderamente, una locura sÃƒÂ³lo comparada a la de los Beatles en el Shea Stadium.[cita requerida]\nEl 10 de noviembre de 1986 la banda lanzÃƒÂ³ el tercer ÃƒÂ¡lbum, Signos (&quot;Persiana Americana&quot;, &quot;Signos&quot;). Fue un paso clave porque de la mano con el ÃƒÂ©xito creciente aumentaban las expectativas, las presiones, el riesgo de fracaso y las tensiones internas. En el disco el trÃƒÂ­o es acompaÃƒÂ±ado por FabiÃƒÂ¡n VÃƒÂ¶n Quintiero (teclados), Richard Coleman (guitarra) y Celsa Mel Gowland (coros). AdemÃƒÂ¡s, Ã‚Â«SignosÃ‚Â» fue el primer disco del rock argentino en editarse en compact disc. Fue fabricado en los PaÃƒÂ­ses Bajos y distribuido en toda LatinoamÃƒÂ©rica.\n\nEscribÃƒÂ­ todas las letras de un tirÃƒÂ³n. VivÃƒÂ­amos al palo, parecÃƒÂ­a que estÃƒÂ¡bamos lejos del arte y sin embargo fue uno de nuestros discos mÃƒÂ¡s profundos, quizÃƒÂ¡s porque no la estÃƒÂ¡bamos pasando bien. (Gustavo Cerati)\nYa dentro de la Gira Signos, el 3 de diciembre hicieron su primera presentaciÃƒÂ³n en Ecuador y el 9 y 10 de enero de 1987 en Uruguay (Punta del Este y Montevideo).\n\npor WIKIPEDIA\n\nTRACKLIST:\n\n01 - Sin Sobresaltos.wma                                         \n02 - El Rito.wma                                                 \n03 - Profugos.wma                                                \n04 - No Existes.wma                                              \n05 - Persiana Americana.wma                                      \n06 - En Camino.wma                                               \n07 - Signos.wma                                                  \n08 - Final Caja Negra.wma   \n\nWMA 320Kbps 44100Hz STEREO","torrent":{"xt":"urn:btih:9b0fdc00edb1a05362d1472c83d61e8020cc768f","amp;dn":"Soda+Stereo+-+Signos+%281986%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b0fdc00edb1a05362d1472c83d61e8020cc768f","infoHashBuffer":{"type":"Buffer","data":[155,15,220,0,237,177,160,83,98,209,71,44,131,214,30,128,32,204,118,143]},"announce":[],"urlList":[]}}