{"title":"Numeracy in Nursing and Healthcare{BBS}","uid":6768501,"size":18352064,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9b7592e5c779507df816c8cd5d10afaeb34cbea4&amp;dn=Numeracy+in+Nursing+and+Healthcare%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1319486562,"description":"Competency in Maths is essential for safe nursing practice; this is the only text to clearly explain Maths specifically for students in nursing and healthcare, expelling the tears and frustration that can be experienced whilst trying to grapple with the subject. The author has been teaching anatomy, physiology and pharmacology to nursing students for 25 years, and is well placed to understand the fears that students have when addressing numbers and maths. This text will help students to handle numbers confidently in the administration of drugs and other practice settings. Clinical examples will be used to illustrate the use of arithmetic and the student will be able to work at their own pace throughout. In addition to drug calculations, the text will allow students to feel confident in other practice settings such as: calculating the body mass index (BMI) of a patient, reading and interpreting a blood result back from the lab, interpreting demographic data, calculating the nutritional intake for a patient, and measuring a patient's blood pressure, pulse, and temperature. &quot;Shihab draws on her 25 years of teaching experience to provide a text devoted specifically to competency in the often-dreaded area of maths for student nurses.&quot; - THES, Feb 2010\nProduct Details\n\n    * Paperback: 234 pages\n    * Publisher: Prentice Hall (August 9, 2009)\n    * Language: English\n    * ISBN-10: 0273720740\n    * ISBN-13: 978-0273720744","torrent":{"xt":"urn:btih:9b7592e5c779507df816c8cd5d10afaeb34cbea4","amp;dn":"Numeracy+in+Nursing+and+Healthcare%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b7592e5c779507df816c8cd5d10afaeb34cbea4","infoHashBuffer":{"type":"Buffer","data":[155,117,146,229,199,121,80,125,248,22,200,205,93,16,175,174,179,76,190,164]},"announce":[],"urlList":[]}}