{"title":"Top Gear Australia S01E07","uid":4502653,"size":731977728,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9bb2d32042de4dc7ecf173fca793f79cf9a2fb68&amp;dn=Top+Gear+Australia+S01E07&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mejeffoh","files":1,"time":1226460069,"description":"It's a review with a difference as Subaru's latest weapon shows its strength against the military's secret airborne attack asset. Known for excelling at &quot;going about as fast as they can from point to point cross country&quot; Steve has asked the Army to indulge in a search and destroy mission with the Tiger Armed Reconnaissance Helicopter against his rally driving skills in the WRX STI.\n\nThen V8 Supercars drivers and Bathurst 1000 podium place winners, Greg Murphy in second and James Courtney in third, take their super fierce competitiveness from Mount Panorama to the Top Gear Australia test track. This time it's not Holden versus Ford, it's man versus man as they race the &quot;Bog Standard Car&quot; like it's never been driven before. Who will be crowned King of the Proton?\n\nAlso, is diesel a better, more efficient fuel than petrol? With skyrocketing petrol prices affecting the pockets of drivers countrywide, Top Gear Australia gave Charlie and Warren identical Volkswagen Golfs with only one difference, one is powered by diesel the other petrol. It's diesel versus petrol, and every man for themself, as they take to the roads to find out which is more economical and which is faster.\n\nAnd Steve falls in love with the Nissan GTR R-35 supercar.  &quot;I just love it! ... It might be as polite as a Japanese waiter but press the right button and she's a samurai.&quot;","torrent":{"xt":"urn:btih:9bb2d32042de4dc7ecf173fca793f79cf9a2fb68","amp;dn":"Top+Gear+Australia+S01E07","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9bb2d32042de4dc7ecf173fca793f79cf9a2fb68","infoHashBuffer":{"type":"Buffer","data":[155,178,211,32,66,222,77,199,236,241,115,252,167,147,247,156,249,162,251,104]},"announce":[],"urlList":[]}}