{"title":"Longtion Software Application Builder v5.11.0.658 Enterprise Edi","uid":9241226,"size":13952942,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9c120e08ef6657be1205cf933a1234a9f23e9a6c&amp;dn=Longtion+Software+Application+Builder+v5.11.0.658+Enterprise+Edi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"TorDigger","files":11,"time":1385283486,"description":"Longtion Application Builder\n\nLongtion Application Builder is a tool for designing and developing database applications and Web applications without writing any code. And you don't have to be a software programmer to do it. With its intuitive integrated development environment (IDE) and drag-and-drop objects, it's quick to learn and easy to use. It requires no programming knowledge whatsoever! You'll be amazed with the powerful functionality and stylish visual appeal that Longtion Application Builder puts at your mouse-clicking fingertip. Design and distribute your software with a few clicks of the mouse.\n\nWith Longtion Application Builder you can build standalone Web applications exactly the same way you would build normal database applications. It is a revolutionary new way to create web-based applications. The standalone Web application is a web server that run without dependencies from any other web server (IIS or Apache).\n\nFeatures:\n\nCreate database applications and Web applications without writing any code. No programming experience is required. \n\nConnect to database servers. Create application that can create, restructure, fetch data from, update, and otherwise manipulate local (Paradox, dBASE, FoxPro, and Access) and remote database servers (Oracle, Sybase, Informix, Microsoft SQL server, and DB2). You can access a wide variety of database servers, using ADO or ODBC to connect to different databases.\n\nConnect directly to Microsoft Jet OLE Database (Access) database files.\n\nCreate Microsoft Jet OLE Database (Access) database and create database tables.\n\nProvides a set of data-aware objects that represent data from fields in a database record, and, if the dataset allows it, enable users to edit that data and post changes back to the database. By placing data objects onto the forms in your database application, you can build your database application's user interface (UI) so that information is visible and accessible to users.\n\nYou can choose between objects that are designed to display and edit plain text, objects that work with formatted text, objects for graphics, multimedia elements, and so on.\n\nYou can display information from a single record on the screen, or list the information from multiple records using a grid (DBGrid).\n\nYou can let users navigate through the records of datasets and add or edit data. You may want to add your own objects or mechanisms to navigate and edit, or you may want to use a built-in object such as a DBNavigator.\n\nCreate master/detail relationships. DBTable datasets can be linked into master/detail relationships. When you set up a master/detail relationship, you link two datasets so that all the records of one (the detail) always correspond to the single current record in the other (the master).\n\nDefine lookup fields. You can define lookup fields for dataset object, DBQuery or DBTable. A lookup field is a read-only field that displays values based on search criteria you specify. In its simplest form, a lookup field is passed the name of an existing field to search on, a field value to search for, and a different field in a lookup dataset whose value it should display. For example, consider a mail-order application that enables an operator to use a lookup field to determine automatically the city and state that correspond to the zip code a customer provides. The column to search on might be called ZipTable.Zip, the value to search for is the customer's zip code as entered in Order.CustZip, and the values to return would be those for the ZipTable.City and ZipTable.State columns of the record where the value of ZipTable.Zip matches the current value in the Order.CustZip field.\n\nDefine calculated fields. You can define calculated fields for dataset object, DBQuery or DBTable. A calculated field displays values calculated at runtime. For example, you might create a float field that displays values calculated from other fields. \n\nAnalyze and summarize information from databases so that users can draw conclusions from the data. The DBChart object lets you present database information in a graphical format that enables users to quickly grasp the import of database information. DBChart includes chart series types: Line, Area, Point, Bar, Horizontal Bar and Pie.\n\nPrint database information. If you want to let your users print database information from the datasets in your application, you can use Report objects, visual report design objects. You can use Report objects to create a variety of reports, from simple banded reports to more complex, highly customized reports.\n\nExport report to PDF (.pdf), RichText (.rtf), Excel (.xls) and Text (.txt) files.\n\nWith Longtion Application Builder you can build standalone Web applications exactly the same way you would build normal database applications.\n\nSupported OS:\n\nWindows 2000, XP, 2003, Vista, Windows 7\n\nHomepage: http://www.longtion.com/appbuilder/appbuilder.htm\n\nInstallation Instructions: \n\n- Install program.\n- Copy content from crack folder and paste into default installation directory.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:9c120e08ef6657be1205cf933a1234a9f23e9a6c","amp;dn":"Longtion+Software+Application+Builder+v5.11.0.658+Enterprise+Edi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c120e08ef6657be1205cf933a1234a9f23e9a6c","infoHashBuffer":{"type":"Buffer","data":[156,18,14,8,239,102,87,190,18,5,207,147,58,18,52,169,242,62,154,108]},"announce":[],"urlList":[]}}