{"title":"Herbie Hancock - Sextant [Jazz][mp3 320][h33t][schon55]","uid":4656007,"size":95007120,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9c38753b36e94ab04da26cadeb998884cadb1fec&amp;dn=Herbie+Hancock+-+Sextant+%5BJazz%5D%5Bmp3+320%5D%5Bh33t%5D%5Bschon55%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"schon55","files":10,"time":1232206940,"description":"Herbie Hancock - Sextant \nYear: 1973\nLabel: Columbia/Legacy ( 1998 )\nTotal time: 39:02\nBitrate: mp3 320 kbps\n\nWhen Herbie Hancock left Warner Bros. in 1971 after releasing three musically sound but critically and commercially underappreciated albums -- The Crossing, Mwandishi, and Fat Albert's Groove -- he was struggling. At odds with a jazz establishment that longed for his return to his Blue Note sound and a fierce consciousness struggle with free music and the full-on embrace of electricity since his tenure with Miles Davis, Hancock was clearly looking for a voice. Before diving into the commercial waters that would become Headhunters in 1973, Hancock and his tough group ( including Billy Hart, Julian Priester, Dr. Eddie Henderson, Bennie Maupin, and Buster Williams ) cut this gem for their new label, Columbia. Like its Warner predecessors, the album features a kind of post-modal, free impressionism while gracing the edges of funk. The three long tracks are exploratory investigations into the nature of how mode and interval can be boiled down into a minimal stew and then extrapolated upon for soloing and &quot; riffing. &quot; In fact, in many cases, the interval becomes the riff, as is evidenced by &quot; Rain Dance. &quot; The piece that revealed the true funk direction, however, was &quot; Hidden Shadows, &quot; with its choppy basslines and heavy percussion -- aided by the inclusion of Dr. Patrick Gleeson and Buck Clarke. Dave Rubinson's production brought Hancock's piano more into line with the rhythm section, allowing for a unified front in the more abstract sections of these tunes. The true masterpiece on the album, though, is &quot; Hornets, &quot; an eclectic, electric ride through both the dark modal ambience of Miles' In a Silent Way and post-Coltrane harmonic aesthetics. The groove is in place, but it gets turned inside out by Priester and Maupin on more than one occasion and Hancock just bleats with the synth in sections. Over 19 minutes in length, it can be brutally intense, but is more often than not stunningly beautiful. It provides a glimpse into the music that became Headhunters, but doesn't fully explain it, making this disc, like its Warner predecessors, true and welcome mysteries in Hancock's long career. ~ Thom Yurek, AMG\n\nPersonnel:\nHerbie Hancock ( Electric Piano, Clavinet, Piano and Melotron ) \nBennie Maupin ( Soprano Saxophone, Bass Clarinet and Piccolo ) \nEddie Henderson ( Trumpet and Flugelhorn ) \nJulian Priester ( Trombones and Cowbell ) \nBuster Williams ( Bass Guitar and Double Bass ) \nBilly Hart ( Drums ) \nPatrick Gleeson ( Synthesizer ) \nBuck Clarke ( Congas and Bongos ) \n\nHerbie Hancock - Sextant  Tracks:\n01  Rain Dance 9:16 \n02  Hidden Shadows 10:11 \n03  Hornets 19:35 \nAll compositions - by Herbie Hancock","torrent":{"xt":"urn:btih:9c38753b36e94ab04da26cadeb998884cadb1fec","amp;dn":"Herbie+Hancock+-+Sextant+%5BJazz%5D%5Bmp3+320%5D%5Bh33t%5D%5Bschon55%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c38753b36e94ab04da26cadeb998884cadb1fec","infoHashBuffer":{"type":"Buffer","data":[156,56,117,59,54,233,74,176,77,162,108,173,235,153,136,132,202,219,31,236]},"announce":[],"urlList":[]}}