{"title":"Hoaxes, Myths, and Mayhem (2003) by Robert E. Bartholomew","uid":10764667,"size":1736022,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9c3f4cb889f18f8d9d38819065f6ae76e45447e2&amp;dn=Hoaxes%2C+Myths%2C+and+Mayhem+%282003%29+by+Robert+E.+Bartholomew&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":-1,"time":1408014471,"description":"Hoaxes, Myths, and Mayhem - Why We Need Critical Thinking (2003) by Robert E. Bartholomew &amp; Benjamin Radford.epub\n\nThinking is an innate ability that most people take for granted. But like writing well or speaking effectively before the public, thinking well is a skill that can be learned and improved with practice. In this unique introduction to critical thinking, Robert Bartholomew and Benjamin Radford first lay out the principles of critical thinking and then invite readers to put these principles to the test by examining a series of unusual and challenging case studies. Assembling a wide range of bizarre but actual incidents from many cultures and various time periods, they demonstrate how the tools of critical thinking can help to unravel alleged paranormal events and seemingly mysterious behavior.\n\nWhat factors led to the &quot;Martian panic&quot; of 1938? Why did many people conclude that an alien spaceship crashed in Roswell, New Mexico, in 1947? How do we explain the panic expressed by otherwise normal Southeast Asian men who came to believe that a contagious disease was causing their genitals to shrink, or the frenzied dance manias that captivated thousands of Europeans during the Middle Ages? Bartholomew and Radford show that reality is very much a social construction, that cultural assumptions play a large part in our judgments about what is normal and what is deviant, and that the use of critical reasoning is our best means of ensuring an objective perspective.\n\n229 pages\nPublisher: Prometheus Books (February 1, 2003)\nLanguage: English\nISBN-10: 1591020484\nISBN-13: 978-1591020486","torrent":{"xt":"urn:btih:9c3f4cb889f18f8d9d38819065f6ae76e45447e2","amp;dn":"Hoaxes%2C+Myths%2C+and+Mayhem+%282003%29+by+Robert+E.+Bartholomew","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c3f4cb889f18f8d9d38819065f6ae76e45447e2","infoHashBuffer":{"type":"Buffer","data":[156,63,76,184,137,241,143,141,157,56,129,144,101,246,174,118,228,84,71,226]},"announce":[],"urlList":[]}}