{"title":"Handbook of Microscopy for Nanotechnology","uid":15331437,"size":18533798,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9c46733cf2c6a4abc53780172882e7066c59edbf&amp;dn=Handbook+of+Microscopy+for+Nanotechnology&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1468728352,"description":"Handbook of Microscopy for Nanotechnology - Nan Yao, Zhong Lin Wang (Kluwer, 2005).pdf\r\n\r\nISBN 1-4020-8003-4\r\n\r\nNanostructured materials take on an enormously rich variety of properties and promise exciting new advances in micromechanical, electronic, and magnetic devices as well as in molecular fabrications. The structure-composition-processing-property relationships for these sub 100 nm-sized materials can only be understood by employing an array of modern microscopy and microanalysis tools. Handbook of Microscopy for Nanotechnology aims to provide an overview of the basics and applications of various microscopy techniques for nanotechnology. This handbook highlights various key microcopic techniques and their applications in this fast-growing field. Topics to be covered include the following: scanning near field optical microscopy, confocal optical microscopy, atomic force microscopy, magnetic force microscopy, scanning turning microscopy, high-resolution scanning electron microscopy, orientational imaging microscopy, high-resolution transmission electron microscopy, scanning transmission electron microscopy, environmental transmission electron microscopy, quantitative electron diffraction, Lorentz microscopy, electron holography, 3-D transmission electron microscopy, high-spatial resolution quantitative microanalysis, electron-energy-loss spectroscopy and spectral imaging, focused ion beam, secondary ion microscopy, and field ion microscopy","torrent":{"xt":"urn:btih:9c46733cf2c6a4abc53780172882e7066c59edbf","amp;dn":"Handbook+of+Microscopy+for+Nanotechnology","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c46733cf2c6a4abc53780172882e7066c59edbf","infoHashBuffer":{"type":"Buffer","data":[156,70,115,60,242,198,164,171,197,55,128,23,40,130,231,6,108,89,237,191]},"announce":[],"urlList":[]}}