{"title":"Windows 7 Ultimate x64 x86 activated - September 2010","uid":6917751,"size":3735316480,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9cbcf9010329c3154b9d784c8aef34e361f8179b&amp;dn=Windows+7+Ultimate+x64+x86+activated+-+September+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"hac1m","files":1,"time":1325091063,"description":"Windows 7 Ultimate 32+64-Bit\nUpdated 11th Sept 2010\n\nRelease Notes\nThis has been made from the official Retail DVDs, so legit Retail keys will work with this if you have one.\nThis DVD is not unattended so it will require your interaction.\nYou now have the option to install either 32-Bit (x86) or 64-Bit (x64) versions.\n\n\nHow to install if you have a GENUINE Windows 7 Ultimate Key\n- Install Windows 7 and enter your serial key, you may automatically Activate if you wish.\n- You DON'T need Windows Loader.\n\nHow to use this ISO image\n- Burn to a DVD using your favourite burning program (Nero, Imgburn etc.)\n- Copy the ISO file to a USB Device (no smaller than 4GB) using the Windows 7 USB/DVD Tool.\n\nFrequently Asked Questions\nQ: Why have you included the KB971033 update?\nA: Two reasons. One is for the benefit of people using GENUINE keys.\nSecond is once you run Windows Loader it is not a threat, and it prevents it from being installed at a later date \nwhere it can do damage.\nQ: Can I mount this with DAEMON Tools and install it that way?\nA: From what I hear you can, but I wouldnt recommend it.\nI'd recommend either burning this to a DVD (or copying it to a USB Device) and doing a Clean Install. \nJust make sure you've backed up all your data.\n\nQ: Will I be able to download new Updates when they come out?\nA: Yes.\nQ: Can this be used as an upgrade from Windows Vista/XP?\nA: It should be able to, but I would recommend a Clean Install over an upgrade.\n\nSlipstreamed Programs\n.NET Framework v1.1 (for 32-Bit Windows only)\n.NET Framework v4.0\nAdobe Flash Player\nAdobe Shockwave Player\nMicrosoft Visual C++ 2005 Redistributable Package\nMicrosoft Visual C++ 2008 Redistributable Package\nMicrosoft Visual C++ 2010 Redistributable Package\nRogueSpear's Other Runtimes v3.3.0\nSun Java2 Runtime Environment\nWindows Malicious Software Removal Tool - August 2010\n\n\nSlipstreamed Hotfixes for 32-Bit\nKB971033 - Update for Microsoft Windows\nKB972270 - Security Update for Windows 7\nKB974431 - Update for Windows 7\nKB974571 - Security Update for Windows 7\nKB975467 - Security Update for Windows 7\nKB975496 - Update for Windows 7\nKB975560 - Security Update for Windows 7\nKB976422 - Update for Windows 7\nKB976662 - Update for Windows 7\nKB977074 - Update for Windows 7\nKB977165 - Security Update for Windows 7\nKB978542 - Security Update for Windows 7\nKB978601 - Security Update for Windows 7\nKB978886 - Security Update for Windows 7\nKB979099 - Update for Rights Management Services Client for Windows 7\nKB979309 - Security Update for Windows 7\nKB979482 - Security Update for Windows 7\nKB979916 - Microsoft .NET Framework 3.5 SP1 Security Update for Windows 7 x86\nKB980195 - Cumulative Security Update for ActiveX Killbits for Windows 7\nKB980218 - Security Update for Windows 7\nKB980232 - Security Update for Windows 7\nKB980408 - Update for Windows 7\nKB980436 - Security Update for Windows 7\nKB980846 - Update for Windows 7\nKB981078 - Cumulative Update for Media Center for Windows 7\nKB981332 - Security Update for Windows 7\nKB981793 - Update for Windows 7\nKB981852 - Security Update for Windows 7\nKB982214 - Security Update for Windows 7\nKB982519 - Update for Windows 7\nKB982526 - Microsoft .NET Framework 3.5 SP1 Update for Windows 7 x86\nKB982632 - Update for Internet Explorer 8 Compatibility View List for Windows 7\nKB982664 - Update for Internet Explorer 8 Compatibility View List for Windows 7\nKB982665 - Security Update for Windows 7\nKB982799 - Security Update for Windows 7\nKB983590 - Security Update for .NET Framework 3.5.1 on Windows 7 x86\nKB2079403 - Security Update for Windows 7\nKB2160329 - Security Update for Windows 7\nKB2183461 - Cumulative Security Update for Internet Explorer 8 for Windows 7\nKB2286198 - Security Update for Windows 7\n\n\nSlipstreamed Hotfixes for 64-Bit\nKB971033 - Update for Microsoft Windows\nKB972270 - Security Update for Windows 7 for x64-based Systems\nKB974431 - Update for Windows 7 for x64-based Systems\nKB974571 - Security Update for Windows 7 for x64-based Systems\nKB975467 - Security Update for Windows 7 for x64-based Systems\nKB975496 - Update for Windows 7 for x64-based Systems\nKB975560 - Security Update for Windows 7 for x64-based Systems\nKB976422 - Update for Windows 7 for x64-based Systems\nKB976662 - Update for Windows 7 for x64-based Systems\nKB977074 - Update for Windows 7 for x64-based Systems\nKB978542 - Security Update for Windows 7 for x64-based Systems\nKB978601 - Security Update for Windows 7 for x64-based Systems\nKB978637 - Update for Windows 7 for x64-based Systems\nKB978886 - Security Update for Windows 7 for x64-based Systems\nKB979099 - Update for Rights Management Services Client for Windows 7 for x64-based Systems\nKB979309 - Security Update for Windows 7 for x64-based Systems\nKB979482 - Security Update for Windows 7 for x64-based Systems\nKB979916 - Microsoft .NET Framework 3.5 SP1 Security Update for Windows 7 for x64-based Systems\nKB980195 - Cumulative Security Update for ActiveX Killbits for Windows 7 for x64-based Systems\nKB980218 - Security Update for Windows 7 for x64-based Systems\nKB980232 - Security Update for Windows 7 for x64-based Systems\nKB980408 - Update for Windows 7 for x64-based Systems\nKB980436 - Security Update for Windows 7 for x64-based Systems\nKB980846 - Update for Windows 7 for x64-based Systems\nKB981078 - Cumulative Update for Media Center for Windows 7 x64-based Systems\nKB981332 - Security Update for Windows 7 for x64-based Systems\nKB981793 - Update for Windows 7 for x64-based Systems\nKB981852 - Security Update for Windows 7 for x64-based Systems\nKB982214 - Security Update for Windows 7 for x64-based Systems\nKB982519 - Update for Windows 7 for x64-based Systems\nKB982526 - Microsoft .NET Framework 3.5 SP1 Update for Windows 7 for x64-based Systems\nKB982632 - Update for Internet Explorer 8 Compatibility View List for Windows 7 for x64-based Systems\nKB982664 - Update for Internet Explorer 8 Compatibility View List for Windows 7 for x64-based Systems\nKB982665 - Security Update for Windows 7 for x64-based Systems\nKB982799 - Security Update for Windows 7 for x64-based Systems\nKB983590 - Security Update for .NET Framework 3.5.1 on Windows 7 for x64-based Systems\nKB2032276 - Security Update for Windows 7 for x64-based Systems\nKB2079403 - Security Update for Windows 7 for x64-based Systems\nKB2160329 - Security Update for Windows 7 for x64-based Systems\nKB2183461 - Cumulative Security Update for Internet Explorer 8 for Windows 7 for x64-based Systems\nKB2286198 - Security Update for Windows 7 for x64-based Systems\n\n\n\n\n\nThis upload has been tested by thousands of people and it is working 100%!\n\nInstallation is in English but you can change language afterwards to any of this list via Windows Multilingual User Interface (MUI)\n* Arabic\n* Brazilian Portuguese\n* Bulgarian\n* Chinese Simplified\n* Chinese Traditional - Hong Kong\n* Croatian\n* Czech\n* Danish\n* Dutch\n* English\n* Estonian\n* Finnish\n* French\n* German\n* Greek\n* Hebrew\n* Hindi\n* Hungarian\n* Italian\n* Japanese\n* Korean\n* Lithuanian\n* Norwegian\n* Polish\n* Portuguese\n* Romanian\n* Russian\n* Serbian Latin\n* Slovak\n* Slovenian\n* Spanish\n* Swedish\n* Thai\n* Turkish\n* Ukrainian\n\nWindows 7 System Requirements\nCode:\n\nIf you want to run Windows 7 on your PC, here's what it takes:\n\n* 1 gigahertz (GHz) or faster 32-bit (x86) or 64-bit (x64) processor\n* 1 gigabyte (GB) RAM (32-bit) or 2 GB RAM (64-bit)\n* 16 GB available hard disk space (32-bit) or 20 GB (64-bit)\n* DirectX 9 graphics device with WDDM 1.0 or higher driver\n\nAdditional requirements to use certain features:\n\n* Internet access (fees may apply)\n* Depending on resolution, video playback may require additional memory and advanced graphics hardware\n* For some Windows Media Center functionality a TV tuner and additional hardware may be required\n* Windows Touch and Tablet PCs require specific hardware\n* HomeGroup requires a network and PCs running Windows 7\n* DVD/CD authoring requires a compatible optical drive\n* BitLocker requires Trusted Platform Module (TPM) 1.2\n* BitLocker To Go requires a USB flash drive\n* Windows XP Mode requires an additional 1 GB of RAM, an additional 15 GB of available hard disk space, and a processor capable of hardware virtualization with Intel VT or AMD-V turned on\n* Music and sound require audio output\n\nProduct functionality and graphics may vary based on your system configuration. Some features may require advanced or additional hardware.\n\nWindows 7 Ultimate is the nonplus ultra edition of the Windows 7 operating system as it is the only edition of Windows 7 that is feature complete.\nAll other editions with the exception of Windows 7 Enterprise which is Windows 7 Ultimate branded differently lack features \nthat are included in Windows 7 Ultimate. It combines remarkable ease-of-use with the entertainment features of Home Premium \nand the business capabilities of Professional, including the ability to run many Windows XP productivity programs in Windows XP Mode.\nFor added security, you can encrypt your data with BitLocker and BitLocker To Go. \nAnd for extra flexibility, you can work in any of 35 languages. Get it all with Windows 7 Ultimate.\n\nINSTRUCTIONS\nCode:\n\nInstall:\n- Download\n- Use Nero or other burning app to burn the ISO image\n- Burning speed should not be faster than 4x. Otherwise, it might not work.\n- Restart your computer.\n- Make sure you have selected your DVD-ROM/RW drive as a first boot device.\n\n* Enter the BIOS pressing the DEL button, set the option, insert your Windows 7 installation and restart computer.\n- The black screen will appear (image 01).\n- Press any key to boot from CD or DVD.... (by pressing the key you are entering the setup)\n- Select your language, time and currency and keyboard input (optionaly)\n- Click install now\n- Choose your edition (x86 is 32-bit, x64 is 64-bit) depending of CPU type you have.\n\n*Choose x64 if you have 64-bit processor.\n- Click &quot;I accept&quot;.\n- Click &quot;Custom&quot; (advanced).\n- Choose your partition/hdd drive where Win7 should be installed and click format.\n\n*You might get some error if you have two or more hard disks with different connectors (ATA and SATA).\nIf you get an error, turn off one of your hard disks and repeat the whole proces.\n- After formatting, setup will continue automaticly and it will finish after 15-30 min.\n- Next step would be username\n- Type your password (if you want).\n- When you get the screen for CD-KEY just ignore it leaving blank.\n\n*Uncheck the box for automaticly activation and click next.\n- Choose the third option for next step.\n- Select your time zone.\n- Select your current location (Home is recommended).\n- The black CMD windows will appear. Wait a few seconds until computers restares once again.\n- And that would be all about installation. You are in Windows now.\n\nActivation:\nIt is not required, because it is OEM. Windows will be premanently activated.\nHowever, it is well known that there is some problems with DELL and HP machines.\nSo if you have issues with pre-activation you will be forced to some activator to activate Windows 7.\n\nINSTALLATION NOTES\nCode:\n\n--&gt; Remember when Windows is finalizing its installation, a black screen will appear (cmd), it will stay like this for about 2 to 10 mins\n Depending on the system you are using Then It Will say ***-***-***-***-**** Key installed successfully. \nThen it will restart automatically. After this, you can go to My computer's Properties, Windows is NOW activated!\n\n--&gt; FOR DELL and HP machines\n80% : the activators will work meanwhile the other 20% depends on how old your laptop/computer, If you did an upgrade you will have to use an external activator because this version was made for a clean installation.\n\n--&gt; If you do not want to be forced to use an activator. I would do a custom install but you don't really have to format your driver due to the fact that Windows 7 will just overwrite your current windows and put the old windows in a folder called &quot;Windows.old&quot; where your previous windows installion files are kept. And it is optional if you choose to delete the old folder because the drivers are there after installation. Make sure you are connected to the internet before and after the installation.\nGo for the fresh Installation if you dont really have important programs you can easily re-install at a later time. ( I RECOMMEND THIS )","torrent":{"xt":"urn:btih:9cbcf9010329c3154b9d784c8aef34e361f8179b","amp;dn":"Windows+7+Ultimate+x64+x86+activated+-+September+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9cbcf9010329c3154b9d784c8aef34e361f8179b","infoHashBuffer":{"type":"Buffer","data":[156,188,249,1,3,41,195,21,75,157,120,76,138,239,52,227,97,248,23,155]},"announce":[],"urlList":[]}}