{"title":"Ryan Bingham and the Dead Horses - 2009 - Roadhouse Sun  [EAC - ","uid":5046665,"size":361688695,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9d419f1cfb32ac61fe485118132dd489270c12a1&amp;dn=Ryan+Bingham+and+the+Dead+Horses+-+2009+-+Roadhouse+Sun++%5BEAC+-+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"bludStain","files":-1,"time":1249671226,"description":"Ryan Bingham and the Dead Horses - 2009 - Roadhouse Sun  [EAC - FLAC]\n\nRipped with EAC, converted to FLAC with dbPoweramp.\n\nBiography  by Andrew Leahey\nAmericana singer/songwriter Ryan Bingham was raised in rural Texas, where years of hardscrabble ranch work and competitions on the rodeo circuit would eventually surface in the dusty riffs of his country-styled debut, Mescalito. Living alone since his mid-teens, Bingham shuttled back and forth between Southwestern border towns and relatives' homes, often sleeping in his truck after nightly rodeo gigs. It was during those treks that he began entertaining friends with the guitar, an instrument he'd learned at the age of 17 from a mariachi neighbor. Drawing inspiration from Bob Dylan, Marshall Tucker, and Bob Wills -- all of whom populated the jukebox of The Halfway Bar, a roadhouse owned by Bingham's uncle (whose musical tastes influenced those of his nephew) -- Bingham fashioned a road-weary sound that soon piqued the interest of a barroom proprietor in Stephenville, TX.\n\nBingham was offered a weekly residency at the bar; soon after, he began issuing such self-released albums as Lost Bound Rails and Wishbone Saloon. The popular material was brought to the attention of Nashville heavyweights Lost Highway Records, who signed Bingham and issued his major-label debut, Mescalito (featuring production by Marc Ford, former guitarist for the Black Crowes), in October 2007. Mescalito was well received by critics, with Rolling Stone aptly comparing Bingham's raw, scratchy voice to that of &quot;Steve Earle's dad.&quot; After supporting the album with ample tour dates, the songwriter reprised his relationship with Marc Ford, who produced 2009's Roadhouse Sun. \n\nReview by Mark Deming\nAt the age of 28, Ryan Bingham already sings like he's been howling at the moon in between shots of bourbon and sucking down filterless Chesterfields every night of his life, transplanting the voice of a hard-bitten middle-aged survivor into the body of a guy still young enough to be learning a few things about the world. This disconnect is felt more than once on Roadhouse Sun, Bingham's second major-label album. While Bingham's road-worn voice and tough melodies, which veer between twang-infused rock, rowdy roadhouse blues, and hardscrabble country, certainly sound like the real thing, and his band (Corby Schaub on guitar, Elijah Ford on bass, Matt Smith on drums) has both the chops and the attitude to make these tunes stand up and crow, on Roadhouse Sun Bingham often sounds like he's singing about the stuff he wishes he knew rather than what's really in his heart and mind. It's less a matter of experience than a question of stretching beyond his creative boundaries; between a seriously busted relationship with his family and years touring on the rodeo circuit, Bingham doubtless has plenty of stories to tell, but as much as he tries to emulate the scope and vision of Bob Dylan in a tune he has the nerve to call &quot;Dylan's Hard Rain,&quot; he doesn't come especially close to reaching the mark of his stated influence, and the pseudo-psychedelic poesy of &quot;Changes Is&quot; sounds like pothead wisdom that doesn't sound so clever once the buzz wears off, no matter how hard the band rocks behind it. (And with the help of producer Marc Ford, they rock pretty damn hard when they feel it.) And while the common-man rage of &quot;Hey Hey Hurray&quot; is clearly honest and heartfelt, it's too wordy and scattershot to connect. When Bingham does hit the bulls-eye on tunes like &quot;Wishing Well,&quot; &quot;Endless Ways,&quot; and &quot;Tell My Mother I Miss Her So,&quot; it's clear he's a talent to watch, but as a whole, this is an album whose pieces don't quite fall into place as they should. More than a few folks have compared Ryan Bingham to Bruce Springsteen, but Roadhouse Sun sounds like he's still making his Greetings from Asbury Park -- the kind of record whose clunkers are obvious enough to put a chink into the album's very real virtues.\n\n\nTracks\n01  -  Day Is Done   -  Bingham   -  4:25\n02  -  Dylan's Hard Rain   -  Bingham   -  4:32\n03  -  Tell My Mother I Miss Her So   -  Bingham   -  3:45\n04  -  Country Roads   -  Bingham   -  3:46\n05  -  Bluebird   -  Bingham   -  5:02\n06  -  Snake Eyes   -  Bingham   -  4:38\n07  -  Endless Ways   -  Bingham   -  3:55\n08  -  Change Is   -  Bingham   -  7:18\n09  -  Rollin Highway Blues   -  Bingham   -  3:49\n10  -  Hey Hey Hurray   -  Bingham   -  3:13\n11  -  Roadhouse Blues   -  Bingham   -  3:30\n12  -  Wishing Well   -  Bingham   -  3:58\n\n","torrent":{"xt":"urn:btih:9d419f1cfb32ac61fe485118132dd489270c12a1","amp;dn":"Ryan+Bingham+and+the+Dead+Horses+-+2009+-+Roadhouse+Sun++%5BEAC+-+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d419f1cfb32ac61fe485118132dd489270c12a1","infoHashBuffer":{"type":"Buffer","data":[157,65,159,28,251,50,172,97,254,72,81,24,19,45,212,137,39,12,18,161]},"announce":[],"urlList":[]}}