{"title":"Scribal Culture and the Making of the Hebrew Bible","uid":5494132,"size":1245319,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9dd12b64a2899b9ea5b29e1fbca5e653c0f7c626&amp;dn=Scribal+Culture+and+the+Making+of+the+Hebrew+Bible&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"artpepper","files":-1,"time":1271168126,"description":"Scribal Culture and the Making of the Hebrew Bible, Karel van der Toorn\n\nHarvard University Press (April 15, 2009) | English | 0674032543 | 416 pages | PDF | 1.19 MB\n\n\n\n\n\n\n\nWe think of the Hebrew Bible as the Book - and yet it was produced by a largely nonliterate culture in which writing, editing, copying, interpretation, and public reading were the work of a professional elite. \n\n\nThe scribes of ancient Israel are indeed the main figures behind the Hebrew Bible, and in this book Karel van der Toorn tells their story for the first time. His book considers the Bible in very specific historical terms, as the output of the scribal workshop of the Second Temple active in the period 500-200 BCE. \n\n\nDrawing comparisons with the scribal practices of ancient Egypt and Mesopotamia, van der Toorn clearly details the methods, the assumptions, and the material means of production that gave rise to biblical texts; then he brings his observations to bear on two important texts, Deuteronomy and Jeremiah.\n\n\n\nTraditionally seen as the copycats of antiquity, the scribes emerge here as the literate elite who held the key to the production as well as the transmission of texts. Van der Toorn's account of scribal culture opens a new perspective on the origins of the Hebrew Bible, revealing how the individual books of the Bible and the authors associated with them were products of the social and intellectual world of the scribes. \n\n\n\nBy taking us inside that world, this book yields a new and arresting appreciation of the Hebrew Scriptures. \n\n","torrent":{"xt":"urn:btih:9dd12b64a2899b9ea5b29e1fbca5e653c0f7c626","amp;dn":"Scribal+Culture+and+the+Making+of+the+Hebrew+Bible","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9dd12b64a2899b9ea5b29e1fbca5e653c0f7c626","infoHashBuffer":{"type":"Buffer","data":[157,209,43,100,162,137,155,158,165,178,158,31,188,165,230,83,192,247,198,38]},"announce":[],"urlList":[]}}