{"title":"Handbook of Pharmaceutical Manufacturing Formulations 2nd ed","uid":12746889,"size":24662347,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9e0dae2c0e32304bb65171f266da7e1528ffb021&amp;dn=Handbook+of+Pharmaceutical+Manufacturing+Formulations+2nd+ed&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"clouderone","files":6,"time":1447322433,"description":"Handbook of Pharmaceutical Manufacturing Formulations 2nd ed (6 Volumes)\r\n\r\nInternational Standard Book Number-10: 1-4200-8116-0 (Volume 1; Hardcover)\r\nInternational Standard Book Number-13: 978-1-4200-8116-9 (Volume 1: Hardcover)\r\nInternational Standard Book Number-10: 1-4200-8118-7 (Volume 2; Hardcover)\r\nInternational Standard Book Number-13: 978-1-4200-8118-3 (Volume 2; Hardcover)\r\nInternational Standard Book Number-10: 1-4200-8123-3 (Volume 3; Hardcover)\r\nInternational Standard Book Number-13: 978-1-4200-8123-7 (Volume 3; Hardcover)\r\nInternational Standard Book Number-10: 1-4200-8126-8 (Volume 4; Hardcover)\r\nInternational Standard Book Number-13: 978-1-4200-8126-8 (Volume 4; Hardcover)\r\nInternational Standard Book Number-10: 1-4200-8128-4 (Volume 5; Hardcover)\r\nInternational Standard Book Number-13: 978-1-4200-8128-2 (Volume 5; Hardcover)\r\nInternational Standard Book Number-10: 1-4200-8130-6 (Volume 6; Hardcover)\r\nInternational Standard Book Number-13: 978-1-4200-8130-5 (Volume 6; Hardcover)\r\n\r\nHandbook of\r\nPharmaceutical Manufacturing Formulations\r\nSecond Edition\r\nVolume Series\r\nSarfaraz K. Niazi\r\n\r\nVolume 1\r\nHandbook of Pharmaceutical Manufacturing Formulations:\r\nCompressed Solid Products\r\n\r\nThe largest category of pharmaceutical formulations, comprising almost two-thirds of all dosage forms, compressed solids present some of the greatest challenges to formulation scientists. The first volume, Compressed Solid Products, tackles these challenges head on.\r\nHighlights from Compressed Solid Products, Volume One include:\r\nformulations for more than 200 of the most widely used drugs for all types of release profiles, offering formulators a rare opportunity to start with an optimal composition \r\nthe essentials of what you need to be aware of when establishing a manufacturing process based on the formulations presented \r\nidentification and inclusion of the most popular prescription products, a critical list for the selection of products\r\n\r\n\r\n\r\nVolume 2\r\nHandbook of Pharmaceutical Manufacturing Formulations:\r\nUncompressed Solid Products\r\n\r\nProviding methodologies that can serve as a reference point for new formulations, the second volume covers uncompressed solids, which include formulations of powders, capsules, powders ready for reconstitution, and other similar products.\r\nHighlights from Uncompressed Solid Products, Volume Two include:\r\nthe fundamental issues of good manufacturing practices formulations for more than 400 pharmaceutical products, including currently approved products and innovative products such as small proteins, instantly liquifiable powders, and nanoparticles access to US FDA guidelines, as well as all major guidelines around the world identification and inclusion of the most often approved capsules and powders in the US\r\n\r\n\r\n\r\nVolume 3\r\nHandbook of Pharmaceutical Manufacturing Formulations:\r\nLiquid Products\r\n\r\nWhile liquid drugs do not share the compression problems of solid dosage forms, the filling problems of powder dosage forms, or the consistency problems of semisolid dosage forms, they do have their own set of considerations in the formulation and manufacturing stages.\r\nHighlights from Liquid Products, Volume Three include:\r\npractical details involved in complying with the current good manufacturing practice requirements in liquid manufacturing access to what an FDA auditor would be looking for during a liquid manufacturing audit issues that may arise during a US FDA inspection the protocols used for stability testing for new drugs and new dosage forms, drawn from the most current ICH guidelines\r\n\r\n\r\n\r\nVolume 4\r\nHandbook of Pharmaceutical Manufacturing Formulations:\r\nSemisolid Products\r\n\r\nThe fourth volume in the series covers the techniques and technologies involved in the preparation of semisolid products such as ointments, creams, gels, suppositories, and special topical dosage forms. Drug manufacturers need a thorough understanding of the specific requirements that regulatory agencies impose on the formulation and efficacy determination of drugs contained in these formulations.\r\nHighlights from Semisolid Products, Volume Four include:\r\ncoverage of over 350 formulations valuable information on the difficult area of compliance changes to approved new drug applications and abbreviated new drug applications the evolving guidelines of ICH and when to conduct a regulatory review\r\n\r\n\r\n\r\nVolume 5\r\nHandbook of Pharmaceutical Manufacturing Formulations:\r\nOver-the-Counter Products\r\n\r\nOver-the-Counter products comprise a special category of healthcare products. While these formulations have much in common with their prescription counterparts, they are presented in this series separately because of their development approach taken, labeling considerations required, and support available from suppliers of ingredients in designing these products.\r\nHighlights from Over-the-Counter Products, Volume Five include:\r\nsolids, liquids, and suspensions practical advice on how to bring manufacturing practices into compliance with regulatory requirements cGMP considerations in great detail a large number of formulations of coatings of solid dosage forms\r\n\r\n\r\n\r\nVolume 6\r\nHandbook of Pharmaceutical Manufacturing Formulations:\r\nSterile Products\r\n\r\nNo other area of regulatory compliance receives more attention and scrutiny by regulatory authorities than the regulation of sterile products, for obvious reasons. With the increasing number of potent products, particularly the new line of small protein products, joining the long list of proven sterile products, the technology of manufacturing sterile products has evolved into a very sophisticated industry.\r\nHighlights from Sterile Products, Volume Six include:\r\nformulations of sterile dosage forms, regulatory filing requirements of sterile preparations, and cGMP compliance, all of which are tied together in the final preparation of the CMC sections of regulatory applications specifications of a manufacturing facility to manufacture compliant sterile products NDA or aNDA filing requirements of sterile products an alphabetical presentation of formulations of pharmaceutical products based on their generic names","torrent":{"xt":"urn:btih:9e0dae2c0e32304bb65171f266da7e1528ffb021","amp;dn":"Handbook+of+Pharmaceutical+Manufacturing+Formulations+2nd+ed","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e0dae2c0e32304bb65171f266da7e1528ffb021","infoHashBuffer":{"type":"Buffer","data":[158,13,174,44,14,50,48,75,182,81,113,242,102,218,126,21,40,255,176,33]},"announce":[],"urlList":[]}}