{"title":"The Last of the Mohicans 1936 DvdRip avi Lee1001","uid":9825896,"size":1406047082,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9e5eee41dd2fee57e3ae9a1dec70aef70e6e4fe0&amp;dn=The+Last+of+the+Mohicans+1936+DvdRip+avi+Lee1001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"xultfoad","files":2,"time":1395776438,"description":"The Last of the Mohicans 1936 DvdRip avi Lee1001\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0027869/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0027869/&lt;/a&gt; &lt;a href=&quot;\nhttps://en.wikipedia.org/wiki/The_Last_of_the_Mohicans_(1936_film)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://en.wikipedia.org/wiki/The_Last_of_the_Mohicans_(1936_film)&lt;/a&gt;\nRandolph Scott has one of his best roles as Hawkeye in this exciting film adaptation of James Fenimore Cooper's often... filmed novel. During the brutal French and Indian War, Hawkeye is prevailed upon to escort Major Duncan Heyward (Henry Wilcoxon), and the two daughters of Fort William Henry commander Colonel Munro (Hugh Buckler) -- Alice (Binnie Barnes) and Cora (Heather Angel) -- to safety through enemy lines. Hawkeye is assisted by his Indian friend Chingachgook (Robert Barrat), and Uncas (Philip Reed), Chingachgook's son; the two are the last survivors of the Mohican tribe. During their travels to the fort, Alice falls in love with Hawkeye, while Cora falls in love with Uncas. But along the way, the band is continually harassed by the demonic Huron Indian Magua (Bruce Cabot). Magua causes the deaths of Cora and Uncas, while the British are attacked by the Hurons and the French and forced to flee Fort William Henry. Hawkeye is taken prisoner by the brutal Hurons and Maj. Heyward must organize a band to rescue Hawkeye before he is tortured to death.\n\nThe James Fenimore Cooper historical fiction story [adapted by John Balderston, Paul Perez and Daniel Moore] is transferred to the screen with surprising fidelity, though the two love stories are accentuated, quite naturally. Locale is the wide open spaces of eastern America when England and the French were battling all through New York state to see which one was to be boss of this country. Story moves swiftly to that phase in the campaign when the British were rushing to the defense of Fort William Henry on Lake George (upper N.Y. state).\n\nHawkeye, the colonial scout, is set up as the typical American frontiersman of that day, willing to aid the British, but first interested in defending courageous colonists. Picture is hardly 15 minutes old before the first brush with the cruel Huron Indian tribe. From then it is a series of carefully conceived and deftly executed climaxes, starting with the siege and surrender of the fort.\n\nRandolph Scott gives a virile interpretation as the scout without going overboard at any time. Henry Wilcoxon, as the snobbish British major, vies for honors on the male side. Binnie Barnes, the English girl in love with Hawkeye, further enhances her reputation as a fascinating actress. Heather Angel has less to do as the sister whose romance with a young Mohican ends tragically.\n\nVIDEO\nSize.... 1.30gb\nDuration.... 01:31:40\nCodec.... divx\nFrame Width..... 640\nFrame Height.... 480\nData Rate.... 1853kbps\nFrame Rate.... 23 F/S\nAUDIO\nBit Rate.... 192kbps\n2 Channel Stereo\nAudio Sample Rate.... 48 KHz\nBits Per Sample 16 Bit/Sample\n\nComment on this DVD quality:I think this film is worthy of more, but alas - this seems the best we have in this format. A very worthy and enjoyable movie with the great Randolph Scott - keep your a/v expectations in check by vintage film fans should be thrilled with the film experience. ","torrent":{"xt":"urn:btih:9e5eee41dd2fee57e3ae9a1dec70aef70e6e4fe0","amp;dn":"The+Last+of+the+Mohicans+1936+DvdRip+avi+Lee1001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e5eee41dd2fee57e3ae9a1dec70aef70e6e4fe0","infoHashBuffer":{"type":"Buffer","data":[158,94,238,65,221,47,238,87,227,174,154,29,236,112,174,247,14,110,79,224]},"announce":[],"urlList":[]}}