{"title":"Le Livre Tibetain de la Vie et de la Mort","uid":6880358,"size":19446976,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9f7021f7cbe5c61934a8ddbf69222a7678a274ba&amp;dn=Le+Livre+Tibetain+de+la+Vie+et+de+la+Mort&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"asperge","files":4,"time":1323631681,"description":"Dans cet ouvrage, Sogyal RinpochÃƒÂ© concilie l'ancienne sagesse du Tibet et la recherche contemporaine sur la mort et les mourants, sur la nature de l'esprit et de l'univers. Le Livre TibÃƒÂ©tain de la Vie et de la Mort clarifie, pour la premiÃƒÂ¨re fois, la vision complÃƒÂ¨te de la vie et de la mort telle que nous l'offre la tradition tibÃƒÂ©taine. L'auteur explique notamment les &quot; bardos &quot;, ces ÃƒÂ©tats de conscience aprÃƒÂ¨s la mort qui ont tant fascinÃƒÂ© et fait s'interroger artistes, psychologues, scientifiques, mÃƒÂ©decins et philosophes occidentaux depuis la publication, en 1927, du Bardo ThÃƒÂ¶dol (le Livre des Morts TibÃƒÂ©tain). Sogyal RinpochÃƒÂ© montre que dans la mort, comme dans la vie, l'espoir existe et qu'il est possible ÃƒÂ  chacun de nous de transcender sa peur ou son refus pour dÃƒÂ©couvrir ce qui, en nous, survit et ne change pas. Il propose des &quot; pratiques &quot; simples mais puissantes que chacun, quelle que soit sa religion ou sa culture, peut accomplir afin de transformer sa vie, se prÃƒÂ©parer ÃƒÂ  la mort et aider les mourants. Ce livre prÃƒÂ©sente ÃƒÂ©galement une introduction lucide et complÃƒÂ¨te ÃƒÂ  la pratique de la mÃƒÂ©ditation, ainsi qu'aux notions de renaissance et de karma. A ceux qui accompagnent les mourants, l'auteur indique comment les assister avec amour et compassion et comment leur apporter l'aide spirituelle ÃƒÂ  laquelle tout ÃƒÂªtre humain a droit. A ceux qui travaillent en milieu hospitalier, mÃƒÂ©decins ou personnel soignant, il donne des conseils qui enrichiront leur expÃƒÂ©rience. L'auteur nous fait partager sa vision personnelle de l'expÃƒÂ©rience de proximitÃƒÂ© de la mort (NDE), selon la perspective tibÃƒÂ©taine. Le Livre TibÃƒÂ©tain de la Vie et de la Mort n'est pas seulement un chef-d'oeuvre spirituel. C'est aussi un manuel, un guide, un ouvrage de rÃƒÂ©fÃƒÂ©rence et une source d'inspiration sacrÃƒÂ©e.","torrent":{"xt":"urn:btih:9f7021f7cbe5c61934a8ddbf69222a7678a274ba","amp;dn":"Le+Livre+Tibetain+de+la+Vie+et+de+la+Mort","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f7021f7cbe5c61934a8ddbf69222a7678a274ba","infoHashBuffer":{"type":"Buffer","data":[159,112,33,247,203,229,198,25,52,168,221,191,105,34,42,118,120,162,116,186]},"announce":[],"urlList":[]}}