{"title":"Stossel.2013.11.07.[Privatize Everything].Fox Business.CF.avi","uid":9166440,"size":344684160,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9fda0d64d257b03623b520af287fab9cc2a3714f&amp;dn=Stossel.2013.11.07.%5BPrivatize+Everything%5D.Fox+Business.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"skJGZV6z","files":-1,"time":1383992925,"description":"----------\n\nSTOSSEL - [Privatize Everything!] - Fox Business Network\n2013, November 7, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\nPRIVATIZE EVERYTHING: Leonard Gilroy publishes the Privatization Report for the Reason Foundation. He explains how private companies often perform government services, including state parks, hospitals and recycling, better than government does.\n\nPUBLIC VS. PRIVATE: Former Congressman Dennis Kucinich disagrees. He says government workers can work just as efficiently. I'll debate him.\n\nPRIVATIZE PARKS: Dan Biederman, a public space redeveloper, converts government parks into nicer privately managed ones. One example is Bryant Park in New York City.\n\nLIBERATING LIBRARIES: Special Correspondent Kennedy checks out private libraries in California. A private library manager does a better job.\n\nORGAN SELLING: 100,000 Americans are on a waiting list, desperately hoping someone will donate a kidney. Many will die while waiting. Sigrid Fry-Revere, president of the Center for Ethical Solutions, went to the only country in the world that legalized organ selling. She says the market works.\n\nPRIVATIZE ALL GOVERNMENT?: Economist David Friedman, son of famed economist Milton Friedman, says we should go further with privatization. We should gradually get rid of all government. I have reservations.\n\nMY TAKE: There are some things government ought to do, but just a few things. Most of life works better if the central planners butt out, leaving individuals freedom of choice. That happens when we leave things in private hands. Markets aren't perfect. But they allow for a world where prudence is rewarded and sloth is punished-a world in which people are more likely to take risks and innovate. That's a world where more people prosper.","torrent":{"xt":"urn:btih:9fda0d64d257b03623b520af287fab9cc2a3714f","amp;dn":"Stossel.2013.11.07.%5BPrivatize+Everything%5D.Fox+Business.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9fda0d64d257b03623b520af287fab9cc2a3714f","infoHashBuffer":{"type":"Buffer","data":[159,218,13,100,210,87,176,54,35,181,32,175,40,127,171,156,194,163,113,79]},"announce":[],"urlList":[]}}