{"title":"Broken Vows - Tony Blair The Tragedy of Power (2016).epub Gooner","uid":14997124,"size":2387160,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a003c73024d1c318bba0aa1839ca6e108d3a747c&amp;dn=Broken+Vows+-+Tony+Blair+The+Tragedy+of+Power+%282016%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1466356021,"description":"Broken Vows - Tony Blair The Tragedy of Power (2016).epub Gooner\r\n\r\nPublisher: Faber &amp; Faber; Main edition (3 Mar. 2016)\r\nLanguage: English\r\nISBN-10: 0571314201\r\nISBN-13: 978-0571314201\r\n\r\nProbably the most explosive book of the year will be Tom Bower's Broken Vows - Tony Blair and the Tragedy of Power. Bower has a reputation for unearthing unwelcome truths.' The Times Cultural Review 2016\r\n\r\nWhen Tony Blair became prime minister in May 1997, he was, at forty-three, the youngest person to hold that office since 1812. With a landslide majority, his approval rating was 93 per cent and he went on to become Labour's longest-serving premier.\r\n\r\nOn his first election campaign, Blair had promised that 'New Labour' would modernize Britain, freeing it from sleaze, special interests and government secrecy. He vowed to give priority to social justice and equal opportunity for all.\r\n\r\nSo what went wrong? The invasion of Iraq was particularly controversial and unleashed public fury against a government accused of not being open and honest in its march to war in Iraq and Afghanistan. Alastair Campbell's 'dodgy' dossiers about WMDs sparked outrage, but did the contamination of New Labour's spin stretch beyond the wars?\r\n\r\nWhat is the truth behind Blair's claims of rebuilding Britain's schools, hospitals and welfare services? Why did he covertly open the doors to mass immigration? And how is it that the same man who risked his government to destroy Slobodan MiloSevic and Saddam Hussein has, since leaving office, earned millions of pounds serving dictators?\r\n\r\nTom Bower was one of those who in 1997 looked on in excited anticipation as Blair took up residence in Downing Street. Now, with unprecedented access to more than 180 Whitehall officials, military officers and politicians, he has uncovered the full story of Blair's decade in power. To distil the magic and the myths of an era all Britons experienced but have not properly understood, he has followed Blair's trail since his resignation - to Asia, the Middle East and America, where he has built an extraordinary commercial empire advising tycoons and tyrants.\r\n\r\nThe result is the political thriller of the year - a dramatic re-evaluation of Tony Blair which disentangles the mystery of an extraordinary politician - and illuminates the ultimate tragedy of power","torrent":{"xt":"urn:btih:a003c73024d1c318bba0aa1839ca6e108d3a747c","amp;dn":"Broken+Vows+-+Tony+Blair+The+Tragedy+of+Power+%282016%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a003c73024d1c318bba0aa1839ca6e108d3a747c","infoHashBuffer":{"type":"Buffer","data":[160,3,199,48,36,209,195,24,187,160,170,24,57,202,110,16,141,58,116,124]},"announce":[],"urlList":[]}}