{"title":"Secularism and Religion in Multi-faith Societies (2014) [PDF]","uid":10567015,"size":797639,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a01e874ffd6aec4a0bb53e4ec94ae55c65a2d559&amp;dn=Secularism+and+Religion+in+Multi-faith+Societies+%282014%29+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1405535057,"description":"Title: Secularism and Religion in Multi-faith Societies - The Case of India\nAuthors: Ragini Sen, Wolfgang Wagner, Caroline Howarth \nCategory: Academic/Religion\nSeries: SpringerBriefs in Political Science\nPublisher: Springer; 2014 edition (October 11, 2013)\nLanguage: English\nISBN-10: 331901921X\nISBN-13: 978-3319019215\n\nPromotional info/Publisher's summary - &quot;This Brief looks at the illustrative case of the Hindu-Muslim conflict in India, with the aim of understanding the dynamics of lived secularism as it exists in traditional multi-faith societies such as India. The data analyzed in this Brief comprise many interviews, conducted amidst Hindus and Muslims, with respondents of both sexes living in slum and middle class regions in the city of Mumbai. The volume begins by giving a brief summary of the historical and cultural background to the present situation in India. It then traces complementarities and similarities of opinions across diverse constituencies which cluster around three main anchoring points: communication, re-presentations and operationalizing of a shared dream. The first point explores the need to understand and to be understood, encourages processes of mutual acculturation, and describes the sensitive decoding of cultural symbols such as dress codes. The second point discusses changes in mind sets and mutual perceptions, where Muslims and Islam are portrayed in a balanced way and exploitation of religion for political purposes is stopped. The third main point is the involvement of the common, regular person, and a focus on children, as the unifying hope for the future.\n\nThroughout the volume, emphasis is on moral maturation, cultural interpretation in lieu of cultural imposition and creation of a sensitive media policy. The issues raised may help craft interdisciplinary and international frameworks, which address conflict resolution in culturally diverse multi-faith societies. Accordingly, the book concludes with policy recommendations for supporting the peaceful coexistence of secularism and religion in society from a peace psychological perspective.&quot;\n\nThis torrent contains a fully indexed, browse-able and searchable copy of the book in PDF format. The front cover image is also included. Please seed and enjoy.\n\nPlease visit and support my Suprbay release thread here, I would appreciate it:       &lt;a href=&quot;\nhttps://forum.suprbay.org/Thread-VikTSlick-s-Comics-Releases&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/Thread-VikTSlick-s-Comics-Releases&lt;/a&gt;","torrent":{"xt":"urn:btih:a01e874ffd6aec4a0bb53e4ec94ae55c65a2d559","amp;dn":"Secularism+and+Religion+in+Multi-faith+Societies+%282014%29+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a01e874ffd6aec4a0bb53e4ec94ae55c65a2d559","infoHashBuffer":{"type":"Buffer","data":[160,30,135,79,253,106,236,74,11,181,62,78,201,74,229,92,101,162,213,89]},"announce":[],"urlList":[]}}