{"title":"The Spark of Life: Electricity in the Human Body ","uid":8558978,"size":1385324,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a025accd2c5e6cb39b3a7d7c0a49a03911f2292c&amp;dn=The+Spark+of+Life%3A+Electricity+in+the+Human+Body+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1370835844,"description":"\nThe Spark of Life: Electricity in the Human Body By Frances Ashcroft\n2012 | 352 Pages | ISBN: 0393078035 | EPUB \n\n\n\nA lively exploration of the surprising role that electricity plays in our bodies.\nWhat happens during a heart attack? Can someone really die of fright? What is death, anyway? How does electroshock treatment affect the brain? What is consciousness? The answers to these questions lie in the electrical signals constantly traveling through our bodies, driving our thoughts, our movements, and even the beating of our hearts.\n\nThe history of how scientists discovered the role of electricity in the human body is a colorful one, filled with extraordinary personalities, fierce debates, and brilliant experiments. Moreover, present-day research on electricity and ion channels has created one of the most exciting fields in science, shedding light on conditions ranging from diabetes and allergies to cystic fibrosis, migraines, and male infertility. With inimitable wit and a clear, fresh voice, award-winning researcher Frances Ashcroft weaves together compelling real-life stories with the latest scientific findings, giving us a spectacular account of the body electric.","torrent":{"xt":"urn:btih:a025accd2c5e6cb39b3a7d7c0a49a03911f2292c","amp;dn":"The+Spark+of+Life%3A+Electricity+in+the+Human+Body+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a025accd2c5e6cb39b3a7d7c0a49a03911f2292c","infoHashBuffer":{"type":"Buffer","data":[160,37,172,205,44,94,108,179,155,58,125,124,10,73,160,57,17,242,41,44]},"announce":[],"urlList":[]}}