{"title":"Madredeus - Antologia (2000) [LOSSLESS FLAC][Tntvillage]","uid":5310089,"size":415646522,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a054c1a9c6ad2955ce50af877f75dd1f666b0eb0&amp;dn=Madredeus+-+Antologia+%282000%29+%5BLOSSLESS+FLAC%5D%5BTntvillage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"RDaneel20","files":20,"time":1264530847,"description":"Madredeus - Antologia (2000) [LOSSLESS FLAC][Tntvillage.Scambioetico]\n\n\n\nMadredeus - Antologia\n\n\nby RDaneel\n\n\n\n\n\n\n\n\n[::Album Information::]\n\nTitle: Antologia\nYears: 2000\nGenre: Fado - Folk\nProduction: Blue Note\n\n\n\n[::Tracklist::]\n\n\n1. O Pastor - 3:44\n2. Vem - 3:08\n3. OxalÃƒÂ¡ - 5:51 (Faixa nova)\n4. Haja O Que Houver - 4:29\n5. Guitarra - 3:45\n6. A Andorinha da Primavera - 3:04\n7. CÃƒÂ©u da Mouraria - 3:41\n8. As Ilhas Dos AÃƒÂ§ores - 5:04\n9. As Brumas Do Futuro - 3:37\n10. Ao Longe O Mar - 3:45 (Faixa nova)\n11. O Sonho - 5:06\n12. Alfama - 3:28\n13. O ParaÃƒÂ­so - 6:30\n14. A Vaca de Fogo - 5:01\n15. O Mar - 5:33\n16. Ainda - 7:18\n17. O Tejo - 4:10\n\n\n\n[::Review::]\n\nMadredeus is a Portuguese band. Their music combines traditional Portuguese music (many times erroneously associated with the subgenre of Fado) with influences with modern folk music. The lyrics are often melancholic and related to the sea or travelling or absence, continuing a tradition of songs that dates back to Medieval times (with obvious relations to cantigas de amigo among others).\nThe band's founding members were Pedro Ayres MagalhÃƒÂ£es (Classical guitar), Rodrigo LeÃƒÂ£o (keyboard synthesizer), Francisco Ribeiro (cello), Gabriel Gomes (accordion) and Teresa Salgueiro (vocals). MagalhÃƒÂ£es and LeÃƒÂ£o formed the band in 1985, Ribeiro and Gomes joined in 1986. They'd been searching for a female singer, and found Teresa Salgueiro in one of Lisbon's night clubs. Teresa liked their music and agreed to join, so in 1987 Madredeus recorded their first album, Os dias da Madredeus.\nThe first album was recorded in their rehearsal space, a disused abbey in Lisbon. The recording was especially strenuous due to deafening interruptions every 5 minutes from Lisbon's tram service, which ran directly above. In honour of this unavoidable presence in their every performance, they named themselves after the line's nearby terminus, Madre de Deus (Mother of God), shortened to the vernacular Madredeus.\nIn 1993, Pedro Ayres MagalhÃƒÂ£es left the band temporarily and was replaced in live concerts by JosÃƒÂ© Peixoto (Classical guitar). MagalhÃƒÂ£es rejoined the group later, making it a sextet with two guitarists.\nThey released several albums and became very popular in Portugal, but remained relatively unknown outside the country. This changed in 1994 when Wim Wenders, impressed by their music, asked Madredeus to perform in his movie Lisbon Story - the soundtrack gave the band international fame. Thanks to that, Madredeus spread their wings to the world and conquered fans from all over Europe, South America, Africa and Asia.\nIn 1994 Rodrigo LeÃƒÂ£o left the band to start a solo career, being replaced by Carlos Maria Trindade (keyboard synthesizer).\nIn 1997 Francisco Ribeiro and Gabriel Gomes left the band as Madredeus' style started abandoning its fado roots with the release of O ParaÃƒÂ­so. At this time Fernando JÃƒÂºdice (Acoustic bass guitar) was invited to join them, to form the current lineup, again a quintet. Madredeus has sold over 3 million albums worldwide.\n\nIn November 2007 Teresa Salgueiro announced she had left Madredeus..","torrent":{"xt":"urn:btih:a054c1a9c6ad2955ce50af877f75dd1f666b0eb0","amp;dn":"Madredeus+-+Antologia+%282000%29+%5BLOSSLESS+FLAC%5D%5BTntvillage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a054c1a9c6ad2955ce50af877f75dd1f666b0eb0","infoHashBuffer":{"type":"Buffer","data":[160,84,193,169,198,173,41,85,206,80,175,135,127,117,221,31,102,107,14,176]},"announce":[],"urlList":[]}}