{"title":"Mike Nesmith - The Wichita Train Whistle Sings (1968/VBR)","uid":3389059,"size":68375443,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a0894fdd55b083165e745d890d6a0ea48955f51c&amp;dn=Mike+Nesmith+-+The+Wichita+Train+Whistle+Sings+%281968%2FVBR%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Reride","files":12,"time":1127865832,"description":"The legend of this sonic oddity fits in well with the other peculiarities inherent in the Monkees' collective saga. In order to legally circumvent what would have been by all accounts a crippling income tax assessment, Nesmith cleverly financed this one-off scheme. In keeping with his goals, a 52-piece ensemble of studio all-stars was hired for a two-day session on November 18 and 19, 1967, at RCA Studios in Hollywood. Likewise, Nez had the whole affair catered by Chasen's Restaurant. When Dot Records issued the album in August of the following year, it received very little attention except from the inevitably confused Monkees fans. Their reaction was easily understandable as the songs -- most of which were Nesmith's solid contributions on the first four Monkees long-players -- had been given a decidedly orchestral overhaul. Immediately evident is the big-band style in which these sides were physically documented -- incorporating an open microphone placement which is used when recording larger orchestration. The resulting effect lends a natural-sounding warmth that closely miked and/or amplified techniques often lack. The music itself reflects Nesmith's left-of-center attitude and often unpredictable sense of humor. For instance, the full-bodied and otherwise bombastic arrangement of &quot;Nine Times Blue&quot; is speared right through the middle with a Doug Dillard banjo solo. He throttles up the tempo as the full orchestra breaks into a double-time mambo for the second half of the song. Other reinventions include the once psychedelic &quot;Tapioca Tundra&quot; into a freewheeling escapade replete with a soaring string section that remains amazingly agile throughout. The Wichita Train Whistle Sings project also allowed Nesmith the opportunity to record a few songs that he would revisit during his solo career, such as the pseudonym-esque &quot;Carlisle Wheeling.&quot; The strict, if not somewhat lumbering, 4/4 time signature performed here is the antithesis of the easy country-rock sound most synonymous with the tune. He would eventually issue it under the name &quot;Conversations&quot; on his second solo album, Loose Salute. Also worthy of note is &quot;Don't Cry Now,&quot; as it is the only track on the album to have never been issued by either the Monkees or Nesmith. Wichita Train Whistle Sings is much more of a timepiece or cultural artifact than an album designed to express artistic achievement or in any way reestablish Nesmith's post-Monkees direction. Fans of his quirky and offbeat sense of humor as well as his delicious melodies will find much to enjoy. \n-------------------------------------------------------------------\n                       Tracklisting\n-------------------------------------------------------------------\n\n01. (04:10) Mike Nesmith - 01 Nine Times Blue\n02. (04:47) Mike Nesmith - 02 Carlisle Wheeling\n03. (02:53) Mike Nesmith - 03 Tapioca Tundra\n04. (04:30) Mike Nesmith - 04 Don't Call On Me\n05. (03:31) Mike Nesmith - 05 Don't Cry Now\n06. (03:05) Mike Nesmith - 06 While I Cried\n07. (03:22) Mike Nesmith - 07 Papa Gene's Blue\n08. (02:19) Mike Nesmith - 08 You Just May Be The One\n09. (03:38) Mike Nesmith - 09 Sweet Young Thing\n10. (04:17) Mike Nesmith - 10 You Told Me\n\nPlaying Time.........: 36:36\nTotal Size...........: 65,21 MB\n","torrent":{"xt":"urn:btih:a0894fdd55b083165e745d890d6a0ea48955f51c","amp;dn":"Mike+Nesmith+-+The+Wichita+Train+Whistle+Sings+%281968%2FVBR%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0894fdd55b083165e745d890d6a0ea48955f51c","infoHashBuffer":{"type":"Buffer","data":[160,137,79,221,85,176,131,22,94,116,93,137,13,106,14,164,137,85,245,28]},"announce":[],"urlList":[]}}