{"title":"Doctor Who Confidential - Season 01 (2005-2006) - 13 Episodes +","uid":10637962,"size":4012549938,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a116e99945ff03e237d6a4637b9e670092428df5&amp;dn=Doctor+Who+Confidential+-+Season+01+%282005-2006%29+-+13+Episodes+%2B+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"bnaron","files":-1,"time":1406415027,"description":"Doctor Who Confidential - Season 01 (2005-2006) - 13 Episodes + 3 Specials\n\nSeries Description Courtesy:\n\n                   Wikipedia, the free encyclopedia\n                   (en.wikipedia.org/wiki/Doctor_Who_Confidential)\n\n\nDoctor Who Confidential is a documentary series created by the British Broadcasting Corporation (BBC) to complement the revival of the long-running British science fiction television series Doctor Who. Each episode was broadcast on BBC Three on Saturdays, immediately after the broadcast of the weekly television episode on BBC One. The running time of the first two series was 30 minutes, being extended to 45 minutes in the third.[1] BBC Three also broadcast a cut-down edition of the program, lasting 15 minutes, shown after the repeats on Sundays and Fridays and after the weekday evening repeats of earlier seasons.\n\nDescribed as focusing on the human element of the series, Confidential features behind-the-scenes footage on the making of Doctor Who through clips and interviews with the cast, production crew and other people, including those who have participated in the television series over the years of its existence. Each episode deals with a different topic, and in most cases refers to the Doctor Who episode that preceded it.\nSeason 01 (2005)\n\n\nEpisode Synopses courtesy of:\n\n                   The On-line TV Database\n                   An Open Database for Television Fans\n                   (www.thetvdb.com)\n\n\n2005-03-26 - (2 Episode Night) (1) - Special - A New Dimension (Video: 320x240, 472kbps, 24fps - Audio: 44.1kHz, 95kbps)\n\nA special documentary made by the Doctor Who Confidential team. Aired immediately before the first episode, it covers the history of Doctor Who and the return of the series to our screens.\n\n\n2005-03-26 - (2 Episode Night) (2) - Bringing Back the Doctor (Video: 640x368, 1100kbps, 24fps - Audio: 44.1kHz, 114kbps)\n\nDoctor Who's return to teatime television on BBC One is described by various actors and crew who have worked on the program, past and present, with a mixture of clips from episodes and footage from the new production.\n\n\n2005-04-02 - The Good, the Bad and the Ugly (Video: 640x368, 1100kbps, 24fps - Audio: 44.1kHz, 113kbps)\n\nThe new series of Doctor Who has some new alien creatures, and this episode shows how some of them were made, for the second episode, The End of the World.\n\n\n2005-04-09 - TARDIS Tales (Video: 640x368, 1100kbps, 24fps - Audio: 44.1kHz, 115kbps)\n\nFrom behind the scenes of the Dickens set in Swansea the Confidential team takes a good long look at the TARDIS and its vital role in the Doctor's adventures. The program looks at all the different worlds that the present and past Doctors visit and visited.\n\n\n2005-04-16 - I Get a Side-Kick Out of You (Video: 704x400, 1100kbps, 24fps - Audio: 44.1kHz, 104kbps)\n\nThis episode looks at Rose and her predecessors. What does it take to make the grade as the Doctor's companion? The Confidential team looks back at companions from the past. Why does the Doctor need Rose? What does she add to the mix?\n\n\n2005-04-23 - Why on Earth (Video: 640x368, 1100kbps, 24fps - Audio: 44.1kHz, 100kbps)\n\nAfter The Doctor saves the Earth once more in the fifth episode, World War Three, this episode of Doctor Who Confidential looks at some of the history of the Doctor's special interest in our planet.\n\n\n2005-04-30 - Dalek (Video: 640x360, 1100kbps, 24fps - Audio: 44.1kHz, 108kbps)\n\nThe long-awaited return of The Doctor's most famous enemy brings a look at the making of this important sixth episode of Doctor Who, Dalek, and some impressions of them from interviews.\n\n\n2005-05-07 - The Dark Side (Video: 640x360, 1100kbps, 24fps - Audio: 44.1kHz, 105kbps)\n\nEvil geniuses and sudden death - the vital ingredients of Doctor Who.\n\n\n2005-05-14 - Time Trouble (Video: 640x384, 1100kbps, 24fps - Audio: 44.1kHz, 115kbps)\n\nFollowing the Doctor's dangerous crossing of time streams, on Rose's behalf, in the episode Father's Day, Doctor Who Confidential looks at some of the Doctor's previous adventures within the Fourth Dimension.\n\n\n2005-05-21 - Special Effects (Video: 640x368, 1100kbps, 24fps - Audio: 44.1kHz, 111kbps)\n\nThe adventures of The Doctor on BBC television have not always been renowned for the perfection of their visual effects, however, Doctor Who Confidential looks at how modern technology can now give us effective shots of Rose floating over 1941 London during the Blitz while hanging from a barrage balloon.\n\n\n2005-05-28 - Weird Science (Video: 640x368, 1100kbps, 24fps - Audio: 44.1kHz, 115kbps)\n\nThe plot device of nanogenes in the episode The Doctor Dances points up the role of futuristic science concepts in Doctor Who. This episode examines some of these concepts.\n\n\n2005-06-04 - Unsung Heroes and Violent Death (Video: 640x368, 1100kbps, 24fps - Audio: 44.1kHz, 116kbps)\n\nFollowing on from an episode, Boom Town, that deals mainly with death and justice, the Confidential team looks at the importance of death to Doctor Who and at the Doctor's moral code.\n\n\n2005-06-11 - The World of Who (Video: 640x368, 1100kbps, 24fps - Audio: 44.1kHz, 112kbps)\n\nThe making of the penultimate episode of the new series of Doctor Who, with its reality and game shows gone mad, a look at fandom and conventions, as well as the role of the program in British popular culture, in this episode of Confidential.\n\n\n2005-06-18 - (2 Episode Night) (1) - Special - The Ultimate Guide (Video: 640x360, 1100kbps, 24fps - Audio: 44.1kHz, 103kbps)\n\nThis bonus BBC1 documentary from the Confidential team precedes The Parting of the Ways, the final episode of Season 1 of the new series of Doctor Who. The Ultimate Guide takes the viewer behind the scenes of the new show, giving us access to the cast and crew and celebrating all the triumphs and tears.\n\n\n2005-06-18 - (2 Episode Night) (2) - The Last Battle (Video: 640x360, 1100kbps, 25fps - Audio: 44.1kHz, 106kbps)\n\nA look at the making of the last episode of the 2005 season of Doctor Who, The Parting of the Ways. Also covered is the end of the Ninth Doctor's era, looking forward to the future of the next Doctor.","torrent":{"xt":"urn:btih:a116e99945ff03e237d6a4637b9e670092428df5","amp;dn":"Doctor+Who+Confidential+-+Season+01+%282005-2006%29+-+13+Episodes+%2B+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a116e99945ff03e237d6a4637b9e670092428df5","infoHashBuffer":{"type":"Buffer","data":[161,22,233,153,69,255,3,226,55,214,164,99,123,158,103,0,146,66,141,245]},"announce":[],"urlList":[]}}