{"title":"Stephen Baxter - Flood (Flood #1)","uid":12534652,"size":238699773,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a1d99cfac62d0c213af273533acc40ed2717bb6f&amp;dn=Stephen+Baxter+-+Flood+%28Flood+%231%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Cybotage","files":98,"time":1444308034,"description":"\nNext year. Sea levels begin to rise.\r\n\r\nThe change is far more rapid than any climate change predictions; metres a year. Within two years London, only 15 metres above the sea, is drowned. New York follows, the Pope gives his last adress from the Vatican, Mecca disappears beneaths the waves.\r\n\r\nWhere is all the water coming from? Scientists estimate that the earth was formed with seas 30 times in volume their current levels. Most of that water was burnt off by the sun but some was locked in the earth's mantle. For the tip of Everest to disappear beneath the waters would require the seas to triple their volume. That amount of water is still much less than 1% of the earth's volume.\r\n\r\nAnd somehow it is being released. The world is drowning. The biblical flood has returned. And the rate of increase is building all the time. Mankind is on the run, heading for high ground. Nuclear submarines prowl through clouds of corpses rising from drowned cities, populations are decimated and finally the dreadful truth is known. Before 50 years have passed there will be nowhere left to run.\r\n\r\nFLOOD tells the story of mankind's final years on earth. The stories of a small group of people caught up in the struggle to survive are woven into a tale of unimaginable global disaster. And the hope offered for a unlucky few by a second great ark . . .\r\n\r\n\r\nFormat: MP3\r\nBitrate: 32 Kbps","torrent":{"xt":"urn:btih:a1d99cfac62d0c213af273533acc40ed2717bb6f","amp;dn":"Stephen+Baxter+-+Flood+%28Flood+%231%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1d99cfac62d0c213af273533acc40ed2717bb6f","infoHashBuffer":{"type":"Buffer","data":[161,217,156,250,198,45,12,33,58,242,115,83,58,204,64,237,39,23,187,111]},"announce":[],"urlList":[]}}