{"title":"Eva Eastwood - Min melodi 2016   (320)","uid":14627692,"size":78032228,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a1e1fbf4d7b7db0eba28539e560075aeb755ac61&amp;dn=Eva+Eastwood+-+Min+melodi+2016+++%28320%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"RoffeTheCoolMan","files":13,"time":1463327556,"description":"Eva Eastwood - Min melodi 2016   (320)\r\n\r\nAtt Eva Eastwood går sin egen väg på den svenska musikscenen är närmast ett understatement. Som ingen annan har hon kryssat mellan 50-talsdoftande svensk rockabilly och modern rock så framgångsrikt att Eva Eastwood numera är ett namn bland 50-talshjältar som Elvis Presley, Wanda Jackson och Carl Perkins på Rockabilly Hall of Fame i USA.\r\n\r\n&quot;Min melodi&quot; är ännu ett bevis på att hon gör skäl för titeln som Sveriges okrönta rockabillydrottning. Med tolv nya låtar som hämtar kraften från den första rock'n'roll-explosionen i mitten av 50-talet visar Eva att hennes låtskrivarkreativitet är intakt.\r\n\r\n- Jag älskar att skriva och ibland kan det bli flera låtar om dagen. Det är aldrig svårt, de bara kommer. Men det beror nog på att det känns så lustfyllt att göra musik. Jag är lycklig som får hålla på med det roligaste jag vet, skrattar Eva.\r\n\r\n&quot;Min melodi&quot; består av tolv låtar som drar åt ett tydligare rockabillyhåll än tidigare. Hennes förra album &quot;Åh, vilken skiva&quot; från 2012 blev Grammisnominerad, dock i kategorin &quot;Årets dansband&quot;, en stämpel som man kan diskutera både länge och väl.\r\n\r\n- Till den här skivan känner jag att vi har dragit lite tydligare åt rockabillyhållet än tidigare, både vad gäller låtar, attityd och soundet i studion. Ingen av oss var ju med på 50-talet och vi har väl inte velat blåstirra på exakt hur man gjorde då, men lite mer energi från den tiden finns nog med här, säger en nöjd Eva.\r\n\r\nResultatet hörs redan i inledande &quot;Jimmy, Jimmy&quot;, som Eva själv pekar ut som en av hennes personliga favoriter på plattan - och som hon tror kan bli en &quot;plåtdunkarfavorit&quot; när sommaren kommer och raggarbilarna ger sig ut på vägarna. (Ordet &quot;plåtdunkarfavorit&quot; finns knappast i Svenska akademiens ordlista, men tänk raggarbil med nervevade rutor och arm som dunkar i takt med musiken mot plåten, så är du på rätt spår). \r\n\r\n\r\n\r\n\r\nLåtlista\r\n\r\n    1. Jimmy, Jimmy\r\n    2. När kärleken kom\r\n    3. Världens lyckligaste man\r\n    4. Vad vet väl hon\r\n    5. Tjocka släkten\r\n    6. Han för mig\r\n    7. Min melodi\r\n    8. Man bör vara två\r\n    9. 100 koppar kaffe\r\n    10. Det är som det är\r\n    11. Den snubben\r\n    12. Hör upp","torrent":{"xt":"urn:btih:a1e1fbf4d7b7db0eba28539e560075aeb755ac61","amp;dn":"Eva+Eastwood+-+Min+melodi+2016+++%28320%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1e1fbf4d7b7db0eba28539e560075aeb755ac61","infoHashBuffer":{"type":"Buffer","data":[161,225,251,244,215,183,219,14,186,40,83,158,86,0,117,174,183,85,172,97]},"announce":[],"urlList":[]}}