{"title":"Capo Version 2.1.10 with SN","uid":8215167,"size":7484594,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:a22287638b0f47125a2a3d1fbc0e6ef245517ef1&amp;dn=Capo+Version+2.1.10+with+SN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"polisdavid","files":-1,"time":1362328051,"description":"Â \nOfficial Web Site: &lt;a href=&quot; http://supermegaultragroovy.com/products/Capo/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://supermegaultragroovy.com/products/Capo/&lt;/a&gt;\n\nCapo is a musician's best friend. It lets you slow down your favorite songs, so you can hear the notes and learn how they are played. And, you can tab out your songs in record time atop a highly-detailed OpenCL-powered spectrogram display!\n\nIt's your music\n\nNo longer do you have to rely on the musical tastes of others to learn music. Drag songs right from your music collection into capo to start learning them.\n\nTab it out!\n\nBy simply drawing atop the spectrogram, Capo will generate tablature automatically for you. It really doesn't get much easier than this!\n\nDetect, and enter chords\n\nFigure out the chords in your music using Capo's sophisticated chord detection routines. Or, enter your own easily using strings like 'bbmaj7' or 'f#maj9'.\n\nPitch adjustment\n\nCapo lets you adjust the pitch of your songs-so you can change their key or fine tune them to match your instrument.\n\nMarkers\n\nUse keyboard shortcuts to mark verses, choruses, bridges, and other important points in your songs so you can return to them later.\n\nLooping\n\nRepeat difficult sections slowly, playing along with your favorite artist. Speed up gradually as you get better.\n\nMusic Export\n\nTake your Capo-adjusted music with you. Export speed- and pitch-corrected audio to your iPod, and play along when and where it's most convenient.\n\nEffects\n\nCapo lets you modify panning, adjust a 10-band graphic equalizer, and apply vocal reduction to help you isolate the parts of the music you wish to learn.\n\nWhats new:\n\nBug Fixes:\n\n* Capo no longer fails to respond to keyboard control \n  commands before the Control menu is shown.\n\n* The displayed keyboard modifiers for the defaults no longer\n   include the 'fn' key. (You must delete your preferences to see \n  this fix.)\n\n* When resizing the window during a spectrogram calculation, \n  Capo no longer crashes with an OpenGL assertion.\n\n* When using a mouse with no trackpad attached, Capo no\n   longer shifts the display of the tablature up too high, losing the\n   1st string in the display.\n\nThanks to Special K\n\nSystem Requirements:\n\nIntel Mac, OS,7 or higher\nProcessor type(s) &amp; speed: 64 bit\n\n---- PLEASE SEED ----\n","torrent":{"xt":"urn:btih:a22287638b0f47125a2a3d1fbc0e6ef245517ef1","amp;dn":"Capo+Version+2.1.10+with+SN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a22287638b0f47125a2a3d1fbc0e6ef245517ef1","infoHashBuffer":{"type":"Buffer","data":[162,34,135,99,139,15,71,18,90,42,61,31,188,14,110,242,69,81,126,241]},"announce":[],"urlList":[]}}