{"title":"Political Awakenings by Harry Kreisler","uid":9685122,"size":969076,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a2e911890c8a100779196d0179b4be3801439615&amp;dn=Political+Awakenings+by+Harry+Kreisler&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"PirateBook","files":1,"time":1393749841,"description":"\nAs a kid, Noam Chomsky handed out the Daily Mirror at his uncle's newsstand on 72nd Street, inadvertently finding himself in a buzzing intellectual and political hub for European immigrants in New York. Iranian human rights Nobelist Shirin Ebadi and her husband signed their own legal contract, attempting to restore equality to their marriage after the Iranian Revolution effectively erased the legal rights of women. \n\nElizabeth Warren set out to expose those frauds declaring bankruptcy and taking advantage of the system--only to discover, in her research, a very different story of hard-working middle-class families facing economic collapse in the absence of a social safety net. While studying at Oxford, a young Tariq Ali made a bet with a friend that he could work the Vietnam War into every single answer on his final exams.\n\nIn this rousing, thoughtful, often funny, and always inspiring volume, a diverse and impressive group of thinkers reflect on those formative experiences that shaped their own political commitments. A fascinating new window into the revealing links between the personal and the political, Political Awakenings will engage readers across generations.\n\nGenre: Nonfiction | Politics | History","torrent":{"xt":"urn:btih:a2e911890c8a100779196d0179b4be3801439615","amp;dn":"Political+Awakenings+by+Harry+Kreisler","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2e911890c8a100779196d0179b4be3801439615","infoHashBuffer":{"type":"Buffer","data":[162,233,17,137,12,138,16,7,121,25,109,1,121,180,190,56,1,67,150,21]},"announce":[],"urlList":[]}}