{"title":"Tigana by Guy Gavriel Kay {dwg}","uid":11352201,"size":7566651,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a33d9c5da679711e30e60323bca409d29198aa99&amp;dn=Tigana+by+Guy+Gavriel+Kay+%7Bdwg%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"gratefuldawg77","files":6,"time":1414902066,"description":"Eight of the nine provinces of the Peninsula of the Palm, on a world with two moons, have fallen to the warrior sorcerers Brandin of Ygrath and Alberico of Barbadior. Brandin's younger son is slain in a battle with the principality of Tigana, which the grief-stricken sorcerer then destroys. After sweeping down and destroying the remnants of their army, burning their books and destroying their architecture and statuary, he makes it so that no one not born in that province can even hear its name. Years later, a small band of survivors, led by Alessan, last prince of Tigana's royal house, wages psychological warfare, planting seeds for the overthrow of the two tyrants. At the center of these activities are Devin, a gifted young singer; Catriana, a young woman pursued by suspicions of her family's guilt; and Duke Sandre d'Astibar, a wily resistance leader thought dead. Meanwhile, at Brandin's court, Dianora, his favorite concubine and--unknown to anyone, another survivor of Tigana--struggles between her growing love for the often gentle tyrant and her desire for vengeance. Gradually the scene is set for both conquerors to destroy each other and free a land","torrent":{"xt":"urn:btih:a33d9c5da679711e30e60323bca409d29198aa99","amp;dn":"Tigana+by+Guy+Gavriel+Kay+%7Bdwg%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a33d9c5da679711e30e60323bca409d29198aa99","infoHashBuffer":{"type":"Buffer","data":[163,61,156,93,166,121,113,30,48,230,3,35,188,164,9,210,145,152,170,153]},"announce":[],"urlList":[]}}