{"title":"Charlotte Martin - Hiding Places [2012][EAC,log,cue. FLAC]","uid":9037687,"size":229859867,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a3cc44642098680516bad283658df131cbe43af1&amp;dn=Charlotte+Martin+-+Hiding+Places+%5B2012%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"dickspic","files":11,"time":1381545377,"description":"Artist: Charlotte Martin\nRelease: Hiding Places \nReleased:  2012\nLabel:  Test-Drive Records\nCatalog#: CMH0022\nFormat:  FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle: indie pop\n\n1. Mission Control\n2. The Dance (Acoustic Version)\n3. Animal (Acoustic Version)\n4. Tough\n5. In a World\n6. The Last Song\n7. Stromata (Acoustic Version)\n8. Warrior\n\n\nThe stunning track &quot;Mission Control&quot; is the rousing and richly arranged opening number. Charlotte Martin's crystalline lead vocal soars above the swirling electronic arrangements. Lush backing harmonies add texture to the memorable chorus.\n\nThe first of three stunning acoustic renditions of earlier recordings is &quot;The Dance.&quot; Listen for Charlotte's dramatic vocalise in the song's the final passage. As a perfect complement to the DVD that accompanies the EP, the new studio track has a live feel.\n\nIn the acoustic version of &quot;Animal,&quot; piano backs Charlotte's evocative vocal delivery and layers of self harmonies underscore the melody. The final acoustic number is &quot;Stromata.&quot; While her piano accompaniment contributes to the overall sound--listen for the tapping of the pedal--the new arrangement clearly features Charlotte's evocative vocal work.\n\n&quot;Tough&quot; is a new acoustic-style track that works well alongside the other acoustic songs on Hiding Places. Similarly &quot;The Last Song&quot; is a gentle piano-backed ballad. We especially admire the glistening vocal production and very accurate reproduction of the piano part. Both songs sung atop lone piano, Charlotte's crystalline vocals gorgeously soar, sensually delivering the lyrical pasages.\n\nAdditional percussion joins guitar, keyboard and piano for the more powerful arrangement of &quot;In A World.&quot; Additional vocal layers contribute to the rich sound of this new song. The EP concludes with standout track &quot;Warrior.&quot; In addition to the piano melody that graces the track, strings add further texture, especially in the song's dramatic mid-section.\n","torrent":{"xt":"urn:btih:a3cc44642098680516bad283658df131cbe43af1","amp;dn":"Charlotte+Martin+-+Hiding+Places+%5B2012%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a3cc44642098680516bad283658df131cbe43af1","infoHashBuffer":{"type":"Buffer","data":[163,204,68,100,32,152,104,5,22,186,210,131,101,141,241,49,203,228,58,241]},"announce":[],"urlList":[]}}