{"title":"Skoro sasvim obicna prica [2003] domaci film","uid":5901169,"size":734015488,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a42b74c96b1bef7e9ab9e756cc3d87e8f06dc073&amp;dn=Skoro+sasvim+obicna+prica+%5B2003%5D+domaci+film&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"YuBrat","files":1,"time":1287676087,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0371953/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0371953/&lt;/a&gt;\n\n\n\n\nAudio: Serbian(Srpski)\n\n\n\n\nReditelj: Milos Petricic\n\nScenario: Dusan Ristic\n\nZanr: Romanticna komedija - melodrama\n\nGodina: 2oo3\n\n\n\nUloge: Vuk Toskovic, Stefan Kapidzic, Milica Zaric, Hristina Popovic, Boba Latinovic, Dara Dzokic, Milutin Milosevic, Janos Tot, Snezana Knezevic, Mila Manojlovic, Bojana Ordinacev, Masa Zakic, Dobrila Stojnic...\n\n\n\nOpis: Interesantno je da je ovaj film imao svoju prvu, pravu premijeru na uglednom Medjunarodnom festivalu u Karlovim Varima, u ciklusu pod nazivom Od Istoka na Zapad. Osim ovog, prikazan je i na festivalu u Motovunu, a dobio je i nekoliko znacajnih priznanja na Festivalu u Sopotu osvojio je nagradu za najbolji film, na Palicu Broznani toranj, u Herceg Novom Zlatnu mimozu za reziju i u Vrnjackoj Banji specijalnu nagradu za scenario. U ovom filmu, koji govori o obicnim mladim ljudima koji se nalaze na zivotnim prekretnicama, igra velika ekipa mladih glumaca. Skoro sasvim obicna prica,debitantski film reditelja Milosa Petricica i scenariste Dusana Ristica, je romanticna komedija - melodrama, kazu, americka prica na domaci nacin sa srecnim krajem. Glavne licnosti su Vlada i Irena koji posle tri godine zabavljanja dolaze do prelomne tacke svog odnosa. Sve se desava u trenutku kada se iz Njujorka vraca Marija, devojka sa kojom je Vlada studirao i bio, naravno, zaljubljen u nju. Svedoci njihovih nesporazuma i pomalo i drage savete jesu Irenina najbolja drugarica Anja i Vladin najbolji drug Bane. Oni su ti koji cine da klasicna ljubavna prica bude i komedija, ali i odraz zivota mladih u Jugoslaviji danas.\n","torrent":{"xt":"urn:btih:a42b74c96b1bef7e9ab9e756cc3d87e8f06dc073","amp;dn":"Skoro+sasvim+obicna+prica+%5B2003%5D+domaci+film","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a42b74c96b1bef7e9ab9e756cc3d87e8f06dc073","infoHashBuffer":{"type":"Buffer","data":[164,43,116,201,107,27,239,126,154,185,231,86,204,61,135,232,240,109,192,115]},"announce":[],"urlList":[]}}