{"title":"The Mediterranean Sea - Its History and Present Challenges (gnv6","uid":8924785,"size":36069980,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a44560f206a9055832bb0e1f57f3bde8a614d027&amp;dn=The+Mediterranean+Sea+-+Its+History+and+Present+Challenges+%28gnv6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"gnv65","files":-1,"time":1379338598,"description":"The Mediterranean Sea: Its history and present challenges\nby Stefano Goffredo and Zvy Dubinsky\nSpringer | September 2013 | ISBN-10: 940076703X | PDF | 677 pages | 34.3 mb &lt;a href=&quot;\nhttp://www.amazon.com/The-Mediterranean-Sea-history-challenges/dp/940076703X&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/The-Mediterranean-Sea-history-challenges/dp/940076703X&lt;/a&gt;\n\nThis volume is an indispensable addition to the multidisciplinary coverage of the science of the Mediterranean Sea. The editors have gathered leading authorities from the fields of Marine Biology, Ecology, paleoclimatology, Chemical and Physical Oceanography, Zoology, Botany, Aquatic Photosynthesis, Socioeconomics, Mariculture, Mediterranean History and Science of Humanity. Beginning with the birth of the Mediterranean Sea and its myths. From coral to fish, an introduction is given to its major inhabitants of plants and animals past and present. The chapters illustrate how organisms interact as part of the structure and function of the Sea's main ecosystems. The rise of the Mediterranean as the cradle of the Western Civilization leads to a discourse on the status of human interaction with the sea. Accelerating global climate change, water warming, ocean acidification and sea level rise, and analyses of their effects on key organisms, entire ecosystems and human socioeconomics are given. Forecasting and predictions are presented taking into account different future scenarios from the IPCC (International Panel on Climate Change). The volume is richly illustrated in color, with an extensive bibliography. A valuable addition to the limited literature in the field, offering up-to-date broad coverage merging science and humanities.\n\nCONTENTS\nPart I Geology, Chemical and Physical Oceanography 3\nPart II Ecology: Taxa and Trophic Levels 87\nPart III Global Climate Change and Ecosystem Effects 421\nPart IV Mediterranean Man and Sea: Myths, Origins, Challenges and Opportunities 507\nIndex 655","torrent":{"xt":"urn:btih:a44560f206a9055832bb0e1f57f3bde8a614d027","amp;dn":"The+Mediterranean+Sea+-+Its+History+and+Present+Challenges+%28gnv6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a44560f206a9055832bb0e1f57f3bde8a614d027","infoHashBuffer":{"type":"Buffer","data":[164,69,96,242,6,169,5,88,50,187,14,31,87,243,189,232,166,20,208,39]},"announce":[],"urlList":[]}}