{"title":"Go! All in One - Computer Concepts and Application (gnv64)","uid":7770221,"size":52749422,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a460fe89725c306e44e24947c155fcc9ee86ef8b&amp;dn=Go%21+All+in+One+-+Computer+Concepts+and+Application+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"gnv65","files":1,"time":1351501609,"description":"GO! All in One: Computer Concepts and Applications \nby Shelley Gaskin, Cathy LaBerta, Robert Ferrett and Nancy Graviett\nPrentice Hall | June 2012 | ISBN-10: 0133096394 | PDF | 870 pages | 50.3 mb &lt;a href=&quot;\nhttp://www.amazon.com/Go-All-One-Computer-Applications/dp/0133096394&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Go-All-One-Computer-Applications/dp/0133096394&lt;/a&gt;\n\nThis is a scan of the spiral edition.\nWhy should you consider GO! All In One: Computer Concepts and Applications? Because it teaches computer concepts and applications together - the way it is in the real world!Â¿ It engages students right away by focusing on jobs and incorporating Web 2.0 apps in a logical way.\nTake a look at GO! All In One and learn how you can put concepts into action through this unique, jobs-focused approach that integrates computer concepts and applications into practical combinations of concepts and skills in the context of a job. With this approach students learn how to work in the real world where they will solve problems using computer concepts andÂ¿ skills related to the Internet, Microsoft Office applications, collaboration, social media, and cloud computing.\n\nAbout the Authors\nShelley Gaskin, Series Editor for the GO! Series, is a professor of business and computer technology at Pasadena City College in Pasadena, California. She holds a master's degree in business education from Northern Illinois   University and a doctorate in adult and community education from Ball State University.\nRobert L. Ferrett recently retired as the director of the Center for Instructional Computing at Eastern Michigan University, where he provided computer training and support to faculty.  He has authored or co-authored more than 70 books on Access, PowerPoint, Excel, Publisher, WordPerfect, and Word.\nNancy Graviett is a professor in the Business and Computer Science department at St. Charles Community College in Cottleville, Missouri, where she is the program coordinator for the Business Administrative Systems program and teaches within the program.\n\ncover &lt;a href=&quot; http://img827.imageshack.us/img827/7585/goallinonecomputerconce.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://img827.imageshack.us/img827/7585/goallinonecomputerconce.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:a460fe89725c306e44e24947c155fcc9ee86ef8b","amp;dn":"Go%21+All+in+One+-+Computer+Concepts+and+Application+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a460fe89725c306e44e24947c155fcc9ee86ef8b","infoHashBuffer":{"type":"Buffer","data":[164,96,254,137,114,92,48,110,68,226,73,71,193,85,252,201,238,134,239,139]},"announce":[],"urlList":[]}}