{"title":"Zombie Lake (1981)...........FFF","uid":3806068,"size":710179328,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a466f5acc0ba1335012cc69244682a8079caf149&amp;dn=Zombie+Lake+%281981%29...........FFF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"FatFuckFrank","files":1,"time":1189750118,"description":"IMDB review..........\n\nThis movie is schlock of the highest order, but you&amp;#039;d expect that the copious amounts of nudity would save it, right? Wrong! If you want nudity, rent a porno - a film like &quot;Debbie Does Dallas&quot; is likely to be better acted, scripted, and directed than Le Lac des morts vivants, a.k.a. Zombie Lake. This is a tedious hackwork. I knew it was going to be crap when I saw it, but I figured, it&amp;#039;s got lots of 80&amp;#039;s babes going skinny dipping, so how bad can it be? The answer was: extremely bad. This is a new low in zombie movies, and quite possibly the worst of its kind. Yes, I said it: &amp;#039;Zombie Lake&amp;#039; is worse than &amp;#039;House of the Dead&amp;#039;. At least the latter had a tiny, tiny bit of entertainment value. This is dreary, overlong, and just plain dull! It&amp;#039;s the movie equivalent of Ben Affleck. It&amp;#039;s like a Bergman movie without the fun.\n\nThe plot concerns a zombie dad who looks like a cross between Edward Scissorhands and The Mask. He rises from his watery grave to search for his daughter, who was supposedly born during the second world war but must have suffered some kind of disease that caused her to stop aging for about 30 years. Sound like fun yet? Good, because that&amp;#039;s as much plot as you&amp;#039;re gonna get. This movie might be worth watching for the nekkid women, but I just barely got through it once and you should be either drunk, stoned, very horny and alone, or all of the above before attempting to tackle this atrocity.\n\n\nlater/FFF","torrent":{"xt":"urn:btih:a466f5acc0ba1335012cc69244682a8079caf149","amp;dn":"Zombie+Lake+%281981%29...........FFF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a466f5acc0ba1335012cc69244682a8079caf149","infoHashBuffer":{"type":"Buffer","data":[164,102,245,172,192,186,19,53,1,44,198,146,68,104,42,128,121,202,241,73]},"announce":[],"urlList":[]}}