{"title":"MLK Jr Autobiography - Ultimate Nonviolence Handbook MP3","uid":11771007,"size":141805239,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a4a9c4860c685bffb5dab6bed83a2132f8e06c4d&amp;dn=MLK+Jr+Autobiography+-+Ultimate+Nonviolence+Handbook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"UnviolentPeacemaker","files":61,"time":1427076153,"description":"The Autobiography of Martin Luther King, Jr. [Abridged, Audiobook, Unabridged] [Audio Cassette]  Clayborne Carson (Editor / Author), LeVar Burton (Reader) \n\nThis audio book with original tracks of Dr. King is the best handbook we have for re-learning how to fight unviolently... for Palestine, against US Fascism, Stopping Ecocide....  Read, re-read, read again, make it part of your DNA, and then act.\n\n--------------\n\nReview\nBy weaving together an unprecedented amount of material, including Dr. Kings books, articles, essays, personal letters, and unpublished manuscripts, Clayborne Carson (historian, documentarian, and director of the King Papers Project) has crafted an excellent production that represents the unique medium of audiobooks at its very best. With the effective and engaging narration of actor Levar Burton as a foundation, the tapes provide understanding and insight into this important religious and political leader's powerful convictions. Original music from the civil rights movement, plus rare recordings of Dr. King's moving speeches and sermons, help create an inspiring portrait of one of the most influential leaders of the 20th century. (Running time: 9 hours, 6 cassettes) --George Laney\n\nFrom Publishers Weekly\nCarson, director of the Martin Luther King Jr. Papers Project and author of A Knock at Midnight: Inspiration from the Great Sermons of Reverend Martin Luther King, Jr., has pieced together an incomplete study of King's life by supplementing his extant autobiographies (e.g., Stride Toward Freedom and Where Do We Go from Here) with previously unpublished and published writings, interviews and speeches. If King's rhetorical flourishes and use of the word 'negro' sometimes seem outdated, the compilation still offers a concise first-person account of his life from his birth in Atlanta in 1929 to his awakening social consciousness and discovery of the teachings of Mahatma Gandhi. History propelled King to center stage in the struggle for black liberation. When Rosa Parks refused to surrender her bus seat in 1955, the &quot;once dormant and quiescent Negro community was now fully awake&quot; and King, along with many others in Montgomerys black community, organized the bus boycott that would launch King into his leadership role in the civil rights movement. The book offers glimpses of King's family life as well a view of famous Americans such as Stokely Carmichael, Malcolm X and JFK. (In 1960, King did not feel &quot;there was much difference between Kennedy and Nixon.' He writes, 'I felt at points that he was so concerned about being President of the United States that he would compromise basic principles.&quot;) But what is most evident throughout Carson's study is the moral courage that sustained King and allowed him to inspire a largely peaceful mass movement against segregation in the face of bloody reprisals. (Dec.)","torrent":{"xt":"urn:btih:a4a9c4860c685bffb5dab6bed83a2132f8e06c4d","amp;dn":"MLK+Jr+Autobiography+-+Ultimate+Nonviolence+Handbook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4a9c4860c685bffb5dab6bed83a2132f8e06c4d","infoHashBuffer":{"type":"Buffer","data":[164,169,196,134,12,104,91,255,181,218,182,190,216,58,33,50,248,224,108,77]},"announce":[],"urlList":[]}}