{"title":"[ExploitedCollegeGirls] Morgan (12.04.2014)","uid":11656061,"size":681839611,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:a4c366875416bfc29dc79aa04a032d8b0ec4a048&amp;dn=%5BExploitedCollegeGirls%5D+Morgan+%2812.04.2014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"chkm8te","files":1,"time":1417926625,"description":"[ExploitedCollegeGirls] Morgan (12.04.2014)\n\nNot only does Morgan have the biggest tits we've ever featured on Ex Co Gi (36 DDD!), she might be the most utterly (udderly?) horny girl in all of porn. From the moment Jay touches her, her libido redlines and hardly slows after her orgasms. Okay, yes, Morgan's scene is mostly about her big naturals but it's also a story of her intense arousal. If you look and listen carefully you can see how excited she is through out and you can hear it as Jay fucks her sopping wet pussy. If we had more girls like Morgan we could slash the Ex Co Gi lube budget by 75% or more (Don't worry guys, we'll pass the savings on to you!)\nThis girl has got more curves than a race track, but don't worry - Jay doesn't take this at full speed. He's mesmerized by her huge, nearly perfectly shaped tits and takes plenty of time to get them from every angle and in every kind of motion he can think of. For example, when he gives her her first orgasm of the day with a vibrator we get a perfect view of the twins jiggling as she cums. And when she performs a skilled but sloppy blowjob, Jay sits back and lets us watch those big'uns wrap around his cock.\nFinally he gives her what she's been craving: the D in the V. They start off in cowgirl and the way her tits sway as she rocks her hips is almost hypnotic. After pounding Morgan from behind so we can watch her heavy titties hang and swing, Jay flips her so he can get a good look for himself. As he fucks her she rubs her clit in time to his thrusts and manages a final body shaking orgasm. As a reward, Jay drops her to her knees and sprays her with jizz in an archetypal Ex Co Gi firehose facial.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=6x3grfuqhdkd5cqt63kc.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=6x3grfuqhdkd5cqt63kc.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=xeubakqyejbtl5uioo55.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=xeubakqyejbtl5uioo55.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:a4c366875416bfc29dc79aa04a032d8b0ec4a048","amp;dn":"%5BExploitedCollegeGirls%5D+Morgan+%2812.04.2014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4c366875416bfc29dc79aa04a032d8b0ec4a048","infoHashBuffer":{"type":"Buffer","data":[164,195,102,135,84,22,191,194,157,199,154,160,74,3,45,139,14,196,160,72]},"announce":[],"urlList":[]}}