{"title":"Without Embarrasment","uid":6785906,"size":1807077,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a54bf02916785ad8702985a9f3d0a29fcde2c1b9&amp;dn=Without+Embarrasment&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"3ljust","files":-1,"time":1320087816,"description":"Imagine being able to walk right up to the prettiest woman in a nightclub, classroom or out in the street and begin a cool, calm, flirtatious and exciting conversation with her that will have her laughing and joking around with you in seconds, handing over her phone number in minutes, and leaving you feeling like a million bucks for the rest of the day.\n\nNow imagine being able to pull this off without any paralyzing fear of rejection, without any shame or uncertainty, and most of all...\n\n... Without any embarrassment!\n\nFear of being rejected by a woman is a terrible social handicap that haunts a surprisingly large number of men.  Deeply hidden feelings of inadequacy and low self-worth that surface at the worst possible moment can make it impossible to think, talk, act and sometimes even MOVE when an opportunity to socialize with an attractive woman presents itself.\n\nThis kind of relentless failure is not without consequence, it grinds on you until it eventually begins to drag down all the other aspects of your life as well.  You start to get boxed-out of social events... people \\&quot;forget\\&quot; to invite you to parties because you\\'re \\&quot;that guy\\&quot; who never brings a date... or maybe because your social awkwardness or inappropriate behavior makes them uncomfortable.  This poison can even spread throughout your business and professional life and diminish your ability to network and create opportunities for advancement.\n\nAnd it gets really tiresome always having to put on the \\&quot;happy clown\\&quot; mask to hide all this misery.\n\nWell screw all that.  My book Without Embarrassment will show you how to turn your personal life around by demonstrating how to understand and ultimately correct the misguided self-destructive beliefs that have been blocking you both socially and romantically:\n\n* Imagine walking around getting signals of interest from women everywhere that you go instead of always being the \\'invisible man\\' at every social event...\n\n* Imagine gaining the respect and camaraderie of other men as their regard for you goes up along with your steadily improving Male Status...\n\n* Imagine having your opinions and ideas listened to instead of routinely ignored...\n\n* Imagine being able to reach out and fully accept the affection of a woman, WITHOUT FEELING ANY SHAME...\n\n* Now imagine being able to do all of this naturally and easily without any FEAR OF REJECTION...\n\nThis is what raising your male status -- even just slightly -- can do for you.  You\\'ll discover how minor changes in the way that you carry yourself and your attitude can make an enormous difference in the way that people will regard you.  Your male status as viewed by others is the central most important element that dictates just what sort of day-to-day experiences you will generally have in your life: happy and satisfying... or frustrating and enraging.\nhigh status male\n\nWithout Embarrassment  lays out step-by-step how to develop a casual, seductive personality for yourself that an amazing number of women will find magnetic.  You\\'ll discover clever psychological tactics will improve your odds of successfully making emotional connections with women at every step along the path of courtship and seduction: from the moment that a girl first catches your eye, to the thrill of winning her heart and ultimately bedding her. ","torrent":{"xt":"urn:btih:a54bf02916785ad8702985a9f3d0a29fcde2c1b9","amp;dn":"Without+Embarrasment","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a54bf02916785ad8702985a9f3d0a29fcde2c1b9","infoHashBuffer":{"type":"Buffer","data":[165,75,240,41,22,120,90,216,112,41,133,169,243,208,162,159,205,226,193,185]},"announce":[],"urlList":[]}}