{"title":"Bedhead - What Fun Life Was [mp3/192]","uid":4657767,"size":63965681,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:a5b252e2a645d36a94d18f14a41a4a67358f63c6&amp;dn=Bedhead+-+What+Fun+Life+Was+%5Bmp3%2F192%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"no_fun","files":13,"time":1232272055,"description":"What Fun Life Was by Bedhead\n\n1 Liferaft\n2 Haywire\n3 Bedside Table\n4 Unpredictable Landlord\n5 Crushing\n6 Unfinished\n7 Powder\n8 Foaming Love\n9 To the Ground\n10 Living Well\n11 Wind Down\n\nQuote:\nReview by Ned Raggett, All Music Guide\nIt didn't seem like it at the time, but with the appearance of this, Bedhead's debut, and Low's own first album some months later, the zeitgeist of post-grunge indie rock started to shift toward something more reflective and restrained. Not that WhatFunLifeWas doesn't steer clear of loud moments, to be sure; many of the songs use swelling transitions from quieter to noisier performance and back, all while avoiding the abrupt soft-loud-soft clichÃƒÂ© of the time. However, even at the band's most explosive, there's less a sense of getting ripped out of your head on sound than there is a tension between steady, careful performance (drummer Martinez especially so) and more wide-ranging power. The various comparisons to the Velvet Underground, Joy Division, and Spacemen 3 all make a certain sense, but even at this early stage of the band's life, Bedhead have much more of an individual sensibility, something that fuses and looks beyond rather than simply rehashing. Things sometimes can be a touch more playful than expected -- &quot;To the Ground&quot; is almost jaunty -- but otherwise the moods are calm and often blue, and a large part of that lies in the singing. Matt Kadane's soft, understated semi-drawl doesn't slot easily into comparisons, and its contrast with the band's music is often striking. &quot;Haywire,&quot; an epic guitar blast with an almost giddy surge to music and performance, gets additional intensity against Kadane's barely-there vocals. In the quieter moments, like the openings of &quot;Crushing&quot; or even more so, the flat-out lovely &quot;Powder,&quot; the intensity level is ratcheted even higher; the overall performance is not so much easy listening as it is a prompting to listeners, who must lean forward to catch everything. Add the intertwined guitar work of both Kadane brothers, who combine power and control excellently, and listeners need ask for little more.","torrent":{"xt":"urn:btih:a5b252e2a645d36a94d18f14a41a4a67358f63c6","amp;dn":"Bedhead+-+What+Fun+Life+Was+%5Bmp3%2F192%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5b252e2a645d36a94d18f14a41a4a67358f63c6","infoHashBuffer":{"type":"Buffer","data":[165,178,82,226,166,69,211,106,148,209,143,20,164,26,74,103,53,143,99,198]},"announce":[],"urlList":[]}}