{"title":"The Supernaturals - A Tune A Day [1998]","uid":9477256,"size":346765787,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a6a498c5c94a95ea96996fb9b55fad19d6f5ac7b&amp;dn=The+Supernaturals+-+A+Tune+A+Day+%5B1998%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"GenXRock","files":-1,"time":1389725154,"description":"Review by Jason Damas  [-]\nIt Doesn't Matter Anymore more or less branded the Supernaturals as a novelty act as their humorous, hooky pop seemed like music of the moment and not the work of a band poised to be a principal act in the britpop movement. A Tune a Day, the band's second release, doesn't change that perception, but instead improves upon the debut in both song writing and structure, effectively saving them from a sophomore slump. The Supernaturals returned the second time around with an even stronger set of tunes to turn out a disc with no weak tracks, and, remarkably, they crafted some of the best British releases of 1998. Opening with the throbbing &quot;You Take Yourself Too Seriously,&quot; the band make a very serious statement right off; the Supernaturals brand of pop music isn't meant to be taken seriously. It's fun, inventive, playful pop music with clever and unforgettable lyrics, but that doesn't mean that it isn't altogether irresistible and unforgettable. The range of tempos and textures makes A Tune a Day rival their debut, and this album contains several sing-along anthems for multiple occasions; there's a summertime anthem (&quot;I Wasn't Built to Get Up&quot;), a breakup anthem (&quot;Sheffield Song&quot;), and a falling-in-love anthem (&quot;Let Me Know&quot;), as well as the over-wrought, gut-wrenching album closer, the beautiful power ballad, &quot;Everest.&quot; They even dip slightly into glam rock with &quot;It Doesn't Matter Anymore&quot; and &quot;Still Got That Feeling,&quot; or Sgt. Pepper-era Beatles on &quot;Submarine Song.&quot; While the Supernaturals are hardly the most important or most popular band in the britpop movement (they're far from either), A Tune a Day is a marvelous pastiche of songs that proves that they're one of the best, and one of the most overlooked. (4.5/5)","torrent":{"xt":"urn:btih:a6a498c5c94a95ea96996fb9b55fad19d6f5ac7b","amp;dn":"The+Supernaturals+-+A+Tune+A+Day+%5B1998%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6a498c5c94a95ea96996fb9b55fad19d6f5ac7b","infoHashBuffer":{"type":"Buffer","data":[166,164,152,197,201,74,149,234,150,153,111,185,181,95,173,25,214,245,172,123]},"announce":[],"urlList":[]}}