{"title":"Lou Johnson - Sweet Southern Soul (1969) MP3@256","uid":10488178,"size":70746925,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a77623e3e1b5bc34a3f6d6f77f3deb1ca1b6efb4&amp;dn=Lou+Johnson+-+Sweet+Southern+Soul+%281969%29+MP3%40256&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"AaronVincent","files":13,"time":1404511056,"description":"Lou Johnson (born 1941, Brooklyn, New York City) is an American soul singer and pianist who was active as a recording artist in the 1960s and early 1970s.\n\n\n&quot;Lou Johnson's Sweet Southern Soul is a solid album of journeyman soul. Recorded in 1969 for Atlantic offshoot Cotillion, the mix of ingredients is classic: production by Jerry Wexler and Tom Dowd, musical backing by the Muscle Shoals crew, songs by Don Covay, Eddie Hinton, and Curtis Mayfield. Indeed, the whole thing reads like a textbook to Southern soul in the late '60s. The only thing missing is a compelling lead vocal from Johnson. He certainly has soul and at times sounds like a contender (on the testifying &quot;People in Love&quot; or the bubbling &quot;Rock Me Baby&quot;), but mostly he just sounds average. The choice of cover songs is not too stellar, as the Drifters' &quot;This Magic Moment&quot; and Ben E. King's &quot;Don't Play That Song (You Lied)&quot; don't translate very well. On the flip side of that, Johnson's take on the country chestnut &quot;She Thinks I Still Care&quot; is a lovely, relaxed version that adds something nice and soulful to the original. Sweet Southern Soul is a record that may not justify its lofty status among soul collectors, but is very pleasant nonetheless.&quot;\n\n/Allmusic","torrent":{"xt":"urn:btih:a77623e3e1b5bc34a3f6d6f77f3deb1ca1b6efb4","amp;dn":"Lou+Johnson+-+Sweet+Southern+Soul+%281969%29+MP3%40256","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a77623e3e1b5bc34a3f6d6f77f3deb1ca1b6efb4","infoHashBuffer":{"type":"Buffer","data":[167,118,35,227,225,181,188,52,163,246,214,247,127,61,235,28,161,182,239,180]},"announce":[],"urlList":[]}}