{"title":"(3DS) AGGE - Luigi's Mansion - Dark Moon (US) GW 2.6","uid":11555208,"size":1073741824,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:a94f455b70ce6632d3a488da9f1b78894847dcaa&amp;dn=%283DS%29+AGGE+-+Luigi%27s+Mansion+-+Dark+Moon+%28US%29+GW+2.6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"BanterJ","files":1,"time":1416816992,"description":"Luigi's Mansion: Dark Moon, known in Japan as Luigi Mansion 2 (ãƒ«ã‚¤ãƒ¼ã‚¸ãƒžãƒ³ã‚·ãƒ§ãƒ³2 RuÄ«ji Manshon TsÅ«?), and in Europe, Australia and Hong Kong as Luigi's Mansion 2, is an action-adventure video game developed by Next Level Games and published by Nintendo for the Nintendo 3DS, and is the sequel to the 2001 game Luigi's Mansion for the Nintendo GameCube. The game was first released in Japan on March 20, 2013, and in most other major regions later that same month.\n\nIn Dark Moon, the player takes control of the Mario franchise character Luigi, who is equipped with the Poltergust 5000, a specialized vacuum cleaner used to capture ghosts. In the game's single-player mode, the main goal is to retrieve the pieces of the shattered Dark Moon, a magical object that has a pacifying effect on the ghosts residing in the game's setting, Evershade Valley, by seeking them out in the five haunted mansions located therein. Dark Moon offers a cooperative multiplayer mode that can be played locally or online via Nintendo Network.\n\n-Wikipedia\n\nHeader has been zeroed to protect original copy. Playable as is. To play online, get this: http://thepiratebay.se/torrent/11550246/Gateway_ROM_Patcher_1.0\n\nAdd your own header to avoid a future potential ban.\n\nNote: At the time of this upload, Nintendo hasn't banned any systems or cartridges. Changing the game header to your own, personal one is a security measure to ensure you never get banned","torrent":{"xt":"urn:btih:a94f455b70ce6632d3a488da9f1b78894847dcaa","amp;dn":"%283DS%29+AGGE+-+Luigi%27s+Mansion+-+Dark+Moon+%28US%29+GW+2.6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a94f455b70ce6632d3a488da9f1b78894847dcaa","infoHashBuffer":{"type":"Buffer","data":[169,79,69,91,112,206,102,50,211,164,136,218,159,27,120,137,72,71,220,170]},"announce":[],"urlList":[]}}