{"title":"Mercedes Lackey - Fairy Tale","uid":9486209,"size":2047930,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a95ca1934eb1bf96283988d052765d04ef4d0116&amp;dn=Mercedes+Lackey+-+Fairy+Tale&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"lazypirate..","files":6,"time":1389894837,"description":"Firebird (Epub + Mobi)\nFirebird is the first book in the Fairy Tales series.\nIn Firebird, Lackey draws inspiration from the classic Russian fairy tale to present a marvelous coming-of-age fantasy with a most unusual setting: medieval Russia before unification under the Tsars.\n\nIlya is the son of a boyar, a Russian prince. In his father's rough-and-tumble household, Ilya is persecuted by his large, doltish older brothers, who delight in tormenting him and making him seem the fool. His only friends are three old people: a priest, a magician, and a woman who toils in the palace kitchens. From them Ilya learns faith, a smattering of magic, and the power of love--all of which he will need desperately, for his life is about to be turned upside down.\n\nThe boyar's magnificent cherry orchard is visited at midnight by the legendary Firebird--a gigantic, magnificent hawk whose wings seem to be made of flame. Ilya's father and brothers swear to capture the magical creature--but each fails. When Ilya disobeys his father and makes his own attempt to catch the Firebird, he is banished.\n\nThe young man journeys through a fantastical Russia full of magical mazes, enchanted creatures. and untold dangers. Gifted with the ability to understand the speech of animals, Ilya saves the life of a fox, who becomes his most steadfast companion. As happens in the best fairy tales, Ilya falls in love with an enchanted princess, and wins the heart of the Firebird.\n\n-----------------------------------------------------------------------------------\n\nThe Black Swan (Epub + Mobi)\nThe Black Swan is the first book in the Fairy Tales series.\nMercedes Lackey takes readers back to the ballet with her latest fairy tale fantasy, The Black Swan, which retells the story of Swan Lake. Lackey preserves much of the ballet's action but provides a happier ending than the original German folktale had. She also gives the characters depth and motivation by providing them with histories.\n\nBaron Eric von Rothbart, a powerful sorcerer, hunts down women who have betrayed men and transforms them into swans who can only resume their true forms by moonlight. His lonely daughter Odile, who watches the flock and studies spells, longs vainly for his approval. One day von Rothbart tells Odette, the swan princess, that she can break the spell by winning and holding a man's faithful love for one month. He's even chosen a candidate, Prince Siegfried. Unfortunately, the prince is a womanizing hedonist. Should Odette succeed nevertheless, von Rothbart secretly plans a trap for them and the prince's ambitious mother, Queen Clothilde, who schemes to rule in her own right. But he must use Odile, who has befriended Odette and is no longer her father's puppet.","torrent":{"xt":"urn:btih:a95ca1934eb1bf96283988d052765d04ef4d0116","amp;dn":"Mercedes+Lackey+-+Fairy+Tale","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a95ca1934eb1bf96283988d052765d04ef4d0116","infoHashBuffer":{"type":"Buffer","data":[169,92,161,147,78,177,191,150,40,57,136,208,82,118,93,4,239,77,1,22]},"announce":[],"urlList":[]}}