{"title":"Jimmy Buffett - Changes in Latitudes, Changes in Attitudes","uid":6616694,"size":265562916,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a9748318bdda90f3e37a9dc87b37e44cc2437eeb&amp;dn=Jimmy+Buffett+-+Changes+in+Latitudes%2C+Changes+in+Attitudes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"cdda-flac","files":-1,"time":1313825056,"description":" &lt;a href=&quot;\nhttp://g-ecx.images-amazon.com/images/G/01/ciu/42/51/0bb281b0c8a029ac0533b110.L.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://g-ecx.images-amazon.com/images/G/01/ciu/42/51/0bb281b0c8a029ac0533b110.L.jpg&lt;/a&gt;\n\n\nTitle: Changes in Latitudes, Changes in Attitudes\nArtist: Jimmy Buffett\nAudio CD (October 25, 1990)\nOriginal Release Date: January 1977\nGenre: Pop\nFormat: Free Lossless Audio Codec\n\n\nTrack Listing:\n\n01. Changes in Latitudes, Changes in Attitudes\n02. Wonder Why We Ever Go Home\n03. Banana Republics\n04. Tampico Trauma\n05. Lovely Cruise\n06. Margaritaville\n07. In the Shelter\n08. Miss You So Badly\n09. Biloxi\n10. Landfall\n\n\nAmazon Review:\nBuffett sold his promise as a real-world singer-songwriter God knows how many boats ago, but 1977\\'s Changes remains one of his last stands before plunging into a sea of parrotheads, \\&quot;Fins,\\&quot; and personal empire building. \\&quot;Margaritaville\\&quot; was the deceptively lighthearted hit, but Steve Goodman\\'s \\&quot;Banana Republics\\&quot; and the title tune also raised an eyebrow at the worlds Buffett encountered in his 100-proof-fueled travels. Yet soon the empire would overtake the wit and ego would subsume his creative reach.\n\nAllmusic Review:\nOne reason why Jimmy Buffett\\'s sixth album, Changes in Latitudes, Changes in Attitudes, is his best record yet is simply the sound. Buffett\\'s move from Don Gant, who produced his last four albums, to Norbert Putnam is a serious upgrade. Putnam, a bassist by trade with a talent for string arranging, specializes in working in Nashville with artists who don\\'t quite belong in Nashville. His production of Eric Andersen\\'s Blue River resulted in a masterpiece, and he\\'s done quality work with the likes of Joan Baez, Neil Young, and Dan Fogelberg, creating a country-pop sound that achieves the crossover such artists crave. Putnam is a perfect fit for Buffett; he gives the music the polish Buffett\\'s always needed. But that only explains the reason why the album works so well sonically. The main reason it\\'s Buffett\\'s best is the songs, most of which he wrote. Buffett has always been a good songwriter when he had the time to apply himself, and he\\'s been developing a persona that reaches its culmination here. Or, it might be said that the persona takes a logical next step. Buffett\\'s alter ego is something of a screwup, a guy who\\'s on the road, sometimes defined as a traveling musician, and who fuels himself on liquor and recreational drugs. He wants to get home to his loved ones, but he\\'s actually not in that much of a hurry to do so. The guy who sang \\&quot;Come Monday\\&quot; in 1974 (\\&quot;I just want you back by my side\\&quot;) has evolved into someone who\\'s been on the road so long that he and his pals \\&quot;Wonder Why We Ever Go Home.\\&quot; He may, as he claims, \\&quot;Miss You So Badly,\\&quot; but he also acknowledges, \\&quot;The longer I\\'m gone the closer I feel to you.\\&quot; When he is at home, he is clearly at loose ends, and this is where Buffett\\'s observations are most acute, as he leads off the LP\\'s two sides with its two best songs. The title tune finds him world-weary yet ready to head off again. \\&quot;If I wasn\\'t crazy I would go insane,\\&quot; goes the chorus. And the culmination of it all comes on the irresistibly catchy, completely self-deprecating \\&quot;Margaritaville,\\&quot; a guitar-strumming beach bum\\'s declaration of purpose (or purposelessness). He can\\'t remember how he got a new tattoo, he has cut his foot on the \\&quot;pop top\\&quot; of a beer can, and his heart seems to have been broken some time in the past (he doesn\\'t seem to remember all that well), but soon his blender will finish stirring up his favorite drink and all will be well. The song is an anthem for the Buffett character and likely to prove an archetype.","torrent":{"xt":"urn:btih:a9748318bdda90f3e37a9dc87b37e44cc2437eeb","amp;dn":"Jimmy+Buffett+-+Changes+in+Latitudes%2C+Changes+in+Attitudes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9748318bdda90f3e37a9dc87b37e44cc2437eeb","infoHashBuffer":{"type":"Buffer","data":[169,116,131,24,189,218,144,243,227,122,157,200,123,55,228,76,194,67,126,235]},"announce":[],"urlList":[]}}