{"title":"Minor Alps - Get There (2013) [FLAC]","uid":9136748,"size":273171582,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a99ba5ee0f6d206e19adae5f707bf80a1880e25c&amp;dn=Minor+Alps+-+Get+There+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"politux","files":-1,"time":1383425573,"description":"\n  Minor Alps - Get There (2013) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Indie Rock, Alternative, Indie Pop\n  Source: WEB\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 Buried Plans\n  02 I Don't Know What To Do With My Hands\n  03 Far From The Roses\n  04 If I Wanted Trouble\n  05 Maxon\n  06 Wish You Were Upstairs\n  07 Mixed Feelings\n  08 Radio Static\n  09 Lonely Low\n  10 Waiting For You\n  11 Away Again\n\n  One should never underestimate the value of good harmonies; more than a few acts have enjoyed long and healthy careers based on their ability to wrap their voices around one another, and judging from their debut album, Get There, Minor Alps have the potential to follow in their footsteps. Minor Alps is a collaborative project featuring Matthew Caws of Nada Surf and former Blake Baby Juliana Hatfield, and Get There reveals they make a great team -- their voices mesh beautifully, enough so that just hearing them sing together would make this album worth a listen even if the songs weren't up to par. Thankfully, that's not the case; for the most part, Get There is a set of graceful pop tunes with subtle but effective melodies that float over a bed of guitars and electronics, and the music provides a lovely backdrop for the duet vocals on &quot;Buried Plans,&quot; &quot;Radio Static,&quot; and &quot;If I Wanted Trouble.&quot; Elsewhere, the duo turns up the amps and lets it rock on &quot;Mixed Feelings&quot; and opts for a low-key, organic sound on &quot;Far from the Roses.&quot; Caws and Hatfield are as well-matched as songwriters as they are as vocalists, and their atmospheric, airy production (with Tom Beaujour) is just what these tunes need. While Caws and Hatfield both get solo spots on this album -- he takes the lead on &quot;Maxon,&quot; she gets the closer &quot;Away Again&quot; -- Get There sounds like a collaboration in the best sense of the word, with the two musicians bringing out the best in one another, their individual strengths coming together in a set of smart, well-crafted performances. Hopefully this isn't a one-off, since Get There is as pleasurable as anything Hatfield or Nada Surf have offered listeners in recent years.","torrent":{"xt":"urn:btih:a99ba5ee0f6d206e19adae5f707bf80a1880e25c","amp;dn":"Minor+Alps+-+Get+There+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a99ba5ee0f6d206e19adae5f707bf80a1880e25c","infoHashBuffer":{"type":"Buffer","data":[169,155,165,238,15,109,32,110,25,173,174,95,112,123,248,10,24,128,226,92]},"announce":[],"urlList":[]}}