{"title":"Speed: Facing Our Addiction... (2014) Stephanie Brown (multi) ","uid":9549167,"size":2110205,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a9c47b0aa484299c5177fb6cd6c54c384543368f&amp;dn=Speed%3A+Facing+Our+Addiction...+%282014%29+Stephanie+Brown+%28multi%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"7","files":-1,"time":1391202530,"description":"Speed: Facing Our Addiction to Fast and Faster (2014) Stephanie Brown (multi) \n\n\t\n\n\nSpeed: Facing Our Addiction to Fast and Faster--And Overcoming Our Fear of Slowing Down by Stephanie Brown\n\n\nFormat: mobi/epub/azw3\nLength: 384 pages\nGenre: Non-Fiction/Self-Help\nDate: 7 January 2014\n\nMORE, BETTER...SLOWER.\n\nFeeling rushed, out of control, and overwhelmed?\nFeeling like you can't keep up...and can't stop?\nIt's not just you.\n\nFrom the need to be constantly connected and the changing definition of &quot;work hours&quot; to unrealistic expectations of instant gratification, our bodies and brains are being harmed by habits that, as with any kind of addiction, promise short-term satisfaction while doing long-term damage.\n\nAs a psychologist and addiction expert who practices in Silicon Valley, Stephanie Brown sees firsthand the impact of ever-faster technology and the culture it has spawned. She knows it's affecting us mentally, physically, and spiritually. In this groundbreaking book, she explores how our beliefs and behaviors are being shaped by the seemingly limitless new world we've entered in recent years--and why faster doesn't always equal better.\n\nDr. Brown offers a step-by-step plan for breaking out of the speed trap. With practical guidelines, she shows us how to ease up on the gas pedal and reconnect with ourselves, learning to accept--and value--our limitations as human beings, reduce our stress levels, and free ourselves from our counterproductive obsession with speed.\n\nAuthor:\n\nA licensed psychologist with more than thirty-five years of clinical experience, Stephanie Brown, PhD, is also a teacher, a researcher, and a consultant in the field of addiction. An internationally recognized expert on the trauma and treatment of addicts and their families, she is especially known for her pioneering work in the theory and treatment of adult children of alcoholics. She is the author of ten books on the subject of addiction, lectures widely and maintains a private practice.","torrent":{"xt":"urn:btih:a9c47b0aa484299c5177fb6cd6c54c384543368f","amp;dn":"Speed%3A+Facing+Our+Addiction...+%282014%29+Stephanie+Brown+%28multi%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9c47b0aa484299c5177fb6cd6c54c384543368f","infoHashBuffer":{"type":"Buffer","data":[169,196,123,10,164,132,41,156,81,119,251,108,214,197,76,56,69,67,54,143]},"announce":[],"urlList":[]}}