{"title":"Belladonna's Slut! [DVDRip]","uid":7274091,"size":1467920384,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:aa3a35cfbaec351d7bd972e9ef3ce11386d1aa6c&amp;dn=Belladonna%27s+Slut%21+%5BDVDRip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"chkm8te","files":2,"time":1337213250,"description":"&quot;Belladonna Entertainment's  Aiden Riley has written and directed a highly stylized, fetish-laden  movie that evokes an Orwellian/alternative/industrial reality, while  steadfastly clutching its sexual purpose. The willingness of &quot;the Sluts&quot;  and &quot;the Fuckers&quot; redefines the boundaries performers will traverse for  the sake of hardcore pornography. The graphic display of humiliation --  nipple tweaking, choking, deep-throating, cock-gagging, fingering,  dildo insertion, double penetration, orifice stretching, gaping anuses,  anal-squirting, spanking, anal sex and cum-swallowing -- should divest  us of any fear that the sex is sacrificed for the style. Despite the  bounty of intense sucking and fucking, there's plenty of drama. The  premise is a six-step primer in how to prepare a slut for proper carnal  presentation. The setting is a cold cinderblock prison with a decidedly  harsh medical experimentation component, thanks to Belladonna and her  rough assistants. In each scene we're treated to a slo-mo &quot;tease&quot;  sequence of the slut to highlight her freshly watered body, and in  Charley Chase's case, her delectable bouncing boobs. The tease segments  are fueled by industrial-trance beats and an occasional classical music  interlude for ironic effect. Dressed in surgical scrubs and masks,  Belladonna and the faceless guards deliver the sluts, pulled from their  cells one at a time, to the interrogation room (a concrete cell). Naked  but for their wrist and ankle shackles, the sluts meet their waiting  fuckers (two at a time in five of the six scenes). Each slut is an  object lesson in one of the six steps of slut preparation: &quot;finding the  slut; training the slut; stretching the slut; feeding the slut; cleaning  the slut,&quot; and last, &quot;selling the fucking slut.&quot; The opening voice-over  explains the moral of the story: &quot;...A slut is a girl who lives for the  fuck. She breathes fuck, eats fuck and shits fuck. Her life is fuck.  She is, was and always will be SLUT!&quot;&quot;\n\nCAST: Andy San Dimas, Charley Chase, Tara Lynn Foxx, Charlotte Vale, Amy Brooke, James Deen, John Strong, Mark Ashley, Mark Wood, Mick Blue, Mr. Pete.\n\n\nRELEASE: June 28th, 2010\n\n\nScreens: &lt;a href=&quot;\nhttp://ximg.me/viewer.php?file=chgx0ftx1k21ml1n85gs.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ximg.me/viewer.php?file=chgx0ftx1k21ml1n85gs.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://ximg.me/viewer.php?file=7z6mop3vyxy0sdhi7pcw.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ximg.me/viewer.php?file=7z6mop3vyxy0sdhi7pcw.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://ximg.me/viewer.php?file=ejudryhje83db8jycy2m.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ximg.me/viewer.php?file=ejudryhje83db8jycy2m.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:aa3a35cfbaec351d7bd972e9ef3ce11386d1aa6c","amp;dn":"Belladonna%27s+Slut%21+%5BDVDRip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa3a35cfbaec351d7bd972e9ef3ce11386d1aa6c","infoHashBuffer":{"type":"Buffer","data":[170,58,53,207,186,236,53,29,123,217,114,233,239,60,225,19,134,209,170,108]},"announce":[],"urlList":[]}}