{"title":"Kipps The Story of a Simple Soul by H G Wells [republicV]","uid":7780992,"size":1724470,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aa3f93886745b27866435af5a44840206ba2d1ab&amp;dn=Kipps+The+Story+of+a+Simple+Soul+by+H+G+Wells+%5BrepublicV%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"republicV","files":4,"time":1351775198,"description":"HG Wells was born in Bromley, Kent in 1866. After working as a draper's apprentice and pupil-teacher, he won a scholarship to the Normal School of Science in 1884, studying under T H Huxley. He was awarded a first-class honours degree in biology and resumed teaching but had to retire after a kick from an ill-natured pupil afflicted his kidneys. He worked in poverty in London as a crammer while experimenting in journalism and stories. It was with The Time Machine (1895) that he had his real breakthrough.\n\nKipps: The Story of a Simple Soul - is a novel by H.G. Wells, first published in 1905. The story is a semi-autobiographical account of Wells' experience in working as a draper (shop assistant).\n\nArtie Kipps is an orphan, raised by his uncle and aunt, and then apprenticed for 7 years as a draper (based on Wells's own experience). However, his life suddenly changes when he discovers through reading a newspaper that he is the grandson of a wealthy gentleman. He inherits his fortune and is abruptly thrown into upper class society, and struggles to learn about etiquette and the rules of public society; he soon discovers what it is to be a true gentleman.","torrent":{"xt":"urn:btih:aa3f93886745b27866435af5a44840206ba2d1ab","amp;dn":"Kipps+The+Story+of+a+Simple+Soul+by+H+G+Wells+%5BrepublicV%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa3f93886745b27866435af5a44840206ba2d1ab","infoHashBuffer":{"type":"Buffer","data":[170,63,147,136,103,69,178,120,102,67,90,245,164,72,64,32,107,162,209,171]},"announce":[],"urlList":[]}}