{"title":"John Mayall and The Bluesbreakers - Stories","uid":5269366,"size":470599554,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:aa7e176438a4679ab4ef66d89c0b64747f045014&amp;dn=John+Mayall+and+The+Bluesbreakers+-+Stories&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"AlboBaggins","files":15,"time":1262993135,"description":"John Mayall, 69 years of age at the time of this recording, is at the very least irrepressible. He and his many versions of the Bluesbreakers have hit the road every year for decades, and the five years leading up to the release of Stories offer a flurry of activity that hasn't been seen from him since the 1970s. The Bluesbreakers lineup here has been with him since Spinning Coin, and includes Joe Yuele on drums, guitarist Buddy Whittington, Hank Van Sickle on bass, and Tom Canning on keyboards. Like the young hip-hop kids who self reference ubiquitously, Mayall writes more songs about blues music or playing the blues than virtually any musician in history, and Stories seems to be a series of narrative songs that are, for the most part, about various blues giants of the past, such as a reminiscence about seeing Little Walter in &quot;Southside Story&quot; or a paean to Leadbelly in &quot;Oh, Leadbelly,&quot; various blues myths such as &quot;I Thought I Heard the Devil&quot; and &quot;The Witching Hour,&quot; or exhortations for young people to take up the blues mantle (&quot;Kids Got the Blues&quot;). There are other tracks, however, like the excellent political minor-key shuffle &quot;Dirty Water&quot; -- no, not that one. The best track on the album is a country-style Bo Diddley shuffle called &quot;Feels Just Like Home,&quot; the only love song on the record and it's a stunner. The production is crisp, perhaps a little too, and the playing is inspired. Mayall's harmonica playing is as fine as ever, and if there is one complaint about the last few records, it's the overplaying of Whittington, who is a stunning guitar player in the modern style. Mayall reins him in a bit here (though not enough) and as a result the songs -- because Mayall is a fine writer -- come shining through the instrumental prowess. This is a worthy inclusion in one of the most prolific and consistent catalogs in blues-rock history. ~ Thom Jurek","torrent":{"xt":"urn:btih:aa7e176438a4679ab4ef66d89c0b64747f045014","amp;dn":"John+Mayall+and+The+Bluesbreakers+-+Stories","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa7e176438a4679ab4ef66d89c0b64747f045014","infoHashBuffer":{"type":"Buffer","data":[170,126,23,100,56,164,103,154,180,239,102,216,156,11,100,116,127,4,80,20]},"announce":[],"urlList":[]}}