{"title":"Legion - Secret Origin 1-6 (digital) (DreamGirl-Novus-HD) [NVS-D","uid":8367727,"size":175214579,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:aac80893d6268b406f9c4422b1134a2af0de8583&amp;dn=Legion+-+Secret+Origin+1-6+%28digital%29+%28DreamGirl-Novus-HD%29+%5BNVS-D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"blackcanary","files":-1,"time":1365818189,"description":"English | CBZ | 6 Issues\n\nLegion: Secret Origin #1-6\nPublisher:  DC Comics\nPublication Date:  October 26, 2011 - March 28, 2012\n\nWriter:  Paul Levitz\nPenciler:  Chris Batista\nInker:  Marc Deering\nColorist:  Wes Hartman\nLetterer:  Dezi Sienty\nCover:  Tom Fiester\n\nThe future is past as super-scribe Paul Levitz and all-star artist Christ Batista transport us back to the formation of the LEGION OF SUPER-HEROES. You might think you know how the Legion came together, but hold on to your helmet for the ride of a lifetime.\n\nLegion: Secret Origin #1\nWhy was the organization known as the United Planets formed? Who tried to kill R.J. Brande the first time? And what great power could leave entire planets desolate and lifeless? Cosmic Boy, Saturn Girl and Lightning Lad may have founded the Legion, but the real story starts here!\n\nLegion: Secret Origin #2\nIn the 31st century, three teens from different worlds act to save prominent businessman R.J. Brande from assassination. That one courageous act will change their lives forever and tie them to a conspiracy threatening the fragile foundations of the burgeoning United Planets and the future itself!\n\nLegion: Secret Origin #3\nThe battle to save the border worlds of the United Planets from an unknown alien threat rages on. It's a trial by fire for the newly formed Legion as work continues on an experimental starship that could tip the balance of the war.\n\nLegion: Secret Origin #4\nAs more worlds fall to the mysterious alien armada, the Legion continues its struggle to defend the United Planets. Will new members Ultra Boy and Star Boy be enough to turn the tide?\n\nLegion: Secret Origin #5\nAs the Legion's adventures rocket them into the public eye, they must still contend with new threats to their worlds. While attempting to seek help from the century of Super Heroes, they find themselves locked out of time and discover a clue to who is behind the terrorizing forces!\n\nLegion: Secret Origin #6\nFull-on war breaks out across the United Planets. But there is hope, as the Legionnaires have finally come together to confront the evil behind the attacks on their homeworlds. Will it be in time, and do they have enough power on their own to survive their darkest hour?\n\nThanks goes to DreamGirl for this release.","torrent":{"xt":"urn:btih:aac80893d6268b406f9c4422b1134a2af0de8583","amp;dn":"Legion+-+Secret+Origin+1-6+%28digital%29+%28DreamGirl-Novus-HD%29+%5BNVS-D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aac80893d6268b406f9c4422b1134a2af0de8583","infoHashBuffer":{"type":"Buffer","data":[170,200,8,147,214,38,139,64,111,156,68,34,177,19,74,42,240,222,133,131]},"announce":[],"urlList":[]}}