{"title":"Electronics Datasheets and Manuals","uid":3747208,"size":246256471,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:ab412c8613602a6a321606c6eff837ef8eeb3d9c&amp;dn=Electronics+Datasheets+and+Manuals&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"griffie","files":11,"time":1184892551,"description":"A collection of different datasheets and manuals: \n\nCommercial IC and Transistor Data Sheets and App Notes (1 and 2) are a collection of data sheets and application notes for a lot of different devices that I&amp;#039;ve used over the years, mostly tending towards audio-frequency applications, with some oddball driver and displays thrown in. \n\nKaypro 2-2X-4-4X-10-16-Robie-286i Service manual: Kaypro&amp;#039;s own service manual and price listings from 1984. The original is somewhat fuzzy, but the data is readable, and most of the schematics can be deciphered. This contains prices for all Kaypro parts as of 1984, as well as troubleshooting guides and schematical diagrams for Kaypro&amp;#039;s luggable computers. \n\nNixie Tube Catalog B_W: Self explanatory, I think. \n\nRacal Dana 6000 DVM Ops and Service Manual: Just what it says, an operation and service manual for the 6000 series of microprocessing multimeters. These were rack-mount giants stuffed to the brim with circuit cards. Very cool pieces of useable history. \n\nRacal Dana 9000 Counter-Timer Ops and Service Manual: Ditto the 6000 DVM description, above. \n\nSpecific Products WWVC Time-Standards receiver Ops and Service manual: A manual for what it says. The WWVC is a dedicated government time channel receiver that looks like a device from your favorite sci-fi B-flick. Contains diagrams and information for the vacuum tube version of this unit. \n\nTechTran 900 Series Standalone Disc Drive Ops Manual: A Manual for an early standalone data storage device, this booklet contains operation codes and programming information. The 900 series was a box containing a full-height 5.25&quot; disc drive (SSSD) which wrote in it&amp;#039;s own format, controlled direct by serial commands. \n\nWE Transistor and IC data: A bunch of data sheets from the venerable Western Electric corporation, these were found at a hamfest many years ago. Contains a wide array of different WE devices, from transistors to memory ICs. \n\nWE Transistor and LED Data: Ditto the above, contains more transistors and LED data. \n\nThese are all 600DPI scans of manuals, some original, some second generation. They were done in a mega-sheet scanner, so some sheets are a little crooked, and the data is all run together in one long PDF. I think all the doubles are cleaned up, and nothing is missing. Enjoy!","torrent":{"xt":"urn:btih:ab412c8613602a6a321606c6eff837ef8eeb3d9c","amp;dn":"Electronics+Datasheets+and+Manuals","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab412c8613602a6a321606c6eff837ef8eeb3d9c","infoHashBuffer":{"type":"Buffer","data":[171,65,44,134,19,96,42,106,50,22,6,198,239,248,55,239,142,235,61,156]},"announce":[],"urlList":[]}}