{"title":"Super Mario All Stars (Super Mario World And Captain N)","uid":4650618,"size":2244689426,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:abf8e3ee975c34826cc52ee0bef73f5d9a197ecc&amp;dn=Super+Mario+All+Stars+%28Super+Mario+World+And+Captain+N%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Scrounder","files":21,"time":1232036061,"description":"Super Mario All stars Direct DVD Upload. This is my First torrent. Contains DVD Quality Rips of Every single Super Mario World and The 11 minute episodes of Captain N. \n\nInfo\n====================================================================\nThe series centered on Mario, Luigi, and Princess Toadstool, now living in Dinosaur Land (sometimes also called Dinosaur World) with Yoshi, who was depicted on the show as a curious childlike dinosaur with a large appetite and several phobias. King Koopa and the Koopalings were also around, having followed the Mario Bros. and the Princess to Dinosaur Land.\nUnlike in the game, Dinosaur Land was depicted as being populated with cavepeople, including a pre-adolescent caveboy named Oogtar, who replaced the role of Toad. Some episodes revolved around Mario trying to introduce a modern invention to the cavepeople in an attempt to make their lives easier, only for the Koopas to twist it into an evil scheme. It is unclear whether the characters had traveled back in time (in the episode &quot;Rock TV&quot;, King Koopa mentions &quot;there's no TV here in the Stone Age [because] it hasn't been invented yet&quot;), or if Dinosaur Land was simply a &quot;lost valley&quot;-esque island that the characters had come to (in the flashback episode &quot;Mama Luigi&quot;, Luigi simply mentions that he and the others came to Dinosaur Land without any mention of time travel).\nThe show was originally aired on Saturday mornings on NBC in the 1991-92 season. It was featured in a half-hour time slot with a shortened version of Captain N: The Game Master, titled Captain N &amp; The New Super Mario World (also erroneously titled Captain N &amp; Super Mario Bros. World in the commercial bumpers). Episodes of Super Mario World were later shown as part of the syndication package Captain N and the Video Game Masters. Afterwards, the series was split up from Captain N altogether and shown in time-compressed reruns on Mario All-Stars. In the United Kingdom, however, the show was still broadcast as Captain N &amp; The New Super Mario World.\nUnlike the previous two Mario cartoons, the show was not widely distributed on home video in the NTSC region, where its only release was the inclusion of the show's Christmas episode on the 1996 VHS release Super Mario Bros. Super Christmas Adventures. Meanwhile, two PAL tapes were released in the United Kingdom. More recently, the series was released on DVD in Australia.\n============================================================================\n\n\nTorrent Contains:\n\nSuper Mario World Episodes:\n===============================\nFire Sale\nThe Wheel Thing\nSend in the Clown\nGhosts 'R' Us\nThe Night Before Cave Christmas\nKing Scoopa Koopa\nBorn to Ride\nParty Line\nGopher Bash\nRock TV\nThe Yoshi Shuffle\nA Little Learning\nMama Luigi\n\nCaptain N Episodes:\n============================\nMisadventures in Robin Hood Woods\nPursuit of the Magic Hoop\nReturn to Castlevania\nTotally Tetrisized\nA Tale of Two Dogs\nBattle of the Baseball Know-It-Alls\nThe Fractured Fantasy of Captain N\n\nBonus Feature:\n===================================\nIntro Animatic\n\n\nThis is also for all you youtube poopers out there, enjoy ;)","torrent":{"xt":"urn:btih:abf8e3ee975c34826cc52ee0bef73f5d9a197ecc","amp;dn":"Super+Mario+All+Stars+%28Super+Mario+World+And+Captain+N%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"abf8e3ee975c34826cc52ee0bef73f5d9a197ecc","infoHashBuffer":{"type":"Buffer","data":[171,248,227,238,151,92,52,130,108,197,46,224,190,247,63,93,154,25,126,204]},"announce":[],"urlList":[]}}