{"title":"Tom Petty - Full Moon Fever [FLAC+MP3]","uid":9508199,"size":376809270,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ac6b8276812554ee4d2c48efd510d99d9a58de9a&amp;dn=Tom+Petty+-+Full+Moon+Fever+%5BFLAC%2BMP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Big-Papi","files":-1,"time":1390354198,"description":"Source: Original CD Release\n\nThis CD is a &quot;Best Of&quot; in its own right. Enjoy. - Big Papi\n\n\n\n\nBy ProperGander\n\nTom Petty has produced many masterpieces (so far) in his long and brilliant career, but none more enjoyable than this rocking collaboration with producer and fellow Travelling Wilbury Jeff Lynne. It sounds so effortless and breezy, yet FULL MOON FEVER was a sales and airplay titan from 1989-1991, and remains a staple of classic rock radio to this day.\n\nListening to it, one is amazed that this is not a &quot;greatest hits&quot; collection, but a studio CD recorded over a relatively brief period of time while Petty and Lynne were also working on their Traveling Wilburys VOLUME ONE project, on the Roy Orbison MYSTERY GIRL album, Del Shannon's ROCK ON album, and numerous other sidelines. Petty, in his book CONVERSATIONS, says that he and Lynne were writing non-stop and recording a song a day in order to beat Lynne's travel deadlines. That sense of speed and urgency, coupled with Petty and Lynne's close friendship and unique chemistry, give this album a sense of sponteneity and fun that keeps it fresh every time you hear it.\n\nMike Campbell and Benmont Tench, two of Petty's colleagues from The Heartbreakers also contributed significantly to FULL MOON FEVER. Campbell, in particular, demonstrates why he is one of the most respected guitarists in rock and roll with a brilliant, monster, &quot;one-man Skynyrd&quot; solo in &quot;Running Down a Dream,&quot; a searing, atmospheric rocker that was a major hit single.\n\nOther enduring hits include the ubiquitous and perfect acoustiCali-pop of &quot;Free Falling,&quot; and the bluesy &quot;I Won't Back Down,&quot; which has become something of an anthem for anyone who believes in their cause. &quot;Love Is a Long Road&quot; was another cut that garnered significant airplay, with it's stuttering keyboard and guitar interplay.\n\nBut the &quot;famous&quot; songs are not all there is to this long-play master work. There's the witty and sprightly &quot;Yer So Bad,&quot; and the punky &quot;Apartment Song,&quot; and the folk-rock &quot;Feel a Whole Lot Better,&quot; which outflies the Byrds' original. &quot;Alright for Now&quot; is a gorgeous, spare lullabye, while &quot;A Mind With a Heart of Its Own&quot; rocks and rolls and tumbles with a Bo Diddley-esque jump. &quot;A Face in the Crowd&quot; aches with loneliness and longing while the giddy bounce of &quot;Zombie Zoo&quot; belies its own melancholy core.\n\nIn short, what's not to like? It's as good a folk-rock-pop confection as has ever been wrought, drawing on Petty's and Lynne's deep appreciation and experience with Brit-pop, California country-folk-rock, and even a touch of Southland swamps.\n\nWithout question, this is an absolutely essential recording for fans of all of the above. T Petty belongs in the pantheon of great singer-songwriters in the tradition of B Dylan, B Springsteen, B Seegar, J Mellencamp, N Young, J Cash, K Kristofferson, and W Nelson.\n\nIf you like this CD, you should also check out the Tom Petty &amp; the Heartbreakers CD entitled INTO THE GREAT WIDE OPEN, also produced by Jeff Lynne, and the upcoming Spring 2006 Petty/Lynne collaboration. Of course, the Traveling Wilburys VOLUME ONE and VOL. 3 recordings are a must, as is the Roy Orbison MYSTERY GIRL record. Finally, I highly recommend the book, CONVERSATIONS WITH TOM PETTY by Paul Zollo, which is a great read filled with revelations and great stories on every TP song","torrent":{"xt":"urn:btih:ac6b8276812554ee4d2c48efd510d99d9a58de9a","amp;dn":"Tom+Petty+-+Full+Moon+Fever+%5BFLAC%2BMP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac6b8276812554ee4d2c48efd510d99d9a58de9a","infoHashBuffer":{"type":"Buffer","data":[172,107,130,118,129,37,84,238,77,44,72,239,213,16,217,157,154,88,222,154]},"announce":[],"urlList":[]}}