{"title":"The Forbidden Manuscript T01-T03 (2009-2011) (complete)","uid":8866185,"size":175556497,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:ad952d1afd7c6e85fa2675e6935dc05959a3b9d4&amp;dn=The+Forbidden+Manuscript+T01-T03+%282009-2011%29+%28complete%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"AN0NYMOUS142857","files":-1,"time":1377912830,"description":"In 1950. Egon Bauer has picked the wrong time to undertake research in a monastery in the wilds of Tibet. People's Republic of China invaded the region and meeting little resistance. The clashes sometimes turn to the massacre, led by such a captain a little overzealous, Tongiu. It was he who controls the attack Bainang in which is the American anthropologist. The latter was about to make a discovery which would have shaken the foundations of Christianity by changing the interpretation of Scripture. Much of his work are recorded in a book which becomes the object of desire, that of Zhang Ziyi, who represents the Chinese government, but also that of men in black, the armed wing of the Church. Meanwhile in Los Angeles, Elen, the daughter of Egon Bauer, has languished for not having heard from his father. She decides to go looking for him in the company of a private detective, Kevin McBride.\n\nIf one of the themes of forbidden Manuscript for the resurrection of Christ, he might as well apply to the genesis of this series initiated in 2007 under the title of the Shadow of the time. Robert Laffont has decided to terminate its experience in the middle of the 9th Art, it is published by Delcourt, who bought the catalog and are assured the recovery of this title under a new name, perhaps more catchy. To mark the release of the second volume, the first is reissued with a cover, unpublished. At first glance, the scenario imagined by Roberto Dal Pra ' does not seem to get rid of countless others dealing with the translation of sacred texts that are jeopardizing the Christian dogmas. Yet even if the forbidden manuscript does not revolutionize the genre, elements make reading pleasant and almost manage to forget many of its predecessors. Starting with the geographical environment, shared among the Chinese border, Tibetan and Indian, but also history, in which the author draws certain events that integrate seamlessly into the narrative, whether the issue of Tibetan independence or the emergence of McCarthyism in Hollywood by one of the centers investigated. It is also thanks to characters particularly well researched that the charm works, each playing in its register, a partition without a hitch: Tongiu in the military's role limited and perverse Zhang Zivi in the agent's charms to pests or Elen, the lover and apprentice chilled adventurer. But it is especially Kevin McBride, a mixture of Humphrey Bogart and Indiana Jones, which fills the screen, a private whose false nonchalance is not unlike that of Sam Spade.\n\nThe work of Paolo Grella is equally remarkable. The boxes are painted so many paintings that draw the eye immediately, they represent the mountainous landscapes of Tibet and its monasteries. The faces on them are less or more depending on whether they express the ravages of time, like Egon Bauer, or youth and innocence of that of Elen. And if the result can sometimes seem a little outdated, it also evokes many films from Hollywood of the 50s. However, some scenes, overloaded by too strong a mixture of colors, lose a little clarity. The authors of the manuscript prohibited manage the feat to rekindle interest in a genre declined in all its forms. Despite a relatively classic, the story becomes involved in these pages, thanks to its cast of characters, endearing, and its graphical richness. If the third and final volume is correspondingly high, no doubt that the series could become a must in the field of esoteric thriller.","torrent":{"xt":"urn:btih:ad952d1afd7c6e85fa2675e6935dc05959a3b9d4","amp;dn":"The+Forbidden+Manuscript+T01-T03+%282009-2011%29+%28complete%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad952d1afd7c6e85fa2675e6935dc05959a3b9d4","infoHashBuffer":{"type":"Buffer","data":[173,149,45,26,253,124,110,133,250,38,117,230,147,93,192,89,89,163,185,212]},"announce":[],"urlList":[]}}