{"title":"Castle.Story.Prototype-RAiN","uid":8969832,"size":353872553,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ae83dc46c608797677b114b8b30aaa417f6531f0&amp;dn=Castle.Story.Prototype-RAiN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"AN0NYMOUS142857","files":-1,"time":1380313763,"description":"&gt; Castle.Story.Prototype-RAiN &lt;\n\nRls Date:27/Sep/2013\nLanguages:English\nRipped:\nType:Game\nProtection:money\nSize:xx mb\nReq:\n\nAbout\n\nCastle Story\n\nIndependent RTS game set in a world created with voxeli. Game mechanic combines economic strategy Stronghold series in style with elements inspired by the hit Minecraft sandbox. Fun collection consists mainly of raw materials and build castles and defend them against the invaders.\n\nStrategy, RTS, Kickstarter\n\nMarch 2013 (world premiere)\nMarch 2013 (premiered in the U.S.)\n\nlanguage:\nEnglish\n\nCastle Story is a RTS game combines elements of military-style economic strategy Stronghold series of dynamic voxelowym world reminiscent of the iconic Minecraft. This is the debut of the Canadian independent production studios Sauropod.\n\nAction Castle Story takes place in a world of suspended islands. The game was on an engine that uses voxeli, which provides fully dynamic terrain deformation. This allows you to cut down trees at will, digging tunnels or digging holes. Fun is mainly on building castles and then their defense against invaders. However, only the player is in charge and therefore must rely on his orders obedient settlers. Thanks to them, can explore new areas, collect resources and build structures.\n\nAll towers must be designed by hand, deciding on the location of each brick. This creates a three-dimensional architectural plan, which is then our subordinates transform into reality. Of course, this is done it is necessary to collect enough materials. For this purpose, we use the settlers in the role of miners.\n\nMechanics governing the construction work is very complex. We subordinates are able to climb obstacles just not high and the speed of their movement affects the weight carried by them. Therefore, the key to success is to provide a suitable settlers to come to concrete structural elements, so that cared without undue delay. We realize this goal include by placing the stone steps and bridges. After some time on the board and enter enemy forces begin siege of our fortress.\n\nCastle Story runs on the Unity engine, and all the graphics area is created voxeli. This gives the game a specific charm and makes it look like made of Lego bricks. The advantage is that the presence of the operating system based on the physics of environmental destruction and locks.\n\nInstall Notes\n\n1.Unpack\n2.Run It\n3.Enjoy\n\nNews and Greetings\n\nWir leben in einem Alptraum\nDas Erwachen wird der Selbstmord sein\nNur der Tod reibt sich die Haende\nDenn nur er alleine wird\nDer Sieger sein\n\nNOiR , VACE , SHELTER , TE , WaLMaRT\n\nFUCK YOU\n\n&gt;2013&lt;","torrent":{"xt":"urn:btih:ae83dc46c608797677b114b8b30aaa417f6531f0","amp;dn":"Castle.Story.Prototype-RAiN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae83dc46c608797677b114b8b30aaa417f6531f0","infoHashBuffer":{"type":"Buffer","data":[174,131,220,70,198,8,121,118,119,177,20,184,179,10,170,65,127,101,49,240]},"announce":[],"urlList":[]}}