{"title":"Beyond Our Differences --Sadhguru Jaggi Vasudev, Dalai Lama, etc","uid":4646764,"size":241341111,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:af1f995e01cae4c44962b8e85fec6cdb87508c03&amp;dn=Beyond+Our+Differences+--Sadhguru+Jaggi+Vasudev%2C+Dalai+Lama%2C+etc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"deepakgod","files":2,"time":1231911087,"description":"Entropy Films is proud to present Beyond Our Differences, a documentary film conceived and directed by Peter Bisanz that explores the positive role of faith in the world today and the fundamental unity of the worlds religions\nWhat are the fundamental issues facing our world today?\nWhere do world leaders and the biggest thinkers of our time\nin politics, religion, culture, arts and science\nweigh in on these issues?\nHow do these leaders apply their own experiences with faith and morality when forming constructive solutions for the world's most distressing and calamitous problems?\nIn what context do faith and religion play principal roles in inspiring our collective peoples toward a more peaceful and compassionate humanity?\nThese are the critical questions that Beyond Our Differences is striving to answer.\nWith all of the problems facing the world today -- war, poverty, weapons, environmental degradation, starvation, overpopulation and severe desperation among millions -- people are longing for meaning. Many find answers in religion or spirituality, but as a result faith and religion are often hijacked by those seeking to enhance their own power at the expense of others, often all in the name of God.\nWith this dichotomy in mind, we call upon key religious leaders, politicians, and luminaries in their fields to tackle the toughest and most complex issues in the modern age, and we ask what inspires them to affect positive change. We hope that by sharing their personal experiences, each person will provide a unique perspective on how to support and strengthen compassionate and non-violent activism when resolving difficult disputes.\nBeyond Our Differences provides a tapestry of distinct voices and viewpoints regarding spirituality, woven with one universal expression of hope. By providing such a variety of experiences in such an accessible format, we hope that individual viewers will understand this unified message of hope and will become empowered through their own expressions of faith to impact positive change in their lives and the lives of others.\nThis documentary features interviews with a lot of famous personalities and religious leaders. A few of them are:\nHis Holiness the Dalai Lama\nSadhguru Jaggi Vasudev\nSwami Sahajananda\nDeepak Chopra\nMarianne Williamson\nEla Gandhi, Granddaughter of Mahatma Gandhi\nMichael Bernard Beckwith\nTenzin Robert Thurman and lots more,,,,,,,,,,","torrent":{"xt":"urn:btih:af1f995e01cae4c44962b8e85fec6cdb87508c03","amp;dn":"Beyond+Our+Differences+--Sadhguru+Jaggi+Vasudev%2C+Dalai+Lama%2C+etc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af1f995e01cae4c44962b8e85fec6cdb87508c03","infoHashBuffer":{"type":"Buffer","data":[175,31,153,94,1,202,228,196,73,98,184,232,95,236,108,219,135,80,140,3]},"announce":[],"urlList":[]}}