{"title":"Rosie Thomas - With Love [2012] [EAC/FLAC]","uid":11722860,"size":215223146,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:af40c6bdaade6dd625f34fd4fb5c8f1228e2b4b0&amp;dn=Rosie+Thomas+-+With+Love+%5B2012%5D+%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":13,"time":1424925687,"description":"FLAC / Lossless / Log (100%) / Cue \nLabel/Cat#: Sing-A-Long #223\nCountry: USA\nYear: February 14, 2012\nGenre: singer songwriter,folk\nFormat:CD\n\n01. Where Was I \n02. Over The Moon \n03. In Time \n04. Like Wildflowers \n05. Two Worlds Colide \n06. 2 Birds \n07. Is This Love \n08. Back To Being Friends \n09. Really Long Year \n10. Sometimes Love\n\nIn the four eventful years since 2008's A Very Rosie Christmas, multi-talented actress, standup, and vocalist Rosie Thomas has faced a lengthy battle with illness, married her folksinger partner Jeff Shoop, and relocated from Seattle to New York, as well as finding the time to tour with Iron &amp; Wine and appear in two independent films. It's therefore unsurprising that her sixth studio album, With Love, sees her attempt to slow down the pace on ten wistful and elegant piano-pop tracks that recall the '90s coffeehouse fare of Jann Arden, Shawn Colvin, and Sarah McLachlan. Always the most mellow artist on the Sub Pop roster, her first non-festive release away from the iconic label is arguably her most delicate since 2001 debut When We Were Small, with only the propulsive basslines of &quot;Over the Moon&quot; and the dreamy harmony-laden &quot;Is This Love?&quot; coming anywhere close to shifting into second gear. Indeed, its Valentine's Day release date couldn't have been more appropriate, as the warm inviting production from Dave Bazan (Pedro the Lion) and Blake Wescott (Damien Jurado) tastefully surrounds Thomas' romantic reflections and bittersweet intimate tones with gentle acoustic hooks, shuffling brush-stroke rhythms, and understated strings, whether it's the Sunday morning soul-pop of &quot;Back to Being Friends,&quot; the impassioned torch song &quot;Two Worlds Collide,&quot; or the melancholic balladry of &quot;Like Wildflowers.&quot; Those who shudder at the thought of a Dawson's Creek soundtrack should steer well clear, but loved-up fans of good old-fashioned singer/songwriter pop will find plenty to enjoy here","torrent":{"xt":"urn:btih:af40c6bdaade6dd625f34fd4fb5c8f1228e2b4b0","amp;dn":"Rosie+Thomas+-+With+Love+%5B2012%5D+%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af40c6bdaade6dd625f34fd4fb5c8f1228e2b4b0","infoHashBuffer":{"type":"Buffer","data":[175,64,198,189,170,222,109,214,37,243,79,212,251,92,143,18,40,226,180,176]},"announce":[],"urlList":[]}}