{"title":"The History Channel - The Vietnam War","uid":4693861,"size":2204192768,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:af82f9b4906df31d8621d18f4e41260c635b8991&amp;dn=The+History+Channel+-+The+Vietnam+War&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"bcbudman","files":-1,"time":1233489284,"description":"This is the War as it was. America's first televised war comes starkly and comprehensively alive in this sweeping documentary collection.\n\nThe best material from the archives of THE HISTORY CHANNEL and CBS News.\n7 complete documentaries on 2 discs offer rare insight into critical elements of the Vietnam War.\nContemporary footage and commentary capture the Vietnam experience as it happened.\n\n\n\nIn this remarkable, definitive DVD set, the perspective of history and the immediacy of lived experience come together in a carefully selected group of documentaries that examine the telling moments of the Vietnam War.\n\nAt a total cost of more than 3.1 million lives, the Vietnam conflict is, to date, America's longest and most controversial war. It also marked the first time TV journalists ventured to the frontlines to bring the spectacle of combat into American living rooms. Across the nation, Americans watched, captivated by the surprise Tet Offensive and the slow-motion tragedy of the 77-day Battle of Khe Sanh, and inspired by the courage and skill of American soldiers at decisive engagements like Ia Drang Valley, Con Thien, and Dak To. \n\nThis special collection profiles the decision-makers of the Vietnam War and chronicles each key event, from the advisors' arrival in 1959 to the airlift from the roof of the American Embassy in 1975. Archival footage and interviews with historians and veterans reveal the military and political strategies in play, and CBS News archives take viewers to the frontlines to witness the daily struggles of American servicemen and women. \n\nThe VIETNAM WAR DVD SET includes:\n\nAmerica Enters the War (On the Frontlines) \nTet in Saigon and Hue War (On the Frontlines)\nRinging Down the Curtain (On the Frontlines)\nThe End Game (On the Frontlines)\nLBJ and Vietnam: In the Eye of the Storm\nCommand Decisions: Tet Offensive\nUnsung Heroes: The Battle of Khe Sanh\n\n","torrent":{"xt":"urn:btih:af82f9b4906df31d8621d18f4e41260c635b8991","amp;dn":"The+History+Channel+-+The+Vietnam+War","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af82f9b4906df31d8621d18f4e41260c635b8991","infoHashBuffer":{"type":"Buffer","data":[175,130,249,180,144,109,243,29,134,33,209,143,78,65,38,12,99,91,137,145]},"announce":[],"urlList":[]}}