{"title":"Iggy Pop - A Million In Prizes Anthology 2005 FLAC vtwin88cube","uid":10346097,"size":1212103073,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:af978a5afc1e4c81f68b798ef9ac178052128561&amp;dn=Iggy+Pop+-+A+Million+In+Prizes+Anthology+2005+FLAC+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":5,"uploader":"vtwin88cube","files":-1,"time":1402606222,"description":"Iggy Pop\nA Million In Prizes:\nThe Anthology (2005)\n\n\n\n\n\nAllmusic.com...\n\nIf you're willing to count his work in such early regional bands as the Prime Movers and the Iguanas, Iggy Pop has been playing rock &amp; roll for over 40 years as this compilation hits the stores -- meaning there are guys in big-league rock bands who've spent years trying to be Iggy but weren't even alive when the guy first started plugging into the Real O Mind. That, dear readers, is influence, and while the man has had more than his share of creative ups and downs over those four decades, one spin of A Million in Prizes: The Anthology tells you why Iggy has always mattered, and still does -- he has never lost the ability to plug into the primal madness and furious belief that separates great rock &amp; roll from ordinary stuff, and he can call up that near-demonic passion on a regular basis. While this isn't the first career-inclusive Iggy compilation, A Million in Prizes is comprised of two full-loaded CDs, which gives it a scale and scope that bests its closest competition, 1996's solid Nude &amp; Rude: The Best of Iggy Pop, and it also gives full props to his work with the Stooges, featuring 11 songs from that band's various incarnations (though whose idea was it to only include one track from the epochal Fun House? For shame!). As for the solo stuff, this set follows the bizarre roller-coaster ride from the gloomy self-reappraisal of his albums with David Bowie through his desperate efforts to find his own solo voice in the 1980s to his reemergence in the new millennium as an artist who can merge mind and muscle with equal force. While not every album is represented on A Million in Prizes, this offers an accurate and compelling look at the Iggy time line, and the mastering is strong, clear, and loud (especially on the earlier material, which has long merited aural refurbishing). The liner essays from Danny Fields and Lenny Kaye are excellent, and Iggy sums himself pretty well when he tells Fields, &quot;I get up in the morning, I look in the mirror, and I think, 'Hey, you're a pretty interesting guy.'&quot; That may well be rock's greatest understatement, and while A Million in Prizes is hardly the final and definitive statement on Iggy Pop's life and music, as an introduction and career overview it's damn near unbeatable -- at least until Iggy finally gets the box set treatment he so richly deserves.\n\n\nGenre................: Punk Rock\nSource...............: CD {Virgin CDVUSD 266}\nYear.................: 2005\nQuality..............: Free Lossless Audio Codec (FLAC)\nIncluded.............: Covers, Cue, Log, Audiochecker\n\n\nCD1\n\n01.1969\n02.No Fun\n03.I Wanna Be Your Dog\n04.Down On The Street\n05.I Got A Right!\n06.Gimme Some Skin\n07.I'm Sick Of You\n08.Search And Destroy\n09.Gimme Danger\n10.Raw Power\n11.Kill City\n12.Nightclubbing\n13.Funtime\n14.China Girl\n15.Sister Midnight\n16.Tonight\n17.Success\n18.Lust For Life\n19.The Passenger\n\nCD2\n\n01.Some Weird Sin\n02.I'm Bored\n03.I Need More\n04.Pleasure\n05.Run Like A Villain\n06.Cry For Love\n07.Real Wild Child (Wild One)\n08.Cold Metal\n09.Home\n10.Candy (With Kate Pierson)\n11.Well, Did You Evah! (With Deborah Harry)\n12.Wild America\n13.T.V. Eye (Live Felle Festival, Ireland 1993)\n14.Loose (Live Felle Festival, Ireland 1993)\n15.Look Away\n16.Corruption\n17.I Felt The Luxury (With Medeski Martin + Wood)\n18.Mask\n19.Skull Ring\n\n\n\n\nSupport The Artists.\n Buy it if you like it!\n\n Thanks for Seeding\nCheers..\t","torrent":{"xt":"urn:btih:af978a5afc1e4c81f68b798ef9ac178052128561","amp;dn":"Iggy+Pop+-+A+Million+In+Prizes+Anthology+2005+FLAC+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af978a5afc1e4c81f68b798ef9ac178052128561","infoHashBuffer":{"type":"Buffer","data":[175,151,138,90,252,30,76,129,246,139,121,142,249,172,23,128,82,18,133,97]},"announce":[],"urlList":[]}}