{"title":"Tres Logos [Hardcover Scan] Robert Klanten (Editor), Nicolas Bou","uid":7277440,"size":317804686,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aff8bb5bebe4bf9ec2f4e5dab6017254911a1e82&amp;dn=Tres+Logos+%5BHardcover+Scan%5D+Robert+Klanten+%28Editor%29%2C+Nicolas+Bou&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"erbdout","files":7,"time":1337332744,"description":"Logo design is one of the most crucial and challenging tasks in graphic design. Seemingly simple, The Logo becomes the indispensable face of companies and conveys the brand's identity and philosophy.\n\nLos Logos and Dos Logos documented this unceasing evolution. Expanding on the previous editions, Tres Logos demonstrates how influences from illustration and street art have become increasingly evident in logo design inspiring ornamental patterns with logos replacing the abstract tag. Additionally, companies are becoming more daring and exploiting their logos to identify their brand with a certain style and appeal.\n\nFully indexed and structured thematically, the book draws connections between the applications and the field for which it was intended. Like its predecessors, Tres Logos explores the exceptional visual language and stylistic approaches to logo creation by designers around the globe, exhibiting thousands of examples and simultaneously providing information about the &quot;makers'&quot; personal approach.\n\nTres Logos is a state of the art visual encyclopedia on the current state and evolution of Logo Design.\n\n\nERB - Amazing book that has offered countless ideas for me to expand on. This is an indispensable tool in the work kit of any self respecting graphic designer.","torrent":{"xt":"urn:btih:aff8bb5bebe4bf9ec2f4e5dab6017254911a1e82","amp;dn":"Tres+Logos+%5BHardcover+Scan%5D+Robert+Klanten+%28Editor%29%2C+Nicolas+Bou","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aff8bb5bebe4bf9ec2f4e5dab6017254911a1e82","infoHashBuffer":{"type":"Buffer","data":[175,248,187,91,235,228,191,158,194,244,229,218,182,1,114,84,145,26,30,130]},"announce":[],"urlList":[]}}