{"title":"The HarperCollins Bible Dictionary (1996)","uid":5512038,"size":73433872,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b0ac0a84c7ff57f1d5fa860ae23cc121ba06bb9d&amp;dn=The+HarperCollins+Bible+Dictionary+%281996%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"artpepper","files":-1,"time":1272097074,"description":"The HarperCollins Bible Dictionary, Revised Edition\n\nHarperCollins | 1996 | ISBN: 0060600373 | PDF | 1280 pages | 69 MB\n\n\n\n\n\n\n\n\nThe HarperCollins Bible Dictionary puts the latest and most comprehensive biblical scholarship at your fingertips. Here is everything you need to know to fully understand the Old Testament, the Apocrypha, and the New Testament. \n\n\nAn unparalleled resource, The HarperCollins Bible Dictionary explains every aspect of the Bible, including biblical archaeology, culture, related writings such as the Dead Sea Scrolls, the Bible's influence on Western civilization, biblical history, theological concepts, modern biblical interpretations, flora and fauna, climate and environment, crafts and industry, the content of individual books of the bible, and more.\n\n\n\n\nThe HarperCollins Bible Dictionary features:\n\n\n\n    * Contributions by 193 noted experts on the Bible and the ancient Near East\n    * More than 3700 entries covering the Bible from A to Z\n    * Outlines for each book of the Bible\n    * 590 black-and-white photographs\n    * 53 color photographs\n    * An updated pronunciation guide\n    * 72 black-and-white maps\n    * 18 color maps\n    * Dozens of drawings, diagrams, and tables\n\n\n\n\n\n\nAmazon.com Review:\n\n\n&quot;For the maps alone, this book is worth it. Following 1,250 pages that describe and explain the people, places, terms, and events of the Bible from Aaron to Zurishaddai, the 16 spectacular maps detail the political entities and boundaries of biblical times, bringing the historic times to vivid life. A fascinating book, an impressive collection of scholarship, and a possession to cherish, the 188 contributors and five editors show what can be produced if you don't cut corners on excellence.&quot;\n\n\n\n\nFrom Library Journal:\n\n\n&quot;In the field of biblical studies, the past ten years have seen continuing archaeological discoveries, new trends in biblical criticism, and the release of the full corpus of the Dead Sea Scrolls. Thus, it is entirely fitting that a new edition of a standard Bible dictionary appear. \n\nThe first edition of The HarperCollins Bible Dictionary (under the title Harper's Bible Dictionary, LJ 1/96) was well received by scholars, students, and lay readers. This edition has been expanded and revised, with approximately 25 percent of the material either new or updated. \n\nThe number of contributors has also increased, from 179 to 193. The work has retained the two-column format, with 16 single-column articles interspersed throughout (including &quot;Art in the Biblical Period,&quot; &quot;Jesus Christ,&quot; and &quot;The Temple&quot;), and it is well illustrated. Many of the longer articles include a brief bibliography (most of which have been updated from the first edition).\n\nIt is outstanding in terms of scholarship and writing. All biblical studies collections should have this new work (balanced by New Bible Dictionary, InterVarsity, 1996. 3d ed., which represents current evangelical scholarship), even if they already own the previous edition.&quot;","torrent":{"xt":"urn:btih:b0ac0a84c7ff57f1d5fa860ae23cc121ba06bb9d","amp;dn":"The+HarperCollins+Bible+Dictionary+%281996%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0ac0a84c7ff57f1d5fa860ae23cc121ba06bb9d","infoHashBuffer":{"type":"Buffer","data":[176,172,10,132,199,255,87,241,213,250,134,10,226,60,193,33,186,6,187,157]},"announce":[],"urlList":[]}}