{"title":"Poltergeist.1982.Dvd5.NLsub.+.Multisub","uid":10441340,"size":4387091286,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b10ab55a6cb3f4e59115927909c3df19933b0507&amp;dn=Poltergeist.1982.Dvd5.NLsub.%2B.Multisub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"hendriknld","files":13,"time":1403892455,"description":"Het eerste deel van de horrorfilm-reeks Poltergeist werd geregisseerd door Tobe Hooper en kwam uit op 4 juni 1982. Het verhaal werd geschreven door onder andere Steven Spielberg, die ook over de productie ging. De film werd uitgebracht door MGM en duurt 114 minuten. Er gaan verhalen rond dat de film voor het grootste gedeelte door Spielberg zelf is geregisseerd omdat hij van mening verschilde met Hooper.\nHet normale leventje van de familie Freeling wordt verstoord wanneer er klopgeesten aanwezig blijken in hun huis. Ze praten met jongste dochter Carol Anne (Heather O'Rourke) via de televisie. Het huis van de Freelings blijkt te zijn gebouwd op een oude Indiaanse begraafplaats.\nIn het begin lijken de geesten niet gevaarlijk. Ze doen dan nog niemand wat aan en de familie heeft zelfs schik in de meeste rare voorvallen waar de geesten verantwoordelijk voor zijn. Maar dan worden ze agressief en ontvoeren ze Carol Anne naar hun dimensie. Ze zien in haar de gids die ze naar het licht moet brengen waar ze naar verlangen. Het paranormale vrouwtje Tangina (Zelda Rubinstein) schiet te hulp.\n\nWith Poltergeist, directed by Tobe Hopper, Steven Spielberg had his first great success as a producer. Released around the same time as Spielberg's E.T., the film presents the dark side of Spielberg's California suburban track homes. The film centers on the Freeling family, a typical middle class family living in the peaceful Cuesta Verde Estates. The father, Steve (Craig T. Nelson), has fallen asleep in front of the television, and the dog saunters around the house revealing the other familymembers -- Steve's wife Diane (JoBeth Williams), sixteen-year-old daughter Dana (Dominique Dunne), eight-year-old son Robbie (Oliver Robins), and five-year-old Carol Ann (Heather O'Rourke). Soon strange things begin to happen around the house; the pet canary dies, mysterious storms occur, and Carol Ann is summoned to the TV set, where a strange shaft of green light hits her and causes the room to shake (&quot;They're he-e-ere!&quot;). As curious events continue, Carol Ann is repeatedly drawn to the television, where she begins to talk to &quot;the TV people.&quot; Soon Carol Ann is sucked into a closet, disappearing from this reality plane. Unable to find his daughter, Steve consults Dr. Lesh (Beatrice Straight), a para-psychologist from a nearby college. Lesh finds that paranormal phenomena is so strong in the Freelong household she is unable to deal with it and sends for clairvoyant and professional exorcist Tangina (Zelda Rubinstein) to examine the house in hopes of finding Carol Ann. Tangina makes a horrifying discovery: Carol Ann is alive and in the house, but is being held on another spectral plane. ~ Paul Brenner, Rovi\n","torrent":{"xt":"urn:btih:b10ab55a6cb3f4e59115927909c3df19933b0507","amp;dn":"Poltergeist.1982.Dvd5.NLsub.%2B.Multisub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b10ab55a6cb3f4e59115927909c3df19933b0507","infoHashBuffer":{"type":"Buffer","data":[177,10,181,90,108,179,244,229,145,21,146,121,9,195,223,25,147,59,5,7]},"announce":[],"urlList":[]}}