{"title":"James Brown - Live At The Apollo Volume II: Deluxe Edition (320k","uid":4301438,"size":228439152,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b11a5016611506ba8038c6ff217f8a8d2ecb4e75&amp;dn=James+Brown+-+Live+At+The+Apollo+Volume+II%3A+Deluxe+Edition+%28320k&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dankencity","files":24,"time":1216325860,"description":"James Brown - Live At The Apollo Volume II: Deluxe Edition ripped in 320kbps w/ artwork.\n\n\n1.\tIntroduction to the James Brown Show - (with Frankie Crocker)\n2.\tThink - (with Marva Whitney)\n3.\tI Wanna Be Around\n4.\tJames Brown (Thanks)\n5.\tThat&amp;#039;s Life\n6.\tKansas City\n7.\tSweet Soul Music - (with Bobby Byrd)\n8.\tIt&amp;#039;s A Man&amp;#039;s Man&amp;#039;s Man&amp;#039;s World / Lost Someone / When A Man Loves A Woman\n9.\tCaravan - (with The James Brown Band/The J.B Dancers)\n\n1.\tIntroduction to Star Time! - (with Frankie Crocker/Sad Sam)\n2.\tMoney Won&amp;#039;t Change You / Out Of Sight\n3.\tBring It Up\n4.\tTry Me\n5.\tLet Yourself Go\n6.\tThere Was a Time\n7.\tI Feel All Right\n8.\tCold Sweat\n9.\tPrisoner of Love\n10.\tMy Girl - (Instrumental Interlude instrumental)\n11.\tMaybe the Last Time\n12.\tI Got You (I Feel Good)\n13.\tPlease, Please, Please\n14.\tBring It up (Finale)\n\n\nAs a whole, this double album is pretty erratic -- there are a bunch of torchy R&amp;B ballads that were somewhat anachronistic in light of the explosive funk innovations Brown was unleashing in the studio during this time, and some of those funk hits are reprised here in super-brief versions that seem to cut off before they have a chance to get started. On the other hand, some of it is as essential as anything else Brown ever recorded. In particular, the 20-minute medley of &quot;Let Yourself Go/There Was a Time/I Feel All Right/Cold Sweat&quot; is a magnificent, seamless ball of energy, a landmark performance in the evolution of soul and funk. Other highlights are &quot;Bring It Up&quot; and an 11-minute &quot;It&amp;#039;s a Man&amp;#039;s, Man&amp;#039;s, Man&amp;#039;s World.&quot; ~ Richie Unterberger, All Music Guide\n\nIf the purpose of the &quot;Deluxe Edition&quot; of Live at the Apollo, Vol. II is to make the best even better, the mission is more than accomplished. Not only has the original running time been increased by over half an hour -- re-creating an entire performance, but also the sound, is likewise all encompassing and complete. According to Alan Leeds -- tour director of the James Brown show in the late &amp;#039;60s -- by 1968 Brown was honored with the distinction of selling one million concert tickets during his various appearances at the famed Apollo Theatre. The first volume of Live at the Apollo [1963] captures the R&amp;B fury that would single-handedly define the soul music genre. While this volume reveals Brown&amp;#039;s updated stage show, it more importantly offers another prolific observation into the future of R&amp;B -- funk. It would be nearly two years before Brown would discover the likes of Bootsy Collins and ultimately form the JBs. However, as Live at the Apollo, Vol. II testifies, &quot;soul brother number one&quot; is already submerging his band into more extended musical tangents, bobbing and weaving within a tight framework. This yields exciting new readings of familiar classics such as &quot;It&amp;#039;s a Man&amp;#039;s Man&amp;#039;s Man&amp;#039;s World.&quot; Not only does Brown brilliantly incorporate the track &quot;Lost Someone&quot; -- recalling the extended workout given on Live at the Apollo [1963] -- Brown&amp;#039;s percussive, heart-attack inducing call and response will leave even the most unflappable enthusiast slack jawed. This &quot;expanded edition&quot; also incorporates soloists, as well as other featured musicians who were often part of Brown&amp;#039;s revue. Included on this release are previously unissued performances by Bobby Byrd (&quot;Sweet Soul Music&quot;) and the James Brown Band (&quot;Caravan&quot;). The sonic brilliance on this double-disc set is visually matched in the 28-page liner notes booklet. Replete with newly published photos and memorabilia circa Brown&amp;#039;s 1967 spring and summer tours, the booklet also features essays from Allen Leeds and percussionist Ahmir Khalib Thompson, aka ?uestlove. ~ Lindsay Planer, All Music Guide\n\n\nThanks to the paradigm-shifting success of his first Live at the Apollo LP from 1963, James Brown and the famed Harlem theater were all but synonymous in the &amp;#039;60s. By the time Brown recorded there again in early summer of 1967, his music had undergone tremendous changes, as revolutionary for R&amp;B as John Coltrane&amp;#039;s sheets-of-sound approach was for jazz. This second Live at the Apollo caught Brown giving full stick to both his classic soul-ballad style and the funk his band was developing practically in front of the crowds&amp;#039; ears. Even better than previous issues is this terrifically remastered version. It adds nearly 25 minutes of previously edited tape, most significantly the pivotal &quot;Let Yourself Go&quot;/&quot;There Was a Time&quot;/&quot;I Feel All Right&quot; funk workout and an &quot;It&amp;#039;s a Man&amp;#039;s Man&amp;#039;s Man&amp;#039;s World&quot; that extends to a third of an hour here. The revisions add to the you-are-there feel of one of Brown&amp;#039;s must-own albums, as do photos and credits that acknowledge everyone from stellar players like Maceo Parker and Clyde Stubblefield to the troupe&amp;#039;s hairdresser and Learjet pilot. --Rickey Wright, Amazon.com","torrent":{"xt":"urn:btih:b11a5016611506ba8038c6ff217f8a8d2ecb4e75","amp;dn":"James+Brown+-+Live+At+The+Apollo+Volume+II%3A+Deluxe+Edition+%28320k","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b11a5016611506ba8038c6ff217f8a8d2ecb4e75","infoHashBuffer":{"type":"Buffer","data":[177,26,80,22,97,21,6,186,128,56,198,255,33,127,138,141,46,203,78,117]},"announce":[],"urlList":[]}}