{"title":"The Raspberries - Capitol Collectors Series (1991)","uid":8636808,"size":476660048,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b12a19cfb607a00faa17edc8a15e33a262c19868&amp;dn=The+Raspberries+-+Capitol+Collectors+Series+%281991%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":null,"files":29,"time":1372775414,"description":"This is the same torrent that was uploaded to Demonoid in August 2011.\n\n\nThe Raspberries - Capitol Collectors Series (1991)\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51N4NQQJHEL._SL500_AA300_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51N4NQQJHEL._SL500_AA300_.jpg&lt;/a&gt;\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com)\nDVD-ROM: LG GDR816B\nTracks have full tags (including embedded thumbnail)\nAMG Bio.txt\nAMG Review.txt\ninfo.txt (which is simply these notes included in the torrent)\n\nFirst biography paragraph from All Music (by Jason Ankeny):\n\nThe Raspberries cut through the epic pretensions and pomposity of '70s-era rock to proudly reclaim the spirit and simplicity of classic pop, recalling the heyday of the British Invasion with their exquisitely crafted melodies and achingly gorgeous harmonies. The group was formed in Mentor, OH, in early 1970 by singer/songwriter Eric Carmen and drummer Jim Bonfanti, local pop heroes thanks to the respective tenures in the hugely popular bands Cyrus Erie and the Choir; guitarist Wally Bryson and bassist John Aleksic (both Choir veterans as well) completed the original lineup, which made its live debut in mid-October. With their short hair, matching suits, and Beatlesque sound, the Raspberries ran in direct opposition to the prevailing hard rock mentality of the Cleveland scene, but after just a handful of gigs, the band was among the city's most popular live acts. However, after cutting their first demo session, Aleksic left the lineup in March of 1971, and with the addition of rhythm guitarist Dave Smalley, Carmen assumed bass duties.\n\nRead all of the bio at: &lt;a href=&quot;\nhttp://www.allmusic.com/artist/the-raspberries-p5229/biography&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/artist/the-raspberries-p5229/biography&lt;/a&gt;\n\nAll Music Album Review (by Bruce Eder):\n\nIntermixing singles with the band's best accompanying album tracks, this 20-song retrospective gives a good overall impression of the Raspberries' strengths across their two years of recording, as well as hints of some weaknesses in the way they were represented on record. As expected, Eric Carmen is the dominant songwriter, but Wally Bryson and David Smalley also show up with &quot;Last Dance&quot; and &quot;Hard to Get Over a Heartbreak,&quot; respectively, along with Scott McCarl (&quot;Rose Coloured Glasses&quot;), to give a hint of the range of composing talent in the band in its different phases. It's astonishing how many of their LP cuts would have made superb singles in their own right. It's clear listening to this collection that, between the record company's apparent inability to market their material to its fullest potential and the group's fear of sounding too English, that some killer tracks, like &quot;Nobody Knows&quot; with appealing hooks, a great beat, and overflowing with melodic teen angst, and &quot;Hard to Get Over a Heartbreak,&quot; were overlooked as potential singles. Of course, the disputes over songwriting and the matter of who was represented on their singles (and where, the A- or B-side) were among the factors that helped kill the Raspberries after only a couple of years. This collection delineates a lot of the problems in the course of presenting the group's triumphs. An unusual amount of care has been taken in assembling the songs -- they all sound better than the original records, and the hotter single mix of &quot;Overnight Sensation&quot; graces this disc. A serious fan may well want to own CDs of the group's complete albums (available on RPM Records on two CDs), but this is one time that Capitol Records did right by one of its own acts.\n\nTaken from: &lt;a href=&quot;\nhttp://www.allmusic.com/album/the-capitol-collectors-series-r16187/review&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/album/the-capitol-collectors-series-r16187/review&lt;/a&gt;\n\nAmazon.com's page: &lt;a href=&quot; http://www.amazon.com/dp/B000005JMG&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.amazon.com/dp/B000005JMG&lt;/a&gt;\n\nTrack List:\n\n01. Go All The Way\n02. Come Around And See Me\n03. I Saw The Light\n04. Don't Want To Say Goodbye\n05. I Wanna Be With You\n06. Let's Pretend\n07. I Reach For The Light\n08. Nobody Knows\n09. If You Change Your Mind\n10. Drivin' Around\n11. Tonight\n12. Last Dance\n13. Hard To Get Over A Heartbreak\n14. I'm A Rocker\n15. Ecstacy\n16. Overnight Sensation\n17. Party's Over\n18. Rose Coloured Glasses\n19. Cruisin' Music\n20. Starting Over\n21. Radio Promo for 'Fresh Raspberries'\n22. Radio Promo for 'Starting Over'\n","torrent":{"xt":"urn:btih:b12a19cfb607a00faa17edc8a15e33a262c19868","amp;dn":"The+Raspberries+-+Capitol+Collectors+Series+%281991%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b12a19cfb607a00faa17edc8a15e33a262c19868","infoHashBuffer":{"type":"Buffer","data":[177,42,25,207,182,7,160,15,170,23,237,200,161,94,51,162,98,193,152,104]},"announce":[],"urlList":[]}}