{"title":"Sleepwalking Through the Mekong","uid":4619396,"size":364323230,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b174c46e63465309bbb88ebe77efb61fb270d9e9&amp;dn=Sleepwalking+Through+the+Mekong&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"FatDragonFly","files":1,"time":1230975782,"description":"Sleepwalking Through the Mekong\nsdtv xvid\n\nsubtitle : English\n\nCategory: Documentaries\n\nRegions: South Asia\n\nTopics: Music / Art / Culture\n\nSleepwalking Through the Mekong follows Los Angeles-based band Dengue Fever on their recent journey to Cambodia to perform classic 60s and 70s Cambodian rock n' roll in the country where it was created, made popular, and very nearly destroyed. The odyssey is a homecoming for singer Chhom Nimol, and a transformation for the rest of the band as they perform with master musicians and record new songs along the way. More than a rockumentary, the film serves up a portrait of modern Cambodia as the band tours through Phnom Penh and beyond, crossing a great cultural chasm with the same spirit of Cambodia's original rock pioneers.\n\n\n\nCambodia is often synonymous with the brutal Khmer Rouge regime that left millions dead and scattered refugees around the globe. This tragedy overshadows the story of Cambodia's music scene in the 1960s and 1970s. Cambodian musicians reinvented Western rock n' roll with a distinctly Khmer flavor to create a sound that is at once familiar and completely original. Sleepwalking Through the Mekong celebrates this vibrant but long-overlooked music and reveals the power of music to weave a common thread between extremely different cultures.\n\n \n\nLEARN MORE:\n\nVisit the official website of Sleepwalking Through the Mekong\n\nWatch Link's World Music special with Dengue Fever\n\n\n \n\nAbout DOC-DEBUT\n\nThis film is airing as part of DOC-DEBUT, a series on Link TV highlighting unique and groundbreaking international documentary films. Each week features the U.S. television premiere of a new foreign doc, offering American audiences unprecedented perspectives on world events and culture, as seen through the eyes of individuals across the globe. The series also provides a unique outlet for films by independent directors and producers to reach a much wider international audience.","torrent":{"xt":"urn:btih:b174c46e63465309bbb88ebe77efb61fb270d9e9","amp;dn":"Sleepwalking+Through+the+Mekong","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b174c46e63465309bbb88ebe77efb61fb270d9e9","infoHashBuffer":{"type":"Buffer","data":[177,116,196,110,99,70,83,9,187,184,142,190,119,239,182,31,178,112,217,233]},"announce":[],"urlList":[]}}