{"title":"Vangelis - The City + Voices TQMP","uid":4872842,"size":542316308,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b1856a972099468e1e78824bcff0f80e4b03808e&amp;dn=Vangelis+-+The+City+%2B+Voices+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zootallure","files":34,"time":1240934989,"description":"This two cds are in one jewel case and the artwork is uniform, so I've put them in one torrent.\n\nThe City is a 1990 album by Vangelis. It was produced entirely in a Rome hotel room, where Vangelis was staying to witness the filming of the Roman Polanski film Bitter Moon. It can be seen as a concept album in many respects, citing concepts from urban life and alluding to the big city atmosphere.\nVangelis plays all instruments, exclusively synthesizers and drum machines. Vocals are by various guest artists, with narrative by Roman Polanski and Emmanuelle Seigner. Vangelis employs a wide range of styles, from jazz (2) and rock (3) to new age (5, 6). Instrument patches are all synthesizer-based, but sound very convincing (trumpet on 1, guitar on 3, cello on 8).\n\nVoices is a 1995 album by Vangelis.\n\nIts music was used in the soundtrack for the 1998 documentary Deep Seas, Deep Secrets co-produced by The Learning Channel and Discovery Channel, together with music from Vangelis next album, Oceanic.\n\nThe track &quot;Ask the Mountains&quot; was also used as the music for the TV commercial for the Hotpoint/Ariston Aqualtis washing machine.\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at: &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\nSay Ã‚Â»thank youÃ‚Â« by seeding... just seed, it is not harmful to your health :-)","torrent":{"xt":"urn:btih:b1856a972099468e1e78824bcff0f80e4b03808e","amp;dn":"Vangelis+-+The+City+%2B+Voices+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1856a972099468e1e78824bcff0f80e4b03808e","infoHashBuffer":{"type":"Buffer","data":[177,133,106,151,32,153,70,142,30,120,130,75,207,240,248,14,75,3,128,142]},"announce":[],"urlList":[]}}