{"title":"Meditation Buddhist Reincarnation Yogi Tibet SuperPack","uid":4376188,"size":2804739593,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:b1d86cc6463c42b9a9930332bf9612e4fabba9ca&amp;dn=Meditation+Buddhist+Reincarnation+Yogi+Tibet+SuperPack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"SexyChimpy","files":253,"time":1220419068,"description":"If Meditation Buddhism Reincarnation Yogi's or Tibet interests you this is the source!\n\nThis is good for initiates and advanced, The best in each! \n\nThe Yogis of Tibet\nThe secrets of the most advanced deep mediators, the first interviews ever.\nYou will be blown away if never watched before!\n\nAlan Watts on Zen Clues Complete 112 mins, audio Brilliant on of my favorites from him, plus a collection of digitally remastered, lectures &amp; chats by him on Buddhism and its history, philosophy and practice.\n\nGuided Lamrim Meditation (internal jihadist meditation lol, aka tantra gain enlightenment in one lifetime!)\n\nBig Om of Tibet \nRare audio of monks in Tibet chanting and doing rituals. (the offering to the mandala of compassion is amazing)\n\nTibetan Sound Healing, Guided By Monk of the relevant Lineage (speciality sound, mantra etc) Video (Flash) how to Chant properly OM Ah etc, \n\nAudio complete from Britain's longest retreat meditator - includes meditation guidance. In zip file.\n\nVarious Books, Sutras treatise PDF and Word\n\nYangsi Rinpoche Buddha Nature Complete\n\nVen Gareth Sparham Buddhist Morality Complete\n\nObjects of Meditation for you :-)\nImages Mandalas Mantras and Deities, Dalai Lama, Buddha \n\nTara the Recognised Western Reincarnation now called &quot;JetsumaÃƒÂ¢&quot; Her Teachings\n\nThe Wondrous Vietnamese Monk Thich Nhat Hanh.The Present Moment.A Retreat on the Practice of Mindfulness Complete 6Disc Guided \n\nExtras Documentaries watch a Sand Mandala being made by Tibetan Monks its meaning and Ceremony, \nMessage of the Tibetans Tantrism The Yogis, \n\nFive Rites for Long Life and Health Youth Guided, \n\nDecoding The Past The Tibetan Book of The Dead, Observe the  deceased being guided through Bardo by Tibetan Monks, Bardo description, history etc.\n\nWestern Research and Alternative views on Reincarnation &amp; Past Lives, some rare early audio Open Minds from the 60's. Hypnosis research and past life therapy.\n\nThis is Version 2 of this Pack why did no one seed properly? And just how could anyone download this without seeding at least once? \n\nThere is only Love everything else is an Illusion, from a NDE'r myself :-)\nOm Mani Padme Hum \nFree Tibet!\n\nPlease add Reps Too","torrent":{"xt":"urn:btih:b1d86cc6463c42b9a9930332bf9612e4fabba9ca","amp;dn":"Meditation+Buddhist+Reincarnation+Yogi+Tibet+SuperPack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1d86cc6463c42b9a9930332bf9612e4fabba9ca","infoHashBuffer":{"type":"Buffer","data":[177,216,108,198,70,60,66,185,169,147,3,50,191,150,18,228,250,187,169,202]},"announce":[],"urlList":[]}}