{"title":"The Wind That Shakes The Barley (2006) (NL SUBS) TBS","uid":6369674,"size":4503663377,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:b2565982cfa31303b103fd4f1eaa771b17598aaa&amp;dn=The+Wind+That+Shakes+The+Barley+%282006%29+%28NL+SUBS%29+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Vlinder2","files":-1,"time":1304634942,"description":"The Wind That Shakes The Barley (2006) \t\n\n\nIerland / Verenigd Koninkrijk / Duitsland / ItaliÃƒÂ« / Spanje / Frankrijk\nDrama / Oorlog\n127 minuten\n\nmet Cillian Murphy, Liam Cunningham en Gerard Kearney\n\nGemiddelde:\nMoviemeter: 3,52\nIMDB: 7.6/10\n\nLiefhebbers van een avondje film, vergeet niet dat er naast de \\&quot;Grote Hollywoodreleases\\&quot; nog tig van \\&quot;andere\\&quot; (kwaliteits) films zijn, die te goed zijn om in de anonimiteit te verzwelgen.\n\n\nDeze prachtige film geregisseerd door Ken Loach, won de Gouden Palm op het Filmfestival van Cannes. Deze toekenning deed nogal wat stof doen opwaaien. De prijs was geheel onverwacht. Boze tongen beweren dat het niet zozeer om de merites van deze film gaat, maar dat het meer een soort \\&quot;Lifetime achievement Award\\&quot; betreft. Oordeel zelf bij het zien van deze film.\n\nSamenvatting\nIerland, 1920. Arbeiders vormen een guerrillaleger om weerstand te bieden aan de Engelse knokploegen die worden gestuurd om Ierlands roep om onafhankelijkheid in de kiem te smoren. Gedreven door plichtsbesef en liefde voor zijn land geeft Damien (Cillian Murphy) zijn carriÃƒÂ¨re als dokter op. Hij voegt zich bij zijn broer Teddy die voor een vrij Ierland strijdt.\n\nRecensie\nThe Wind That Shakes the Barley is een film over de strijd voor de Ierse onafhankelijkheid. Het Engelse regime wordt geschetst als brute en gewelddadige onderdrukkers en bezetters. Met deze film wilde Loach verantwoording afleggen voor de wijze waarop de Engelsen de Ieren hebben onderdrukt en het land geÃƒÂ«xploiteerd. Via deze film krijg je een helder inzicht in het verleden en het heden van de Ierse natie.\n\nDe film is gesitueerd in de prachtige, mistige en magnifiek groene en lege landschappen van het County Cork. De beelden zijn overweldigend \\&quot;Iers\\&quot; van aanblik. Los van de soms wat vet aangezette Engelse brute arrogantie is dit een film die de idealen van de Ierse vrijheidsstrijders excellent verbeeldt, maar die ook op eminente wijze laat zien hoe mensen ethisch vermorzeld worden door politieke stellingnames. Dit keer eens geen film over bommentapijten van de IRA, maar de vrijheidsstrijd van de kleine man met zijn grote idealen (en falen). Sterk acteerwerk, en camera voering van een grote klasse. Een overtuigende film en een zekere aanrader!\n\nVerhaal\nIerland, 1920. Arbeiders vormen een guerrillaleger om weerstand te bieden aan de Engelse knokploegen die worden gestuurd om Ierland\\'s roep om onafhankelijkheid in de kiem te smoren. Gedreven door plichtsbesef en liefde voor zijn land geeft Damien zijn carriÃƒÂ¨re als dokter op. Hij voegt zich bij zijn broer Teddy die voor een vrij Ierland strijdt. Wanneer de vrijheidsstrijders de Engelsen op hun knieÃƒÂ«n dwingen is er eindelijk ruimte voor een wapenstilstand. Ondanks deze schijnbare overwinning breekt er een burgeroorlog uit. Families, die zij aan zij tegen de Engelsen vochten, staan elkaar nu naar het leven. Hun loyaliteit wordt tot het uiterste op de proef gesteld.\n\n\nMet dank en alle eer voor de originele poster\n\nEnglish\n\nStoryline\nIreland, 1920. Damien and Teddy are brothers. But while the latter is already the leader of a guerrilla squad fighting for the independence of his motherland, Damien, a medical graduate of University College, would rather further his training at the London hospital where he has found a place. However, shortly before his departure, he happens to witness atrocities committed by the ferocious Black and Tans and finally decides to join the resistance group led by Teddy. The two brothers fight side by side until a truce is signed. But peace is short-lived and when one faction of the freedom-fighters accepts a treaty with the British that is regarded as unfair by the other faction, a civil war ensues, pitting Irishmen against Irishmen, brothers against brothers, Teddy against Damien.... \n\n\n\nBron: Retail\nTaal: Engels, en Iers\nAudio: DD 5.1\nOndertitels....: Nederlands, Engels\nCategory.......: Video\nFormat.........: DVD5\nSource.........: Retail\nSubtitle.......: English subs English subs (optional) optional\nGenre..........: Drama War\nLanguage.......: English audio\n\n\n \t\nWeblink\t: &lt;a href=&quot; http://www.imdb.com/title/tt0460989/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt0460989/&lt;/a&gt;\nWeblink : &lt;a href=&quot; http://www.moviemeter.nl/film/33475&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.moviemeter.nl/film/33475&lt;/a&gt;\n\nTBS","torrent":{"xt":"urn:btih:b2565982cfa31303b103fd4f1eaa771b17598aaa","amp;dn":"The+Wind+That+Shakes+The+Barley+%282006%29+%28NL+SUBS%29+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2565982cfa31303b103fd4f1eaa771b17598aaa","infoHashBuffer":{"type":"Buffer","data":[178,86,89,130,207,163,19,3,177,3,253,79,30,170,119,27,23,89,138,170]},"announce":[],"urlList":[]}}