{"title":"Ultimate Rotation Control v4.8.0","uid":9593473,"size":962948,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:b2aa219162e4c4aa37e667b7757fc0985284c74c&amp;dn=Ultimate+Rotation+Control+v4.8.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":1,"time":1391962060,"description":"Google Play link: &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=nl.fameit.rotate&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=nl.fameit.rotate&lt;/a&gt;\n\n--------------------------------------------------------------------------------\n\nThe one and only rotation control app that can REALLY LOCK your screen in ANY orientation and also FORCE the automatic orientation to override app specific settings. \n\nThe &quot;Forced Auto&quot; mode for example is very handy on tablets where some apps force portrait mode while you are holding the screen &quot;upside down&quot;. It also allows using the launchers of for example the HTC (One X/One S) Sense 4, Samsung Galaxy S3 Touchwiz and Google Nexus 7 in landscape mode. Some launchers will have the bottom row of icons cut off or other display issues, this is not something I can fix unfortunately (some versions of Samsung Galaxy S4, Note 2, HTC One). For a device like NVIDIA SHIELD it allows you to use most apps in landscape even if they normally do not work in landscape (like Spotify). \n\nFeatures:\n- True orientation lock\n- Forced automatic rotation\n- Per application settings\n- Two widgets and a status bar notification with shortcut buttons for easily changing your rotation preference\n- Ability to create shortcuts to specific modes\n- Optimized for Android 1.6 (Donut) all the way to Android 4.1 (Jelly Bean)\n- Can act as Tasker / Locale plugin to automate your screen orientation setting\n\nSupported modes:\n- Auto: normal automatic mode, not overriding app preferences\n- Forced Auto: automatic mode, but overriding other app preferences!\n- Lock: truly locks the screen in the current orientation\n- Portrait: truly lock the screen in portrait\n- Landscape: truly lock the screen in landscape\n- Reverse Portrait: truly lock the screen in reverse portrait\n- Reverse Landscape: truly lock the screen in reverse landscape\n- Auto Portrait: automatically select between portrait and reverse portrait\n- Auto Landscape: automatically select between landscape and reverse landscape\n- Manual: normal manual mode, not overriding app preferences\n\nRemarks:\n- This app does NOT require root access.\n- Certain applications might not display properly when forced to work on portrait/landscape. You can set a per application preference to normal auto or manual mode to workaround these issues.\n- Auto and Reverse Portrait and Landscape supported from Android version 2.3 (Gingerbread)\n- Status bar notification direct shortcuts supported from Android version 3.0 (Honeycomb)\n\n--------------------------------------------------------------------------------\n\nUploaded Anonymously.","torrent":{"xt":"urn:btih:b2aa219162e4c4aa37e667b7757fc0985284c74c","amp;dn":"Ultimate+Rotation+Control+v4.8.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2aa219162e4c4aa37e667b7757fc0985284c74c","infoHashBuffer":{"type":"Buffer","data":[178,170,33,145,98,228,196,170,55,230,103,183,117,127,192,152,82,132,199,76]},"announce":[],"urlList":[]}}