{"title":"Khalid bin Al Waleed - The Sword of Allah.chm","uid":4677504,"size":1386103,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b2d48351d248aee8d2bcaf63270b969ed40344bc&amp;dn=Khalid+bin+Al+Waleed+-+The+Sword+of+Allah.chm&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"cybrnomd","files":1,"time":1232953989,"description":"Khalid-bin-Al-Waleed: The Sword of Allah by Author: Lieutenant-General A.I. Akram\n\nHere is a quick intro:\n\nThis book contains perhaps one of the most brilliant biographies written on the Companion of the Prophet (SAWS), Khalid bin Al-Waleed, Sword of Allah.\n\nKhalid bin Al-Waleed was one of the greatest generals in history, and one of the greatest heroes of Islam. Besides him, Genghis Khan was the only other general to remain undefeated in his entire military life. A measure of Khalid's genius is that he was the only person to inflict a (temporary) defeat on the Prophet Muhammad, (may Allah bless him and grant him peace).\n\nThe original title of the book, &quot;The Sword of Allah: Khalid bin Al-Waleed, His Life and Campaigns&quot; was written by the late Lieutenant-General A.I. Akram of the Pakistan Army, in October 1969. The author learnt Arabic in order to draw on the earliest historical sources and he visited every one of Khalid's battlefields in order to draw analyses from the viewpoint of military strategy, including reconciling conflicting historians' accounts. The book was originally published by the Army Education Press, Rawalpindi, Pakistan and printed by Feroze Sons Publishers in Lahore, Pakistan. The excellence of the book was such that it has been translated from English into Arabic and is currently sold in bookshops throughout the Arab World.\n\nThe book is in chm format and you do not need any extra software to read it.\n\nA simple thanx would be enough. To all the spammers out there, be aware, you will get no response.","torrent":{"xt":"urn:btih:b2d48351d248aee8d2bcaf63270b969ed40344bc","amp;dn":"Khalid+bin+Al+Waleed+-+The+Sword+of+Allah.chm","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2d48351d248aee8d2bcaf63270b969ed40344bc","infoHashBuffer":{"type":"Buffer","data":[178,212,131,81,210,72,174,232,210,188,175,99,39,11,150,158,212,3,68,188]},"announce":[],"urlList":[]}}