{"title":"Street Fighter 4 Origial Soundtrack","uid":4743786,"size":281603868,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b326cb4143285a51410e1dad6f5e6529f6bb9523&amp;dn=Street+Fighter+4+Origial+Soundtrack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"MonouFuma","files":-1,"time":1235697668,"description":"Album Title: Street Fighter IV Original Soundtrack\nAlbum Artist: Hideyuki Fukasawa\nMP3 Format 320kbps\n\nStreet Fighter IV is a 2008 fighting game produced by Capcom. It is the first numbered Street Fighter game released by Capcom for the arcades since 1999. The coin-operated arcade game was released in Japan on July 18, 2008 with North American arcades importing the machines by August. The console versions for the PlayStation 3 and Xbox 360 were released on February 12, 2009 in Japan, and were sold in North American stores as early as February 16, with a February 18 release as the target date. The official European release was on February 20. A Windows version will follow during the second quarter of 2009.\n\nHideyuki Fukasawa is a Japanese composer. He has often worked with Capcom but is also involved in a lot of his own freelance composing work. He had a minor role in Onimusha 2 as an assistant sound engineer and programmer to Taro Iwashiro, the acclaimed music composer of that particular game but it was his work on Chaos Legion, a Capcom Gothic action-adventure third-person fighting game in a similar fashion with the Devil May Cry series released in 2002, that gave him a cult-like status among video gaming fans.\n\nHe has recently completed composing and arranging for Street Fighter IV, which half of the soundtrack are arrangements of Street Fighter II's famous soundtrack.\n\nWhat sets Hideyuki Fukasawa's style of music composing apart from video game music heavyweights such as Nobuo Uematsu or Yasunori Mitsuda is his distinctive style of merging orchestral music with techno, rock, heavy metal and gothic chanting. The beat of his music varies from orchestral to being very disco-like, serious, dark, mysterious and having an intense, exciting action adrenaline-pumping feel. Being a huge fan of heavy metal it is not surprising that some of the various traits of that particular music style has made its way into his own music.\n\n-----------------\n\nIf there are any problems just pm me and I'll get on it.\nHappy Downloading!\n\nFuma Monou","torrent":{"xt":"urn:btih:b326cb4143285a51410e1dad6f5e6529f6bb9523","amp;dn":"Street+Fighter+4+Origial+Soundtrack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b326cb4143285a51410e1dad6f5e6529f6bb9523","infoHashBuffer":{"type":"Buffer","data":[179,38,203,65,67,40,90,81,65,14,29,173,111,94,101,41,246,187,149,35]},"announce":[],"urlList":[]}}