{"title":"The Encyclopedia of Taoism - 2010kaiser","uid":7872128,"size":336507792,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b339382eaa89ea729eb7660d06b9ccec854af6cc&amp;dn=The+Encyclopedia+of+Taoism+-+2010kaiser&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"2010kaiser","files":3,"time":1354236330,"description":"                              The Encyclopedia of Taoism - 2010kaiser\n                              ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\n\nThe Encyclopedia of Taoism provides comprehensive coverage of Taoist religion, thought and history, reflecting the current state of Taoist scholarship. Taoist studies have progressed beyond any expectation in recent years. Researchers in a number of languages have investigated topics virtually unknown only a few years previously, while others have surveyed for the first time textual, doctrinal and ritual corpora. The Encyclopedia presents the full gamut of this new research.\n\nThe work contains approximately 1,750 entries, which fall into the following broad categories: surveys of general topics; schools and traditions; persons; texts; terms; deities; immortals; temples and other sacred sites. Terms are given in their original characters, transliterated and translated. Entries are thoroughly cross-referenced and, in addition, 'see also' listings are given at the foot of many entries. Attached to each entry are references taking the reader to a master bibliography at the end of the work. There is chronology of Taoism and the whole is thoroughly indexed.\n\nThere is no reference work comparable to the Encyclopedia of Taoism in scope and focus. Authored by an international body of experts, the Encyclopedia will be an essential addition to libraries serving students and scholars in the fields of religious studies, philosophy and religion, and Asian history and culture.\n\n\nAuthor:Fabrizio Pregadio\nTitle: The Encyclopedia of Taoism\nPublisher: Routledge\nYear: 2007\nFormat: Scanned PDF\n\n\nENJOY AND SEED!!!","torrent":{"xt":"urn:btih:b339382eaa89ea729eb7660d06b9ccec854af6cc","amp;dn":"The+Encyclopedia+of+Taoism+-+2010kaiser","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b339382eaa89ea729eb7660d06b9ccec854af6cc","infoHashBuffer":{"type":"Buffer","data":[179,57,56,46,170,137,234,114,158,183,102,13,6,185,204,236,133,74,246,204]},"announce":[],"urlList":[]}}