{"title":"Wishes in the Wind by Andrea Kane","uid":9637257,"size":1377350,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b4e87bc791fc97c3f774c2dd25506f57a6c0ac92&amp;dn=Wishes+in+the+Wind+by+Andrea+Kane&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"PirateBook","files":1,"time":1392861103,"description":"\nNicole Aldridge, daughter of England's most acclaimed jockey, Nick Aldridge, whisks her father into hiding to protect him from blackmailers who have threatened his life for refusing to throw a race. Desperate to keep her father safe and the two of them fed, Nicole dresses as a boy and answers an ad addressed to her father by the Marquis of Tyreham. As Nick's &quot;protege,&quot; she wins the position of jockey, hired by the marquis to run the race of a lifetime: the celebrated Epsom Derby.\n\nDustin Kingsley, Marquis of Tyreham, renowned as a thoroughbred breeder and the &quot;ton's&quot; most sought-after bachelor, is restless, empty -- until he meets the beautiful stranger sitting by the Thames. Determined to win Nicole's heart, Dustin plunges headlong into the ominous mystery eclipsing their future, hell-bent on convincing Nicole that he's the only man for her.\n\nAn impossible masquerade, a never-to-be-forgotten Derby, and a cherished wishing locket propel Nicole and Dustin toward a climactic finish, where danger threatens a love destined -- by wishes and fate -- to prevail.\n\nGenre: Historical Romance","torrent":{"xt":"urn:btih:b4e87bc791fc97c3f774c2dd25506f57a6c0ac92","amp;dn":"Wishes+in+the+Wind+by+Andrea+Kane","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4e87bc791fc97c3f774c2dd25506f57a6c0ac92","infoHashBuffer":{"type":"Buffer","data":[180,232,123,199,145,252,151,195,247,116,194,221,37,80,111,87,166,192,172,146]},"announce":[],"urlList":[]}}