{"title":"Rouge Galaxy [NTSC] (DVD5 - Working), PS2","uid":5134976,"size":3227579955,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:b54c4a3de6f8aa457da1d191a72bc4a61d19659d&amp;dn=Rouge+Galaxy+%5BNTSC%5D+%28DVD5+-+Working%29%2C+PS2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"Big_dude","files":-1,"time":1256408638,"description":"Rouge Galaxy for the Ps2                                        Rel. 01/30/2007\n\n\nFormat:        DVD5 NTSC-USA\nLang.:         English\nDiscs:         1\nImage:         MDS/ISO\nGenre.:        RPG\nConversion:    DVD9 To DVD5 Rip\nRequirements:  Modded/Chipped Ps2 or Swap Magic Disc Method. \n\n\nCompressed with WinRar, Game was tested and works. \nTry 7zip its free google it, if you don't have WinRar.\n\n\nNote: No Ps2 backup disc/game or copy will work unless your Ps2 Console is Modded \n      (allows playing of backups), or if you use Swap Magic.\n\n\nRelease Notes - This is Rouge Galaxy Ripped from DVD9 To DVD5 Format. Some things \n                were left out from the rip in order for it to work on a DVD5, the\n                Staff Credits of the game and replays of the opening FMV removed \n                but everything else is intact. This version is working and doesn't\n                crash you can play thru chapter 7 to the end without any problems.\n\n\nImportant - There is a small delay after the ps2 logo and game loads just be \n            patient nothing to worry about.\n\n\nYou could try the homebrew exploit to (Free Mc Boot - Also known as soft modding for ps2), if your ps2 system isn't hard modded with a chip or if Swap Magic isn't working as a last resort. There are ps2 emulators but its not 100% &amp; the quality isn't as good as playing your game on your ps2 console.\n\nIf your using swap magic and don't have a flip top, you'll need to first\nremove the front cover of the disc tray for use of the slide card.\n\nHere's a link for how to remove the front cover...\n         &lt;a href=&quot;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&lt;/a&gt;\n\nAnd here's some links on using the slide tool to open the tray to swap in your ps2 copy or backup game.\n         &lt;a href=&quot;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&lt;/a&gt;\n        &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&lt;/a&gt;\n        &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&lt;/a&gt;\n\nThose that don't have a modded Ps2 Here's a few links for Free MC Boot &amp; how to use it to soft mod your ps2 so you can be able to play burned games. Free Mc Boot won't work on newer models of ps2 you'll have to use an older version the tutorial explains this.\n\n-- &lt;a href=&quot; http://bootleg.sksapps.com/tutorials/fmcb/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bootleg.sksapps.com/tutorials/fmcb/&lt;/a&gt;\n\nThen you will also need to patch the iso (the PS2 game) with ESR disc patcher GUI v0.24a if your using free mc boot with ESR Elf to boot your p2 copies or backups (No-swapping required for esr method).\n\nAfter patching burn the iso with Imgburn or Dvd Decrypter to respectable media\nthen use the ESR through fmcb after you installed everything to boot your game.\n\nYou will still need to use the proper media for the game to run or load properly regardless if your using fmcb, a modded ps2, or swap magic. Verbatim or Tayio yuden is preferred.\n\nNote: If fmcb isn't working and your Ps2 isn't Modded, Swap Magic should do the\ntrick.\n\n\n\nGame Description:\n\nRogue Galaxy is the North American and European localized version of Rogue Galaxy (2005), only released in Japan at the time. Instead of only localizing the game, developer Level-5 Inc. spent 2 years to improve the game and add new features and content. This version was also re-released in Japan as Rogue Galaxy (Director's Cut).\n\nThe original single-layer DVD was replaced by dual-layer and the doubled amount of space was used for smoother, better-looking graphics and additional data. Aside from the 4 existing planets, a fifth one, Alistia, was added. It is not part of the main story, but deepens the storyline and has new quests and items. A key to access the new world can be found in chapter 8. The existing Insectron Tournament sidequest has been expanded with two species of Insectrons, each with 8 types of Insectrons per species. The level design of Rosencaster Prison, the Gladius Towers, the Daytron factory, Rosa's desert town, and Rosa's Labyrinth has also been altered.\n\nOver 2,000 lines of additional voice dialogue were added, the battle animations were reworked, damaging enemies has become easier (attack formula revision) and Toady's analysis of weapons has also been simplified.\n\nOther gameplay improvements include the introduction of collectible Burning Chips, which power the Burning Strike attack, more items overall, two new weapons for each character (except Jaster), with 140 weapons in total, and 5 bonus costumes for each character (6 for Kisala and Simon).\n\n\nFeatures:\n\n* No load times: Immerses you into the expansive world and lets you freely explore.\n\n* Superior combat system: Real-time combat puts you fully in control of your \n  adventure. Switch between players, send commands to teammates or utilize \n  multiple combat moves to out-smart, out-shoot or out-muscle your opponents.\n\n* Item synthesis engine and creation system: Put together an assembly line and \n  build the perfect weapon or technology to help your cause.\n\n* Expansive detailed environments: Explore the far reaches of the galaxy from \n  water planets, desserts to deep space.\n\n\nGame Pics Included.\n\n\nBurn with DVD Decrypter, (Included in download).  \n\nBurn at 8x or 4x speed.\n\nUse Verbatim or Tayio Yuden DVD Media for best quality, or if other media\nisn't working.\n\n\nIf using DVD+R then booktype to DVD-ROM \n(If your mod-chip, or Ps2 doesn't support DVD+R).\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\n\nEnjoy!","torrent":{"xt":"urn:btih:b54c4a3de6f8aa457da1d191a72bc4a61d19659d","amp;dn":"Rouge+Galaxy+%5BNTSC%5D+%28DVD5+-+Working%29%2C+PS2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b54c4a3de6f8aa457da1d191a72bc4a61d19659d","infoHashBuffer":{"type":"Buffer","data":[181,76,74,61,230,248,170,69,125,161,209,145,167,43,196,166,29,25,101,157]},"announce":[],"urlList":[]}}