{"title":"Creative Genius   (BBC 2005 - Complete)","uid":7264119,"size":80261675,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:b5540a64dc95847547eb87b8a1746eecafaf0c8a&amp;dn=Creative+Genius+++%28BBC+2005+-+Complete%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Lucybabe","files":4,"time":1336829216,"description":"BBC Radio 4 Science Documentary (2005) - Creative Genius - antonyjscott\n\nWe make, we create, we paint, we write, we think we discover and we invent. Humans are endlessly creative. From our ability to utter\n\ncompletely new sentences every time we speak to the artistic and scientific genius of Picasso, Shakespeare or Einstein. Do scientists or\n\npsychologists know very much about what creativity actually is, or which bit of our brain is in control when we do? In a new series Ian\n\nPeacock unravels the myth, science and psychology behind creativity.\n\nProgramme 1\n\nIn the first programme Ian finds out why the evolution of language and the use of metaphor kick started human creativity, paving the way for\n\ncave art and modern civilisation.\nHe also finds out why computers could be the artists and writers of the 22nd century.\n\nProgramme 2\n\nCreativity unlocked. In the second programme Ian talks to the scientist who's invented a magnetic thinking cap which could make creative\n\ngeniuses of us all and meets the man who after a stroke, can't stop his craving to paint, sculpt and write poetry.\n\nOn his search for Xanadu he finds out why creativity is unleashed in some kinds of brain damage and how neuroscience is shedding light on the\n\nmystery of creativity,\n\n\n\nProgramme Three\n\nHow can you be more creative? In the third programme Ian finds out what strategies and techniques he can borrow from business and beyond to\n\nmaximise his own creativity.\n\nHe talks an advertising agency to find out how they think up their best ideas, and finds out why businesses are using poets and artists to\n\nimprove their productivity\n\n\nRecorded using audio maestro direct to MP3 @320kbps from live internet stream, converted to MP3 @ 128kbps via itunes recently.","torrent":{"xt":"urn:btih:b5540a64dc95847547eb87b8a1746eecafaf0c8a","amp;dn":"Creative+Genius+++%28BBC+2005+-+Complete%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5540a64dc95847547eb87b8a1746eecafaf0c8a","infoHashBuffer":{"type":"Buffer","data":[181,84,10,100,220,149,132,117,71,235,135,184,161,116,110,236,175,175,12,138]},"announce":[],"urlList":[]}}