{"title":"Tara Jane O'Neil - A Ways Away [2009][FLAC ]","uid":8542325,"size":199579985,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b607184c837ea27e010580380a4b91cc7e9713b7&amp;dn=Tara+Jane+O%27Neil+-+A+Ways+Away+%5B2009%5D%5BFLAC+%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":12,"time":1370431501,"description":"Artist: Tara Jane O'Neil\nRelease: A Ways Away \nReleased: 2009\nLabel: K\nCatalog#: KLP 207\nFormat: FLAC / Lossless\n[color=blue]Country: USA\nStyle: Folk Rock, Experimental, Indie Rock\n\nimage\n\n\n01. Dig In ( 5:16)\n02. In Tall Grass ( 2:45)\n03. Drowning ( 3:39)\n04. A New Binding ( 3:35)\n05. Howl ( 5:03)\n06. Pearl Into Sand ( 3:22)\n07. Beast, Go Along ( 3:56)\n08. A Vertiginous One ( 3:00)\n09. Biwa ( 2:16)\n10. The Drowning Electric ( 4:18)\n\nSince her musical beginning as a bass player in the great Louisville, Ky., indie band Rodan, Tara Jane O'Neil has moved in all manner of directions. During the mid-1990s she formed Retsin, a folk-pop duo with the multi-instrumentalist and poet Cynthia Nelson. Then came The Sonora Pine, where she got her experimental chops in collaboration with former Lungfish guitarist Sean Meadows. This was later followed by a stint in the fantastic progressive metal trio the King Cobra, and her relocation to Portland, where she is now based. In addition to her continuously productive solo career which began with the 2000 full-length Peregrine, O'Neil is also a notable artist who's work has been published in two profoundly lovely books of paintings, Who Takes a Feather [Map] and Wings. Strings. Meridians: A Blighted Bestiary [Yeti].\nA Ways Away, O'Neil's fifth solo album and first on the K imprint, draws together her considerable experience as a producer, singer, and songwriter in a fleetingly beautiful 36 minutes that washes over the listener in an introspective haze. There's a characteristic tone that runs through all of her albums-- an elastic guitar reverb that stretches to give a delicate puff to her songs, drums that rarely go beyond a gentle grounding pitter-patter and, of course, the haunting lull of her voice, which beckons the listener into her world with mellow grace. Strings make a valuable appearance on A Ways Away, bringing a sharp sweetness to a song like &quot;In Tall Grass&quot; as she layers and harmonizes over her main vocal track. O'Neil also includes a slightly reworked version of &quot;Howl&quot;, one of the standout songs on her 2004 album, You Sound, Reflect. It benefits from a more powerful but just as moving performance, as the focus is brought to her voice instead of heavy instrumentation and therefore feels right at home among her new material.\nSince O'Neil is just as open to collaboration on recordings as she notoriously is with her live shows, she rounded up Jana Hunter, violinist Jean Cook, members of Ida, and Osa Atoe of New Bloods for contributions to A Ways Away. Their marks are pleasingly evident here and there, but never derail O'Neil's vision for the album, which moves from a glistening guitar solo on &quot;Pearl Into Sand&quot; to an explosive drone on &quot;The Drowning Electric&quot;, bringing our attention back to her understated and intriguing talents as a guitarist with an extraordinary attention to detail that both soothes and surprises.","torrent":{"xt":"urn:btih:b607184c837ea27e010580380a4b91cc7e9713b7","amp;dn":"Tara+Jane+O%27Neil+-+A+Ways+Away+%5B2009%5D%5BFLAC+%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b607184c837ea27e010580380a4b91cc7e9713b7","infoHashBuffer":{"type":"Buffer","data":[182,7,24,76,131,126,162,126,1,5,128,56,10,75,145,204,126,151,19,183]},"announce":[],"urlList":[]}}