{"title":"[Mark_Simon]Producing Independent 2D Character Animation Making ","uid":11066217,"size":38328026,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b611219d284cdfc9a0edccb1559f675685399902&amp;dn=%5BMark_Simon%5DProducing+Independent+2D+Character+Animation+Making+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zombie_rox","files":2,"time":1411228132,"description":"PRODUCING INDEPENDENT 2D CHARACTER ANIMATION takes an in-depth look at the artistry and production process of cel animation in a friendly, how-to manner that makes the sometimes tedious process of animation enjoyable and easy to understand. This book guides animators through every step of planning and production; includes examples of actual production forms, organization tips, screen shots, and sketches from the pre- to post-production processes; and contains detailed information on the hardware and software used to complete each step.\n\nBy mapping out the course of how his small studio brainstormed, created, then produced its award-winning animation, TIMMY'S LESSONS IN NATURE, Mark Simon explains to animators what it takes-both creatively and resource-wise-to get their animations to market.\n\nIncludes exclusive interviews with Oscar-nominated independent animator Bill Plimpton, Craig McCracken, creator of the POWER PUFF GIRLS, Craig &quot;Spike&quot; Decker of SPIKE &amp; MIKE'S SICK AND TWISTED FESTIVAL OF ANIMATION, David Fine &amp; Alison Snowden who are the Academy Award-Winning producers of BOB AND MARGARET, Cartoon Network's Senior Vice President of Original Animation, Linda Simensky, and Tom Sito, Co-Director of OSMOSIS JONES...as well as others.\n\nPublisher: Focal Press (February 12, 2003)\nLanguage: English\nISBN-10: 0240805135\nISBN-13: 978-0240805139\n\nEditorial Reviews\nReview\n&quot;While we are on the subject of how-to books, you really can't afford to miss Mark Simon's brilliant new title, Producing Independent 2D Character Animation.&quot; - Animation Magazine\nAbout the Author\nMark Simon founded and owns A&amp;S Animation, Inc., an award-winning cel animation house in Florida and Animatics &amp; Storyboards, Inc., the largest storyboard house in the southern United States, which has provided work on over 1,200 productions. Mark's accomplishments range from being the owner of an award-winning advertising firm, to a syndicated cartoonist, production designer of film, TV, and animations and writing entertainment industry books and lecturing. Having won over 30 animation awards for his efforts, Mark has directed TIMMY'S LESSONS IN NATURE, MY WIFE IS PREGNANT, A MESSAGE FROM GOD, and SUBURBAN CINDERELLA, numerous commercials, training videos and television series special effects. Mark also teaches at the DAVE School (Digital Animation and Visual Effects) located at Universal Studios Orlando. A&amp;S Animation develops and produces animation for commercials, TV, training videos and the web. The A&amp;S team has produced award-winning shorts and commercials, shows for Nickelodeon and Cartoon Network, and designed sets and special effects on live-action feature films. Prior to its release, A&amp;S has participated in the development of DigiCel Flipbook Pro, the fastest growing digital ink &amp; paint software in the industry. Mark's animation and storyboarding articles have appeared in various industry magazines and he's the author of STORYBOARDS: MOTION IN ART, 2nd Edition, published by Focal Press. Visit the authors website at www.FunnyToons.tv ","torrent":{"xt":"urn:btih:b611219d284cdfc9a0edccb1559f675685399902","amp;dn":"%5BMark_Simon%5DProducing+Independent+2D+Character+Animation+Making+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b611219d284cdfc9a0edccb1559f675685399902","infoHashBuffer":{"type":"Buffer","data":[182,17,33,157,40,76,223,201,160,237,204,177,85,159,103,86,133,57,153,2]},"announce":[],"urlList":[]}}