{"title":"Beneath Oblivion - From Man To Dust (2011)","uid":6808950,"size":185396968,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b61a9d59186fa1129944ec1ee480600741718a5d&amp;dn=Beneath+Oblivion+-+From+Man+To+Dust+%282011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Baphom3t","files":9,"time":1320971321,"description":"Beneath Oblivion is a four piece Cincinnati, Ohio based doom metal band. Since forming in 2003 they have released a demo, a full-length album, a 10&quot; split LP, and a 10&quot; record. As of April 2011, the band has just finished mastering their new double LP record titled 'From Man to Dust' with Billy Anderson, tenatively due to be released in August 2011 on Mylene Sheath Records.\n \n\nAfter forming in 2003, Beneath Oblivion went on to record a demo titled 'The Melancholy Demo' in 2004 before recording and self releasing their first album 'Existence Without Purpose' on CD in 2006. Originally sold at shows and through the band the album received worldwide acclaim, garnering positive reviews from as far afield as Russia as well as in their home country. Following the release the band toured extensively, increasing awareness of their music both in the Cincinnati area and nationwide.\nIn 2007 Beneath Oblivion recorded a split LP with the Providence, Rhode Island band Sin of Angels. The split album was released on the independent label 43rd Parallel and was limited to 500 copies, 150 on green vinyl and 350 on black .\n\nIn 2008 they were signed to the Athens, Georgia based record label The Mylene Sheath. They went on to release their first record for The Mylene Sheath on February 10, 2009. A self-titled 10&quot; record, the album was released exclusively on vinyl and limited to 500 copies: 100 clear with white swirl available exclusively from the band at shows, 100 black available exclusively from The Mylene Sheath web store, and 300 pressed in translucent red with white swirl. Both the mail order and show exclusive versions sold out very quickly. The record was a substantial step forward from the first album, going beyond the traditional boundaries of doom and sluge metal. The release was supported with a number of shows including a Mylene Sheath showcase with labelmates Gifts From Enola and If These Trees Could Talk. The record received almost unanimously favorable reviews and catapulted the band into the higher echelons of doom metal groups.\n\nAs of May 2011, Beneath Oblivion has recorded their forthcoming 2xLP titled 'From Man to Dust,' and mastered it with legendary producer/engineer Billy Anderson. The record due for release sometime in August 2011 again on the Mylene Sheath. Like most releases through the Mylene Sheath, fans can expect elaborate packaging/finish and different colors of vinyl on a gatefold as well as CD and digital release. It is also anticipated that the record label will re-release 'Existence Without Purpose' sometime in the future but this is unconfirmed.\n\nCurrent lineup\nScotty T. Simpson - guitar/ vocals\nKeith Richard Messerle - bass\nAllen L. Scott II - guitar/ samples\nNate Bidwell - drums\n\nGenre = Sludge / Doom Metal\nFormat = mp3\nBit Rate = 320 kbps\nFile Size = 176.81 MB\n\nTracklist\n1. Intro\n2. Atomic Mother\n3. Hope, The Deceiver\n4. Concussions of the Head &amp; Heart\n5. Empire\n6. Barren Earth\n7. Be My Destroyer\n8. From Man To Dust","torrent":{"xt":"urn:btih:b61a9d59186fa1129944ec1ee480600741718a5d","amp;dn":"Beneath+Oblivion+-+From+Man+To+Dust+%282011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b61a9d59186fa1129944ec1ee480600741718a5d","infoHashBuffer":{"type":"Buffer","data":[182,26,157,89,24,111,161,18,153,68,236,30,228,128,96,7,65,113,138,93]},"announce":[],"urlList":[]}}