{"title":"Shell Labs IconChanger v3.8","uid":11152235,"size":1134532,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b63b7aed3fa58f6569863311f0bfa18cd08f74c1&amp;dn=Shell+Labs+IconChanger+v3.8&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"NokTham","files":1,"time":1412362102,"description":"Change desktop icons with IconChanger 3.8 - icon software to customize computer icons.\n\nIcon Changer is a software application that makes changing icons on the desktop fun and easy.\nIt's a hassle-free way to personalize your desktop without submerging yourself into reading books about advanced computing. \nSimply click the icon you want to change, point at the one you like and that's all. Why change icons? \nTo make navigation easier, to group similar applications together, to customize and spice up your desktop, of course. \n\nMoreover, you can use IconChanger to change personal file icons. \nYou can now assign an icon of your choice to each and every file on your computer. \nPersonalize your computing experiences to make using computer a bit easier and much more convenient.\n\nOur icon software comes with an integrated icon search tool that scans your system for icons. \nYou will be greatly surprised at how many beautiful informative icons are there already on your computer. \nMoreover, you can drag your favorite icons to a favorites list to access them easily in the future. \nIconChanger allows you to copy or save individual computer icons for other uses.\nIconChanger can also be used to change desktop icons such as My Computer icon , folder icons  or any shortcut icons.\nAlso you can save and restore the desktop icon positions.\nWhen you change the display resolution, the desktop window changes size and the desktop icons can be resorted. \nTo prevent this, you can save the icon positions before you change the resolution and restore them after you return to the previous resolution\n\nThis icon software not only searches for actual icons, but also, everything that Windows can recognize as an icon (ie cursors and bitmap images). \nYou can also restrict the icon search by specifying what file types to look into.\n &lt;a href=&quot;\nhttp://s19.postimg.org/pg2rhoxnn/screenshot_26.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s19.postimg.org/pg2rhoxnn/screenshot_26.png&lt;/a&gt; &lt;a href=&quot;\nhttp://s19.postimg.org/9vvdr5nj7/screenshot_27.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s19.postimg.org/9vvdr5nj7/screenshot_27.png&lt;/a&gt;","torrent":{"xt":"urn:btih:b63b7aed3fa58f6569863311f0bfa18cd08f74c1","amp;dn":"Shell+Labs+IconChanger+v3.8","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b63b7aed3fa58f6569863311f0bfa18cd08f74c1","infoHashBuffer":{"type":"Buffer","data":[182,59,122,237,63,165,143,101,105,134,51,17,240,191,161,140,208,143,116,193]},"announce":[],"urlList":[]}}