{"title":"Cover to Cover (Wicked Pictures) XXX (DVDRip)","uid":9412977,"size":1572179168,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:b6465d96ecedb3313a663ff2077df37cc1a5b6a8&amp;dn=Cover+to+Cover+%28Wicked+Pictures%29+XXX+%28DVDRip%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":7,"uploader":"xuluhulu","files":1,"time":1388353832,"description":"Gennes plays the role of Louise, who loves to read books and completely immersed in the fabulous world of book history. At first, she moved to distant America, when it was completed the war between North and South. She waited for her beloved from the war, and so bored that he gave him straight in the clearing among the grass, bushes and trees. Travelling by car can be so if it will be Jill Kely and PJ Sparxx. PJ and Jill - charming blondes who have fun with each other. Of course, what else to do - the car is broken! PJ, as in all the films, very emotional and beautiful, Jill also it is not inferior. Next comes a pirate ship fantasy of gold, desires and passions. Then our dreamer will take us at the card table, where Jenna will show what a &quot;pay in kind.&quot; Three blondes in green cloth, vvperemeshku money, chips and whiskey. And the guys watching all this, especially for Jenna try to please! Beautiful, memorable scene. Jenna in this scene, as throughout the film, takes the leading place, and this is underlined by two shots from two guys ... Eastern culture Jenna also not bypass. History of the Ninja has never been so interesting - because there Jenna. Lovely scene where Jenna show their skills in ballet dancing. Beautiful solo her work - it will show all the splendor of his body. And the final scene takes us into the locker room boxing, where after the fight navedyvaetsja Jenna. All is good, only the director found that the more convincing it is necessary to make a scene in black and white. This he ruined the whole scene. Jenna just makes the whole situation. Throughout the film, Jenna goes through a maze of bookshelves and flirting with other book chitaki. This film could be called another in promotion Jenna Dzhemeson which was a success.\n\nCOVERS:\n &lt;a href=&quot;\nhttp://www.imgnip.com/viewer.php?file=55466605208122547448.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imgnip.com/viewer.php?file=55466605208122547448.jpg&lt;/a&gt;\n\n\nTHUMBSNAIL SCREENS:\n &lt;a href=&quot;\nhttp://www.imgnip.com/viewer.php?file=40251230468403912887.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imgnip.com/viewer.php?file=40251230468403912887.jpg&lt;/a&gt;\n\n\nCAST:\n\nMark Davis, Brad Armstrong, Jenna Jameson, Jill Kelly, PJ Sparxx, Kaitlyn Ashley, Shelby Stevens, Kia, Gerry Pike, Morgan Le Fay\n\n\nSEED &amp; ENJOY!!!","torrent":{"xt":"urn:btih:b6465d96ecedb3313a663ff2077df37cc1a5b6a8","amp;dn":"Cover+to+Cover+%28Wicked+Pictures%29+XXX+%28DVDRip%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6465d96ecedb3313a663ff2077df37cc1a5b6a8","infoHashBuffer":{"type":"Buffer","data":[182,70,93,150,236,237,179,49,58,102,63,242,7,125,243,124,193,165,182,168]},"announce":[],"urlList":[]}}