{"title":"Nail Your Novel: Why Writers Abandon Books and How You Can Draft","uid":13768319,"size":1162336,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b67112800c79d74fb6fec2f28c6c2e54ffbf6927&amp;dn=Nail+Your+Novel%3A+Why+Writers+Abandon+Books+and+How+You+Can+Draft&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ZamKhan","files":4,"time":1457268019,"description":"By bestselling ghostwriter and book doctor with a top London literary consultancy\r\n\r\nThis book is used by award-winning authors and university creative writing departments.\r\n\r\nAre you writing a novel? Do you want to make sure you finish? Will you get lost and fizzle out? Will you spend more time reading about how to write than actually getting the words down?\r\n\r\nMost books on novel-writing will make you read hundreds of pages about character arcs, inciting incidents, heroes’ journeys. It’s great to know that – but while you’re reading about it you’re not writing your book. \r\n\r\nAnd what these books don’t tell you is how to use this learning and get the job done.\r\n\r\nNail Your Novel is a writing buddy – and mentor - in a book. \r\n\r\nIn 10 easy steps it will tell you:\r\n*how to shape your big idea and make a novel out of it\r\n*how to do your research and how to use it\r\n*how to organise your time. \r\n*how to plot and build characters\r\n*when you’re going to hit problems and what to do about them\r\n*how to write on the days you don’t feel inspired\r\n*how to reread what you’ve written and polish it. \r\n\r\nAlong the way, Thumbnail Notes give tutorials about storytelling and storycraft – strictly when you need them. The author has written nearly a dozen novels that have made it into print – and this is how she did it. \r\n\r\nYou don’t even need to read the whole book before you get started. You read a section, then do as it says. And, once you’re finally satisfied, Nail Your Novel will tell you how to sell it to publishers and agents.\r\n\r\nYou’ve dreamed of writing a novel. Don’t procrastinate with another theory book. Don’t launch in, get stuck and throw your hard work in a drawer. Nail your novel. \r\n\r\n\r\nAbout the author\r\nRoz Morris has nearly two decades of experience writing novels and helping floundering authors find their way. She is a senior book doctor for a major literary consultancy in London, writes fiction under her own name and has ghostwritten bestselling fiction for high-profile writers with major publishers, including Random House, Puffin and Mammoth","torrent":{"xt":"urn:btih:b67112800c79d74fb6fec2f28c6c2e54ffbf6927","amp;dn":"Nail+Your+Novel%3A+Why+Writers+Abandon+Books+and+How+You+Can+Draft","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b67112800c79d74fb6fec2f28c6c2e54ffbf6927","infoHashBuffer":{"type":"Buffer","data":[182,113,18,128,12,121,215,79,182,254,194,242,140,108,46,84,255,191,105,39]},"announce":[],"urlList":[]}}