{"title":"Obama's Guantanamo Jonathan Hafetz KS49 epub mobi Non-fiction","uid":15227239,"size":2695925,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b67d6ae01ea8efa42f7b05f7d182db231ee2a9dc&amp;dn=Obama%27s+Guantanamo+Jonathan+Hafetz+KS49+epub+mobi+Non-fiction&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"KiwiSue49","files":3,"time":1467778092,"description":"Title:\r\n\r\nObama’s Guantanamo: Stories from an Enduring Prison\r\n\r\n\r\nDescription:\r\n\r\nThe U.S. detention center at Guantanamo Bay has become the symbol of an unprecedented detention system of global reach and immense power. Since the 9/11 attacks, the news has on an almost daily basis headlined stories of prisoners held indefinitely at Guantanamo without charge or trial, many of whom have been interrogated in violation of restrictions on torture and other abuse. These individuals, once labeled &quot;enemy combatants&quot; to eliminate legal restrictions on their treatment, have in numerous instances been subject to lawless renditions between prisons around the world. The lines between law enforcement and military action; crime and war; and the executive, legislative, and judicial branches of power have become dangerously blurred, and it is time to unpack the evolution and trajectory of these detentions to devise policies that restore the rule of law and due process.\r\n\r\nObama's Guantanamo: Stories from an Enduring Prison describes President Obama's failure to close America's enduring offshore detention center, as he had promised to do within his first year in office, and the costs of that failure for those imprisoned there. Like its predecessor, Guantanamo Lawyers: Inside a Prison Outside the Law, Obama's Guantanamo consists of accounts from lawyers who have not only represented detainees, but also served as their main connection to the outside world. Their stories provide us with an accessible explanation of the forces at work in the detentions and place detainees' stories in the larger context of America's submission to fearmongering. These stories demonstrate all that is wrong with the prison and the importance of maintaining a commitment to human rights even in times of insecurity.\r\n\r\nTested the epub in Calibre for PC – Windows, and Moonplus Reader on a Samsung tablet.\r\nHave converted the epub into a mobi file with Kindle Previewer and tested it out in Mobipocket Reader, Kindle for PC and Kindle for Android","torrent":{"xt":"urn:btih:b67d6ae01ea8efa42f7b05f7d182db231ee2a9dc","amp;dn":"Obama%27s+Guantanamo+Jonathan+Hafetz+KS49+epub+mobi+Non-fiction","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b67d6ae01ea8efa42f7b05f7d182db231ee2a9dc","infoHashBuffer":{"type":"Buffer","data":[182,125,106,224,30,168,239,164,47,123,5,247,209,130,219,35,30,226,169,220]},"announce":[],"urlList":[]}}