{"title":"Windows 7 Live CD v.1.0 English Version Based on WinPE","uid":5451896,"size":648390656,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b6ae498f912879628e9c7e2051113278b76bab4c&amp;dn=Windows+7+Live+CD+v.1.0+English+Version+Based+on+WinPE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rocketero","files":-1,"time":1269211239,"description":"WARNING! WARNING! WARNING! WARNING! WARNING! WARNING! WARNING!\n\nDO NOT USE THIS CD IN A PC/LAPTOP THAT HAS A MULTIBOOT MENU (Like Different Partitions with several Operating Systems on the same PC). If you have a /BOOT/BCD hidden file then you have a Multiboot Menu. Booting this CD in such systems will corrupt the /BOOT/BCD FILE and youÃ‚Â´ll have to recover it by using the &quot;REPAIR SYSTEM&quot; From the OS Original DVD (Windows OSÃ‚Â´s). This problem was discovered a while ago and itÃ‚Â´s due to ESET program in the CD. \n\nFor anyone who wants to used a keyboard different than English, here is a small Portable app called KeyboardLayoutChanger.exe written by Ronny Wernicke, you can run it after booting Win7RescuePE, the Link is:\n\nOn the page go to the link at the bottom where it says: SAVE FILE TO YOUR PC: CLICK HERE\nPlace the file anywhere in your hard disk and after booting Win7RescuePE go to that location and run this app and change the keyboard to the Language available in that app. You can use it also in your phisical machine.\n\nWindows 7 Live-CD (English) Based on Windows PreInstallation Environment (WPE).\nISO File is ready to Burn on CD/DVD (fits on 700MB CD).\n\nCharacteristics:\nMonitor Resolution: 1280x1024x32bit (Can be changed with application MultiRes.exe)\nKeyboard: English\nOperating System: Windows 7 English (The Core Files included in WinPE)\n\nApplications installed covered Hard Disk and File Restoration, Fixing Master Boot Record (MBR), Defragging, CD/DVD Burning, CHM,PDF viewers, Graphic Viewer and Editing, Compression and Decompressing (zip, 7zip), Virus and Spy-ware Scanners, Internet Browsers, Document Editing, File Managers, Network Configuration, Screen Capture, and many more.\n\nAll the applications are accessible from the Start Button --&gt; All programs\n\nIf the network is not running, there is additional preconfigured network drivers that can be loaded with the application called: Win7PEldr.exe (on Desktop). Optional you can access the drivers from your hard-drive once Win7RescuePE is booted as it should be able to see and read all the Hard-drive partitions in you computer.\n\nUse this CD/DVD to repair unresponsive Systems or to access files in dead computers. It can be used also to installed stored images using the applications located in the Start-up_Menu called System_Recovery--&gt;DART6.5\n\nAlso you can use any Portable Application inside once you Finish Booting this CD. Like utorrent_Portable, OpenOffice_Portable, MSN_portable, etc. they can be downloaded from Portableapps.com and portablefreeware.com among the best sites for Portable apps.\n\nFinally, it includes PARTED MAGIC, a fast Linux System to deal with Hard Drives, Partitions and Files. It can read Windows partitions (NTFS)_ and its files/folders.\n\nI haven't tried it but I believe it could be done, Formatting a USB stick (1GB) as NTFS and then using UltraISO or other similar app decompress the ISO file to the USB, and that way be able to boot Win7RescuePE from USB.\n\nPlease Help Seeding.\n\nRocketero","torrent":{"xt":"urn:btih:b6ae498f912879628e9c7e2051113278b76bab4c","amp;dn":"Windows+7+Live+CD+v.1.0+English+Version+Based+on+WinPE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6ae498f912879628e9c7e2051113278b76bab4c","infoHashBuffer":{"type":"Buffer","data":[182,174,73,143,145,40,121,98,142,156,126,32,81,17,50,120,183,107,171,76]},"announce":[],"urlList":[]}}