{"title":"XTC - The Mayor of Simpleton [promo].VOB","uid":10726504,"size":80623616,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b7e28119808f5494ee40a3b40880eaed0d327f99&amp;dn=XTC+-+The+Mayor+of+Simpleton+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1407573457,"description":"XTC - The Mayor of Simpleton [promo].VOB\n\n\nHQ very rare promo music video. &quot;The Mayor of Simpleton&quot; is a song by English band XTC, released as the first single from their album Oranges &amp; Lemons.\n\nOranges &amp; Lemons is the eleventh studio album by the English band XTC, released in 1989. The name of the album came from the old English nursery rhyme, also referenced previously in &quot;Ballet for a Rainy Day&quot; on their previous album Skylarking.\n\nThe song reached No. 72 on the Billboard Hot 100 singles chart and No. 1 on its Modern Rock chart, becoming the band's best-performing single in the United States.\n\nIn early 1982, while at the peak of their popularity, XTC embarked on a major tour. This was abruptly cut short when Partridge suffered a mental breakdown on stage during one of the first concerts of the tour in Paris on 18 March 1982.\n\nOn 2 April 1982, a Friday night, XTC were scheduled to play at the Palladium in Hollywood, California, but did not appear. The audience milled about the open festival floor for a long 45 minutes/hour after opening act Oingo Boingo departed the stage, and then finally it was announced that XTC would not take the stage due to the &quot;illness&quot; of one of the band members (later revealed as Andy Partridge's ongoing fight with stage fright in Chris Twomey's book XTC: Chalkhills and Children). XTC never played another tour date. (XTC would perform several acoustic sets for radio only in 1989.)\n\nXTC were a new wave rock band from Swindon, England, led by songwriters Andy Partridge and Colin Moulding and active between 1976 and 2005. The band enjoyed some chart success, including the UK and Canadian hits &quot;Making Plans for Nigel&quot; (1979) and &quot;Senses Working Overtime&quot; (1982).\n\nDespite their three-decade career, XTC were a performing and touring band for only six of those years: they retired from live performance in 1982. For the remaining twenty-three years of their existence XTC were a studio-based project involving session players around a nucleus of Partridge, Moulding and Dave Gregory. The band are perhaps better known for long-standing critical acclaim rather than commercial success.\n(video has a green/white &quot;vh1 classic&quot; logo at the bottom right)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Mayor_of_Simpleton&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Mayor_of_Simpleton&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/maPjOAAFl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/maPjOAAFl&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 640x480 29.97fps 5800kbps\n   Audio: Dolby Digital AC3 48000Hz stereo 320kbps    \n   Duration: 00:03:34\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.6\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:b7e28119808f5494ee40a3b40880eaed0d327f99","amp;dn":"XTC+-+The+Mayor+of+Simpleton+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7e28119808f5494ee40a3b40880eaed0d327f99","infoHashBuffer":{"type":"Buffer","data":[183,226,129,25,128,143,84,148,238,64,163,180,8,128,234,237,13,50,127,153]},"announce":[],"urlList":[]}}