{"title":"Kobold Quarterly Dungeons and Dragons Role Playing","uid":8964474,"size":312566450,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:b7f45f1701c776380ab310c3fe84097647c8f1c2&amp;dn=Kobold+Quarterly+Dungeons+and+Dragons+Role+Playing&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1380184181,"description":"Sadly, after many, MANY years (decades, actually) of being a DM, I no longer have anyone to game with. Rather than leave the 60+ GB of files that will never be used on my external to take up space (which I could use for comic books), I'm going to burn them off to blu-ray data discs and file them away in hopes that they may be used at some point in the future.\n\nNo big descriptions or explanations with these - you either know what they are, and that you want them, or you don't.\n\nThese uploads are definitely an experiment; if there is interest, I'll seed them for a while, but if there isn't, I'll have them deleted and &quot;file&quot; this stuff away. \t\t\n\n\n----------------------------------------------------------------------------------------\n\n\nKobold Quarterly was a roleplaying game magazine created by Wolfgang Baur and published by Open Design LLC. It was published four times a year and focused on the Dungeons &amp; Dragons role-playing game system. The magazine occupied the gaming market niche once served by the Dungeon and Dragon magazines, and included interviews with game designers as well as supplemental game material. As of 2011, the magazine had three editors, including editor-in-chief Wolfgang Baur.\n\nThe magazine has won multiple ENnie Awards.\n\nThe magazine ended publication with issue 23, Fall 2012\n\nIncomplete, contains only issues 1-16","torrent":{"xt":"urn:btih:b7f45f1701c776380ab310c3fe84097647c8f1c2","amp;dn":"Kobold+Quarterly+Dungeons+and+Dragons+Role+Playing","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7f45f1701c776380ab310c3fe84097647c8f1c2","infoHashBuffer":{"type":"Buffer","data":[183,244,95,23,1,199,118,56,10,179,16,195,254,132,9,118,71,200,241,194]},"announce":[],"urlList":[]}}