{"title":"Atlas of Immunology","uid":6993275,"size":37239841,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b89c26bbf764dfa97f66ab4f8518f72d40859bc3&amp;dn=Atlas+of+Immunology&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"tuxworld","files":-1,"time":1327777129,"description":"Atlas of Immunology [II EDITION]\n\n\nAUTHOR :  Robert E. Lewis, Julius M. Cruse\n\n\nThe Atlas of Immunology is a unique pictorial reference, containing more than 1,000 illustrations depicting essentially every concept of importance in understanding immunology. The Atlas demystifies immunology for students, basic scientists, and clinicians. Diagrams are included for all levels of understanding, including basic ideas and a detailed treatments.\n\nPresents new topics in immunology, molecular structures, and mechanics of molecular and cellular interactions\n\nIllustrations in the Atlas range from photographs of historical figures to molecular structures of recently characterized cytokines, major histocompatibility complex molecules, immunoglobulins, and molecules of related interest to immunologists. A host of original illustrations present subjects, such as cellular adhesions molecules, in a manner that facilitates understanding of their role in intercellular and immune reactions. Figures pertinent to immunological subspecialties such as transplantation, autoimmunity, immunophysiology, immunopathology, antigen presentation, the T-cell receptor, and many more are found in the Atlas of Immunology. No other book offers the breadth or detail of illustrated immunological concepts.","torrent":{"xt":"urn:btih:b89c26bbf764dfa97f66ab4f8518f72d40859bc3","amp;dn":"Atlas+of+Immunology","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b89c26bbf764dfa97f66ab4f8518f72d40859bc3","infoHashBuffer":{"type":"Buffer","data":[184,156,38,187,247,100,223,169,127,102,171,79,133,24,247,45,64,133,155,195]},"announce":[],"urlList":[]}}