{"title":"The Mentalist S1 E1 (2008)nl.subs.NLT-Release","uid":4569444,"size":708207934,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b92dd044823ae98c2d6cf6ee99be7b4813a1cf8d&amp;dn=The+Mentalist+S1+E1+%282008%29nl.subs.NLT-Release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"linday1","files":-1,"time":1229005365,"description":"De nieuwe Amerikaanse hitserie The Mentalist is vanaf 1 januari wekelijks te zien op SBS 6. Deze crimeserie vertelt het verhaal van Patrick Jane: een zeer bekende, voormalig televisieparagnost die, nadat hij ontmaskert is als fraudeur, nu zijn echte vaardigheden als mentalist gebruikt om het Californie Bureau of Investigation te helpen met het oplossen van misdrijven. Als mentalist, gebruikt Patrick Jane zijn zeer ontwikkelde kundigheden: observeren, afleiden en manipuleren, om het Serious Crime Team te ondersteunen. Hij is charismatisch, een beetje vreemd - en stuurs, en zijn moderne Sherlock Holmes achtige, opzienbarende methodes overschrijden vaak een grens, maar deze methodes geven hem uiteindelijk vaak gelijk.\n\nTeresa Lisbon is een top agent van het CBI die vaak met Patrick Jane samenwerkt. Alhoewel ze schoorvoetend moet toegeven dat hij talent heeft en dat zijn methodes vaak werken, is ze vastberaden de misdrijven op te lossen, met of zonder hem.\n\n\nSeason 1: Episode 01: The Mentalist: Pilot\nWhen a golf pro's wife and her doctor are murdered in Palm Springs, The California Bureau of Investigation (CBI) is called in to investigate. Patrick Jane, a detective and independent consultant for CBI, uses his razor sharp skills of observation to assist a by-the-book Senior Agent Teresa Lisbon and her team (agents Kimball Cho, Wayne Rigsby and rookie member Grace Van Pelt) in finding the killer. The case poses a particular interest for Jane as the killer's calling card (a red smiley face drawn with the victim's blood) suggests it is the famed &quot;Red John&quot;: a serial killer who years ago murdered Jane's wife and daughter. However, after further investigation, Jane's mentalist skills tell him the real killer is trying to pin the murders on &quot;Red John&quot; and the team needs to take a closer look at the other suspects including the golf pro, who was having an affair; his brother, who was sleeping with his brother's wife; and the doctor's business partner, who was embezzling money. And while the team may question Jane's tactics, they know working together with him will help lead them to solving the crime\n\n\n \n\n\n\nCategorie : Beeld \nFormaat : WMVHD omgezet naar Avi\nBron : TV\n \nOndertitels : Nederlands (ingebakken)\n \nGenre : Actie\nMisdaad\nDrama\n \n\n\n[youtube]OfUnK7ISWZA[/youtube]\n\n[b][color=#FF0040]Mini[/color][/b]:\n\n[b][color=#FF0040]TPB[/color][/b]: &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/4569689&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/4569689&lt;/a&gt;\n\nEnjoy The Movie!!!!!! :D\nCategorie : Beeld \nFormaat : WMVHD omgezet naar Avi\nBron : TV\n \nOndertitels : Nederlands (ingebakken)\n \nGenre : Actie\nMisdaad\nDrama\n\n\nVoor de nieuwste films en muziek ga je naar NLT.Ons-Forum het forum voor de Nederlands Ondertitelde torrents:\n &lt;a href=&quot;\nhttp://www.nlt.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nlt.ons-forum.nl&lt;/a&gt;\n\n\nEnjoy The Movie!!!!!!!","torrent":{"xt":"urn:btih:b92dd044823ae98c2d6cf6ee99be7b4813a1cf8d","amp;dn":"The+Mentalist+S1+E1+%282008%29nl.subs.NLT-Release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b92dd044823ae98c2d6cf6ee99be7b4813a1cf8d","infoHashBuffer":{"type":"Buffer","data":[185,45,208,68,130,58,233,140,45,108,246,238,153,190,123,72,19,161,207,141]},"announce":[],"urlList":[]}}