{"title":"Coast to Coast AM June 02, 2013 - Apocalypse &amp; Metaphysics","uid":8559999,"size":57278779,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:b95dd6945fe5f0d18e6136c7d37fb9706478c878&amp;dn=Coast+to+Coast+AM+June+02%2C+2013+-+Apocalypse+%26amp%3B+Metaphysics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pyramid91","files":5,"time":1370859342,"description":"MP3 version wins!\n\nCourtesy of Coast to Coast Am's wonderful  &quot;Coast Insider&quot; service!\nShow description:\nHost:\nGeorge Noory\nGuests:\nMatthew  Petti,                   Tom  Benedict\nAuthor Matthew Petti presented a new context for humanity's history, touching on the Apocalypse, the Great Pyramid, Atlantis, and various metaphysical ideas and mysteries. Regarding the biblical notion of a pending apocalypse (see our related poll), he doesn't foresee the end of the world, but rather drastic change, &quot;and an unveiling of truth through the harsh experiences that enlighten us.&quot; He related the construction of the Great Pyramid in Egypt to a civilization that existed over 4 million years ago-- the Atlanteans, whom he described as supreme beings, who were much more evolved than the humans of today.  \nExplaining his timeline, he said that scientific evidence for a deluge that engulfed the Earth (such as described in the story of Noah's Ark) has not occurred in over two million years. Using the terms Alpha as our beginning point, and Omega as the end point, he suggested that the cycle of the human journey begins and ends with absolute perfection, supreme beings living in a high state of existence in the world. Underneath the miles of ice in Antarctica, there could be evidence of their previous civilization-- this location was previously temperate before climate shifts occurred, he noted. \nHealing with Stones\nFirst hour guest, healer and intuitive Tom Benedict talked about the healing properties of stones and crystals. Different types of stones have particular frequencies which can match up with various systems in the human body, and help them to function better, he explained. For instance, Black Tourmaline is a great stone to help people stay grounded, focused, and articulate, while Selenite and Apophylite can be used to bring in white light and energy, he said. People can work with the stones by carrying them in their pocket, as jewelry, being held during meditation, or even placed on the body, he detailed. \nNews segment guests: Steve Kates 'Dr. Sky', Peter Davenport \nWebsite(s):\n matthewpetti.com\n tomstones.org\nBook(s):\n Alpha to Omega - Journey to the End of Time\n Apocalypse Now Volume 1: The Metaphysics of Truth \n Heretical Wisdom\n","torrent":{"xt":"urn:btih:b95dd6945fe5f0d18e6136c7d37fb9706478c878","amp;dn":"Coast+to+Coast+AM+June+02%2C+2013+-+Apocalypse+%26amp%3B+Metaphysics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b95dd6945fe5f0d18e6136c7d37fb9706478c878","infoHashBuffer":{"type":"Buffer","data":[185,93,214,148,95,229,240,209,142,97,54,199,211,127,185,112,100,120,200,120]},"announce":[],"urlList":[]}}