{"title":"Allan Bullock - Hitler and Stalin [1991] Unabridged","uid":11489921,"size":1117369904,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ba000c1d785b8dc630da9748b16499a45082bdf0&amp;dn=Allan+Bullock+-+Hitler+and+Stalin+%5B1991%5D+Unabridged&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"rambam1776","files":-1,"time":1416253243,"description":"Hitler and Stalin: Parallel Lives - by Alan Bullock\n\n48 kbps, Read by John McDonald, Unabridged, Thx to OP on WHAT\n &lt;a href=&quot;\nhttp://www.barnesandnoble.com/w/hitler-and-stalin-alan-bullock/1112274014?ean=9780679729945&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.barnesandnoble.com/w/hitler-and-stalin-alan-bullock/1112274014?ean=9780679729945&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.nytimes.com/1992/04/03/books/books-of-the-times-hitler-and-stalin-a-double-portrait-of-tyrants.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nytimes.com/1992/04/03/books/books-of-the-times-hitler-and-stalin-a-double-portrait-of-tyrants.html&lt;/a&gt;\n\nBooks of The Times; Hitler and Stalin: A Double Portrait of Tyrants\nBy MICHIKO KAKUTANI\nPublished: April 3, 1992\n\nHitler and Stalin Parallel Lives By Alan Bullock Illustrated. 1,081 pages. Alfred A. Knopf. $35.\n\nFirst published in 1952, Alan Bullock's &quot;Hitler: A Study in Tyranny&quot; remains the standard biography of the dictator and a widely respected work on the Nazi movement in general. Now, 40 years later, the eminent English historian has decided to try to put Hitler in perspective with that other monster of 20th-century history -- Stalin. The result is a monumental and completely absorbing volume that creates vivid portraits of these two tyrants, while illuminating the history of the first half of this bloodstained century.\n\nWhy focus such a history on these two individuals? Between them, Hitler and Stalin effectively redrew the map of Europe, leaving behind a social and ideological legacy that has only now begun to disintegrate as a result of the recent breakup of Eastern Europe and the Soviet Union. These two tyrants were responsible for suffering on an unprecedented scale -- a scale so horrifying, so unimaginable that many saw it, at the time, as the end of European civilization. In the two decades of the Hitler-Stalin period (roughly 1930 to 1950), 40 million to 50 million men, women and children were killed, while countless others were wounded, maimed and tortured. At least half of those who died were not casualties of war, but victims of murder, massacre, internment and planned extermination.\n\nLord Bullock points out that neither man seems to have taken part directly in these acts of terror and repression. (Stalin made sure other members of the Politburo took public responsibility for the death warrants; Hitler left no written instructions linking him directly with the Final Solution.) But he firmly takes issue with those revisionist historians who argue that the two were &quot;weak&quot; tyrants who set in motion events and programs that soon snowballed out of control.\nSuch impersonal factors as demographic changes and economic shifts are useful in providing certain historical explanations, Lord Bullock says. &quot;But a different situation arises when war, revolution or some other form of violent upheaval disrupts normality and continuity,&quot; he writes. &quot;Communities then become destabilized, behavior unpredictable and more extreme courses conceivable. In such circumstances, it is for an individual to exert a powerful, even a decisive, influence on the way events develop and the policies that are followed.&quot;\n\nAs Lord Bullock's book makes clear, luck, timing and the confluence of global events played an important part in the careers of both Hitler and Stalin. Without the economic depression and political confusion that ensued after Germany's defeat in World War I, Hitler would not have found the receptive audiences that he did. Without the death of Lenin at the age of 53, Stalin's rise to power would not have been insured.\n\nOn the other hand, Lord Bullock writes, &quot;I find it difficult to imagine under any other German leader the extraordinary successes of a right-wing radical party like the Nazis between 1930 and 1933; the foreign policy and military successes of 1936 through 1941; the attack on Russia, the attempt to found a new slave empire in the east, and the racist massacres to which this led, culminating in the attempt to exterminate the Jewish population of Europe.&quot; He says he finds it equally difficult &quot;to imagine under any other Soviet leader than Stalin the Great Leap Forward of the forced collectivization of agriculture imposed without regard to the cost in human lives, the destruction of Lenin's original party, the purge of the Red Army, the creation of the Gulag empire, and the combination of Marxism-Leninism with tsarist autocracy in the Stalinist state.&quot;\n\nAs Lord Bullock sees it, both Hitler and Stalin were narcissists; both regarded themselves as leaders with a historical mission -- leaders who were exempt from the ordinary rules of human conduct. Hitler, Lord Bullock says, &quot;saw himself as called on by Providence to rescue the German people from the humiliation of defeat and the decadence of Weimar; to restore them to their rightful historic position as a master race, and to guarantee it for the future by creating a new Germanic empire in Eastern Europe.&quot; Stalin, on his part, &quot;saw his mission as ending the centuries-old backwardness of Russia, turning a peasant society into a modern industrialized country and at the same time creating the first socialist state in the world.&quot;\n\nOther parallels exist between Hitler's and Stalin's lives as well. Both were outsiders, whose careers were possible only in the new world created in the wake of World War I. Both were champions of 19th-century systems of belief (Marxism, in Stalin's case; social Darwinism combined with racism, in Hitler's) that reached a peak of influence at the turn of the century.\n\nBoth Hitler and Stalin evolved into masterful politicians, skilled at manipulating circumstances while cloaking their ambitions. Both became single-minded tyrants, who regarded ruthlessness and the use of force as virtues. In addition, both suffered from a paranoia that fueled their public policies: while Hitler's suspicion of Jews, Slavs and Bolsheviks helped shape his racist, nationalist agenda, Stalin's mistrust of individuals around him contributed to the succession of arrests, trials and purges against the Communist Party in the late 30's.\n\nIn temperament, Lord Bullock reports, the two dictators could not have been more different: Hitler, charismatic, theatrical and confident in his verbal powers of persuasion; Stalin, cold, secretive and driven to rely on fear as a way of maintaining his power. Still, both men developed personal cults that appealed to people's longing &quot;for a messiah in the guise of a leader&quot; , and both made &quot;their public images omnipresent: the faces staring from every billboard, every office wall and newsreel, the voices over the radio which whole populations were required to listen to.&quot; In this respect, the reader can only be thankful that television, at the time, had yet to become a tool in the arsenal of propaganda.\n\nIn comparing the lives and political careers of Hitler and Stalin, Lord Bullock ranges over a vast amount of material, in the process giving the reader succinct histories of this century's two most aggressive ideologies, Nazism and Communism. Clearly the basic form of the book (&quot;parallel lives&quot;) is a structurally awkward one, entailing much jumping around between narrative lines -- a fact that perhaps explains why it has been employed so rarely since Plutarch. Still, Lord Bullock uses it dexterously to dramatize material that may already be familiar to readers of such earlier works as Joachim Fest's &quot;Hitler,&quot; Robert Conquest's various studies of the Stalin era, and of course his own biography of Hitler.\n\nIn the end, what really makes this particular volume so compelling is Lord Bullock's writing. There is a liveliness to it that comes from the author's historical authority and knowledge, combined with a sure moral sense that leaves the reader with a visceral appreciation of the horrors perpetrated by Hitler and Stalin, as well as an understanding of the terrifying consequences that a single tyrant's actions can have upon the world","torrent":{"xt":"urn:btih:ba000c1d785b8dc630da9748b16499a45082bdf0","amp;dn":"Allan+Bullock+-+Hitler+and+Stalin+%5B1991%5D+Unabridged","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba000c1d785b8dc630da9748b16499a45082bdf0","infoHashBuffer":{"type":"Buffer","data":[186,0,12,29,120,91,141,198,48,218,151,72,177,100,153,164,80,130,189,240]},"announce":[],"urlList":[]}}