{"title":"The Simpsons - Season 9 - Audio Commentary - DVDRip - AAC","uid":7428234,"size":339300498,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:ba17beb74932327a9690450e7eeb98f9be3363c4&amp;dn=The+Simpsons+-+Season+9+-+Audio+Commentary+-+DVDRip+-+AAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"schleicher","files":27,"time":1341868944,"description":"All Singing, All Dancing (5F24) (Audio Commentary by Matt Groening, David Mirkin, Steve O'Donnell, Hank Azaria, Yeardley Smith and Steven Dean Moore)\n\nBart Carny (5F08) (Audio Commentary by Matt Groening, Mike Scully, George Meyer and Mark Kirkland)\n\nBart Star (5F03) (Audio Commentary by Mike Scully, George Meyer, Donick Carey, Dan Castellaneta, Yeardley Smith and Dominic Polcino)\n\nDas Bus (5F11) (Audio Commentary by Matt Groening, Mike Scully, George Meyer, David S. Cohen and Pete Michaels)\n\nDumbbell Indemnity (5F12) (Audio Commentary by Matt Groening, Mike Scully, George Meyer, Ron Hauge, Ian Maxtone-Graham and Dominic Polcino)\n\nGirly Edition (5F15) (Audio Commentary by Matt Groening, Mike Scully, David S. Cohen, George Meyer, Yeardley Smith and Mark Kirkland)\n\nKing of the Hill (5F16) (Audio Commentary by Mike Scully, Richard Appel and Steven Dean Moore)\n\nLisa the Skeptic (5F05) (Audio Commentary by Matt Groening, Mike Scully, David S. Cohen, George Meyer, Yeardley Smith and Pete Michaels)\n\nLisa's Sax (3G02)  (Audio Commentary by Al Jean, Mike Reiss and Dominic Polcino)\n\nLisa, the Simpson (4F24) (Audio Commentary by Bill Oakley, Josh Weinstein, Ned Goldreyer and Susie Dietter)\n\nLisa, the Simpson (4F24) (Additional Audio Commentary by Bill Oakley and Josh Weinstein)\n\nLost Our Lisa (5F17) (Audio Commentary by Matt Groening, Mike Scully, George Meyer, David S. Cohen, Yeardley Smith and Pete Michaels)\n\nMiracle on Evergreen Terrace (5F07) (Audio Commentary by Matt Groening, Mike Scully, George Meyer, Ron Hauge, Nancy Cartwright, Yeardley Smith and Bob Anderson)\n\nNatural Born Kissers (5F18) (Audio Commentary by Matt Groening, Mike Scully, George Meyer, Matt Selman, Dan Castellaneta and Mark Kirkland)\n\nRealty Bites (5F06) (Audio Commentary by Mike Scully, Dan Greaney, Richard Appel and Swinton O. Scott III.)\n\nSimpson Tide (3G04) (Audio Commentary by Al Jean and Mike Reiss)\n\nThe Cartridge Family (5F01) (Audio Commentary by Matt Groening, Mike Scully, Ian Maxtone-Graham, Ron Hauge, George Meyer, Donick Carey, Yeardley Smith and Pete Michaels)\n\nThe City of New York vs. Homer Simpson (4F22) (Audio Commentary by Bill Oakley, Josh Weinstein and Jim Reardon)\n\nThe Joy of Sect (5F23) (Audio Commentary by Matt Groening, David Mirkin, Steve O'Donnell, Yeardley Smith and Steven Dean Moore)\n\nThe Last Temptation of Krust (5F10) (Audio Commentary by Matt Groening, Mike Scully, George Meyer, Ron Hauge, Donick Carey, Yeardley Smith, Jay Leno and Mike B. Anderson)\n\nThe Principal and The Pauper (4F23) (Audio Commentary by Bill Oakley, Josh Weinstein, Ken Keeler and Steven Dean Moore)\n\nThe Trouble With Trillions (5F14) (Audio Commentary by Matt Groening, Mike Scully, George Meyer, Ian Maxtone-Graham, Matt Selman and Swinton O. Scott III.)\n\nThe Two Mrs. Nahasapeemapetilons (5F04) (Audio Commentary by Mike Scully, Richard Appel and Steven Dean Moore)\n\nThis Little Wiggy (5F13) (Audio Commentary by Matt Groening, Mike Scully, George Meyer and Dan Greaney)\n\nTrash of the Titans (5F09) (Audio Commentary by Matt Groening, Mike Scully, George Meyer, Ron Hauge, Nancy Cartwright, Ian Maxtone-Graham and Yeardley Smith)\n\nTreehouse of Horror VIII (5F02) (Audio Commentary by Matt Groening, Mike Scully, David S. Cohen, George Meyer, Matt Selman and Mark Kirkland)","torrent":{"xt":"urn:btih:ba17beb74932327a9690450e7eeb98f9be3363c4","amp;dn":"The+Simpsons+-+Season+9+-+Audio+Commentary+-+DVDRip+-+AAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba17beb74932327a9690450e7eeb98f9be3363c4","infoHashBuffer":{"type":"Buffer","data":[186,23,190,183,73,50,50,122,150,144,69,14,126,235,152,249,190,51,99,196]},"announce":[],"urlList":[]}}