{"title":"Do It Yourself: A Handbook for Changing Our World","uid":7810667,"size":7672218,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ba36fb2e9477d47b7738428a0ae319767c9d684c&amp;dn=Do+It+Yourself%3A+A+Handbook+for+Changing+Our+World&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1352522080,"description":"Kim Bryan, Paul Chatterton, Alice Cutler, &quot;Do It Yourself: A Handbook for Changing Our World&quot;\nEnglish | ISBN: 0745326374 | 2007 | PDF | 306 pages \n\nDo you really want to change the world? If the answer is YES, then this book shows you how.\n\nLeading a sustainable and truly radical life encompasses a whole variety of things that challenge the mainstream. This book shows how we can make real changes to the way we live. In simple steps, it describes how you can create sustainable and equitable ways of living that can help transform not just your own life, but the society around you.\n\nThe book weaves together analysis, stories, experiences, and practical guides, examining nine different areas where people are transforming their lives and society---right here and now.\n\nAccessible and informative, this DIY handbook brings alive the rich potential of grassroots activism and shows how we can work together to create just, equitable, and sustainable societies.\n\nCovering everything from cultural activism to health, autonomous spaces, food, alternative media, popular education, and direct action, it shows you how to:\n\nset up a housing cooperative do a workshop on climate change build a passive solar heating system start an independent media project set up a social center make interventions in the urban landscape that are funny and inspiring and lots more!\n\t\t","torrent":{"xt":"urn:btih:ba36fb2e9477d47b7738428a0ae319767c9d684c","amp;dn":"Do+It+Yourself%3A+A+Handbook+for+Changing+Our+World","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba36fb2e9477d47b7738428a0ae319767c9d684c","infoHashBuffer":{"type":"Buffer","data":[186,54,251,46,148,119,212,123,119,56,66,138,10,227,25,118,124,157,104,76]},"announce":[],"urlList":[]}}