{"title":"Greg Iles - Third Degree (Retail)","uid":10354295,"size":529560,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ba63deebc4c0e7c7e208bbe513abb4815155e119&amp;dn=Greg+Iles+-+Third+Degree+%28Retail%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"TheRose88","files":1,"time":1402710572,"description":"Greg Iles - Third Degree - Retail (epub)\n\n\n Greg Iles takes us to the idyllic town of Athens Point, Mississippi, to probe beneath the surface of the modern American marriage -- where the appearance of perfection conceals a soul-searing conflict of unnerving intensity and violent possibility. Packed with the storytelling brilliance and twisting suspense that mesmerized readers of &quot;True Evil, Turning Angel,&quot; and &quot;Blood Memory,&quot; Iles's newest novel delivers a powerful, revelatory reading experience.\n\nLaurel Shields, thirty-five and mother of two, awakens to find that her husband, Warren, a prominent local physician, is not in bed with her. Creeping out to the kitchen of their palatial home, she sees him through the doorway of his study, wildly pulling books from the shelves. Two weeks earlier, Warren and his partner were informed by the IRS that their medical practice was being audited; since then the stress on Dr. Shields has steadily ratcheted up.\n\nBut Laurel has problems of her own. Quickly returning to the bedroom, she locks herself in the master bath, opens a home pregnancy testing kit, and fearfully tests herself. &quot;PREGNANT,&quot; announces the digital readout. Laurel closes her eyes as though absorbing news of a death, then quickly hides the evidence. She is not sure who the father is. Summoning all her strength, she walks into the kitchen to carry out the acting performance of her life.\n\nLater that morning, Laurel returns home and is surprised to find her husband's car still parked in the driveway. The house has a strange stillness to it. In the den, she finds Warren sitting on the sofa in the same clothes he wore the previous day. His face is pale and unshaven, his eyes hollow with fear. Then, in come the children, innocent of it all....\n\nSo begins the most terrifying day in the history of a marriage, one that in less than five hours will make the Shields house the vortex of a nerve-wracking siege. While a nervous ring of armed men awaits its chance to storm the suburban home, inside the house the clock ticks down on exposure of Laurel's terrible secret. But she is not alone in her lies. Before the siege is through, this terrifying drama will pull in desperate characters from the town and drive Dr. Shields, his wife, and her lover to the very brink of sanity and survival.","torrent":{"xt":"urn:btih:ba63deebc4c0e7c7e208bbe513abb4815155e119","amp;dn":"Greg+Iles+-+Third+Degree+%28Retail%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba63deebc4c0e7c7e208bbe513abb4815155e119","infoHashBuffer":{"type":"Buffer","data":[186,99,222,235,196,192,231,199,226,8,187,229,19,171,180,129,81,85,225,25]},"announce":[],"urlList":[]}}