{"title":"Friedrich Nietzsche - Thus Spoke Zarathustra (Unabridged)","uid":4747144,"size":441057886,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ba823cde73cf449ea6359195b8ea945f9641180a&amp;dn=Friedrich+Nietzsche+-+Thus+Spoke+Zarathustra+%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"sheila6","files":56,"time":1235939614,"description":"Friedrich Nietzsche's great novel, which first gave us the term 'Superman' later to be turned into a comic book hero, and an early look at atheism which would warm the heart of Richard Dawkins.\n\nThe novel opens with Zarathustra descending from his cave in the mountains after ten years of solitude. He is brimming with wisdom and love, and wants to teach humanity about the overman. He arrives in the town of the Motley Cow, and announces that the overman must be the meaning of the earth. Mankind is just a bridge between animal and overman, and as such, must be overcome. The overman is someone who is free from all the prejudices and moralities of human society, and who creates his own values and purpose.\n \nThe people on the whole seem not to understand Zarathustra, and not to be interested in the overman. The only exception is a tightrope walker who has fallen and who dies shortly thereafter. At the end of his first day among people, Zarathustra is saddened by his inability to move this &quot;herd&quot; of people in the marketplace. He resolves not to try to convert the multitudes, but rather to speak to those individuals who are interested in separating themselves from the herd.\n \nThe bulk of the first three parts is made up of individual lessons and sermons delivered by Zarathustra. They cover most of the general themes of Nietzsche's mature philosophy, though often in highly symbolic and obscure form. He values struggle and hardship, since the road toward the overman is difficult and requires a great deal of sacrifice. The struggle toward the overman is often symbolically represented as climbing a mountain, and the light-hearted free spirit of the overman is often represented through laughter and dance.\n \nZarathustra is harshly critical of all kinds of mass movements, and of the &quot;rabble&quot; in general. Christianity is based upon a hatred of the body and of this earth, and an attempt to deny them both by believing in the spirit and in an afterlife. Nationalism and mass politics are also means by which weary, weak, or sick bodies try to escape from themselves. Those who are strong enough, Zarathustra suggests, struggle. Those who are not strong give up and turn to religion, nationalism, democracy, or some other means of escape.\n \nThe culmination of Zarathustra's preaching is the doctrine of the eternal recurrence, which claims that all events will repeat themselves again and again forevermore. Only the overman can embrace this doctrine, since only the overman has the strength of will to take responsibility for every moment in his life and to wish nothing more than for each moment to be repeated. Zarathustra has trouble facing the eternal recurrence, as he cannot bear the thought that the mediocrity of the rabble will be repeated through all eternity without improvement.\n \nIn Part IV, Zarathustra assembles in his cave a number of men who approximate, but who do not quite attain the position of the overman. There, they enjoy a feast and a number of songs. The book ends with Zarathustra joyfully embracing the eternal recurrence, and the thought that &quot;all joy wants deep, wants deep eternity.&quot; \n\n\nEnjoy and Seed!","torrent":{"xt":"urn:btih:ba823cde73cf449ea6359195b8ea945f9641180a","amp;dn":"Friedrich+Nietzsche+-+Thus+Spoke+Zarathustra+%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba823cde73cf449ea6359195b8ea945f9641180a","infoHashBuffer":{"type":"Buffer","data":[186,130,60,222,115,207,68,158,166,53,145,149,184,234,148,95,150,65,24,10]},"announce":[],"urlList":[]}}