{"title":"Runaway: A Road Adventure(PC Game)","uid":4272755,"size":959188249,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:bab5090da0c3bfbcb2799d3a12e33595435a8546&amp;dn=Runaway%3A+A+Road+Adventure%28PC+Game%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"kingswoodtown","files":1,"time":1215025007,"description":"Runaway A Road Adventure one of the best point and click games iv played.. Nothing is ripped everything is there in this great game...INSTALL and play ..ENJOY\n\n\nRunaway: A Road Adventure is a new entry in the traditional adventure game genre from Spanish developer Pendulo Studios. Well, Runaway is new to the United States--the game&amp;#039;s been available in Europe for quite a while, but it&amp;#039;s just now showing up on these shores with fully translated text and English dialogue. In the fast-paced world of PC games, a delay of just a few months can make your game look dated when it&amp;#039;s finally released, so you might expect a delay of well over a year to be Runaway&amp;#039;s death knell. However, adventure games depend more on creativity than technology, and it&amp;#039;s for this reason that Runaway is just as enjoyable today as it was when it was originally released. The game is a reasonably well-made attempt at revitalizing the adventure game spirit of old, and though it may not quite live up to the standard-bearers of the genre, it&amp;#039;s certainly of sufficient quality that adventure fans should give it a look.\n\nThe story in Runaway follows Brian Basco, a recent college graduate based on the East Coast who&amp;#039;s looking to continue his studies out West. Brian takes off on a road trip so he can begin a postgraduate stint at UC Berkeley, but he doesn&amp;#039;t even make it out of town before his plans are reduced to shambles by a collision with damsel in distress named Gina. Brian&amp;#039;s big heart demands that he help Gina, who is not surprisingly being pursued by some jackbooted mafiosi, and together they take off to flee the thugs and also discover the secret of a mysterious artifact entrusted to Gina by her slain secret-agent father. If this setup sounds a little far-fetched, it is, but as you wend your way through the plot, you&amp;#039;ll find a fair number of interesting places and people, as well as some unexpected twists (especially toward the end). Overall, the story is pretty evenly paced and should satisfy all but the most discriminating gamers\n\n","torrent":{"xt":"urn:btih:bab5090da0c3bfbcb2799d3a12e33595435a8546","amp;dn":"Runaway%3A+A+Road+Adventure%28PC+Game%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bab5090da0c3bfbcb2799d3a12e33595435a8546","infoHashBuffer":{"type":"Buffer","data":[186,181,9,13,160,195,191,188,178,121,157,58,18,227,53,149,67,90,133,70]},"announce":[],"urlList":[]}}