{"title":"Kindertijd 39 (5 FIlms op 1 DVD)(dutch) TBS","uid":7031914,"size":4622904921,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:bb067b825bb65346f4042ecca6a2b1e7bf3842f3&amp;dn=Kindertijd+39+%285+FIlms+op+1+DVD%29%28dutch%29+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Betty-Boop","files":-1,"time":1329245791,"description":"Kindertijd 39\n\n[img]http://img819.imageshack.us/img819/2066/039rw.jpg[/img]\n\ndisc 39\nBrother Bear 2\nDucktales - Aardbeving\nDucktales - De Micro-Ducks\nMickey's Mooiste Kerst\nSimsala Grimm dvd1\n\nBrother Bear 2\nWe zijn terug met een hele nieuwe film hÃƒÂ¨? Mooi. En niet alleen wij elanden, maar ook de grote beer (Kenai dus), zijn kleine berenbroer (Koda dus) en ook een nieuw meisje genaamd Nita. Zij is nogal een lastpost hÃƒÂ¨? Nita kent Grote Beer van vroeger toen hij nog geen beer was. Dat was in de eerste film, weet je nog? Hoe dan ook, ze dachten dat ze voor altijd bij elkaar zouden blijven, ook al gaan ze met elkaar om als twee boze bevers in een modderhut.\n\nDucktales - Aardbeving\nZe zijn uitdagend, ze zijn explosief, ze zijn Disney's Ducktales. Oom Dagobert, Kwik, Kwek, en Kwak en een aantal nieuwe figuurtjes zorgen voor avontuur en spanning in deze explosieve nieuwe tekenfilm serie. In AARDBEVING verdwalen Dagobert Duck en Kwik, Kwek en Kwak in een geheimzinnig ondergronds koninkrijk en worden daar aardig door elkaar geschud.\n\nDucktales - De Micro-Ducks\nZe zijn uitdagend, ze zijn explosief, ze zijn Disney's Ducktales. Oom Dagobert, Kwik, Kwek en Kwak en een aantal nieuwe figuurtjes zor- gen voor avonturen en spanning in deze explosieve nieuwe tekenfilm-serie. Buitenaardse wezens hebben oom Dagobert en zijn neefjes heel klein gemaakt in De Micro-Ducks. In Een Huisdier Voor Oom Dagobert besluiten de neefjes oom Dagobert wat afleiding te bezorgen door een huisdier voor hem te kopen. Met alle gevolgen van dien.\n\nMickey's Mooiste Kerst\nKijk hoe koppige Donald wanhopige pogingen doet om vooral niet van dekerstdagen te genieten. lach vervolgens mee met Mickey en Pluto als ze een belangrijke les leren over de kracht van vriendschap. Deze magische CGI-animatie geeft jou en je familie een geheel nieuwe kijk op je favoriete Disney vriendjes. Geniet van de feestdagen met deze onweerstaanbare verzameling kerstverhalen.\n\nSimsala Grimm dvd1\nDe sprookjes van de gebroeders Grimm zijn misschien wel de mooiste ooit geschreven. In SimsalaGrimm nemen Yoyo en Doc Croc je mee op een ontdekkingstocht door de leukste en spannendste verhalen van Grimm! Deze box bevat 12 mooie en spannende sprookjes, samen goed voor zo'n 5 uur kijkplezier!\n\n\nSpotinformatie:\nCatagorie: Beeld\nFormaat: DVD 5\nBron: Retail dvd voor de Mpeg\nGenre: Animatie\nAudio: NL\nSubtitles: geen\n\n@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@\n\nKom ook eens kijken :\n    &lt;a href=&quot;\nhttp://black-sam.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://black-sam.org&lt;/a&gt;\n[img]http://img708.imageshack.us/img708/589/blacksam3.jpg[/img]\n\nEnjoy\n\n@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@","torrent":{"xt":"urn:btih:bb067b825bb65346f4042ecca6a2b1e7bf3842f3","amp;dn":"Kindertijd+39+%285+FIlms+op+1+DVD%29%28dutch%29+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb067b825bb65346f4042ecca6a2b1e7bf3842f3","infoHashBuffer":{"type":"Buffer","data":[187,6,123,130,91,182,83,70,244,4,46,204,166,162,177,231,191,56,66,243]},"announce":[],"urlList":[]}}