{"title":"Uninvited (1988) - DVDRip","uid":5654912,"size":664351424,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bcaa49c16901e4dc58eb3e82a12a4e36c0357c5e&amp;dn=Uninvited+%281988%29+-+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Horrorspoke","files":-1,"time":1277760020,"description":"You'll Never Look At A Cat The Same Way Again!\n\nSYNOPSIS:\n\nA bunch of young people are invited to a Caribbean cruise on a gangster's yacht, to distract the attention of the authorities. Unfortunately, a mutant cat which escaped from a test laboratory also gets on board, and kills most of the passengers.\n\nIMDB REVIEW:\n\nThis is a wonder in film making, as in you'll wonder what the makers of this film were thinking when they created the hideous &quot;monster&quot; that kills several people. Beautiful babes go on board a yacht belonging to gangster types and one brings a pretty kitty she just found. Little does she know that it's an escaped mutant and it barfs up more than just hairballs. It also meows and makes other catty noises incessantly without opening its mouth too. Talk about bad dubbing. When one first sees the &quot;monster&quot; unrestrained laughter is probably the reaction rather than &quot;ohmigod!&quot;. It looks rather like the cat is spewing out a Muppet but it manages to inflict fatal wounds to pretty much anyone it comes in contact with. If not for the scratches you'd think they laughed themselves to death. Any attempt at plotting is pretty well overshadowed by the special effects, so no point in trying to describe any of that here, but it does involves dirty doings and gangsters and George Kennedy is present so what more can I say. A truly awful piece of garbage, which I liked, but wouldn't recommend to anyone except a bad movie enthusiast. 7 out of 10.\n\n\nSeed and enjoy!!!","torrent":{"xt":"urn:btih:bcaa49c16901e4dc58eb3e82a12a4e36c0357c5e","amp;dn":"Uninvited+%281988%29+-+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bcaa49c16901e4dc58eb3e82a12a4e36c0357c5e","infoHashBuffer":{"type":"Buffer","data":[188,170,73,193,105,1,228,220,88,235,62,130,161,42,78,54,192,53,124,94]},"announce":[],"urlList":[]}}