{"title":"Positive Noise-Heart of Darkness _1981_New Wave_Magazine_style_J","uid":7401575,"size":58772605,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:bcaff27627f08a0f33f41eaeb4444e4bd7f14d67&amp;dn=Positive+Noise-Heart+of+Darkness+_1981_New+Wave_Magazine_style_J&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"angeldustless","files":14,"time":1341088837,"description":"Shortish lived Glasgow band formed in July 1979 featuring three Middleton brothers, Ross Middleton (vocals/guitar), Fraser Middleton (bass), Graham Middleton (keyboards) and Les Gaff (drums). \n\n First album 'Heart of Darkness' borrowed heavily from Magazine and Joy Division, though perhaps with a more Celtic or Gothic angle.  Some fine moments notably 'Ghosts'. (album guests: Keith Levene - Guitar, Gary Barnacle - Saxophone) \n\n Follow-up single Charm took a different direction with a film noire feel, poppier structure and gathered some airtime.  Rather than marking a change in direction, it turned out to be a precursor to a full-blown coup, with guitarist Russell Blackstock persuading the two junior Middletons that Ross's lyrics were 'Heavy metal' and that they should embrace the electronic age.  Ross left and went on to form Leisure Process. The next album 'Change of Heart' emerged as a synth-pop effort, with well-above-average tunes but ultimately going down a cul-de-sac.  Inferior further effort Distant Fires failed to hitch a ride on the electronic bandwagon. 2 John Peel Sessions: 19/08/1980 (Maida Vale 4), 16/03/1981 (Langham 1).\n\nSong 6 was a single included in the LP that was released in Greece!!!\n\nSong 12 from another LP. Compare the change of style as being described in www.last.fm\n","torrent":{"xt":"urn:btih:bcaff27627f08a0f33f41eaeb4444e4bd7f14d67","amp;dn":"Positive+Noise-Heart+of+Darkness+_1981_New+Wave_Magazine_style_J","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bcaff27627f08a0f33f41eaeb4444e4bd7f14d67","infoHashBuffer":{"type":"Buffer","data":[188,175,242,118,39,240,138,15,51,244,30,174,180,68,78,75,215,241,77,103]},"announce":[],"urlList":[]}}