{"title":"Maceo Parker - School's In! (2005) SACD-DFF","uid":11181947,"size":1144070875,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:bd2b281197eeab3886b07e42cd748996e09d7a53&amp;dn=Maceo+Parker+-+School%27s+In%21+%282005%29+SACD-DFF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"hal4000","files":-1,"time":1412869554,"description":"Maceo Parker (born February 14, 1943) is an American funk and soul jazz saxophonist, best known for his work with James Brown in the 1960s, as well as Parliament-Funkadelic in the 1970s. Parker was a prominent soloist on many of Brown's hit recordings, and a key part of his band, playing alto, tenor and baritone saxophones. Since the early 1990s, he has toured under his own name.\n\nAlto saxophonist Maceo Parker will forever be known as James Brown's main horn man, and his gritty sax playing with the likes of Bootsy Collins and Prince has made him the dean of funk, a man who helped build the genre from the ground up, starting with &quot;Papa's Got a Brand New Bag.&quot; That new bag is now 40 years old here, and although Parker's solo projects have never gotten the same attention as his side jobs, it is startling to realize that School's In! is his ninth solo album. Parker knows that the groove is the thing, and working the groove to death is his main goal, so being up to date, current, and innovative doesn't concern him very much, which is why School's In! sounds so wonderfully refreshing, and is arguably his most complete effort since 1992's Life on Planet Groove. Recorded in the studio with his touring band, the album has a loose, bright feel, grounded, of course, by Parker's brand of jazz-tinged soul funk. Highlights include long, muscular sax workouts on &quot;Basic Funk: 101&quot; and the Jackson 5's &quot;ABC,&quot; both of which stretch out to over eight minutes in length, and Parker's vocal duet with fellow alto sax player (and fellow Prince alum) Candy Dilfer on Sam Cooke's &quot;What a Wonderful World.&quot; Morris Hayes adds some nice counter piano on the soul-jazzy &quot;Arts &amp; Crafts,&quot; while the album's instrumental ballad, &quot;Song for My Teacher,&quot; hints at what Parker can do in the jazz department should he ever choose to transfer there. The track that will undoubtedly get the most media attention is &quot;What Do You Know About Funk?,&quot; which includes a mid-tempo rap from Parker's son, Corey Parker. Unfortunately it is the least interesting thing on the album, maybe because funk has never been much about words and entirely about making the ground shake at the mercy of the almighty groove. What you say isn't as important as what you do in the world of funk, and Maceo Parker has always known what to do. Thank God he's still doing it.\n\nDFF files extracted with Scarletbook\n    &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/10942620/Scarletbook-SACD-Extractor&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/10942620/Scarletbook-SACD-Extractor&lt;/a&gt;\n\nfrom the 2005 SACD.\n\nSACD-ISO-DFF-1Bit-2.8Mhz.","torrent":{"xt":"urn:btih:bd2b281197eeab3886b07e42cd748996e09d7a53","amp;dn":"Maceo+Parker+-+School%27s+In%21+%282005%29+SACD-DFF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd2b281197eeab3886b07e42cd748996e09d7a53","infoHashBuffer":{"type":"Buffer","data":[189,43,40,17,151,238,171,56,134,176,126,66,205,116,137,150,224,157,122,83]},"announce":[],"urlList":[]}}