{"title":"SDL Game Development (PDF)","uid":9012345,"size":4205135,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bd7d1f7cd8a63cdf1cfe9210513d909f587f242a&amp;dn=SDL+Game+Development+%28PDF%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dzadel67","files":-1,"time":1381126434,"description":"Review by Greg\n\n-------------------------------------------\n\nGood ideas, but lacks polish\n\nLet me preface this review by saying that I'm currently halfway through the Kindle edition of this book, and I'd like to give you my thoughts thus far. The book succeeds in teaching you the fundamental ideas of how to build a solid, reusable framework for a game written in C++ using SDL 2.0. \n\nHowever, the book's code is riddled with bugs! Granted, most of them are simple syntax errors that can be easily fixed if you have some experience programming in C++ and know your way around a debugger, but recently I ran into a pretty major bug in the &quot;Finite State Machine&quot; chapter where, the way it's currently implemented, the program tries to access heap memory that has already been freed. I haven't yet found a simple fix for this, and I'm in the process of redesigning the way the FSM is implemented. \n\nIn other words, if you simply copy + paste most of the book's code into your editor and compile it, it will not run! I also have a couple other minor gripes. His explanations of C++ concepts are pretty worthless; for example, he explains what the &quot;::&quot; scope resolution operator is about a quarter of the way into the book after using it in his code countless times up until that point. Also, the formatting in the Kindle edition is a bit wonky, but that's to be expected.\n\nIn summary, the book provides a good foundation for writing games with SDL, but the implementation of that foundation isn't quite there. HEED THE BOOK'S WARNING that it is NOT a beginner's guide to C++! BE FAMILIAR with data structures, polymorphism, inheritance, function overloading, pointers, callback functions, and debugging! \n\nI bought the book because SDL 2.0 is still relatively new and there aren't that many complete online tutorials available yet. If you have the patience, it might be better to wait for people such as Lazy Foo to finish their online SDL 2.0 tutorials. Otherwise, be prepared to sift through the bugs! \n\n===========================================\n\nReview by Sean Welgemoed\n\n-------------------------------------------\n\nSDL 2.0 book\n\nI'm currently half-way through the book, it's really brilliant for someone who's learnt at least all of the basic -&gt; intermediate fundamentals of C++ (up to an advanced level of classes).\n\nHowever, throughout the book you'll find some mistakes and things can get pretty complex pretty quickly (especially at the game objects section, you need to know classes up until polymorphism). I'd recommend going through the book twice if you need a full understanding of how to create a pretty basic engine in SDL2.\n\nThe mistakes can become a little bit annoying and can slow down progress very quickly though. The very first mistake is inside a singleton for the texture handler, they neglected to show that you needed a private variable: static textureManager *s_pInstance; -you could have puzzled this out by the name as I did when I got to the section (s: static, p: pointer, and it's quite obvious it had to be a textureManager type as it would hold itself as an object).\n\nOtherwise this book is brilliant and does as advertised, it has a good teaching method and you'll be up and running with SDL2 in no time.\n\n===========================================\n\nUploaded Anomyously.","torrent":{"xt":"urn:btih:bd7d1f7cd8a63cdf1cfe9210513d909f587f242a","amp;dn":"SDL+Game+Development+%28PDF%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd7d1f7cd8a63cdf1cfe9210513d909f587f242a","infoHashBuffer":{"type":"Buffer","data":[189,125,31,124,216,166,60,223,28,254,146,16,81,61,144,159,88,127,36,42]},"announce":[],"urlList":[]}}