{"title":"Iced Earth - Night Of The Stormrider[Power/thrash metal]","uid":3378814,"size":110140935,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:bf22013ed7d646b3ebf4276744f9b924a601a01c&amp;dn=Iced+Earth+-+Night+Of+The+Stormrider%5BPower%2Fthrash+metal%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"metalmania","files":14,"time":1125805624,"description":"[img]http://www.metal-observer.com/covers/cov1452.jpg[/img]\n\nTracklist\n\n01. Angel's Holocaust\n02. Stormrider\n03. The Path I Choose\n04. Before the Vision\n05. Mystical End\n06. Desert Rain\n07. Pure Evil\n08. Reaching the End\n09. Travel In Stygian\n\nMP3 @ 320Kbps\n\nLineup:\nJohn Greely - Vocals\nRandall Shawver - Lead Guitar\nJon Schaffer - Rhythm Guitar, Vocals\nDave Abell - Bass\nRichey Secchiari - Drums\n\n[quote]Wwoooooowwwww!!!! The beginning is an absolute classic by now! An excerpt of Orff's &quot;Carmina Burana&quot; in a bombastic Metal-armour, great! I know, this piece is one of the most-covered in music-history, but still, this version rules!\n\nThe second album of the iced earth starts out on a soaring high, with new vocalist and new drummer, which has done the band only good, because John Greely easily shadows his predecessor Gene Adam, more power, more melody, just better...\n\nThe track, which follows the bombastic intro is called &quot;Angels Holocaust&quot; and to date is one of the absolute classics of the band and a fix-point in every live-show. A very varied cracker, which alternates between acoustic and really heavy and using some elements of &quot;Carmina Burana&quot; throughout its length, when an album starts like this, then it can only get great, can't it?\n\nAnd they are continuing just as furious, with &quot;Stormrider&quot;, sung by Jon Schaffer himself, straighter than the opener, starting out acoustic and very calm, then turning into a mid-paced, straight track, just like the opener still a must at each gig. After the calm and short interlude &quot;Before The Vision&quot; John Greely clearly shows on &quot;Mystical End&quot; how far superior he is to Gene Adam, then the great guitars, very good song!\n\nThat &quot;Desert Rain&quot; has, for ICED EARTH, a very catchy refrain at first seems to be a little strange, but builds a wanted, good contrast to the straight rest of the song, while the closing &quot;Travel In Stygian&quot; with its more than nine minutes comes over very varied again, double-bass-driven passages are interspersed with calm parts, in which John Greely once more shows off his great voice, only the keyboards in the chorus do not really fit, but still a really great song!\n\nOverall ICED EARTH further refined their sound, especially the guitars have turned into a real trademark with this album (no matter what Wes or Math might try to suggest ;), also the structure of the songs with its calmer part puts the slightly thrashy Power Metal of the Americans apart from the pack.\n\nAll in all another great album of the Americans, which should not disappoint any fan of heavy Power Metal. [/quote]\n\n[color=orange][b][size=14]Enjoy &amp; Seed[/size][/b][/color]","torrent":{"xt":"urn:btih:bf22013ed7d646b3ebf4276744f9b924a601a01c","amp;dn":"Iced+Earth+-+Night+Of+The+Stormrider%5BPower%2Fthrash+metal%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf22013ed7d646b3ebf4276744f9b924a601a01c","infoHashBuffer":{"type":"Buffer","data":[191,34,1,62,215,214,70,179,235,244,39,103,68,249,185,36,166,1,160,28]},"announce":[],"urlList":[]}}