{"title":"Chico Buarque e Edu Lobo - Album de Teatro [1997]","uid":7039370,"size":124814129,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:bf9d8cd771d32c6fa07f195b9833e06ee0281744&amp;dn=Chico+Buarque+e+Edu+Lobo+-+Album+de+Teatro+%5B1997%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":17,"time":1329486743,"description":"Esse disco ÃƒÂ© um projeto de Edu Lobo, que assina a direÃƒÂ§ÃƒÂ£o musical. ReÃƒÂºne o que a dupla considera o melhor de sua produÃƒÂ§ÃƒÂ£o para o teatro, a saber, os espetÃƒÂ¡culos O Grande Circo MÃƒÂ­stico, de 1982, O CorsÃƒÂ¡rio do Rei, de 1985, e DanÃƒÂ§a da Meia-Lua, de 1988. Algumas gravaÃƒÂ§ÃƒÂµes originais foram mantidas - como a impecÃƒÂ¡vel de Meia-Noite, com Djavan, da trilha do CorsÃƒÂ¡rio, ou o mais belo (e nostÃƒÂ¡lgico) hino ÃƒÂ  vida de artista que ÃƒÂ© Na Carreira, peÃƒÂ§a de encerramento de O Grande Circo MÃƒÂ­stico, interpretada pelos autores.\nMas Edu queria visÃƒÂµes novas de algumas canÃƒÂ§ÃƒÂµes. Escalou, por exemplo, Leila Pinheiro para lanÃƒÂ§ar outras cores sobre A Historia de Lily Braun, que, no Circo MÃƒÂ­stico, era cantada por Gal Costa. E deu tiro arriscado ao transferir de Tim Maia (no original do Circo) para Ney Matogrosso a visÃƒÂ£o de A Bela e a Fera. Trata-se da histÃƒÂ³ria do homem que &quot;dÃƒÂ¡ nÃƒÂ³ em paralela e almoÃƒÂ§a rolimÃƒÂ£&quot;, tem &quot;tÃƒÂ³rax de Superman e coraÃƒÂ§ÃƒÂ£o de poeta&quot;. O vozeirÃƒÂ£o (e o comportamento, na vida e nos palcos, se houve diferenÃƒÂ§a entre ponto e ponto) de Tim Maia, seu porte, deixavam evidente a contradiÃƒÂ§ÃƒÂ£o do personagem - como nos desenhos animados, o bicho mais bravo de todos que se comove com o passarinho que cai do galho. Na voz aguda e equilibrada de Ney Matogrosso, a forÃƒÂ§a e as fraquezas sÃƒÂ£o de outra natureza, que cabe ao ouvinte buscar entender.\nNana Caymmi cantava originalmente o Bancarrota Blues, de O CorsÃƒÂ¡rio do Rei; Edu passou a missÃƒÂ£o para Ed Motta, e a Valsa Brasileira, que Edu cantava na trilha original da DanÃƒÂ§a da Meia-Lua, voltou na voz de Chico Buarque, nessa preciosa compilaÃƒÂ§ÃƒÂ£o.\nNaturalmente, nÃƒÂ£o se mexeu na versÃƒÂ£o de Beatriz. A gravaÃƒÂ§ÃƒÂ£o de Milton Nascimento ÃƒÂ© mais que perfeita. Para a finalidade explÃƒÂ­cita, a de colecionar o melhor da mÃƒÂºsica feita para cena, nÃƒÂ£o poderia haver interpretaÃƒÂ§ÃƒÂ£o melhor.\nAliÃƒÂ¡s, cumpre lembrar que Beatriz, talvez o maior sucesso da dupla Edu e Chico, certamente seu clÃƒÂ¡ssico definitivo, nunca tocou no rÃƒÂ¡dio. Mas as platÃƒÂ©ias sempre sabem a letra e conhecem as sutilezas da canÃƒÂ§ÃƒÂ£o, sem refrÃƒÂ£o, sem apelos. Sua popularidade e perenidade ÃƒÂ© mistÃƒÂ©rio para os autores.\n\nLista das MÃƒÂºsicas: \n1- Na carreira (Edu Lobo - Chico Buarque) Edu Lobo Chico Buarque 1982\n2- A histÃƒÂ³ria de Lily Braun(Leila Pinheiro) Edu Lobo Chico Buarque 1982\n3- Na ilha de Lia, no barco de Rosa (Edu Lobo) Meio-dia meia-lua Edu Lobo - Chico Buarque 1989\n4- Beatriz (Milton Nascimento) Edu Lobo Chico Buarque 1982\n5- O circo mÃƒÂ­stico (Zizi Possi) Edu Lobo Chico Buarque 1982\n6- Sobre todas as coisas (Gilberto Gil) Edu Lobo Chico Buarque 1982\n7- A mulher de cada porto (Chico Buarque - Gal Costa) Edu Lobo Chico Buarque 1985\n8- Meia-noite (Djavan) Edu Lobo Chico Buarque 1985\n9- A bela e a fera (Ney Matogrosso) Edu Lobo Chico Buarque 1982\n10- A permuta dos santos (Garganta Profunda) Edu Lobo Chico Buarque 1987-1988\n11- Bancarrota blues (Ed Mota) Edu Lobo Chico Buarque 1985\n12- Valsa brasileira (Chico Buarque) Edu Lobo Chico Buarque 1987-1988\n13- Acalanto (Ivan Lins) Edu Lobo Chico Buarque 1985\n14- TororÃƒÂ³ (Danilo Caymmi) Edu Lobo Chico Buarque 1987-1988\n15- Choro bandido (Edu Lobo) Edu Lobo Chico Buarque 1985\n16- Salmo (ZÃƒÂ© Renato - ClÃƒÂ¡udio Nucci) Edu Lobo Chico Buarque 1985\n17- Oremus (Instrumental) Edu Lobo","torrent":{"xt":"urn:btih:bf9d8cd771d32c6fa07f195b9833e06ee0281744","amp;dn":"Chico+Buarque+e+Edu+Lobo+-+Album+de+Teatro+%5B1997%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf9d8cd771d32c6fa07f195b9833e06ee0281744","infoHashBuffer":{"type":"Buffer","data":[191,157,140,215,113,211,44,111,160,127,25,91,152,51,224,110,224,40,23,68]},"announce":[],"urlList":[]}}