{"title":"The IMS: IP Multimedia Concepts and Services 3rd","uid":5149574,"size":8469716,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bfd05d3d85ecb7abcaf77f2b70d44340521b0d14&amp;dn=The+IMS%3A+IP+Multimedia+Concepts+and+Services+3rd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"VasiaZozulia","files":-1,"time":1257474174,"description":"The 3rd edition of this highly successful text builds on the achievement of the first two editions to provide comprehensive coverage of IMS. It continues to explore the concepts, architecture, protocols and functionalities of IMS while providing a wealth of new and updated information. It is written in a manner that allows readers to choose the level of knowledge and understanding they need to gain about the IMS.\n\nWith 35% new material, The IMS,IP Multimedia Concepts and Services, 3rd Edition has been completely revised to include updated chapters as well as totally new chapters on IMS multimedia telephony and IMS voice call continuity. Additional new material includes IMS transit, IMS local numbering, emergency sessions, identification of communication services in IMS, new authentication model for fixed access, NAT traversal and globally routable user agents URI. Detailed descriptions of protocol behaviour are provided on a level that can be used for implementation and testing.\n\nKey features of the 3rd edition:\n\n* Two new chapters on IMS multimedia telephony service and IMS Voice Call Continuity\n* Updated information on Third Generation Partnership Project (3GPP) Release 7 level, including architecture, reference points and concepts\n* Substantially extended coverage on IMS detailed procedures\n* Completely rewritten and extended chapters on IMS services ","torrent":{"xt":"urn:btih:bfd05d3d85ecb7abcaf77f2b70d44340521b0d14","amp;dn":"The+IMS%3A+IP+Multimedia+Concepts+and+Services+3rd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bfd05d3d85ecb7abcaf77f2b70d44340521b0d14","infoHashBuffer":{"type":"Buffer","data":[191,208,93,61,133,236,183,171,202,247,127,43,112,212,67,64,82,27,13,20]},"announce":[],"urlList":[]}}