{"title":"Prototype 2 Proper Crack Only-SKIDROW","uid":7488133,"size":17822320,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c05b91f9eb51f58355434f83103f187b18ca0eda&amp;dn=Prototype+2+Proper+Crack+Only-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"HeroMaster","files":-1,"time":1343654194,"description":"S  K  I  D  R  O  W\nthe leading force\n\nproudly presents\nPrototype 2 - Proper (c) Activision\n\n30-07-2012....Release Date &lt;-&gt; Protection.............Steam + CEG\nAction...........Game Type &lt;-&gt; Disk(s)......................2 DVD\n\nPROPER NOTES\n\nThe guys from Fairlight have recently started to do some Steamworks CEG\nreleases, and while it's abosolutly fantastic to see them compete with\nthe rest of us, their method simply dosen't justify the effort they\nput into this.\n\nThere are several reasons, but here are the two most interesting ones:\n\n1. CEG Routines are not resolved, instead a part of ceg is emulated to\ncalculate the right values, respect for the research on this, but\ncan lead to false results and slows runtime down.\n\n2. CEG and CRC is still active, can`t run under debugger neither using\na &quot;Trainer&quot;\n\nWhile the second option isn't a reason to proper, it's not living up\nto the scene rules.\n\nSo now we have decided to proper Fairlight's Prototype 2 release,\nbecause our crack is fully reversed and CEG free. Which gives the end\nuser a more stable crack, with less crashes, startup problems gone,\nfast loading, better framerates etc. are some of the problems that our\nfully reversed crack prevents.\n\nWe encourage Fairlight's crackers to run our proper under debugger and\nset breakpoints on these examples offset's, to see how different kinds\nof ways CEG get resolved.\n\n10569E10, 10569D70, 1055CF40, 103036F0 and 1010E960\n\nThere are of course more, but this will give insight into, why your\nway of killing the CEG checks with mov,al 1 - just isn't optional for\nall users, because the CEG does not always gets calculated the same on\neach machine.\n\nIf you still don't get what we mean, then contact us, and we'll help\nyou.\n\nWhat's even more sad, is that Fairlight got the knowledge to properly\nreverse the protection and in the end it's actually not that hard to\ndo. So why not do it the quality, tradition and pride way?\n\nRELEASE NOTES\n\nWelcome to New York Zero.\n\nThe sequel to Radical Entertainment's best-selling open-world action\ngame of 2009, Prototype 2 takes the unsurpassed carnage of the original\nPrototype and continues the experience of becoming the ultimate\nshape-shifting weapon. You are Sgt James Heller, husband to a deceased\nwife and child and a soldier left simply to die.\n\nAs the game's all-new infected protagonist, players will experience Sgt\nJames Heller cutting a bloody swathe through the wastelands of\npost-viral New York Zero. Equipped with unparalleled new shapeshifting\npowers,players will gradually build a vast genetic arsenal of deadly\nnew biological weapons and abilities as they hunt, kill and consume\ntheir way toward the ultimate goal - to kill Alex Mercer!\n\nAre you ready to murder your maker?\n\nINSTALL NOTES\n\n1. Unpack the release\n2. Mount or burn image\n3. Install\n4. Copy everything from the SKIDROW folder on DVD 2 into the game\ninstallation\n5. Play the game\n6. Support the companies, which software you actually enjoy!\n\nADDITIONAL NOTES\n\nWe have included externally a sr-p2crack.rar file containg the proper\ncrack, with the rar files for DVD2, for those that has the Fairlight\nrelease installed already and don't want to download whole game again.\n\nGREETINGS\n\nTo all friends of the family and honorable rival groups!\n\nascii art by the\ngodlike &amp; terrific duo\nmalodix + irokos\ntitan artdivision\n\n\nENJOY!","torrent":{"xt":"urn:btih:c05b91f9eb51f58355434f83103f187b18ca0eda","amp;dn":"Prototype+2+Proper+Crack+Only-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c05b91f9eb51f58355434f83103f187b18ca0eda","infoHashBuffer":{"type":"Buffer","data":[192,91,145,249,235,81,245,131,85,67,79,131,16,63,24,123,24,202,14,218]},"announce":[],"urlList":[]}}