{"title":"The Roman Army: The Civil Wars 88-31 BC","uid":11376770,"size":37785811,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c097be745c0368ec4c353662957df9cbe62becd7&amp;dn=The+Roman+Army%3A+The+Civil+Wars+88-31+BC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"HowdyDooDoo","files":-1,"time":1415156884,"description":"The Roman Legions were the most highly organized troops of the ancient world, but the process of turning the Legions from what was essentially a part-time citizen militia into the professional force that first made Rome the dominant power in the Mediterranean and then built an empire that stretched across the known world, was no small feat.\n\nFocusing on the organizational changes in the Roman Army during the Civil Wars, Nic Fields examines the role played by Caius Marius and his far-reaching reforms, which included having professional volunteers from the lowest social class enter the army in search of the possibility of plunder. He goes on to examine the consequences of encouraging these soldiers to follow their commanders without question, which broke the allegiance of the army to the Roman state, a trend that gave rise to militarily ambitious men such as Sulla, Pompeius, Caesar, Antonius, and Octavian.\n\nWith the nuts and bolts detail that readers demand from the Battle Orders series, this is an intriguing description of how the Roman army grew, modernized, rebelled and finally helped build an empire, complete with full organizational charts, photographs and detailed maps","torrent":{"xt":"urn:btih:c097be745c0368ec4c353662957df9cbe62becd7","amp;dn":"The+Roman+Army%3A+The+Civil+Wars+88-31+BC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c097be745c0368ec4c353662957df9cbe62becd7","infoHashBuffer":{"type":"Buffer","data":[192,151,190,116,92,3,104,236,76,53,54,98,149,125,249,203,230,43,236,215]},"announce":[],"urlList":[]}}