{"title":"Pocket Dictionary of Food Safety (2011) - (Malestrom)","uid":6366834,"size":1518404,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c1214c6921fad29626e425d744be45cf8048ebce&amp;dn=Pocket+Dictionary+of+Food+Safety+%282011%29+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"malestrom_HH","files":-1,"time":1304538699,"description":"Jeffrey T. Solate, &quot;Pocket Dictionary of Food Safety&quot;\nCRC Press | 2010 | ISBN: 1439842035 | 160 pages | PDF \n\nWith tentacles that reach into several biological and medical sciences, including epidemiology, infectious diseases, community medicine, and public health, food science has become a truly interdisciplinary discipline. To compete successfully in this field, you must have a basic understanding of these related areas. Practical, portable, and easy to use, Pocket Dictionary of Food Safety provides a collection of terms and definitions as well as an extensive list of biological organisms.\n\nThe book delivers a comprehensive list of definitions that are commonly used in the food industry and in the testing of food products as well as in food service facilities and restaurants. Classifying and organizing food safety terms from various sources into alphabetical listings, the dictionary covers:\nFood microbiology\nFood chemistry\nFood quality assurance\nFood borne incidents\nFood regulations\nStandards\nEquipment\n\nAlthough the author draws information from numerous disciplines, the book keeps its focus tightly on food safety, making it an excellent resource for students, educators, and anyone involved in the growing, handling, preparation, packaging, or serving of any food product as well as for anyone in biochemistry or biology educational programs inside and beyond the food industry. It makes an ideal companion to other technical and industry materials. ","torrent":{"xt":"urn:btih:c1214c6921fad29626e425d744be45cf8048ebce","amp;dn":"Pocket+Dictionary+of+Food+Safety+%282011%29+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1214c6921fad29626e425d744be45cf8048ebce","infoHashBuffer":{"type":"Buffer","data":[193,33,76,105,33,250,210,150,38,228,37,215,68,190,69,207,128,72,235,206]},"announce":[],"urlList":[]}}