{"title":"Kierkegaard's Writings, XI: Stages on Life's Way","uid":9041013,"size":17932253,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c149ef4819adf914659ecb2559e6bb6aa8eb826f&amp;dn=Kierkegaard%27s+Writings%2C+XI%3A+Stages+on+Life%27s+Way&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"livhre","files":-1,"time":1381619510,"description":"Stages on Life's Way, the sequel to Either/Or, is an intensely poetic example of Kierkegaard's vision of the three stages, or spheres, of existence: the esthetic, the ethical, and the religious. With characteristic love for mystification, he presents the work as a bundle of documents fallen by chance into the hands of &quot;Hilarius Bookbinder,&quot; who prepared them for printing. The book begins with a banquet scene patterned on Plato's Symposium. (George Brandes maintained that &quot;one must recognize with amazement that it holds its own in this comparison.&quot;) Next is a discourse by &quot;Judge William&quot; in praise of marriage &quot;in answer to objections.&quot; The remainder of the volume, almost two-thirds of the whole, is the diary of a young man, discovered by &quot;Frater Taciturnus,&quot; who was deeply in love but felt compelled to break his engagement. The work closes with a letter to the reader from Taciturnus on the three &quot;existence-spheres&quot; represented by the three parts of the book.\n\nStages on Life's Way not only repeats themes, characters, and pseudonymous authors of the earlier works but also goes beyond them and points to further development of central ideas in Concluding Unscientific Postscript","torrent":{"xt":"urn:btih:c149ef4819adf914659ecb2559e6bb6aa8eb826f","amp;dn":"Kierkegaard%27s+Writings%2C+XI%3A+Stages+on+Life%27s+Way","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c149ef4819adf914659ecb2559e6bb6aa8eb826f","infoHashBuffer":{"type":"Buffer","data":[193,73,239,72,25,173,249,20,101,158,203,37,89,230,187,106,168,235,130,111]},"announce":[],"urlList":[]}}