{"title":"Green Lantern - Blackest Night Crossover","uid":5515400,"size":2745151268,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:c15b0005c187c1d9262511b23ff5af507df36322&amp;dn=Green+Lantern+-+Blackest+Night+Crossover&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ParrowJack","files":-1,"time":1272229613,"description":"Blackest Night is a comic book limited series that formed the basis of a crossover event between several DC Comics publications. \n\nBlackest Night involves a personified force of death resurrecting deceased superheroes and seeking to eliminate all life and emotion from the universe.  The crossover was published for eight months via a limited series, as well as in both the current Green Lantern and Green Lantern Corps titles. Various other limited series and tie-ins were published.\n\nThe storyline was first mentioned at the conclusion of the &quot;Sinestro Corps War&quot; in Green Lantern v4 #25. As the war between the Green Lantern and Sinestro Corps reaches its climax, the Green Lanterns of Earth are told by the Guardians Ganthet and Sayd of the &quot;Blackest Night&quot; prophecy.  According to the prophecy, the two existing Corps would be joined by five new ones, each driven by a specific emotion and empowered by a specific color of the emotional spectrum, leading to a &quot;War of Light&quot; that would subsequently destroy the universe. \n\nThe main series is written by Geoff Johns and penciled by Ivan Reis.\n\n\nI have started this story-arc from Final Crisis: Rage of the Red Lanterns and Green Lantern v4 #36 as this introduces the various corps that are integral to the Blackest Night storyline.\n\nI have organized the cross-over in specific story-arcs as this is how I like to read them, I don't like chopping and changing and coming back to a previous character or situation.  If you prefer reading your crossover events in the more traditional way I have included an alternative reading order.\n\n\nTracked by &lt;a href=&quot; http://comicpirates.info&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://comicpirates.info&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:c15b0005c187c1d9262511b23ff5af507df36322","amp;dn":"Green+Lantern+-+Blackest+Night+Crossover","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c15b0005c187c1d9262511b23ff5af507df36322","infoHashBuffer":{"type":"Buffer","data":[193,91,0,5,193,135,193,217,38,37,17,178,63,245,175,80,125,243,99,34]},"announce":[],"urlList":[]}}