{"title":"One Third of the Holocaust - wma 4 hours","uid":4726131,"size":878878695,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:c2b5f8faae5335034e2982d60b3917e1cb8dacae&amp;dn=One+Third+of+the+Holocaust+-+wma+4+hours&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"CuriousGeorge","files":1,"time":1234765090,"description":"*Over 4 hours of 30 episodes in one convenient video file\n*One of the most scientific analyses of the official Holocaust claims\n\nExplains how Treblinka, Sobibor, and Belzec were not death camps, thereby debunking 1/3 of the holocaust. Asks questions like, &quot;Would the Germans have really put a fence made out of tree branches around a deathcamp?&quot; Banned at Youtube. 30 episodes. 4 hours 15 min. Click the above image to view.\n\nEpisode 1: Introduction\nThe death camps Treblinka, Sobibor, and Belzec made up nearly 1/3 of the holocaust. Episode 1 explains what they were.\n\nEpisode 2: Water Well\nOn the map we see a water well surrounded by burial pits. The water well would have been contaminated. The storytellers didn't think of that.\n\nEpisode 3: Haircut\nIf you're going to get off a train, and get gassed within the hour, and then thrown into a pit; what is the point of a haircut? Yet that's part of the story.\n\nEpisode 4: Engine Exhaust\nEngine exhaust seems like the best way to make carbon monoxide gas, if you're not a chemist, that is.\n\nEpisode 5: Nuremberg\nWasn't the holocaust completely documented at Nuremberg? Yes it was. If you consider 20 minutes of courtroom time a thorough documentation of 1.5 million deaths.\n\nEpisode 6: Gassing Building\nWe look at a model of the gassing building that supposedly killed nearly the population equivalent to San Francisco, and find it odd that the building entrance didn't even have a set of double doors.\n\nEpisode 7: Abraham Bomba\nThe featured witness for Treblinka at the US Holocaust Memorial Museum says something very odd: that the Germans disguised the gas chambers as a kind of hair salon, complete with professional barbers. As he says: &quot;...make to believe that they're getting a nice haircut.&quot;\n\nEpisode 8: Eliyahu Rosenberg\nA Treblinka witness at the Eichmann trial in 1961 makes some mistakes on the witness stand.\n\nEpisode 9: Reader's Digest\nAn article in February 1943 first brought the holocaust story to mainstream America. The article also mentioned six million--an uncanny number to throw out since the supposed fact hadn't happened yet.\n\nEpisode 10: Experiments\nRidiculous experiments the Germans wouldn't have done. One of the most prestigious holocaust scholars writes: &quot;Incendiary bombs were tried, but these caused large fires in the surrounding woods.&quot; Uh, o.k.\n\nEpisode 11: Treblinka Burial Space\nWe use 3-D modeling to show that the burial space at Treblinka is too small. Way too small. The storytellers figured a few large pits would suffice for 700,000 bodies.\n\nEpisode 12: Belzec Burial Space\nIt's too small also, and we use the Rose Bowl Stadium during the Rose Bowl Game to show that. Watch episode 11 first or this chapter won't make sense.\n\nEpisode 13: Sobibor Burial Space\nLet's put it this way, you can't bury the equivalent to the stadium spectators of the Rose Bowl Game in two pits not much bigger than the chicken coop, and then sentence someone to life imprisonment based on &quot;the evidence.&quot; Something just isn't right.\n\nEpisode 14: Steven Spielberg's Shoah Foundation and Sobibor witness Alexander Pechersky.\nExcerpt: &quot;This young black man might be thinking that the slavery that happened to his ancestors is nothing compared to the holocaust. Except what happened to his ancestors really happened.&quot;\n\nEpisode 15: Rain, Wind, Fire, and Ice\nThere's some elements that the storytellers forgot about. Outdoor cremation fires in the middle of winter, for instance, might work better if they had a roof over them. You know, for when it rained and stuff.\n\nEpisode 16: Escape Tunnel\nAt Sobibor they tried to dig an escape tunnel. They could only dig down 5 feet because they said there was a danger of striking water past that. One problem the storytellers forgot about: the burial pits are described as 23 feet deep.\n\nEpisode 17: Belzec Chronicles\nA few Belzec-related stories weaved together. Most people would probably agree that barbed wire with tree branches propped into it is not a great example of good design for a security fence in a death camp. We comment on Josef Oberhauser and Rudolf Reder.\n\nEpisode 18: Physical Evidence part 1\nWhy we know more about a tsunami that hit in the year 1700 than what's underground at Treblinka. We also look at some excerpts from the movie &quot;Mr. Death.&quot;\n\nEpisode 19: Physical Evidence part 2\nAdmittedly, mixing holocaust denial with an episode of the 70's tv show Charlie's Angels seems odd, at first glance that is.\n\nEpisode 20: Soviets Arrive at Treblinka\nHolocaust historians copiously write about what the Soviets found when they took over Auschwitz, but strangely omit what the Soviets found when they took over Treblinka. Why is that? Also, when Professor Boder went to Europe after the war to document the holocaust, he was likely surprised at what people had to say.\n\nEpisode 21: Destoying Evidence: Treblinka Compared to Auschwitz\nAt Treblinka they supposedly destroyed all traces that the camp ever existed. They even tore up the railroad tracks leading to the camp. But at Auschwitz they left 7 tons of human hair and 7,000 Jewish inmate eyewitnesses waiting to speak to the Soviets. Why is that?\n\nEpisode 22: A Doctor Testifies\nNo one informed Dr. Berman that the Germans purportedly left Treblinka without leaving a trace. Thus his story of the &quot;10's of thousands of little shoes of little children&quot; is problematic.\n\nEpisode 23: Lamb\nExcerpt: &quot;We're going to cremate a leg of lamb at the beach as a way to better understand the outdoor cremation process.&quot;\n\nEpisode 24: Bone Crushing\nIt looks like three flowers on a football field, but what it's showing is that it takes space to crush that many bones. And no space is given on the maps for bone crushing.\n\nEpisode 25: The Flameable Fence (the Germans wouldn't have had)\nThey burned a &quot;B as in Bruce&quot; quarter Billion pounds of wood in an area enclosed by a tree branch fence. Hmmm.\n\nTreblinka had two fences. This was the inner fence.\n\nEpisode 26: Treblinka's Outer Fence\nNo tanks are going to get into this camp! What with the anti-tank obstacles surrounding it. But does that make sense? Wouldn't the large gun mounted on the front of a tank make it unneccessary for the tank to need to enter the camp?\n\nEpisode 27: Confessing Germans part 1: Kurt Gerstein\nSS Officer Kurt Gerstein presented himself to his French captors as a very important eyewitness--one of a handful of people who had seen Belzec. Presenting himself as valuable was a strategy for staying alive.\n\nEpisode 28: Confessing Germans part 2: Adolf Eichmann, Franz Suchomel\nAdolf Eichmann purposely said the most ridiculous things in his 1961 trial. And the reporters at the New York Times amazingly believed him. It's amazing what people will believe when evil is in the equation.\n\nEpisode 29: Book: Treblinka by Alexander Donat\nIt's a book respected by holocaust historians. Nevermind that the author has a story to top his peers: that he and his wife survived 9 death camps. We also look at the following question: &quot;What happened to the Jews of Europe? Did they just disappear out of thin air?&quot; We look at it, and answer it.\n\nEpisode 30: Conclusion\nTeaching &quot;Tolerance&quot; is great.\n\nSuggestion: Use real examples.\n\nLike the American Indians. You don't need to use a lie-example, when there's plenty of real examples.\n\nWe conclude by looking at how the belief in the holocaust leads to unfair United States foreign policy in the Middle East, and from that, what Americans then spend their time reading about in the newspapers.\n\n----------------------------------------------------------------------------------\n\nMy public URL:\t &lt;a href=&quot;\nhttp://thepiratebay.se/user/TalmudTimmy&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/TalmudTimmy&lt;/a&gt;\n\nMy RSS feed:\t &lt;a href=&quot;\nhttp://rss.thepiratebay.se/user/97bdef327d0ba834f331abb3d0fe47a2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://rss.thepiratebay.se/user/97bdef327d0ba834f331abb3d0fe47a2&lt;/a&gt;","torrent":{"xt":"urn:btih:c2b5f8faae5335034e2982d60b3917e1cb8dacae","amp;dn":"One+Third+of+the+Holocaust+-+wma+4+hours","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2b5f8faae5335034e2982d60b3917e1cb8dacae","infoHashBuffer":{"type":"Buffer","data":[194,181,248,250,174,83,53,3,78,41,130,214,11,57,23,225,203,141,172,174]},"announce":[],"urlList":[]}}