{"title":"Bobby Darin - Born Walden Robert Cassotto (1968)","uid":9032548,"size":313489939,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c2f290370ae6ea45a432a8ef385e6923ff685f97&amp;dn=Bobby+Darin+-+Born+Walden+Robert+Cassotto+%281968%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"KeepPortlandWeird","files":-1,"time":1381454324,"description":"There will always be at least one seed for this.  Ignore TPB's seed count.\n\nFrom Allmusic.com:\n\nBobby Darin's Bobby Darin Born Walden Robert Cassotto was arguably his most personal project and his life's work. The album was completely written, arranged, and produced by Darin himself. In fact, the album jacket also asserts that Bobby Darin even designed the album art and took its pictures. The lyrics are printed on the inside jacket, which demonstrates how Darin was trying to express himself more with this album than any other, beginning with the title. Using it almost as a coming out, Darin sheds his stage persona and offers up himself as the true artist. In some ways, it could be claimed that this isn't a Bobby Darin album at all. Instead it is Robert Cassotto's debut (and only) record. The music is his most rock and is highly Beatlesque, and includes hints of psychedelia. The songwriting makes absolutely no attempt to be commercial, even by Darin's standards (which often led him to cover popular genres like folk or traditional ones like standards or Broadway). Instead, these tracks are marked with a personal voice that only occasionally appeared on previous Darin albums. &quot;Questions&quot; is a funky song inspired by soul and rock dealing with commercialism, identity, and urban ills. &quot;The Proper Gander&quot; even includes a Woody Guthrie homage (&quot;This Land Is Your Land&quot;) and musical hints of the Beatles (&quot;Drive My Car&quot; and &quot;Rocky Raccoon&quot;), both of whom were major influences. &quot;Change&quot; includes the most straightforward lyric Darin ever sung: &quot;music that used to sound hollow/Now seems to fit in your range.&quot; If Bobby Darin was an expert singer and interpreter, here he attempts to be the singer/songwriter. You can bet every executive who could have convinced Darin tried to dissuade him from including &quot;Bullfrog,&quot; but the song encapsulates how he loved telling a story through lyrics. The album ends with such a story. &quot;Memoriam&quot; is inspired by Robert Kennedy, whose life and death deeply touched Darin. Overall, the album is a reflection of the historical moment, for it was created in an environment of assassinations, LSD, civil rights, economic recession, and war. Darin was feeling heavy and these songs became his cathartic release. Bobby Darin Born Walden Robert Cassotto did not chart, making it perhaps his most commercially disappointing album. It was surprisingly critically acclaimed, however, meaning that his message of artistic truth did reach some people. (In fact, &quot;Long Line Rider&quot; reached number 79 on the singles charts.) The least-essential record to casual fans. But possibly the most important Darin record for those who wish to better understand the man's love for music and his quest for artistic truth. Put another way, if you are moved by knowing that Bobby Darin once retired from the Las Vegas scene, started going by Bob, and removed his hairpiece to sing folk-rock songs with genuine passion and integrity, then this album may be your favorite. Bobby Darin Born Walden Robert Cassotto was more than a one-time indulgence. Committment followed in 1969 and makes a nice companion to this album, both of which were released by Darin's own Direction label. The catalogue number for the record is Robert Cassotto's birth date, not an insignificant choice. An overlooked masterpiece painted in bold, personal strokes.","torrent":{"xt":"urn:btih:c2f290370ae6ea45a432a8ef385e6923ff685f97","amp;dn":"Bobby+Darin+-+Born+Walden+Robert+Cassotto+%281968%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2f290370ae6ea45a432a8ef385e6923ff685f97","infoHashBuffer":{"type":"Buffer","data":[194,242,144,55,10,230,234,69,164,50,168,239,56,94,105,35,255,104,95,151]},"announce":[],"urlList":[]}}