{"title":"The Four Steps to the Epiphany - Successful Strategies for Produ","uid":9361526,"size":44395467,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c32f6e895206db12df91a4353484d3631aa903ac&amp;dn=The+Four+Steps+to+the+Epiphany+-+Successful+Strategies+for+Produ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"aksljdf","files":1,"time":1387326089,"description":"The bestselling classic that launched 10,000 startups and new corporate ventures - The Four Steps to the Epiphany is one of the most influential and practical business books of all time. \nThe Four Steps to the Epiphany launched the Lean Startup approach to new ventures. It was the first book to offer that startups are not smaller versions of large companies and that new ventures are different than existing ones. Startups search for business models while existing companies execute them. \nThe book offers the practical and proven four-step Customer Development process for search and offers insight into what makes some startups successful and leaves others selling off their furniture. Rather than blindly execute a plan, The Four Steps helps uncover flaws in product and business plans and correct them before they become costly. Rapid iteration, customer feedback, testing your assumptions are all explained in this book. \nPacked with concrete examples of what to do, how to do it and when to do it, the book will leave you with new skills to organize sales, marketing and your business for success. \nIf your organization is starting a new venture, and you're thinking how to successfully organize sales, marketing and business development you need The Four Steps to the Epiphany. \nEssential reading for anyone starting something new.","torrent":{"xt":"urn:btih:c32f6e895206db12df91a4353484d3631aa903ac","amp;dn":"The+Four+Steps+to+the+Epiphany+-+Successful+Strategies+for+Produ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c32f6e895206db12df91a4353484d3631aa903ac","infoHashBuffer":{"type":"Buffer","data":[195,47,110,137,82,6,219,18,223,145,164,53,52,132,211,99,26,169,3,172]},"announce":[],"urlList":[]}}