{"title":"Will Hoge...The Wreckage(2009)[FLAC]","uid":6014338,"size":272984694,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c3db70806f1ea55bd0ea1dff111dd8f226457bcd&amp;dn=Will+Hoge...The+Wreckage%282009%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":16,"time":1291572667,"description":"Will Hoge - The Wreckage\nRecord Label: Rykodisc  RCD10990\nRelease Date: Sept. 29, 2009 \n\nThe music world got a scare in August of 2008 when much lauded Nashville songwriter Will Hoge was severely hurt in a motorcycle crash. The accident left Hoge with a bevy of broken bones (ribs, sternum, shattered femur, knee cap, shoulder blades), lacerations to his face, arms, and torso (requiring over 100 stitches), as well as other minor injuries. Since the crash, Hoge has underwent numerous surgical procedures and devoted hours of physical therapy in the hopes of getting back out on the road. Having given himself ample to heal and resume writing, he has returned with The Wreckage, his sixth studio release, and second on new home Rykodisc. Make no mistake, these eleven songs are most definitely his finest work to date, and continue to bolster the steadfast argument that there are few if any singer/songwriters writing better heartland rock than Will Hoge. \n\nFrom front to back, The Wreckage is a gorgeous assortment of Midwestern roots-rock, whiskey-soaked ballads, and frothy guitar-driven rockers. Co-produced again by former Wilco member Ken Coomer and Charlie Bracco, and mixed by living legend Jim Scott, The Wreckage has all the hallmarks of the quintessential Hoge sound, while also displaying hints of something new. Hoge's raspy vocals have anchored much of his decade-long career, often using his strong-lunged timbre to soulfully convey the highs and lows of romance, touring and the world around us. While they're still on display throughout The Wreckage, there's a good chunk of softness and restraint in his delivery and the difference is what makes this so indelible. After dabbling into political commentary on The America EP at the early part of this decade, his last two efforts have found him back into familiar territory, detailing love, loss, heartbreak and indefatigability. \n\nSticking with that formula, The Wreckage is without a doubt, his most honest and most sincere release yet. Though he's shifted his songwriting style ever so slightly year by year, the alterations seem to have merit, as The Wreckage has nary a fault or glitch. Album opener &quot;Harder to Love,&quot; is a near-perfect roots-rock charmer, replete with driving piano, bristling guitars and a comfortable confidence that is totally captivating. He displays his penchant for searing guitar-driven rock on the snappy &quot;Long Gone,&quot; which has much of the tenacity and swerve of his 1998 live album Live at the Exit In, while also displaying a firm nod to the blues that he showcased on 2006's The Man Who Killed Love. The album then hits its most comfortable stride and rattles off four straight knockouts. Title track, &quot;The Wreckage,&quot; is a sparse and airy meditation on romance that's backed by a brittle lap steel and tender vocals; whereas &quot;Favorite Waste of Time,&quot; is a radio accessible exercise in jangle-pop that rolls along like a Marshall Crenshaw b-side. \n\nLead single, &quot;Even If It Breaks Your Heart,&quot; follows and its a near-perfect four minutes in expertly executed roots-pop. Catchy, sublime and thoroughly intoxicating, the song is arguably one of the most honest singles released to radio this year and has all the trappings of an effort that will be reflected on for years to come. And yet, for all its charms, the real centerpiece of the disc is the leave-it-all-on-the-table ballad &quot;What Could I Do,&quot; that bleeds with desperation, helplessness and some of the most desirous vocals of his career. Not one to let a filler track ruin his vision, Hoge pens a folksy, CSNY-ballad &quot;Goodnight/Goodbye,&quot; with enough forlorn sentiment and bittersweet ache to make every word out of his mouth sound utterly enchanting. He ups the ante on the Tom Petty-esque rockers &quot;Just Like Me,&quot; and &quot;Highway Wings,&quot; with the former being a mid-tempo ode to self-deprecation, while the latter is a tale of life on the road and the Tennesseean's innate sense of wanderlust. The Wreckage wraps up with &quot;Where We Do Go From Down,&quot; a cerebral meditation of a failed relationship which is extended on the gorgeous ballad, &quot;Too Late Too Soon.&quot; \n\nThe inherent genius of Hoge is that many of his songs are tour-de-forces that drip with authenticity and fervor. Since his inception, he has written passionate, gritty music that's ablaze with color and fueled by an innate verve that's explosive, cathartic and utterly vintage. Armed with strong melodies and a genuine candor, Hoge always puts forth discs that are never forced, faked or fictitious. His craft is raw, creative energy that is free-spirited, individualistic and firmly committed to excellence. Sure, there's a good chunk of Springsteen and Petty in what he sings, but there's also a deeper commitment to staying relative and current. Moreover, The Wreckage, much like all his other efforts, is free of studio gimmicks. There's no studio gloss, no auto-tune, no programming and no vocoder. Just songs played as they were meant to be played, with an unwavering determination from a natural born rocker. \n\nThis is big-hearted, hip-shaking rock n' roll that's unabashedly emotive, lyrically potent and truly intoxicating. Summing it up best is Hoge himself who says this about his career, &quot;I bust my ass every night, I load my own gear and mortgaged my house to pay the band. But if you want it, you have to be willing to bleed. In the end, I'm embarrassingly in love with rock and roll, it's all consuming.&quot; And in that spirit, so too is his music. Now six impeccable releases in, Hoge shows no signs of slowing down. And for that, the music world is utterly grateful. \n\nTrack Listing1. Hard to Love (3:24)\n2. Long Gone (2:51)\n3. The Wreckage (3:33)\n4. Favorite Waste of Time (3:11)\n5. Even If It Breaks Your Heart (3:43)\n6. What Could I Do (4:28)\n7. Goodnight/Goodbye (4:24)\n8. Just Like Me (3:28)\n9. Highway Wings (3:24)\n10. Where Do We Go From Down (3:45)\n11. Too Late Too Soon (4:01)\n\ncd ripped by dBpoweramp\n\nplease seed\n &lt;a href=&quot;\nhttp://dickthespic.org/2010/11/20/will-hoge/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/2010/11/20/will-hoge/&lt;/a&gt;","torrent":{"xt":"urn:btih:c3db70806f1ea55bd0ea1dff111dd8f226457bcd","amp;dn":"Will+Hoge...The+Wreckage%282009%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3db70806f1ea55bd0ea1dff111dd8f226457bcd","infoHashBuffer":{"type":"Buffer","data":[195,219,112,128,111,30,165,91,208,234,29,255,17,29,216,242,38,69,123,205]},"announce":[],"urlList":[]}}