{"title":"The World According to Garp Dvdrip H264 Bookerdog.mp4","uid":4985703,"size":988182019,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c490ddfb94b5c910faa41224b294c75dd02b0662&amp;dn=The+World+According+to+Garp+Dvdrip+H264+Bookerdog.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"bookerdog","files":-1,"time":1246667234,"description":"Category\tDramas, Comedies, Recommended, Based On A Novel, History, Period Piece, Social Issues, Character Study\nStarring\tRobin Williams, Mary Beth Hurt, John Lithgow, Amanda Plummer, Glenn Close, Jessica Tandy, Hume Cronyn, Swoosie Kurtz\nDirector\tGeorge Roy Hill\n136 minute feature film DVD starring Robin Williams. A wistful writer wrestles with tumultuous times.\nConceived in a hospital room by the independent, strong-willed Jenny Fields (who makes sure to choose a father who can never interfere with her decisions), T.S. Garp grows up in the placid academic atmosphere of the exclusive New England boy's school where Jenny works. As Garp becomes a man, the film shifts between the events that shape his world and those that shape his mother's. While Garp follows a &quot;normal&quot; path--marrying, becoming a father, and establishing himself as an author and teacher--Jenny continues to make extraordinary decisions and allies herself with a very strange group of characters. And through it all, Jenny remains a powerful, inescapable influence on her son.","torrent":{"xt":"urn:btih:c490ddfb94b5c910faa41224b294c75dd02b0662","amp;dn":"The+World+According+to+Garp+Dvdrip+H264+Bookerdog.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c490ddfb94b5c910faa41224b294c75dd02b0662","infoHashBuffer":{"type":"Buffer","data":[196,144,221,251,148,181,201,16,250,164,18,36,178,148,199,93,208,43,6,98]},"announce":[],"urlList":[]}}