{"title":"DVDA Residue - Music from Trey Parker and Matt Stone","uid":3463304,"size":73221361,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c493cfc7e4197727918528a99e7948439e8afb98&amp;dn=DVDA+Residue+-+Music+from+Trey+Parker+and+Matt+Stone&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"slurpee","files":28,"time":1143567968,"description":"Do you think Trey Parker and Matt Stone are talented guys?\nDo you fantasize about being friends with Matt and Trey?\nDo you think &quot;MnT are totally fuckin' tight&quot; and that they would &quot;totally \nkick it&quot; with you?\nAre you secretly in love with Matt and Trey?\nDo Matt's sweet ass and Trey's pouty lips somehow call to you?\nWould you fill your DVDA spots 2 and 4 with Matt and Trey?\n(They would actually want spots 3 and 4.  Together.)\n\nIf you have no fucking clue what this is all about, DVDA is a band\nwhose members include Matt Stone and Trey Parker.  If you're still\nclueless, Trey Parker and Matt Stone are responsible for South Park. \nPlease, please tell me you've at least heard of South Park.  If you\nhaven't, put this down, back away, pick up some nice Dan Fogelberg.\n\nFor the uninitiated fans, I'll just lay it out for you:  DVDA means\ndouble-vaginal double-anal.  Yes, that means penetration.  Yes, it's a\ndirty, dirty thing and you should just go wash your hands right now\njust to be safe.  But, dude, DV is impressive, and DA is impressive...\n DVDA is amazing.  The band isn't far off from that - amazing, and\nplugging every good hole you have on your sorry body.  DVDA is a\nmotherfuckin' rock band.\n\nI made this because Trey Parker and Matt Stone have produced some\ngreat tracks as a few official releases here and there and as a few\nlive performances.  The recurring theme is &quot;a few,&quot; as DVDA isn't a\nvery active public band, so what better way to pull them together than\nan overproduced fan compilation?  Most of these songs were written by\nTrey Parker, including the songs that are not officially credited to\nDVDA but are written and performed by Trey and other DVDA members (and\ndefinitely in the style of DVDA).  These include tracks from Orgazmo,\nTeam America: World Police, BASEketball, and, of course, South Park.\n\nMuch care and late-night haze has gone in to producing this\ncompilation, especially the equalization and compression of &quot;Sgt.\nBaker&quot; and the live tracks.  For the record, Acrid and I loved every\none of the probably fifty times we listened to &quot;Sgt. Baker&quot; while\nmixing.  Yes sir, yesss, siirrr!  If you enjoy this comp, share it\nwith friends or just those within earshot of a very loud stereo.  Matt\nand Trey and Bruce and the rest of DVDA love to play music, and they\nkick ass at it - play it loud.\n\nDVDA Residue is a FTS release:  Fuck The Scene!  Fuck yeah!\n\n- slurpee\n\n\nSteve fucking Perry, get to the track list already:\n\n[*** DVDA Residue ***]\n\n\t1. Now You're A Man\n\n\t2. America, Fuck Yeah\n\t\tFrom &quot;Team America: World Police&quot;\n\n\t3. Sgt. Baker\n\t\tPrimus cover, from &quot;Sailing the Seas of Cheese&quot;\n\n\t4. Timmy\n\t\tTimmy and the Lords of the Underworld\n\n\t5. What Would Brian Boitano Do? Pt. II\n\n\t6. Warts on Your Dick\n\t\tFrom &quot;BASEketball&quot;\n\n\t7. Living A Lie\n\t\tTimmy and the Lords of the Underworld\n\n\t8. Montage\n\t\tFrom &quot;Team America: World Police&quot;\n\n\t9. Only A Woman\n\t\tFrom &quot;Team America: World Police&quot;\n\n\t10. America, Fuck Yeah (Bummer Remix)\n\t\tFrom &quot;Team America: World Police&quot;\n\n\t11. Hell Isn't Good  (Featuring James Hetfield)\n\n\t12. Hot Lava  (Featuring Perry Farrell)\n\n\t* DVDA Live:  Opening for WEEN 6.30.00\n\t13. Crack\n\t14. David Kelley, TV Warrior\n\t15. Now You're A Man\n\t16. I Am Chewbacca\n\t17. Sgt. Baker\n\t18. What Would Brian Boitano Do?\n\n192k MP3s plus high- and low-res cover art - you love me, I know.\n\nThis album contains mostly unreleased tracks downloaded from the amazing \ncollection at spschat.com, they are primarily to thank!  This collection was \ninspired by their superfandom, check them out for lyrics &amp; more.\n","torrent":{"xt":"urn:btih:c493cfc7e4197727918528a99e7948439e8afb98","amp;dn":"DVDA+Residue+-+Music+from+Trey+Parker+and+Matt+Stone","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c493cfc7e4197727918528a99e7948439e8afb98","infoHashBuffer":{"type":"Buffer","data":[196,147,207,199,228,25,119,39,145,133,40,169,158,121,72,67,158,138,251,152]},"announce":[],"urlList":[]}}