{"title":"Santosh Sivan - Theeviravaathi aka The Terrorist (1999)","uid":4532092,"size":1358297670,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c4d0cbb5d0c010fbfb6594d4b50b2c09c124f232&amp;dn=Santosh+Sivan+-+Theeviravaathi+aka+The+Terrorist+%281999%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"lord_terabyte","files":-1,"time":1227594588,"description":"Santosh Sivan - Theeviravaathi aka The Terrorist (1999) &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0169302/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0169302/&lt;/a&gt;\n\nLanguage: Tamil\nSubtitles: English\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/5108ARRX67L.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/5108ARRX67L.jpg&lt;/a&gt;\n\nFor all its title, this Indian film is not in any way political; though it is clearly inspired by the assacination of Rajiv Gandhi in 1991, by a girl who strapped a bomb around her body, the location of &quot;The Terrorist&quot; remains vague. But that makes a point because the film concentrates an orphaned girl Malli's pyschological change from a soldier fighting in the jungle for cause, into something she never thought of before, something with humanity.\n\nThe film neither defends nor accuses the terrorism (whatever you may define it) and those who are involved in it. The director wisely avoids including any reference to political climate, and sets his forcus upon the girl who believes her cause, and for that purpose, could be ruthless to kill a man. She is chosen for the 'human bomb' soldier to assacinate one statesman, and when she knows that, she quite happily starts the preparatory course for the mission, saying the words of gratitude before the commander.\n\nAnd Malli is sent to an old farmer's house under false identity, in order to wait for the order, but there she encounters the events that influence her way of thinking. For the reason that is gradually revealed in flashback sequences, her strong will starts to falter. In fact, Malli is given a chance to choose her life, which is to be suggested in the end.\n\nShot all with natural lighting, and except the leading actress Ayesha Dharkar, with all non-professional actors, the film shows the impressive contrast of darkness and light. Santosh Sivan, acclaimed photographer of India, gives his second feature as a director, and his skill for capturing the natural light is brilliantly shown here, with finely realized images of green, wet jungle. Though the film does not tell us anything particularly new about terrorism and its participants, its cinematography surely sneaks into the (possibly imaginary to some extent, but realistic) world of them.\n\nBut, the greatest treasure of the film is the lead Ayasha Dharkar, whose natural beauty never leaves the memory of ours the instant she looks deep into the camera. Her wide eyes are as expressive as anything I have seen on the screen recently, and if for her acting only, the film deserves your time and money. Actually, you might have seen her already in a certain Hollywood blockbuster film called &quot;Episode II&quot; (no kidding), but George Lucas seems to have missed it. A real shame. (About where she was, read on till the end.)\n\nJohn Malkovich, when he was chairman at Cairo Film Festival, loved the film so much that he decided to lend his name to introduce the film worldwide. So, Japanese poster of this film has a line &quot;John Malkovich Presents&quot; and his enthusiastic feelings are only natural. &quot;The Terrorist&quot; may put off many prospective viewers because of its topic and title, but the film deals with more personal matter, about which we should think for once. And again I say, the lead is so compelling that you never turn your eyes from her.  &lt;a href=&quot;\nhttp://bayimg.com/image/aamijaabb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/image/aamijaabb.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://bayimg.com/image/aamikaabb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/image/aamikaabb.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://bayimg.com/image/aamimaabb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/image/aamimaabb.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://bayimg.com/image/aaminaabb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/image/aaminaabb.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://bayimg.com/image/aamioaabb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/image/aamioaabb.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://bayimg.com/image/aamipaabb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/image/aamipaabb.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://bayimg.com/image/bamiaaabb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/image/bamiaaabb.jpg&lt;/a&gt;\n\n----------my rip------\n\nFile Size (in bytes):...........................1,330,835,456                     \n                                                                                \n--- Video Information ---                                                       \nVideo Codec Name:...............................XviD ISO MPEG-4              \nDuration (hh:mm:ss):............................1:36:42                \nFrame Count:....................................145040             \nFrame Width (pixels):...........................672                  \nFrame Height (pixels):..........................368                  \nAspect Ratio:...................................1.826                     \nFrames Per Second:..............................25.000          \nVideo Bitrate (kbps):...........................1633                 \n......MPEG-4......B-VOP........................                    \nQuality Factor (bits/pixel)/frame:..............0.264&quot;                     \n                                                                                \n--- Audio Information ---                                                       \nAudio Codec:....................................0x0055 MPEG-1 Layer 3                   \nAudio Sample Rate (Hz):.........................48000             \nAudio Bitrate(kbps):............................192                 \nAudio Bitrate Type (&quot;CBR&quot; or &quot;VBR&quot;):............CBR            \nAudio Channel Count:............................2    \n\nBY ROGER EBERT /  March 31, 2000\n\n\t\n\nCast &amp; Credits\nMalli: Ayesha Dharkar\nVasu: Parmeshwaran\nThyagu: Vishnu Vardhan\nPerumal: Bhanu Prakash\nLotus: Vishwas\nLover: K. Krishna\n\nPhaedra Cinema Presents A Film Directed By Santosh Sivan. Written By Sivan, Ravi Deshpande And Vijay Deveshwar. Running Time: 95 Minutes. No MPAA Rating (Contains Non-Exploitative Violence). In Tamil With English Subtitles. \n\n\nShe is 19 years old and a soldier in a revolutionary movement. Her brother has died for the cause, and she has killed for it. A volunteer is needed for a suicide mission. She steps forward, fiercely and silently, and is accepted. She will become a &quot;thinking bomb,&quot; and after she places a garland of flowers around a politician's neck, she will blow them both to pieces.\n\n&quot;The Terrorist&quot; does not name its time or place, or the politician, but it seems broadly inspired by the 1991 assassination of India's Rajiv Gandhi. It is not a political film, but a personal one. If you have ever wondered what kind of person volunteers to become a human bomb, and what they think about in the days before their death, this film wonders, too.\n\nAnd its director, Santosh Sivan, does something filmmakers find almost impossible. He follows this young woman without identifying with her mission. We do not want her to succeed. Films are such a first-person medium--they identify so strongly with their protagonists--that they generate sympathy even for evil: Did we want Hannibal Lecter to escape? Of course we did. And at the end of &quot;The Day of the Jackal&quot; (1973), we instinctively wanted the assassin to succeed, simply because we had been following him for two hours. Of course we think murder is wrong, but fiction tends to argue for its heroes. Consider Crime and Punishment .\n\nIn &quot;The Terrorist,&quot; we do not want the girl, named Malli, to succeed. That's despite the way the movie paints her loyalty to her cause, and the possibility that her cause is right. The movie is quiet and persuasive as it shows Malli learning more about her life--in what may be her last days-- than she ever knew before.\n\nPlayed by Ayesha Dharkar, a young actress with expressive eyes and a beauty that is innate, not cosmetic, Malli doesn't talk much, and we sense that she has deep wounds; her brother's death in the same cause suggests a painful background. After she volunteers for the mission, she is passed along an underground network of conspirators to the farm where she will spend her final days. One of her guides is a boy of 13 or 14 named Lotus (Vishwas), who leads her down the center of a shallow river and shows her where to step to avoid land mines and booby traps. He has guided many others this way, he says; they have all later been killed. When a truck blows up, he weeps: &quot;There will be blood everywhere.&quot; No more than a child, he is traumatized by his life.\n\nAlso on the journey, she meets a young soldier who is mortally wounded. In a scene of great delicacy, she cradles him on the forest floor, and he whispers that he has never been so close to a woman in his life. Nor, we sense, has she ever been so close to a man. Just as Sivan makes a movie that does not identify with its violent mission, so he creates a love scene that is not about sex, but communication, surcease, healing.\n\nEventually Malli arrives at a farm and is given a room of her own. We meet the farmer Vasu (Parmeshwaran) and his helper. These are characters to remind us of the gentle humor of the great Indian novelist R.K. Narayan. Their philosophy and religion are part of their lives, and the farmer tells Malli: &quot;A flower is the earth smiling.&quot; He always sets an extra place at dinner, for his wife, who is in a coma and has not stirred for seven years. Malli sees the woman in the room next to her own, staring sightlessly at nothing.\n\nMalli's terrorist contact and his sidekick rehearse her carefully, and select clothing that will conceal the bomb strapped around her middle. They are narrow functionaries, telling her that news of her action will go out to all the world. It is unclear if the farmer knows of her mission (I think he doesn't). He argues for life, not in words so much as in how he conducts his own existence.\n\nMalli says little in the film. Sometimes the soundtrack uses the sound of quiet breathing, which places us inside her head. She regards herself in the mirror, and we intuit what she's thinking. Conversations she has with the farmer put her action in a new light, with new consequences. All leads up to an ending which is the right ending for this film, although few members of the audience will anticipate it.\n\nThere is no shortage of those prepared to sacrifice their lives to kill others and advance their cause. If we disagree with them, they are fanatics. If we agree, they are heroes. At least they are personally involved and prepared to pay with their lives, which in a sense is more moral than killing by remote control at long distance and calling it &quot;modern warfare.&quot;\n\nBut what do they think? How do they feel? I've often wondered what goes through the mind of a condemned prisoner, who knows the exact hour of his death. How much stranger it must seem to be your own willing executioner: to die voluntarily because an idea is bigger than yourself. In my mind, the self is the biggest of all ideas; without it, there are no ideas. Does Malli arrive at this conclusion? \n\n********************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release. &lt;a href=&quot;\nhttp://freakyflicks.proboards54.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://freakyflicks.proboards54.com&lt;/a&gt;\n\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE \n","torrent":{"xt":"urn:btih:c4d0cbb5d0c010fbfb6594d4b50b2c09c124f232","amp;dn":"Santosh+Sivan+-+Theeviravaathi+aka+The+Terrorist+%281999%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4d0cbb5d0c010fbfb6594d4b50b2c09c124f232","infoHashBuffer":{"type":"Buffer","data":[196,208,203,181,208,192,16,251,251,101,148,212,181,11,44,9,193,36,242,50]},"announce":[],"urlList":[]}}