{"title":"Starwars Holiday Special WHIO Remaster.mp4","uid":9990011,"size":729543777,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c510f5c9c7e38a938ff94023f912c779278f90c7&amp;dn=Starwars+Holiday+Special+WHIO+Remaster.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":null,"files":1,"time":1397839165,"description":"Writeup available online: Until a couple of weeks ago, there were really only two or three common sources to 99% of all the Star Wars holiday Special video available on the internet, a first or second generation VHS recording of the broadcast recorded from KCCI in Des Moines, Iowa, another from WBBM in Chicago, and one from WMAR-TV in Baltimore, Maryland. The latter is not as good quality as the other  two, but it does include all of the original commercial breaks, which many would argue are more entertaining than the show itself.\n\nIn the early to mid-1990s, before the advent of the internet and digital video, these original recordings were duplicated and re-duplicated on tape until most fans who wanted a copy would be lucky if they could find a sixth generation VHS dub. Then, with the birth of the internet, BitTorrent and YouTube, much cleaner earlier generation VHS dubs of these sources started to appear. There was a KCCI Angrysun Edition in 2005, and later a &quot;hybrid Edition&quot; combining the WBBM show with the WMAR commercials, both of which are pretty good quality.\n\nThen, a couple of weeks ago an OriginalTrilogy.com member calling him (or her) self &quot;Tasjo&quot; picked up an original first generation VHS recording of the Star Wars Holiday Special from WHIO in Dayton Ohio. The video quality is about as good as VHS ever gets. \n\n\n\nThis version is the Tasjo VHS rip and not mine, its converted from VOB to MP4 (464x352), as far as I know its only available on newsgroups so thought I would share.\n\nAgain this is not my rip!\n\n","torrent":{"xt":"urn:btih:c510f5c9c7e38a938ff94023f912c779278f90c7","amp;dn":"Starwars+Holiday+Special+WHIO+Remaster.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c510f5c9c7e38a938ff94023f912c779278f90c7","infoHashBuffer":{"type":"Buffer","data":[197,16,245,201,199,227,138,147,143,249,64,35,249,18,199,121,39,143,144,199]},"announce":[],"urlList":[]}}