{"title":"Clocking the Mind (2006) by Arthur Robert Jensen","uid":10139767,"size":2824254,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c59c5fc054a5b100678a617c75691f52b6642468&amp;dn=Clocking+the+Mind+%282006%29+by+Arthur+Robert+Jensen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":-1,"time":1399940875,"description":"Clocking the Mind - Mental Chronometry and Individual Differences (2006) by Arthur Robert Jensen.pdf\n\nMental Chronometry (MC) comprises a variety of techniques for measuring the speed with which the brain processes information.\n\nFirst developed in mid-1800, MC was subsequently eclipsed by more complex and practically useful types of psychometric tests stemming from Alfred Binet. This class of mental tests, however, has no true metric relating the test scores to any specific properties of the brain per se. The scores merely represent an ordinal scale, only ranking individuals according to their overall performance on a variety of complex mental tasks. The resulting scores represent no more than ranks rather than being a true metrical scale of any specific dimension of brain function. Such an ordinal scale, which merely ranks individuals in some defined population, possesses no true scale properties, possessing neither a true zero or equal intervals throughout the scale. This deficiency obstructs the development of a true natural science of mental ability. The present burgeoning interest in understanding individual differences in mental abilities in terms of the natural sciences, biology and the brain sciences in particular, demands direct measures that functionally link brain and behavior. One such natural ratio scale is time itself - the time it takes the brain to perform some elementary cognitive task, measured in milliseconds.\n\nAfter more than 25 years researching MC, Jensen here presents results on an absolute scale showing times for intake of visual and auditory information, for accessing short-term and long-term memory, and other cognitive skills, as a function of age, at yearly intervals from 3 to 80 years. The possible uses of MC in neurological diagnosis and the monitoring of drug effects on cognition, the chronometric study of special time-sensitive talents such as musical performance, and presents a theory of general intelligence, or g, as a function of the rate of oscillation of neural action potentials as measured by chronometric methods. Finally, Jensen urges the world-wide standardization of chronometric methods as necessary for advancing MC as a crucial branch of biopsychological science.\n\n*Provides a different scale to report Mental Chronometry (MC) findings\n*Argues for the global adoption of an absolute scale as opposed to the traditional ordinal scale\n*An important contribution to MC researchers and psychologists and neuroscientists\n\n286 pages\nPublisher: Elsevier Science; 1 edition (September 13, 2006)\nLanguage: English\nISBN-10: 0080449395\nISBN-13: 978-0080449395","torrent":{"xt":"urn:btih:c59c5fc054a5b100678a617c75691f52b6642468","amp;dn":"Clocking+the+Mind+%282006%29+by+Arthur+Robert+Jensen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c59c5fc054a5b100678a617c75691f52b6642468","infoHashBuffer":{"type":"Buffer","data":[197,156,95,192,84,165,177,0,103,138,97,124,117,105,31,82,182,100,36,104]},"announce":[],"urlList":[]}}