{"title":"Acid Dreams[BBS]","uid":6607233,"size":1323711,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c5b53968b6f234a35274f22c0125ee415dfecfa6&amp;dn=Acid+Dreams%5BBBS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1313449632,"description":"                                      Acid Dreams\n\n       The Complete Social History of LSD: The CIA, The Sixties, and Beyond\n\n\n\n\nAcid Dreams is the complete social history of LSD and the counterculture it helped to define in the sixties. Martin Lee and Bruce Shlain's exhaustively researched and astonishing account-part of it gleaned from secret government files-tells how the CIA became obsessed with LSD as an espionage weapon during the early l950s and launched a massive covert research program, in which countless unwitting citizens were used as guinea pigs. Though the CIA was intent on keeping the drug to itself, it ultimately couldn't prevent it from spreading into the popular culture; here LSD had a profound impact and helped spawn a political and social upheaval that changed the face of America. From the clandestine operations of the government to the escapades of Timothy Leary, Abbie Hoffman, Ken Kesey and his Merry Pranksters, Allen Ginsberg, and many others, Acid Dreams provides an important and entertaining account that goes to the heart of a turbulent period in our history. &quot;Engaging throughout . . . at once entertaining and disturbing.&quot; - Andrew Weil, M.D., The Nation; &quot;Marvelously detailed . . . loaded with startling revelations.&quot; - Los Angeles Daily News; &quot;An engrossing account of a period . . . when a tiny psychoactive molecule affected almost every aspect of Western life.&quot; - William S. Burroughs; &quot;An important historical synthesis of the spread and effects of a drug that served as a central metaphor for an era.&quot; - John Sayles.","torrent":{"xt":"urn:btih:c5b53968b6f234a35274f22c0125ee415dfecfa6","amp;dn":"Acid+Dreams%5BBBS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5b53968b6f234a35274f22c0125ee415dfecfa6","infoHashBuffer":{"type":"Buffer","data":[197,181,57,104,182,242,52,163,82,116,242,44,1,37,238,65,93,254,207,166]},"announce":[],"urlList":[]}}