{"title":"Philosophical Foundations for a Christian Worldview","uid":10475645,"size":2130189,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c6067f8773ec7ac8c2044fe9978cd7f966597e34&amp;dn=Philosophical+Foundations+for+a+Christian+Worldview&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"adamryanx","files":-1,"time":1404330245,"description":"Winner of a 2004 ECPA Gold Medallion Award! Winner of an Award of Excellence in the 2003 Chicago Book Clinic!\nWhat is real?\nWhat is truth?\nWhat can we know?\nWhat should we believe?\nWhat should we do and why?\nIs there a God?\nCan we know him?\nDo Christian doctrines make sense?\nCan we believe in God in the face of evil?\nThese are fundamental questions that any thinking person wants answers to. These are questions that philosophy addresses. And the answers we give to these kinds of questions serve as the the foundation stones for consrtucting any kind of worldview. In Philosophical Foundations for a Christian Worldview J.P. Moreland and William Lane Craig offer a comprehensive introduction to philosophy from a Christian perspective. In their broad sweep they seek to introduce readers to the principal subdisciplines of philosophy, including epistemology, metaphysics, philosophy of science, ethics and philosophy of religion. They do so with characteristic clarity and incisiveness. Arguments are clearly outlined, and rival theories are presented with fairness and accuracy. Philosophy, they contend, aids Christians in the tasks of apologetics, polemics and systematic theology. It reflects our having been made in the image of God, helps us to extend biblical teaching into areas not expressly addressed in Scripture, facilitates the spiritual discipline of study, enhances the boldness and self-image of the Christian community, and is requisite to the essential task of integrating faith and learning. Here is a lively and thorough introduction to philosophy for all who want to know reality.","torrent":{"xt":"urn:btih:c6067f8773ec7ac8c2044fe9978cd7f966597e34","amp;dn":"Philosophical+Foundations+for+a+Christian+Worldview","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6067f8773ec7ac8c2044fe9978cd7f966597e34","infoHashBuffer":{"type":"Buffer","data":[198,6,127,135,115,236,122,200,194,4,79,233,151,140,215,249,102,89,126,52]},"announce":[],"urlList":[]}}