{"title":"Richard's 21st Century Bicycle Book","uid":6477428,"size":3453222,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c642392bdcb70d5bec398a22973dfa14a99c75be&amp;dn=Richard%5C%27s+21st+Century+Bicycle+Book&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Djofullinn","files":1,"time":1308359796,"description":"Product Description\nThe New York Times called Richard's Bicycle Book the very best, the only good book ever written for the amateur cyclist when it was first published almost thirty years ago. Quickly recognized as the essential manual for cyclists at all levels, it has gone on to become a million-copy bestseller. But the times-and the bikes-have changed. Now Richard-older, wiser, and in many ways younger, too-is ready to lead a new generation into a new millennium in this completely new edition of his cyclist's bible.\n\nRichard's 21st-Century Bicycle Book covers all kinds of bicycles-from mountain bikes to kids' tricycles, and including cargo cycles, exotic superbikes and futuristic 70-mph vehicles. Richard provides expert advice on buying the right bicycle and setting it up for maximum comfort and efficiency as well as thorough evaluations of such accessories as anti-puncture tires, child seats, helmets, lights and more. His basic lessons will have even the most wary riding within 15 minutes, and his tips on negotiating traffic will guarantee safe travel for pleasure and fitness riders alike. For the more adventurous cyclists, Richard especially explores the pleasures of mountain biking (with a special focus on recent advances in bike technology), transcontinental touring, off-road expeditions, and competition biking. Bikes and cycling are economical, ecological and, most importantly, great fun, and this is the guide to lead everyone-Sunday cyclists and Olympic hopefuls alike-pedaling into the 21st-century.\nAbout the Author\nRichard Ballantine is the author of Richard's Bicycle Book and, with Richard Grant, of Richard's Ultimate Bicycle Book and The Bicycle Repair Manual, and the founder of several cycling magazines. He is an editor at Rufus Publications, founded by his parents, Ian and Betty Ballantine, and has written books on a wide range of subjects. \n &lt;a href=&quot;\nhttp://www.amazon.com/Richards-21st-Century-Bicycle-Book/dp/1585671126/ref=sr_1_2?ie=UTF8&amp;qid=1308352340&amp;sr=8-2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Richards-21st-Century-Bicycle-Book/dp/1585671126/ref=sr_1_2?ie=UTF8&amp;qid=1308352340&amp;sr=8-2&lt;/a&gt;","torrent":{"xt":"urn:btih:c642392bdcb70d5bec398a22973dfa14a99c75be","amp;dn":"Richard%5C%27s+21st+Century+Bicycle+Book","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c642392bdcb70d5bec398a22973dfa14a99c75be","infoHashBuffer":{"type":"Buffer","data":[198,66,57,43,220,183,13,91,236,57,138,34,151,61,250,20,169,156,117,190]},"announce":[],"urlList":[]}}