{"title":"RTE The Zoo Series 3 Dublin Zoo Christmas Special 11of11 DVDRip ","uid":9034619,"size":737087196,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c6c46c94efb32366f17bcb9664d4f995cda2a927&amp;dn=RTE+The+Zoo+Series+3+Dublin+Zoo+Christmas+Special+11of11+DVDRip+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MVGroup","files":-1,"time":1381486365,"description":"The Zoo Series 3 (Dublin)\n\nNature Documentary hosted by Tom Dunne, published by RTE in 2012 - English narration\n\n\nInformation\n------------------------------\n\nThe Zoo Series 3 (Dublin)\nThere's excitement, drama and plenty of animal adventures in this brand new series featuring all of your favourite zookeepers and animals! There's been a baby boom in Dublin Zoo and over the course of series you'll be introduced to new born baby gorillas, hippos, red pandas, mangabey monkeys and many others. You'll also meet a whole host of new animals, from tiny marmosets to tarantulas and gila monsters, and catch up with some of your old favourites, including Dublin Zoo's troop of gorillas who are getting ready to set foot in their new rainforest habitat for the very first time.\n\n\n1)  Part 1 \nGarth has a hairy encounter with one of the Reptile House's creepier inhabitants, the Chilean Rose Tarantula and the deadly spider demonstrates its incredible hunting techniques on an unsuspecting locust. When a baby white crowned mangabey is rejected by its inexperienced mother, the keepers decide to step in and take care of the little one until it can be reintroduced to the rest of its troop. In this episode, team leader Helen takes the little one home to hand raise it herself. The new Gorilla Rainforest is finally ready for its new inhabitants. Horticulturalist Stephen introduces us to the many plants and flowers he has sown to create the right environment for the gorillas, while Ciaran and his team prepare the gorilla family for the biggest move of their life.\n\n2)  Part 2 \nThe big day has finally arrived and Dublin Zoo's gorilla family are moving in to their new rainforest home. But how will they take to their new habitat? We follow them as they take their very few steps into unexplored territory. After several weeks of home care and motherly attention, the little white crowned mangabey is ready to begin the reintroduction process so she can rejoin the rest of the mangabey troop on their island home. There's a baby boom in Family Farm! Team Leader Eddie introduces some of its newest inhabitants, from rabbits and goats to beautiful twin new born lambs.\n\n3)  3 \nOne of the zookeepers notices that some of the red-ruff lemurs appear to be losing clumps of hair. Gerry calls in the vet to investigate the mysterious hair loss, but first the keepers will have to round up these beautiful tree-dwelling creatures. Hippos Henry and Hoovie have lived together for many years in Dublin Zoo, but the time has come for Hoovie to move on and find a different mate. It's a sad time for Henry, until he meets his new companion that is. We watch them as love blossoms and the keepers cross their fingers and hope for the greatest news of all, a baby hippo. When a new group of female meerkats arrive from Belfast and a young male from Wales, team leader Eddie and his team are keen to see the new group will get on together. He introduces us to these fascinating creatures as they take their first steps into their new habitat.\n\n4)  Part 4 \nA new female red panda moves to Dublin Zoo, so it's an exciting time for Dublin Zoo's solitary male. When the big day arrives he looks a little shy and more than a little wary of his new partner, but will his curiosity get the better of him? The highly anticipated hippo calf is finally ready to be born in Dublin Zoo. But it's a tricky setup for the keepers. These enormous semi-aquatic mammals like to do everything in the water, including giving birth. Sandy the giraffe is getting ready for an important journey. She is a favourite of team leader Helen and has a big place in zoo keeper John's heart after hand-raising her himself, so it's a bitter-sweet mixture of emotions as they set out with her to Belfast to bid farewell to their old friend.\n\n5)  Part 5 \nAfter her journey from Dublin Zoo, Sandy the giraffe is ready to meet her new herd. It's her first time being part of a herd where she might have a potential mate. But how will the Belfast giraffes take to the new arrival?\nThe hippo calf is growing fast and spending lots of time in the pool with its very protective mother. Team leader Helen and her team are keeping a close eye on her all the same, but so far so good. After a successful introduction, zookeeper Susan is delighted to find a couple of tiny furry heads poking out of the red panda den, but it doesn't take the red panda babies long to get over their initial shyness and they're soon getting up to all kinds of mischief. Gorilla Mayani is due to give birth at any moment. It's her first pregnancy and, because she was a hand-raised gorilla, the keepers are a little worried she may not have all the skills she needs to raise her young. Whatever happens, James, Helen and the other keepers are ready to step in and help at any moment.\n\n6)  Part 6 \nAt the African Plains the team in Dublin Zoo have been keeping a close eye on Hailey the giraffe, one of the older females in the herd. It's been a long 15 month pregnancy, but the zookeepers are hopeful they'll soon have a beautiful new calf joining the herd. Dublin Zoo's flock of Chilean flamingos are thriving and it's been growing steadily for many years. With some of the birds over 30 years old, it's important that Eddie and his team in the East section are able to keep track of all the flock and monitor their health, but first the tricky part; rounding them all up. Pygmy marmosets are one of the smallest primates in the world, and it's always an exciting occasion when these tiny South American tree dwellers give birth. Normally they give birth to two offspring at a time, but when a third is born the smallest marmoset was left to take care of itself. Luckily Susan and the zookeepers are on hand to raise the little monkey themselves.\n\n7)  Part 7 \nA new male snow leopard arrives in Dublin Zoo to join Ciara the female leopard. Introductions like these can be tricky, but Ciaran and his team are hopeful that the pair will get on well. If everything goes to plan, there could be a birth that will be tremendously important for the future of this beautiful but critically endangered species. The little white crowned mangabey has been doing well under Helen's watchful eye, and she's started the slow process of being introduced to the rest of the group, but how is the rest of the troop taking to her? Ciaran from the Irish Wildlife Trust introduces Garth to the smooth newt, one of Ireland's few species of amphibian. The two animal lovers take a journey into the countryside to explore its native habitat and see if they can find the elusive newts.\n\n8)  Part 8 \nThis week in the Reptile House Garth introduces the gila monsters. It's the start of the breeding season and at this time of year these highly venomous lizards can get a little boisterous with each other. Garth tends to their wounds and introduces us to these fascinating creatures. Susan is delighted to discover that Angelina the red panda has successfully given birth to two adorable cubs and is warming quickly to her new role as protective mother to the two furry infants. There's a lot of activity happening on the macaque island, and it's now home to a number of playful young monkeys. To keep an eye on their health and well-being, it's important that Dublin Zoo perform some simple health checks, but first keepers Ciaran and Yvonne are going to round them all up. Honey, a rare Indian black buck antelope, is pregnant. Zookeeper Alice is watching her progress very carefully and, if all goes well, Dublin Zoo is hoping the new arrival will share the Kaziranga Forest Trail at Dublin Zoo with the herd of elephants that live there, just as they share a habitat in the wild.\n\n9)  Part 9 \nThe tiny pygmy marmoset baby has been doing well under Susan's watchful eye, but it's still at a delicate stage in its development and requires round the clock care. We join Susan in her home as she gives the little primate a night feed. Kasi the white-crowned mangabey has been growing bigger and stronger by the day and has even made some new friends amongst her troop. With things going so well, Helen feels the little monkey is almost ready for her full reintroduction. Brendan the zookeeper takes his love of gorillas to the road and goes in search of gorillas in the rainforests of Africa. He keeps a video diary from the heart of a Ugandan forest where he is preparing for the most thrilling encounter of his life, meeting gorillas in the wild... Eddie and his team have their hands full on Family Farm when Dublin Zoo's Tamworth pig gives birth to a litter of 9 piglets. There's good news on the African Plains too as Helen and John are delighted to discover a litter of Red River Hogs have been born overnight.\n\n10)  Part 10 \nZookeeper Brendan fulfils a lifelong ambition when he encounters a band of Mountain Gorillas on his journey into the heart of Bwindi Impenetrable National Park in Uganda. After months of hand rearing Helen and the other keepers has become very close to Kasi the baby mangabey and she has gone from strength to strength under their care. Finally, the big day has arrived and it's time for the mangabey and her keepers to part ways. We join the little monkey as she prepares to be rejoining the rest of her troop on Mangabey Island for the first time. There's great excitement in the West section where Ciaran and Gerry are keeping a close eye on Dublin Zoo's snow leopard pair. Mating season has just begun for these beautiful but critically endangered cats, and it's so far so good as they seem to be showing a lot of interest in each other. Red panda babies grow up fast as their keeper Susan knows only too well. The two youngsters are already proving quite the handful and are becoming more curious and playful by the day. Susan visits them in their habitat to give them a check-up and see how they are getting on.\n\n11)  Christmas Special \nIncluded is this hour long Christmas Special, featuring all your favourite animals and keepers coping with a snow bound zoo over the Christmas holidays.\n\nScreenshots\n------------------------------ &lt;a href=&quot;\nhttp://img33.imageshack.us/img33/1492/n4fh.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img33.imageshack.us/img33/1492/n4fh.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img96.imageshack.us/img96/2633/4p8e.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img96.imageshack.us/img96/2633/4p8e.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img534.imageshack.us/img534/6606/msr5.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img534.imageshack.us/img534/6606/msr5.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img850.imageshack.us/img850/2327/xw05.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img850.imageshack.us/img850/2327/xw05.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img197.imageshack.us/img197/5338/ymul.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img197.imageshack.us/img197/5338/ymul.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img7.imageshack.us/img7/9906/nlll.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img7.imageshack.us/img7/9906/nlll.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img5.imageshack.us/img5/9382/kvpm.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img5.imageshack.us/img5/9382/kvpm.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img10.imageshack.us/img10/4950/xzs1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img10.imageshack.us/img10/4950/xzs1.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img818.imageshack.us/img818/5475/87lu.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img818.imageshack.us/img818/5475/87lu.jpg&lt;/a&gt; \n\nTechnical Specs\n------------------------------\n\n\n * Video: Codec: x264 CABAC &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;a1e9c8c6c9e1ed958f91&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n * Video: Bitrate: 1398 Kbps\n * Video: Aspect Ratio: 1.778 (16:9)\n * Video: Resolution: 832x468\n * Audio: Codec: AAC LC\n * Audio: Bitrate: 128 Kbps VBR 48KHz\n * Audio: Channels: stereo (2/0)\n * Audio: English\n * Run-Time: 25mins\n * Framerate: 29fps\n * Number of Parts: 11\n * Part Size: average 239 MB\n * Container: Mp4\n * Source: DVD\n * Encoded by: Harry65\n\n\n\nLinks\n------------------------------\n\n1)  Further Information &lt;a href=&quot;\nhttp://www.thezoo.ie/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.thezoo.ie/&lt;/a&gt;\n\n\n","torrent":{"xt":"urn:btih:c6c46c94efb32366f17bcb9664d4f995cda2a927","amp;dn":"RTE+The+Zoo+Series+3+Dublin+Zoo+Christmas+Special+11of11+DVDRip+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6c46c94efb32366f17bcb9664d4f995cda2a927","infoHashBuffer":{"type":"Buffer","data":[198,196,108,148,239,179,35,102,241,123,203,150,100,212,249,149,205,162,169,39]},"announce":[],"urlList":[]}}