{"title":"LeWoods Anal Superstars ( 2014 EVIL ANGEL ) 2 DISC SET","uid":11223657,"size":3453732001,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:c7a85bd222803947446dc25da8b660f3cf265344&amp;dn=LeWoods+Anal+Superstars+%28+2014+EVIL+ANGEL+%29+2+DISC+SET&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":11,"uploader":"TechLatina","files":-1,"time":1413414791,"description":"LeWoods Anal Superstars ( NEW 2014 EVIL ANGEL ) [ SPECIAL 2 DISC SET - DVD RIP ]\n\n\nCAST\nMark Wood, Francesca Le, India Summer, Chris Strokes, Phoenix Marie, Jada Stevens, Bridgette B., Chanel Preston, Remy Lacroix, Bonnie Rotten, Zoey Monroe, Aj Applegate\n\n\n\nDESCRIPTION\nSubject to change without notice Pornographic partners Francesca Le and Mark Wood love creating scenes of nasty, X-rated sodomy, and they're showcasing some of their best butt fucks in the double-DVD LeWood's Anal Superstars. Sensational Bonnie Rotten shocks Mark with her radical tattoos and behavior as she slurps his fragrant cock ass-to-mouth. A rough anal pounding makes her butthole gape. Blonde cutie Zoey Monroe learns about sleazy agents from Mark and Chris Strokes, who slide their thick pricks up her sweet ass for a lewd double-penetration. Francesca (the insatiable American Latina MILF) and Mark bring adorable, young Remy LaCroix on swinging vacation to Mexico! Glamorous beauty Chanel Preston gets her butthole drilled and a messy cum shot slops her lush make-up. Mark spies sassy Jada Stevens bathing her plump ass and enjoys a literally breathtaking experience when she plants her tush on his face. Voluptuous Phoenix Marie, blonde AJ Applegate, bodacious Latina Bridgette B. and brunette MILF India Summer serve up their fine asses","torrent":{"xt":"urn:btih:c7a85bd222803947446dc25da8b660f3cf265344","amp;dn":"LeWoods+Anal+Superstars+%28+2014+EVIL+ANGEL+%29+2+DISC+SET","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7a85bd222803947446dc25da8b660f3cf265344","infoHashBuffer":{"type":"Buffer","data":[199,168,91,210,34,128,57,71,68,109,194,93,168,182,96,243,207,38,83,68]},"announce":[],"urlList":[]}}