{"title":"Rifftrax - Aeon Flux (720p)","uid":9673590,"size":572256588,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:c80631ae856cb3c4b3adf27131c2f03408f92726&amp;dn=Rifftrax+-+Aeon+Flux+%28720p%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"utternerd","files":-1,"time":1393516974,"description":"This has disembaudio lines removed, and is auto-ducked.\n\nIf you enjoy this please don't be a cheap bastard, it wasn't free:\n &lt;a href=&quot;\nhttp://www.rifftrax.com/donate&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.rifftrax.com/donate&lt;/a&gt;\n\n\n&quot;Seeing it...made me feel helpless, humiliated and sad.&quot; A celebrity apologizing for their latest paparazzi shots? No, those are the words of Aeon Flux creator Peter Chung regarding the big screen adaptation of the TV show he created. Peter, Peter, Peter...Why the long face? You have it so good!\n\n \nYou want helpless? Watch yet another director hamfistedly attempt to cope with a studio's order to &quot;Be more like The Matrix.&quot; You want humiliated? Try Best Actress Oscar winners Charlize Theron and Frances McDormand, who must have done some hard drinking together the night before they signed up to play members of a spy sect called the &quot;Monicans&quot; for some reason. Want sad? Look at the latest devoted sect of fanboys whose beloved cult cartoon is now known by the general population as being &quot;That movie with that guy from xXx.&quot;\n\n \nPeter my friend, when a bomb as fast and as loud and as incomprehensible as Aeon Flux comes along, it's your job to just quietly cash the checks, and then turn the reigns over to Mike Nelson and Kevin Murphy, and let the two of them do their thing. The hilarity, much like the Relical, (whatever that is), is omnipresent in this RiffTrax, and it is guaranteed to make you feel the opposite of helpless, humiliated and sad, (whatever that may be as well.)","torrent":{"xt":"urn:btih:c80631ae856cb3c4b3adf27131c2f03408f92726","amp;dn":"Rifftrax+-+Aeon+Flux+%28720p%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c80631ae856cb3c4b3adf27131c2f03408f92726","infoHashBuffer":{"type":"Buffer","data":[200,6,49,174,133,108,179,196,179,173,242,113,49,194,240,52,8,249,39,38]},"announce":[],"urlList":[]}}