{"title":"Toy Story 2 - Action Game (Portable)","uid":11426697,"size":329367761,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c88b66a5ca592aee46794a361b4ce44a1e087347&amp;dn=Toy+Story+2+-+Action+Game+%28Portable%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"frogz2007","files":-1,"time":1415672149,"description":"Description (fromThough it may not appeal to many adult gamers, Disney's Toy Story 2 Action Game is a solid arcade game. The title combines the style and humor of the movie with 3-D platform-game elements you would normally find in a video game. In fact, the exact same game is also available for the PlayStation and Nintendo 64 game consoles, and its video-game roots are often clearly visible.\n\nPlayers take control of Buzz Lightyear in his quest to rescue Woody from the evil clutches of Al, the toy collector. The game is played from a third-person perspective and is more like Super Mario 64 than Tomb Raider. Many of the 15 levels--most of which revolve around actual locations from the movie--are straightforward, but offer numerous bonus items and secret areas to explore. In order to make it through the entire game, Buzz has to perform many difficult jumps, climb trees, zap evil toys with his laser, and interact with all of his toy pals to get clues.\n\nMuch like the movie, the game's primary audience is kids (ages 8 and older); adults may tire of the arcade-style jumping and climbing action in short order. Still, for parents searching for a family-friendly computer game--and one that wonderfully re-creates the environments and characters of a great Disney movie--Toy Story 2 Action Game is a great bet.\n\n\nINSTALL INSTRUCTIONS\n________________________\n\n1. Unzip using 7-Zip, which can be found here: http://www.7-zip.org\n2. Run regsetup.exe\n3. Play!\n________________________\n\n\nMost other torrents with this game have no music, and has to be installed. This one, however, has all of the music and cut-scenes, and is PORTABLE! Just run the regsetup.exe file and you'll be all set.\n\n\n\n\n\n- frogz2007","torrent":{"xt":"urn:btih:c88b66a5ca592aee46794a361b4ce44a1e087347","amp;dn":"Toy+Story+2+-+Action+Game+%28Portable%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c88b66a5ca592aee46794a361b4ce44a1e087347","infoHashBuffer":{"type":"Buffer","data":[200,139,102,165,202,89,42,238,70,121,74,54,27,76,228,74,30,8,115,71]},"announce":[],"urlList":[]}}