{"title":"Action Comics v1 812-826 (2004-2005) (digital) (DreamGirl-Novus-","uid":9792108,"size":604854585,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:c89783f6e9f8902b6ecaa7f774a5096b26fd7c2e&amp;dn=Action+Comics+v1+812-826+%282004-2005%29+%28digital%29+%28DreamGirl-Novus-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":4,"uploader":"blackcanary","files":-1,"time":1395263788,"description":"English | CBZ | 15 Issues\n\nAction Comics v1 #812-826\nPublisher:  DC Comics\nPublication Date:  April 2004 - June 2005\n\nAction Comics #812\n&quot;Godfall&quot; part 1! Written by acclaimed artist Michael Turner! Kal-El begins his new life...on the planet Krypton? What's going on, and why doesn't he remember who he is? A strange new adventure begins for the Man of Steel! Continued in ADVENTURES OF SUPERMAN #625.\n\nAction Comics #813\n&quot;Godfall&quot; part 4, continued from SUPERMAN #202. Betrayed by the one person he thought he could trust, Kal-El must find a way to return to Metropolis. Meanwhile, Lyla has set her sights on the one thing he cares about most: Lois Lane! Continued in ADVENTURES OF SUPERMAN #626.\n\nAction Comics #814\nA day in the life for anyone else would be ordinary, but not for Superman! There are robbers to catch, children to save, and the hordes of Apokolips to stop. And Darkseid and his minions provide only a hint of the threats on the way to challenge the Man of Steel.\n\nAction Comics #815\nThe Superman revolution continues as the Man of Steel gets ready for round two with Gog! Superman battles for his life--and those of the Teen Titans--against a foe fueled by an unholy rage!\n\nAction Comics #816\nGog and Superman continue their epic battle with their throw down heading to Clark's hometown of Smallville! Too bad Superboy, Wonder Girl and Kid Flash get in the way!\n\nAction Comics #817\nInjured from his knock-down fight with Gog, Superman is cornered by every villain who wants to make a name for himself by getting a piece of the Man of Steel. Will Wonder Woman and Superboy be enough muscle to help Superman?\n\nAction Comics #818\nAn injured Superman is surrounded inside STAR Labs with no way to get through the hordes of villains outside. And when one of those villains makes it inside, things get even worse!\n\nAction Comics #819\nIntroducing Sodom &amp; Gomorrah, a new husband-and-wife super villain team prepared to give Superman a sound beating! Plus, some startling new developments in Clark's relationship with Lana Lang.\n\nAction Comics #820\nA tribute to the dead is interrupted by Silver Banshee! As Superman and Jack Ryder pay their respects to a photographer caught in the crossfire of a supervillain rampage, Silver Banshee comes screaming from the pits of Hell!\n\nAction Comics #821\nPreus, the villain from the &quot;Godfall&quot; storyline returns, and the rogue Kandorian cop is assembling followers on Earth to declare a holy war on the Man of Steel.\n\nAction Comics #822\nClark and Lois go back to Smallville for the holidays hoping to escape the hustle and bustle of Metropolis. There's just one problem: Lana Lang is in town, too.\n\nAction Comics #823\nSuperman is being beaten by an unlikely foe. Can Krypto save both Superman and Superboy from a terrible fate?\n\nAction Comics #825\nVillains unite in this special extra-sized anniversary issue. Doomsday and Gog attack Superman in the middle of a deserted Metropolis, leveling the city in an all-out battle.\n\nAction Comics #826\n&quot;Lightning Strikes&quot; part 1! A great evil searches for Superman, and the wizard Shazam sends Captain Marvel to help the Man of Steel. Will Captain Marvel arrive in time, or will Superman himself succumb to the villainous entity's mad power? Continued in ADVENTURES OF SUPERMAN #639.\n\nThanks goes to DreamGirl for this release.\n\nDon't know how to view this comic book?  Use CDisplayEx or another comic book reader application. &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/9226334&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/9226334&lt;/a&gt;","torrent":{"xt":"urn:btih:c89783f6e9f8902b6ecaa7f774a5096b26fd7c2e","amp;dn":"Action+Comics+v1+812-826+%282004-2005%29+%28digital%29+%28DreamGirl-Novus-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c89783f6e9f8902b6ecaa7f774a5096b26fd7c2e","infoHashBuffer":{"type":"Buffer","data":[200,151,131,246,233,248,144,43,110,202,167,247,116,165,9,107,38,253,124,46]},"announce":[],"urlList":[]}}