{"title":"The Colossal Book of Short Puzzles and Problems","uid":8532857,"size":21388218,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c90e323f87d756f41f2aab89142cf5f5dc446696&amp;dn=The+Colossal+Book+of+Short+Puzzles+and+Problems&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1370198825,"description":"The Colossal Book of Short Puzzles and Problems by Martin Gardner and Dana Richards\nEnglish | 2005-11-28 | ISBN: 0393061140 | 512 pages | PDF | 20 MB\n\nFinally collected in one volume, Martin Gardner's immensely popular short puzzles; along with a few new ones from the master. For more than twenty-five years, Martin Gardner was Scientific American's renowned provocateur of popular math. His yearly gatherings of short and inventive problems were easily his most anticipated math columns. Loyal readers would savor the wit and elegance of his explorations in physics, probability, topology, and chess, among others. Grouped by subject and arrayed from easiest to hardest, the puzzles gathered here, which complement the lengthier, more involved problems in The Colossal Book of Mathematics, have been selected by Gardner for their illuminating; and often bewildering; solutions.\n\nFilled with over 300 illustrations, this new volume even contains nine new mathematical gems that Gardner, now ninety, has been gathering for the last decade. No amateur or expert math lover should be without this indispensable volume; a capstone to Gardner's seventy-year career. 308 illustrations\n","torrent":{"xt":"urn:btih:c90e323f87d756f41f2aab89142cf5f5dc446696","amp;dn":"The+Colossal+Book+of+Short+Puzzles+and+Problems","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c90e323f87d756f41f2aab89142cf5f5dc446696","infoHashBuffer":{"type":"Buffer","data":[201,14,50,63,135,215,86,244,31,42,171,137,20,44,245,245,220,68,102,150]},"announce":[],"urlList":[]}}