{"title":"Sega Archives 2016","uid":15445633,"size":59650682,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c9daae79370ecd2739d270a83386e37b4f8ef09c&amp;dn=Sega+Archives+2016&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Replicant70","files":1,"time":1469879324,"description":"Since its origins as Service Games in the 1940s, Sega has been one of the most influential players in gaming history. From arcades filled with sit-down cabs, market-dominating consoles, an iconic mascot in Sonic the Hedgehog and everything in-between, Sega has certainly had its ups and downs. Sega brought so many new things to the gaming world, including downloadable games way back in 1994 and a motion sensing controller called the Sega Activator. The Mega Drive, know as the Genesis in North America, sold a staggering 30 million units. But Sega’s hopes and dreams came crashing down around its ears with the Dreamcast’s disappointing launch in 1998. It marked the company’s final foray into home consoles and ushered in the era of third-party software development for other gaming platforms. With Sega Archives you can relive Sega’s colourful history, from early coin-op capers and the abandoning of the Master System’s first mascot, Alex Kidd, to the gamble and subsequent failure of the Mega-CD and Mega Drive 32X. We’ve scoured the Retro Gamer archives to bring you amazingly in-depth articles on some of Sega’s biggest games and franchises, as well as looking at the home consoles. It’s the perfect way to celebrate Sega’s timeless achievements.\r\n\r\nSega Archives 2016\r\nEnglish | 180 pages | True PDF | 57.00 MB","torrent":{"xt":"urn:btih:c9daae79370ecd2739d270a83386e37b4f8ef09c","amp;dn":"Sega+Archives+2016","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9daae79370ecd2739d270a83386e37b4f8ef09c","infoHashBuffer":{"type":"Buffer","data":[201,218,174,121,55,14,205,39,57,210,112,168,51,134,227,123,79,142,240,156]},"announce":[],"urlList":[]}}