{"title":"Burning Paradise by Robert Charles Wilson","uid":9146223,"size":366343,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c9e25d56f27deddb16ce415817b63c7cde1e8088&amp;dn=Burning+Paradise+by+Robert+Charles+Wilson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"420weedman","files":1,"time":1383601332,"description":"From Robert Charles Wilson, the author of the Hugo-winning Spin, comes Burning Paradise, a new tale of humans coming to grips with a universe of implacable strangeness. Cassie Klyne, nineteen years old, lives in the United States in the year 2015 - but it's not our United States, and it's not our 2015.\n\nCassie's world has been at peace since the Great Armistice of 1918. There was no World War II, no Great Depression. Poverty is declining, prosperity is increasing everywhere; social instability is rare. But Cassie knows the world isn't what it seems. Her parents were part of a group who gradually discovered the awful truth: that for decades - back to the dawn of radio communications - human progress has been interfered with, made more peaceful and benign, by an extraterrestrial entity. That by interfering with our communications, this entity has tweaked history in massive and subtle ways. That humanity is, for purposes unknown, being farmed.\n\nCassie's parents were killed for this knowledge, along with most of the other members of their group. Since then, the survivors have scattered and gone into hiding. Cassie and her younger brother Thomas now live with her aunt Nerissa, who shares these dangerous secrets. Others live nearby. For eight years they have attempted to lead unexceptional lives in order to escape detection. The tactic has worked.\n\nUntil now. Because the killers are back. And they're not human.\nGenre: Science Fiction, Alternate History","torrent":{"xt":"urn:btih:c9e25d56f27deddb16ce415817b63c7cde1e8088","amp;dn":"Burning+Paradise+by+Robert+Charles+Wilson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9e25d56f27deddb16ce415817b63c7cde1e8088","infoHashBuffer":{"type":"Buffer","data":[201,226,93,86,242,125,237,219,22,206,65,88,23,182,60,124,222,30,128,136]},"announce":[],"urlList":[]}}