{"title":"Sherlock Holmes - Audio Drama - 128k - MP3 -","uid":8635245,"size":3370097233,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:cadadb34add8b4900a4225d1c504b5a1d60d6a4b&amp;dn=Sherlock+Holmes+-+Audio+Drama+-+128k+-+MP3+-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Wldsthrnboy","files":-1,"time":1372726350,"description":"+8\n \n0\nSherlock Holmes - Audio Drama - 128k - MP3 -\nseeders: 0leechers: 0\nDOWNLOAD TORRENT\nAdded on Feb 3, 2009 by  Wldsthrnboy8117 in Books &gt; Audio books\t\nTorrent verified.\tDownloaded 0 times.\nMAIN\n \nTECHNICAL\n \nCOMMENTS 5\nadd torrent to bookmarks add torrent to your personal rss feed\nSherlock Holmes - Audio Drama - 128k - MP3 - (Size: 3.14 GB)\n \t\t01 - Sherlock Holmes - A Study In Scarlet - Revenge.mp3\t51.63 MB\n \t\t02 - Sherlock Holmes - A Study In Scarlet - The Country Of The Saints.mp3\t51.47 MB\n \t\t03 - Sherlock Holmes - The Sign Of The Four - Timbertoe.mp3\t52.28 MB\n \t\t04 - Sherlock Holmes - The Sign Of The Four - The Great Agra Treasure.mp3\t52.04 MB\n \t\t05 - The Adventures Of Sherlock Holmes - A Scandal In Bohemia.mp3\t39.38 MB\n \t\t06 - The Adventures Of Sherlock Holmes - The Red-Headed League.mp3\t40.61 MB\n \t\t07 - The Adventures Of Sherlock Holmes - A Case Of Identity.mp3\t40.3 MB\n \t\t08 - The Adventures Of Sherlock Holmes - The Boscombe Valley Mystery.mp3\t40.19 MB\n \t\t09 - The Adventures Of Sherlock Holmes - The Five Orange Pips.mp3\t38.87 MB\n \t\t10 - The Adventures Of Sherlock Holmes - The Man With The Twisted Lip.mp3\t40.36 MB\n \t\t11 - The Adventures Of Sherlock Holmes - The Adventure Of The Blue Carbuncle.mp3\t38.56 MB\n \t\t12 - The Adventures Of Sherlock Holmes - The Adventure Of The Speckled Band.mp3\t40.57 MB\n \t\t13 - The Adventures Of Sherlock Holmes - The Adventure Of The Engineer's Thumb.mp3\t39.6 MB\n \t\t14 - The Adventures Of Sherlock Holmes - The Adventure Of The Noble Bachelor.mp3\t40.41 MB\n \t\t15 - The Adventures Of Sherlock Holmes - The Adventure Of The Beryl Coronet.mp3\t40.35 MB\n \t\t16 - The Adventures Of Sherlock Holmes - The Adventure Of The Copper Beeches.mp3\t40.37 MB\n \t\t17 - The Memoirs Of Sherlock Holmes - Silver Blaze.mp3\t40.57 MB\n \t\t18 - The Memoirs Of Sherlock Holmes - The Adventure Of The Yellow Face.mp3\t39.88 MB\n \t\t19 - The Memoirs Of Sherlock Holmes - The Stock-Broker's Clerk.mp3\t39.75 MB\n \t\t20 - The Memoirs Of Sherlock Holmes - The Gloria Scott.mp3\t40.14 MB\n \t\t21 - The Memoirs Of Sherlock Holmes - The Musgrave Ritual.mp3\t40.01 MB\n \t\t22 - The Memoirs Of Sherlock Holmes - The Adventure Of The Reigate Squires.mp3\t40.27 MB\n \t\t23 - The Memoirs Of Sherlock Holmes - The Adventure Of The Crooked Man.mp3\t40.58 MB\n \t\t24 - The Memoirs Of Sherlock Holmes - The Resident Patient.mp3\t38.15 MB\n \t\t25 - The Memoirs Of Sherlock Holmes - The Greek Interpreter.mp3\t39.94 MB\n \t\t26 - The Memoirs Of Sherlock Holmes - The Naval Treaty.mp3\t40.49 MB\n \t\t27 - The Memoirs Of Sherlock Holmes - The Final Problem.mp3\t40.32 MB\n \t\t28 - The Return Of Sherlock Holmes - The Adventure Of The Empty House.mp3\t40.63 MB\n \t\t29 - The Return Of Sherlock Holmes - The Adventure Of The Norwood Builder.mp3\t40.39 MB\n \t\t30 - The Return Of Sherlock Holmes - The Adventure Of The Dancing Men.mp3\t39.62 MB\n \t\nâ–¼And 49 files more\nDescription\nArthur Conan Doyle's fictional detective is one of the most enduring popular sleuths of all time. Gathered together in this striking collector's box set is all the Arthur Conan Doyle stories and novels featuring Holmes &amp; Watson - an impressive accomplishment! The entire 48-hour series features the same expert team of directors, producers, dramatizers, and leading actors - including Clive Merrison as Holmes and Michael Williams as Watson. Acclaim for this work has been widespread: &quot;A remarkable undertaking - the dramatization of all 56 Sherlock Holmes short stories. Applauding them, and particularly Clive Merrison's Holmes, made my hands sore.&quot; - Peter Davalle, The Times (London).\n\nThis collection is a welcome addition to the library of any Doyle aficionado, and will provide hours of unrivaled entertainment.\n\nPresented on 64 CDs, 48 hours, and featuring a Full Cast.\n\nAll discs ripped with EAC to perfect flac, then transcoded with dBPoweramp to 192 CBR\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/List_of_BBC_Radio_Sherlock_Holmes_dramatisations&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/List_of_BBC_Radio_Sherlock_Holmes_dramatisations&lt;/a&gt;","torrent":{"xt":"urn:btih:cadadb34add8b4900a4225d1c504b5a1d60d6a4b","amp;dn":"Sherlock+Holmes+-+Audio+Drama+-+128k+-+MP3+-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cadadb34add8b4900a4225d1c504b5a1d60d6a4b","infoHashBuffer":{"type":"Buffer","data":[202,218,219,52,173,216,180,144,10,66,37,209,197,4,181,161,214,13,106,75]},"announce":[],"urlList":[]}}