{"title":"the lacanian left.yannis stavrakakis.2007.pdf","uid":10131838,"size":2436778,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cb651ab22d359ae6200226416334f8192c8fb3c4&amp;dn=the+lacanian+left.yannis+stavrakakis.2007.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"sswbzh01","files":1,"time":1399890375,"description":"The Lacanian Left: Psychoanalysis, Theory, and Politics (Suny Series in Psychoanalysis and Culture)\nby Yannis Stavrakakis\n\nHardcover: 320 pages\nPublisher: State Univ of New York Pr (August 9, 2007)\nLanguage: English\nISBN-10: 0791473295\nISBN-13: 978-0791473290\nProduct Dimensions: 9.2 x 6.5 x 1.2 inches \n\nIn recent years psychoanalysis--especially Lacanian theory--has been gradually acknowledged as a vital resource in the ongoing reorientation of contemporary political theory and analysis. Of particular note is that the work of Jacques Lacan is increasingly being used by major political philosophers associated with the Left. This indicates the dynamic emergence of a new theoretico-political horizon: that of the &quot;Lacanian Left.&quot; However, this field has yet to be properly conceived as a field, and this is the first book to bring it into academic consciousness and to systematically draw its implications for concrete political analysis. This book offers an accessible mapping of its main contours; a detailed examination of the convergences and divergences between the major figures active within or at the periphery of this terrain, including Slavoj Zizek, Ernesto Laclau, Alain Badiou, and Cornelius Castoriadis; and a critical evaluation of their respective arguments on social construction and the political, affectivity and discourse, ethics and social change, and negativity and positivity.\n\nEngaging with the role of affect and emotion in political life through the central Lacanian notion of &quot;enjoyment,&quot; The Lacanian Left puts forward innovative analyses of political power and authority, nationalism, European identity, consumerism and advertising culture, and de-democratization and post-democracy. It will be of value to everyone interested in exploring the potential of psychoanalysis in reinvigorating political theory, critical political analysis, and democratic politics. ","torrent":{"xt":"urn:btih:cb651ab22d359ae6200226416334f8192c8fb3c4","amp;dn":"the+lacanian+left.yannis+stavrakakis.2007.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb651ab22d359ae6200226416334f8192c8fb3c4","infoHashBuffer":{"type":"Buffer","data":[203,101,26,178,45,53,154,230,32,2,38,65,99,52,248,25,44,143,179,196]},"announce":[],"urlList":[]}}