{"title":"Blu Notte - Morte di un poeta - P.P.Pasolini [TVrip Mpeg Ita] [T","uid":5571977,"size":737089536,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:cc3e63afe2101b787bb90c5f245276d2e87aded8&amp;dn=Blu+Notte+-+Morte+di+un+poeta+-+P.P.Pasolini+%5BTVrip+Mpeg+Ita%5D+%5BT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"l.diliberto","files":1,"time":1274274032,"description":" &lt;a href=&quot;http://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=21786&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=21786&lt;/a&gt;\n\nQuesta ÃƒÂ© la sesta edizione di Blu Notte - dice l'autore Carlo Lucarelli - la terza che abbia a che fare con quelli che chiamiamo misteri italiani, e anche per questo ciclo di puntate mi ÃƒÂ© accaduto di essere colpito da tre cose, e con la stessa intensitÃƒÂ¡ della prima volta.\nLa prima cosa a colpirmi ÃƒÂ© il numero di misteri che appartengono alla nostra storia nazionale. Ogni anno stiliamo una lista che sembra non voler finire piÃƒÂº, e ogni volta dobbiamo fare una scelta molto ponderata per rimandare casi altrettanto importanti ad un altro anno. La storia d'Italia ha una metÃƒÂ¡ oscura non solo molto profonda, ma anche molto vasta.\nLa seconda cosa ÃƒÂ¨ come tutti questi casi possano essere raccontati con le chiavi e le strutture della narrativa in generale e quella gialla in particolare. Storie che sembrano romanzi, storie che sembrano romanzi gialli. Non ÃƒÂ© una bella cosa, significa che trame, intrighi, colpi di scena, depistaggi, omicidi e drammi umani, abbondano nelle nostre vicende reali come in un libro giallo, tanto che potrebbero essere state scritte da maestri del noir e del romanzo di spionaggio come James Ellroy, John Le CarrÃƒÂ©Ã‚Â¨ o Giorgio Scerbanenco. Il problema ÃƒÂ© che sono vicende reali, realmente accadute, che invece di nutrire semplicemente il nostro immaginario hanno influenzato concretamente la nostra vita, individuale e collettiva.\nLa terza cosa ÃƒÂ© che a studiare i misteri italiani, a leggere tutte le carte e gli esiti dei processi, anche quelli che assolvono tutti, ci si rende conto che contrariamente a quanto pensiamo noi, di quelle vicende misteriose, sappiamo molte cose. VeritÃƒÂ¡ , anche giudiziarie, fatti accertati, ricostruzioni storiche che dicono tanto, che permettono di farsi un'idea di quello che ÃƒÂ© successo, una veritÃƒÂ¡ del buon senso, che anche se non potrÃƒÂ¡ avere esiti giudiziari, dovrÃƒÂ¡ avere necessariamente il suo posto nella Storia, quella con la esse maiuscola, e nelle coscienze dei cittadini.&quot;\n\n========================================\n\n.: Dati tecnici del file :.\n\nVideo Codec:mpeg4\nVideo Bitrate:1095kb/s\nRisoluzione: 512x400\nFPS: 25\n\nAudio Codec: mp3\nAudio Bitrate: 118kb/s\nFreq Audio: 48KHz","torrent":{"xt":"urn:btih:cc3e63afe2101b787bb90c5f245276d2e87aded8","amp;dn":"Blu+Notte+-+Morte+di+un+poeta+-+P.P.Pasolini+%5BTVrip+Mpeg+Ita%5D+%5BT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc3e63afe2101b787bb90c5f245276d2e87aded8","infoHashBuffer":{"type":"Buffer","data":[204,62,99,175,226,16,27,120,123,185,12,95,36,82,118,210,232,122,222,216]},"announce":[],"urlList":[]}}