{"title":"HISTORY OF POP AND ROCK MUSIC - part 536","uid":9243774,"size":365954886,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:cc430c12f7bc963330dbc9f53a3b0fd13acdb060&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+536&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zlatkopupovac","files":-1,"time":1385334533,"description":" \n\n\n                    PART  536\n\n\n\n           REBECCA FERGUSON  -  Backtrack  (2012)\n           REBECCA FERGUSON  -  Glitter &amp; Gold  (2012)\n                              \n\n\n    &quot;Backtrack&quot; is a song recorded by British soul recording artist Rebecca Ferguson, taken as the lead single from the deluxe edition of her debut album &quot;Heaven&quot; (2012). The song was written by Ferguson and Jonny Lattimer, who produced the track with Tim Baxter as well. The song was released on 14 October 2012 in the United Kingdom, the day before the release of the deluxe edition of Heaven. The single already features as a bonus track on the U.S. version of Heaven. &quot;Backtrack&quot; contains elements of soul, jazz and pop. The single entered the UK Singles Chart at number 15, making it Ferguson's second top twenty hit.\n    &quot;Glitter &amp; Gold&quot;  was released in the United Kingdom on 29 April 2012. The song was written by Rebecca Ferguson herself, Alex Smith and Paul Barry, and it was produced by Smith and Mark Taylor. The song &quot;Glitter &amp; Gold&quot; has received positive views from critics. Digital spy rated the song 4 out of 5 stars. They reviewed the song as &quot;tame by Adele's standards&quot;, and said the song is &quot;as sour as Rebecca gets&quot; when she has ended a relationship with her boyfriend. The Guardian described the single as &quot;lovely&quot; livened up with &quot;a Mark Ronson-esque arrangement&quot;.The song debuted at 164 on the UK Singles Chart, but climbed up to 116 after Ferguson performed the song on Alan Carr's Chatty Man. The song has, so far, peaked higher than Too Good To Lose, which peaked at number 186. The song also charted on the Irish Singles Chart at 65. To add to this, the song has also charted at number peaked at 27 in Italy, and peaked at 36 so far in the Swiss Singles Chart.","torrent":{"xt":"urn:btih:cc430c12f7bc963330dbc9f53a3b0fd13acdb060","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+536","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc430c12f7bc963330dbc9f53a3b0fd13acdb060","infoHashBuffer":{"type":"Buffer","data":[204,67,12,18,247,188,150,51,48,219,201,245,58,59,15,209,58,205,176,96]},"announce":[],"urlList":[]}}