{"title":"Schubert String Quintet in C D 956 Guarneri Greenhouse","uid":10747763,"size":245047264,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:cd7458def1a1c865527e56f3c45e4f0ea3f8c91d&amp;dn=Schubert+String+Quintet+in+C+D+956+Guarneri+Greenhouse&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"magneez","files":5,"time":1407839472,"description":"FLAC+CUE, covers\n\nrandom amazon review:\nAlthough recorded in June 1990, this version was released only in 1993. Maybe Philips considered that there was too much of a glut of new recordings of Schubert's Quintet at the opening of the decade. 1990 saw the release or recording of the Chamber Music Society of the Lincoln Center, the St. Luke's Chamber Ensemble, Quartetto Academica, Ensemble Villa Musica for the budget Naxos, Archibudelli on period instruments and Emerson Quartet with Rotropovich, and it might have seemed enough (see product links in the comments section).\n\nThe Guarneris had already recorded Schubert's Quintet, in 1975, with second cellist Leonard Rose: an interesting version for precisely what made it exceptionable, a grimness of approach (not out of situation in Schubert's valedictory chamber music masterpiece, but one that some listeners found &quot;unsmiling&quot; - and indeed it was) and a certain tonal greyness, with acoustics that were very clear and analytical, but close-up and dry (Schubert: String Quintet D. 956; Quartettsatz D. 703).\n\nThe personel hasn't changed in the intervening 15 years, with only guest Bernard Greenhouse (otherwise the cellist of the Beaux-Arts Trio) substituting for Leonard Rose (and Greenhouse's third recording, after the two he made with the Juilliard Quartet in 1972 and 1986, and before the live one with the Vellinger Quartet in 1997), so maybe it is not surprising that the new version is strikingly similar in its approach to the previous one, but with much more natural-sounding (but somewhat less detailed) acoustics.","torrent":{"xt":"urn:btih:cd7458def1a1c865527e56f3c45e4f0ea3f8c91d","amp;dn":"Schubert+String+Quintet+in+C+D+956+Guarneri+Greenhouse","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd7458def1a1c865527e56f3c45e4f0ea3f8c91d","infoHashBuffer":{"type":"Buffer","data":[205,116,88,222,241,161,200,101,82,126,86,243,196,94,79,14,163,248,201,29]},"announce":[],"urlList":[]}}