{"title":"U2 - The Best Of 1990-2000 &amp; B-Sides (2002) WMA320","uid":6157694,"size":352248944,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cd932b9b00140e8cbdd4e904f6fc36ad06a65f53&amp;dn=U2+-+The+Best+Of+1990-2000+%26+B-Sides+%282002%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1297097352,"description":"Let's break it down: \n\n[The New Tracks] \n\nWhat would a greatest hits collection be without two new songs? I never understood the irony of including new tracks that would probably never be hits on such a project but I, like the rest of you, hunger greatly for any new U2 material so I won't be complaining too loudly. \n\nThat said, the two new songs here are &quot;Electrical Storm&quot; and &quot;The Hands That Built America.&quot; The former is a beautiful, lushly produced number that would have fit in well on All That You Can't Leave Behind. It has the passion, the intensity, and the memorable melody that would definitely make it a highlight in U2 concerts (if they would ever play it!). The latter comes to us described as the &quot;Theme From `Gangs Of New York',&quot; a Scorcese film expected later this year. It's a good track but it definitely seems like the bourgeoisie party guest at the socialite soiree. \n\nHere's my gripe, though. The previous collection (U2 - The Best Of 1980-1990) contained only one new track (&quot;Sweetest Thing&quot;) and that song had been written in the time span covered during The Joshua Tree sessions. It stood up well stylistically in that release and it was something new for people who had all the rest of the songs. The two new tracks on The Best Of 1990-2000 &amp; B-Sides however are brand spanking new from 2002. &quot;Electrical Storm&quot; would certainly have fit in well on Vertigo and &quot;Hands&quot; will easily be the high profile single on the &quot;Gangs Of New York&quot; soundtrack. Certainly a band as prolific as U2 could have rerecorded two songs from somewhere in the 1990-2000 time period for inclusion on this project. \n\n[The Greatest Hits] \n\nFourteen other tracks fill out the rest of the disc, covering Achtung Baby, Zooropa, Passengers, Pop, and All That You Can't Leave Behind with a Batman tune thrown in for good measure, but more on that later. Out of these songs, we are treated to four new mixes of classic songs, two of which are better than the originals (&quot;Gone&quot; and the oft misunderstood &quot;Discotheque&quot;), one mundane (&quot;Staring At The Sun&quot;) and one which should never again see the light of day (&quot;Numb&quot;). \n\nThe rest represent the period well but sparsely in my opinion, as any U2 fanatic would have a hard time picking only fourteen songs to highlight this era. The Bat-tune &quot;Hold Me, Thrill Me, Kiss Me, Kill Me&quot; is the only throwaway here, likely included because no one bought the Batman Forever soundtrack rather than for its quality. Standout tracks are &quot;Until The End Of The World&quot; (one of their finest ever), &quot;The First Time,&quot; and &quot;Miss Sarajevo&quot; from the overlooked Passengers album/experiment. \n\n&quot;Beautiful Day&quot; and &quot;Stuck In A Moment You Can't Get Out Of&quot; are the only guests from the latest release (ATYCLB) and don't flow as well in the mix as the rest of the tracks on this disc. Since these songs were released in 2000, I feel that they would have been better served on the next obvious collection, The Best Of 2000-2010. That would have left room for some of the more unassuming gems like &quot;Acrobat&quot; and &quot;Wake Up Dead Man,&quot; tracks which are sorely missed here by this reviewer. It also would have fit well thematically, since the `90s represented a time of excess and contradictions for U2 where ATYCLB starts a new period focused upon grace, hope, and ultimately redemption. \n\n[The B-Sides] \n\nThe second disc of this collection contains a whopping fourteen tracks of new mixes and hard-to-find previous releases. There's a more raw version of &quot;Electrical Storm&quot; here that's worth some spins as well as a violent industrial Beatles cover (&quot;Happiness Is A Warm Gun&quot;) and a gospel tinged, Studio 54 techno remix of &quot;Even Better Than The Real Thing&quot; that would make even the hardest cynic smile and get down. It's definitely worth the extra $5 to get this second disc as well as a bonus DVD. \n\n[The Verdict] \n\nSo is it great? Of course it is. Could it have been more? Without question! I think the powers that be at Island Records got lazy when it came to this release - they should have let U2 go nuts in the studio with some of their older material and included that since this is supposed to be a period piece. Granted, no two fans of the band would pick the same track list and that's the hit-or-miss (pun intended) quality of such a project. But let's hope that they put more thought into it next time. \n\nby Eric Bieger\n\nTRACKLIST:\nDisc 1:\n01 - Even Better Than The Real Thing.wma                         \n02 - Mysterious Ways.wma                                         \n03 - Beautiful Day.wma                                           \n04 - Electrical Storm (William Orbit Mix).wma                    \n05 - One.wma                                                     \n06 - Miss Sarajevo.wma                                           \n07 - Stay (Faraway, So Close!).wma                               \n08 - Stuck In A Moment You Can't Get Out Of.wma                  \n09 - Gone (New Mix).wma                                          \n10 - Until The End Of The World.wma                              \n11 - The Hands That Built America.wma                            \n12 - Discotheque (New Mix).wma                                   \n13 - Hold Me, Thrill Me, Kiss Me, Kill Me.wma                    \n14 - Staring At The Sun (New Mix).wma                            \n15 - Numb (New Mix).wma                                          \n16 - The First Time.wma    \n\nDisc 2:\n01 - Lady With The Spinning Head (Extended Dance Mix).wma        \n02 - Dirty Day (Junk Day Mix).wma                                \n03 - Summer Rain.wma                                             \n04 - Electrical Storm.wma                                        \n05 - North And South Of The River.wma                            \n06 - Your Blue Room.wma                                          \n07 - Happines Is A Warm Gun (The Gun Mix).wma                    \n08 - Salome (Zooromancer Remix).wma                              \n09 - Even Better Than The Real Thing (The Perfecto Mix).wma      \n10 - Numb (Gimme Some More Dignity Mix).wma                      \n11 - Mysterious Ways (Solar Plexus Club Mix).wma                 \n12 - If God Will Send His Angels (Big Yam Mix).wma               \n13 - Lemon (Jeep Mix).wma                                        \n14 - Discotheque (Hexidecimal Mix).wma  \n\nWMA 320Kbps 44100Hz STEREO","torrent":{"xt":"urn:btih:cd932b9b00140e8cbdd4e904f6fc36ad06a65f53","amp;dn":"U2+-+The+Best+Of+1990-2000+%26+B-Sides+%282002%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd932b9b00140e8cbdd4e904f6fc36ad06a65f53","infoHashBuffer":{"type":"Buffer","data":[205,147,43,155,0,20,14,140,189,212,233,4,246,252,54,173,6,166,95,83]},"announce":[],"urlList":[]}}