{"title":"Heroes Rise: HeroFall","uid":12959854,"size":28508568,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:cda2d7e7b7e26b28c189159193c88e28f9dc87fe&amp;dn=Heroes+Rise%3A+HeroFall&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dauphong","files":1,"time":1449835669,"description":"Would a hero like you assassinate the president of the United States to defend the right to be Powered?\r\n\r\nAs the corrupt President Victon launches his oppressive campaign of Powered Regulation, your Legendary heroic rise transforms into something much more: you must become a political icon fighting to restore Powered rights in America. This new battle takes a twisted turn when your once-greatest enemy, Prodigal, tells you President Victon’s darkest secret....\r\n\r\nNow you are faced with the biggest choices of your career: Do you trust the word of your archenemy? Will you evade President Victon's gang of criminal bounty hunters? Can you save your family and complete your rise as a Legendary hero?\r\n\r\n&quot;Heroes Rise: HeroFall&quot; completes the epic Heroes Rise trilogy by Zachary Sergi, featuring the smash hits &quot;Heroes Rise: The Prodigy&quot; and &quot;Heroes Rise: The Hero Project,&quot; interactive novels where your choices control the story. The Heroes Rise trilogy is entirely text-based—without graphics or sound effects—and driven by the vast, unstoppable power of your imagination.\r\n\r\nAll of your decisions lead to this epic conclusion, where you must truly define what you believe is right and what you stand for as a hero—and what (or whom) you’re willing to sacrifice for those ideals. Play as male or female, gay or straight, and decide how your story will end. How many alternate endings can you unlock?\r\nHow High Will You Rise?\r\n\r\n    Over 118,000 words\r\n    Play as gay or straight, male or female\r\n    Five possible romance options\r\n    Save your parents from the Devoid prison for Powered criminals\r\n    Unleash your mysterious &quot;Infini&quot; powers","torrent":{"xt":"urn:btih:cda2d7e7b7e26b28c189159193c88e28f9dc87fe","amp;dn":"Heroes+Rise%3A+HeroFall","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cda2d7e7b7e26b28c189159193c88e28f9dc87fe","infoHashBuffer":{"type":"Buffer","data":[205,162,215,231,183,226,107,40,193,137,21,145,147,200,142,40,249,220,135,254]},"announce":[],"urlList":[]}}