{"title":"Bodil Martensson - Greppet - 2010 - DAISY","uid":6814076,"size":301641148,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ce03103cfcafbeadf866856e657fae28022b583f&amp;dn=Bodil+Martensson+-+Greppet+-+2010+-+DAISY&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ssslaaark","files":-1,"time":1321132104,"description":"\nSa otroligt harligt det var, tankte Helena, att simma har ute pa djupt vatten.\nHerregud, vad var det? Foten, hon... Foten satt plotsligt fast - som i ett skruvstad! Det gjorde sa ont, hade hon fastnat mellan stenar?\nMen... stenar ror sig inte.\nEtt kraftfullt ryck drog henne under ytan, ner mot den morka bottnen...\n\nDet var en riktigt varm och skon var i skane, ja i hela landet. Manga, sarskilt de unga och varmblodiga, inledde dodsforaktande badsasongen rekordtidigt det aret - artonariga Helana Berning var en av dem.\n\nTriton har en stor passion. Han alskar att leka gud i havet. Njuter av att avgora - vem som ska fa leva och vem som ska do. Triton har tidigare utovat sin passion i frammande lander, men odet tvingar honom byta jaktmarker. Skanska badstrander blir i ett slag veritabla mordfallor.\n\nLiam James har en stark affarsidÃƒÂ©. Han avgor inte vem som ska do, men erbjuder for pengar en genial metod att verkstalla dodsdomen. Liam James har tvingats lamna en framgangsrik karriar inom Provisoriska IRA och hittat en halsosammare vistelseort - lilla Paarp utanfor Helsingborg.\n\nTva man med helt olika bakgrund, men lika hansynslosa.\nGemensamt har de - greppet.\nBada drabbar nordvastra skane samtidigt, och forodande som en jordbavning.\n\nKriminalkommissarie Joakim Hill vid Helsingborgspolisen kanner vanmakten ta strupgrepp. Han tvingas offra familjen. Bildligt... och bokstavligt! \n\n\nUpplasare: Dodo Parikas","torrent":{"xt":"urn:btih:ce03103cfcafbeadf866856e657fae28022b583f","amp;dn":"Bodil+Martensson+-+Greppet+-+2010+-+DAISY","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce03103cfcafbeadf866856e657fae28022b583f","infoHashBuffer":{"type":"Buffer","data":[206,3,16,60,252,175,190,173,248,102,133,110,101,127,174,40,2,43,88,63]},"announce":[],"urlList":[]}}