{"title":"How to Create an Awesome Online Course","uid":8747911,"size":1608881082,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:ce4c204c508310d46054676185b05f0036abdb4a&amp;dn=How+to+Create+an+Awesome+Online+Course&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"angelos2225","files":-1,"time":1374968473,"description":"How to Create an Awesome Online Course\n========================================\nby Miguel Hernandez\n\nIf you have any skill and like to teach, trust me, someone is wanting to learn from you right now, and in many cases, even willing to pay for it.\nLast year I made over $90,000 US selling one course alone (This One). In this course you'll learn with all detail exactly how I made that happen so you can do the same.\nI will teach you how to create your own online course, make it look awesome, promote it, sell it, and make money with it.\nSounds good? well here is exactly what we will cover:\n\n---Getting started: how to break down your course, all the tools you can use to create a course, and how to make it interesting so people actually listen!\n---Creating a great course: I'll teach you how to create a super cool presentation using Keynote\n---Recording your course: once you create your presentation you need to record it. I'll teach you how to use ScreenFlow for Mac to record your computer screen and yourself and how to edit it all together.\n---How to promote your course: once you have created your course it is time world know it exists! I'll teach you the most efficient ways to promote your course and find students.\n---Making money selling your course: how much to charge for your course? I'll teach you how to create a great sales page for your course, how to use PayPal to make money selling your course, finding affiliates, and much more!\n\nJust like you I have invested zillions of dollars and many years educating myself, learning new skills. It's time to share that hard earned knowledge with the world and creating an online course is one of the best ways to do so, reach thousands of people and why not make some money on the side.\n\nAre you ready? Let's do it!\nCategory: Education","torrent":{"xt":"urn:btih:ce4c204c508310d46054676185b05f0036abdb4a","amp;dn":"How+to+Create+an+Awesome+Online+Course","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce4c204c508310d46054676185b05f0036abdb4a","infoHashBuffer":{"type":"Buffer","data":[206,76,32,76,80,131,16,212,96,84,103,97,133,176,95,0,54,171,219,74]},"announce":[],"urlList":[]}}