{"title":"Sexually Broken--Jennifer White is Category 5 fucked on the couc","uid":8103021,"size":1114168381,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:ce87b3c78ad4a74b88d32a853f4425057e0052d7&amp;dn=Sexually+Broken--Jennifer+White+is+Category+5+fucked+on+the+couc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"merzedes","files":-1,"time":1360017160,"description":"Jennifer White is Category 5 fucked on the couch. Manhandled into submission and brutal orgasms. | Jennifer White | Matt Williams\n\nFebruary 4, 2013 \n \n\nMP4 only.\n\n \nAll natural and seductive is a pretty good description of Jennifer White, that and beautiful to boot. We have Jennifer back and plan on manhandling and using that sexy body of hers to the extreme. Sexually Broken is the best Bondage and consensual rough sex site in the world. \n\nStrictly, but comfortably, bound in a modified Japanese box tie, Jennifer is helpless and at our mercy. With this tie we can toss and manhandle Jennifer into any postion we want, quickly and efficiently. \n\nStanding and bent over the hard cock, Jennifer is busy with a throat full. Her perfect ass is sticking out as we deep throat fuck her at will. Jennifer is very special when it comes to her cock sucking abilities and we are going to abuse that talent. We bring Jennifer up on the bed and on to her knees, so we can better control her. \n\nWe tear up Jennifer's throat. Deep hard throat fucking, we hold those balls deep. We blast Jennifer into subspace from the intense face fucking. Without warning we flip Jennifer on to her back and jam the hard cock into her wet shave pussy, within seconds she cums, and cums hard. \n\nWhat happens next is a whirlwind of brutal sex. From pussy fucking to skull fucking, we never give Jennifer a chance to catch her breath. She is manhandled back and forth in a frenzy of orgasms and deep throat fucking, over and over, a non stop carousel of hard cock. Jennifer has that vacant look girls get when they cum so hard and so much. She is a mindless sex machine getting drilled and drilled well. \n \nScreens   &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/02_04jwhite2/SexuallyBroken-Jennifer-White-Matt-Williams-Jennifer-White-is-Category-5-fucked-on-the-couch-Manhandled-into-submission-and-brutal-orgasms.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/02_04jwhite2/SexuallyBroken-Jennifer-White-Matt-Williams-Jennifer-White-is-Category-5-fucked-on-the-couch-Manhandled-into-submission-and-brutal-orgasms.php&lt;/a&gt;\n\n9000 uploads and counting, 10k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:ce87b3c78ad4a74b88d32a853f4425057e0052d7","amp;dn":"Sexually+Broken--Jennifer+White+is+Category+5+fucked+on+the+couc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce87b3c78ad4a74b88d32a853f4425057e0052d7","infoHashBuffer":{"type":"Buffer","data":[206,135,179,199,138,212,167,75,136,211,42,133,63,68,37,5,126,0,82,215]},"announce":[],"urlList":[]}}