{"title":"Shop Til You Drop","uid":5867399,"size":611451333,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:cf9c8e47a115d17b5ca53e26e94cfe57c126324e&amp;dn=Shop+Til+You+Drop&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":1,"time":1286264171,"description":"MEF - Media Education Foundation\n\nShop \\\\\\\\\\\\\\'Til You Drop\nThe Crisis of Consumerism\n\nAre we too materialistic? Are we willfully trashing the planet in our pursuit of things? And what\\\\\\\\\\\\\\'s the source of all this frenetic consumer energy and desire anyway? In a fast-paced tour of the ecological and psychological terrain of American consumer culture, Shop \\\\\\\\\\\\\\'Til You Drop challenges us to confront these questions head-on. Taking aim at the high-stress, high-octane pace of fast-lane materialism, the film moves beneath the seductive surfaces of the commercial world to show how the flip side of accumulation is depletion -- the slow, steady erosion of both natural resources and basic human values. In the end, Shop \\\\\\\\\\\\\\'Til You Drop helps us make sense of the economic turbulence of the moment, providing an unflinching, riveting look at the relationship between the limits of consumerism and our never-ending pursuit of happiness.\n\nPeter Whybrow, author of American Mania: When More is Not Enough\nJuliet B. Schor, author of The Overspent American\nCecile Andrews, author Slow Is Beautiful\nDuane Elgin, author of Voluntary Simplicity\nChris Jordan, photographic artist\nJames B. Twitchell, Professor of English &amp; Advertising at University of Florida\nJulian Darley, co-founder of the Post Carbon Institute\nEli Jaxon-Bear, author of Sudden Awakening\nRod Gorney, Ashley Montagu Institute\nJohn de Graaf, co-author of Take Back Your Time\nCarol Holst, founder of Postconsumers\nDavid Room, founder of Energy Preparedness \n\nLibrarians: Download and print a DVD Amaray Case Cover if you would like to replace the recycled digipak case.\n\nFilmmaker Info\nProduced, Directed &amp; Edited by Gene Brockhoff\nCinematography &amp; Sound Recording by Jeff Deveraux\nOriginal Music by Jonah Sharp\nPost Audio &amp; Sound Design by B.Z. Lewis\nAnimation &amp; Motion Graphics by Kiko Taganashi\nNarrated by Alex Peterson\n\nFilmmaker\\\\\\\\\\\\\\'s Bio\nGENE BROCKHOFF | Producer &amp; Editor\nGene Brockhoff has no history in film. He has been and still is a flooring contractor who made this film in his spare time. \\\\\\\\\\\\\\&quot;Nobody else was doing films about consumerism, so I thought I\\\\\\\\\\\\\\'d fill the void,\\\\\\\\\\\\\\&quot; he says. \\\\\\\\\\\\\\&quot;It was also a way for me to confront my own desires for materialism.\\\\\\\\\\\\\\&quot; In the making of the film he became very proficient with Apple\\\\\\\\\\\\\\'s editing software Final Cut Pro and did some of the cinematography as well. \\\\\\\\\\\\\\&quot;I discovered a love of editing and the trillions of possibilities. I\\\\\\\\\\\\\\'m a possibility junkie!\\\\\\\\\\\\\\&quot; He is still available in the SF Bay Area for installing and refinishing hardwood flooring in a sustainable and non-toxic way.\n\nScreenings\nAmerican Sociological Association\\\\\\\\\\\\\\'s annual meeting | Atlanta, GA | August 14 - 17, 2010\n\nRelated Links\nThe Theory of the Leisure Class by Thorstein Veblen\nAmerican Mania: When More Is Not Enough by Peter Whybrow\nThe Overspent American: Why We Want What We Don\\\\\\\\\\\\\\'t Need by Juliet B. Schor\nSlow Is Beautiful: New Visions of Community, Leisure and Joie de Vivre by Cecile Andrews\nVoluntary Simplicity: Toward a Way of Life That Is Outwardly Simple, Inwardly Rich by Duane Elgin\nSudden Awakening: Into Direct Realization by Eli Jaxon-Bear\nTake Back Your Time by John de Graaf\nGet Satisfied: How Twenty People Like You Found the Satisfaction of Enough by Carol Holst and Peter Whybrow\nBranded Nation: The Marketing of Megachurch, College Inc., and Museumworld by James B. Twitchell\nHigh Noon for Natural Gas: The New Energy Crisis by Julian Darley\nRunning the Numbers by Chris Jordan\nChris Jordan Photography\nJames B. Twitchell\nPost Carbon Institute\nEnergy Preparedness\nCenter for a New American Dream\n\nPraise for the Film\n\\\\\\\\\\\\\\&quot;[Shop \\\\\\\\\\\\\\'Til You Drop] takes viewers from the Industrial Revolution to the present, concentrating on the 1950s through the 1970s, when women moved into the workforce, celebrity culture saturated the media, and suburban dwellers worked harder than ever to keep up with the Joneses. Now, of course, they work even longer hours and rack up more debt, leading to a host of social problems. Recommended.\\\\\\\\\\\\\\&quot;\n- Video Librarian","torrent":{"xt":"urn:btih:cf9c8e47a115d17b5ca53e26e94cfe57c126324e","amp;dn":"Shop+Til+You+Drop","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf9c8e47a115d17b5ca53e26e94cfe57c126324e","infoHashBuffer":{"type":"Buffer","data":[207,156,142,71,161,21,209,123,92,165,62,38,233,76,254,87,193,38,50,78]},"announce":[],"urlList":[]}}