{"title":"Wikileaks Document Release: Congressional Reports Service Feb 20","uid":4713076,"size":2320496642,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:d0383506a21af5fc117146492676c3ad9ddd4685&amp;dn=Wikileaks+Document+Release%3A+Congressional+Reports+Service+Feb+20&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"man_exec","files":1,"time":1234136372,"description":"February 8, 2009\n\nEDITORIAL\n\nChange you can download.\nWikileaks has released nearly a billion dollars worth of quasi-secret reports commissioned by the United States Congress.\n\nThe 6,780 reports, current as of this month, comprise over 127,000 pages of material on some of the most contentious issues in the nation, from the U.S. relationship with Israel to the financial collapse. Nearly 2,300 of the reports were updated in the last 12 months, while the oldest report goes back to 1990. The release represents the total output of the Congressional Research Service (CRS) electronically available to Congressional offices. The CRS is Congress's analytical agency and has a budget in excess of $100M per year.\n\nOpen government lawmakers such as Senators John McCain (R-Arizona) and Patrick J. Leahy (D-Vermont) have fought for years to make the reports public, with bills being introduced--and rejected--almost every year since 1998. The CRS, as a branch of Congress, is exempt from the Freedom of Information Act.\n\nCRS reports are highly regarded as non-partisan, in-depth, and timely. The reports top the list of the &quot;10 Most-Wanted Government Documents&quot; compiled by the Washington based Center for Democracy and Technology[1]. The Federation of American Scientists, in pushing for the reports to be made public, stated that the &quot;CRS is Congress' Brain and it's useful for the public to be plugged into it,&quot;[2]. While Wired magazine called their concealment &quot;The biggest Congressional scandal of the digital age&quot;[3].\n\nAlthough all CRS reports are legally in the public domain, they are quasi-secret because the CRS, as a matter of policy, makes the reports available only to members of Congress, Congressional committees and select sister agencies such as the GAO.\n\nMembers of Congress are free to selectively release CRS reports to the public but are only motivated to do so when they feel the results would assist them politically. Universally embarrassing reports are kept quiet.\n\nEach time the topic of opening up the reports comes up, it runs into walls erected by opposing lawmakers such as Sen. Ted Stevens (R-Alaska), who &quot;like many members of Congress, views CRS as an extension of his staff,&quot;. If the reports were made public, &quot;every time a member requests a particular document, the public may infer that he's staking out a particular policy position.&quot; (Aaron Saunders, Stevens' spokesman, Washington Post, 2007)[4].\n\nHowever that hasn't stopped a grey market forming around the documents. Opportunists smuggle out nearly all reports and sell them to cashed up special interests--lobbyists, law firms, multi-nationals, and presumably, foreign governments. Congress has turned a blind eye to special interest access, while continuing to vote down public access.\n\nOpposition to public availability comes not only from members of Congress but, also, from within the CRS.\n\nOne might think that the CRS, as an agency of the Library of Congress, would institutionally support having a wider audience. But an internal memo reveals the CRS lobbying against bills (S. Res. 54 and H.R. 3630) which would have given the public access to its reports (Project on Government Secrecy, FAS, 2003)[5].\n\nThe primary line pushed by the CRS is the one that appeals most to Congressional members--open publication would prevent spin control. The memo states this in delicate terms, referring to such spin failures as &quot;Impairment of Member Communication with Constituents&quot;.\n\nOf course the CRS doesn't really care about politicians facing much needed voter discipline, but it does have reasons of its own to avoid public oversight. Institutionally, the CRS has established an advisory relationship with members of Congress similar to the oversight-free relationship established between intelligence agencies and the office of the President.\n\nFree from meaningful public oversight of its work, the CRS, as &quot;Congress's brain&quot;, is able to influence Congressional outcomes, even when its reports contain errors. Arguably, its institutional power over congress is second only to the parties themselves. Public oversight would reduce its ability to exercise that influence without criticism. That is why it opposes such oversight, and that is why such oversight must be established immediately.\n\nIn 1913 Supreme Court Justice Louis Brandeis, a forceful proponent for open government, stated &quot;Sunlight is the best disinfectant; electric light the most efficient policeman&quot;. Those wise words are still true today.\n\nWelcome, Congress, to our generation's electric sun. ","torrent":{"xt":"urn:btih:d0383506a21af5fc117146492676c3ad9ddd4685","amp;dn":"Wikileaks+Document+Release%3A+Congressional+Reports+Service+Feb+20","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0383506a21af5fc117146492676c3ad9ddd4685","infoHashBuffer":{"type":"Buffer","data":[208,56,53,6,162,26,245,252,17,113,70,73,38,118,195,173,157,221,70,133]},"announce":[],"urlList":[]}}