{"title":"Vashti Bunyan - Some Things Just Stick in Your Mind: Singles and","uid":11439461,"size":117357276,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:d11cc2d11d47d8871d853da8f78d149e7e01acd8&amp;dn=Vashti+Bunyan+-+Some+Things+Just+Stick+in+Your+Mind%3A+Singles+and&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"red_paddy","files":25,"time":1415788737,"description":"2007 two CD collection, a comprehensive look back at her early recordings from the period prior to her classic 1970 Just Another Diamond Day album. Some Things... attempts to both draw a line under the past and also to set the record straight regarding the disparity between how Bunyan viewed (and still views) herself and the way the public views her as an artist. This complete collection of Bunyan's 25 existing early recordings is a young London girl's series of beautiful love songs that resonate profoundly via an almost brutal efficiency and honesty. The melodies seem timelessly sweet and addictive, the vision at once delicate but somehow tough as granite. The first disc gathers together the early singles (two of which were unreleased) and a set of demos recorded between 1965 and 1967; the second comprises the entire, unaltered contents of a long-forgotten tape discovered at the last minute before mastering, containing a set of raw, pure, intimate recordings. Dicristina.\n\nThe renewed interest in Vashti Bunyan continues, and has outpaced the attention she initially received in the mid-'60s and a pair of UK singles. Her 1970 album, Just Another Diamond Day, became a touchstone for the likes of Devendra Banhart and Joanna Newsom, and was reissued in 2000. Having left the music business, she returned with her second album in 2005, Lookaftering. This new set doubles her available output. The first disc of the set offers those rare Decca singles (including the title track, penned by Mick Jagger and Keith Richards). These make it clear that, while she's been labeled a folk singer, her writing was decidedly more diverse in its simplicity. Production and arrangement approaches aimed were infused with pop sensibilities, bringing those inclinations to the fore without bending the songs into inappropriate shapes. Intimate and captivating, the second disc is from a long forgotten tape, on which she performs a dozen songs solo, one after another, as a demo in 1964\n\nTrack listing\nCD1\n&quot;Some Things Just Stick in Your Mind&quot; (Jagger/Richards)\n&quot;I Want to be Alone&quot; (Bunyan)\n&quot;Train Song&quot; (Vashti Bunyan, Alasdair Clayre, Jennifer Lewis)\n&quot;Love Song &quot;\n&quot;Winter is Blue&quot;\n&quot;Coldest Night of the Year&quot; (Mann/Weil) (unreleased single &quot;Twice as Much and Vashti&quot;, 1966, album track 1968)\n&quot;I'd Like to Walk Around in Your Mind&quot; (unreleased single, produced by Mike Hurst)\n&quot;Winter is Blue&quot;\n&quot;Girl's Song in Winter&quot; (John Bunyan's tape with Mike Crowther, 1966)\n&quot;If in Winter (100 Lovers)&quot; (John Bunyan's tape with Mike Crowther, 1966)\n&quot;Wishwanderer&quot;\n&quot;Don't Believe&quot; (John Bunyan's tape with Mike Crowther, 1966)\n&quot;17 Pink Sugar Elephants&quot; (John Bunyan's tape with Mike Crowther, 1966)\n&quot;I Won't Say&quot; - ltd. ed. bonus track\n&quot;Girl's Song In Winter&quot; (alt version) - ltd. ed. bonus track\n&quot;If In Winter (100 Lovers)&quot; (alt version) - ltd. ed. bonus track\n&quot;I'd Like to Walk Around In Your Mind&quot; (alt version) - ltd. ed. bonus track\n\nCD2\n&quot;Autumn Leaves&quot;[6]\n&quot;Leave Me&quot;\n&quot;If in Winter (100 Lovers)&quot;\n&quot;How Do I Know&quot;\n&quot;Find My Heart Again&quot;\n&quot;Go Before the Dawn&quot;\n&quot;Girl's Song in Winter&quot;\n&quot;I Don't Know What Love is&quot;\n&quot;Don't Believe What They Say&quot;\n&quot;Love You Now&quot;\n&quot;I Know&quot;\n&quot;Someday&quot;","torrent":{"xt":"urn:btih:d11cc2d11d47d8871d853da8f78d149e7e01acd8","amp;dn":"Vashti+Bunyan+-+Some+Things+Just+Stick+in+Your+Mind%3A+Singles+and","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d11cc2d11d47d8871d853da8f78d149e7e01acd8","infoHashBuffer":{"type":"Buffer","data":[209,28,194,209,29,71,216,135,29,133,61,168,247,141,20,158,126,1,172,216]},"announce":[],"urlList":[]}}