{"title":"Onde AudioBook Converter 1.02.2","uid":7494532,"size":7002535,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:d180ab1df2b21557fce6b70f0ab41dfbb486c5e3&amp;dn=Onde+AudioBook+Converter+1.02.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"openarena","files":-1,"time":1343837747,"description":"Onde AudioBook Converter is an AA converter that can batch convert purchased Audio books or AA flies from iTunes or Audible on Mac OS X to MP3 or AAC format. Then DRM protections on audio book will be removed. The conversion with CD output quality is at up to 12X speeds!\n\nConvert purchased Audio Book playable on iTunes\nAny purchased audio books from itunes or audible, if it could be played on iTunes, can be unlocked and converted to MP3 or AAC, AC3, AIFF, AU, FLAC, M4A, M4R and MKA.\n\nConvert audible aa to MP3 to Play anywhere\nRemove DRM of Audio Books or AA files from iTunes audiobook library to MP3 or AAC format and enjoy it on iPhone 4S, iPod touch, iPad, Sony PSP, smart phone, MP3 player, laptop, portable PC, etc.\n\nRemove DRM protections\nDesigned as an .aa converter and audio book DRM remover, Onde audioBook converter can remove copy-protection (DRM) from Audio Books and convert into unprotected MP3 or AAC format.\n\n12X conversion speed\nOnde audioBook converter Mac can encode and convert audible aa files at speeds of up to 12X.\n\nPreserve ID Tags\nOnde purchased AudioBook Converter will keep ID Tags to the new converted MP3 or AAC files files. Output MP3 or AAC files with CD Quality\nPreset output options like codeck, bitrate, sample rate and channels to get customized MP3 or AAC files with CD Quality. Convert DRM audiobooks in batch\nBatch conversion allows users to select multiple audio book files to convert with just a single button. Silent Recording\nOnde AudioBook Converter works in the background when remove DRM from purchased audio books. Quick access to iTunes folder\nLoading the user's iTunes' folders automatically makes for a quick and seamless user experience. Unlimited converting times\nConvert AA files as many times as you like with Onde AudioBook without limitation of one-time burning to Disc on each authorized Mac.\n\nWhat's New\nVersion 1.02.2:\n\nGreater efficiency, lower CPU utilization\nClick the Fresh button to import all your iTunes audiobooks into Onde AudioBook Converter\n\nRequirements\n\nIntel\nMac OS X 10.6 or later\n\nCredits to Special [K]","torrent":{"xt":"urn:btih:d180ab1df2b21557fce6b70f0ab41dfbb486c5e3","amp;dn":"Onde+AudioBook+Converter+1.02.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d180ab1df2b21557fce6b70f0ab41dfbb486c5e3","infoHashBuffer":{"type":"Buffer","data":[209,128,171,29,242,178,21,87,252,230,183,15,10,180,29,251,180,134,197,227]},"announce":[],"urlList":[]}}