{"title":"The Geek Atlas - 128 Places Where Science &amp; Technology Come ","uid":8548985,"size":26495141,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d2277f824eb136c7877d3b833a34f687aa4255d9&amp;dn=The+Geek+Atlas+-+128+Places+Where+Science+%26amp%3B+Technology+Come+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"gnv65","files":-1,"time":1370597926,"description":"The Geek Atlas - 128 Places Where Science &amp; Technology Come Alive\nby John Graham-Cumming\nO'Reilly Media | May 2009 | ISBN: 978-0-596-52320-6 | PDF | 544 pages | 25.2 mb &lt;a href=&quot;\nhttp://www.amazon.com/The-Geek-Atlas-ebook/dp/B003WUYEN4&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/The-Geek-Atlas-ebook/dp/B003WUYEN4&lt;/a&gt;\n\nThe history of science is all around us, if you know where to look. With this unique traveler's guide, you'll learn about 128 destinations around the world where discoveries in science, mathematics, or technology occurred or is happening now. Travel to Munich to see the world's largest science museum, watch Foucault's pendulum swinging in Paris, ponder a descendant of Newton's apple tree at Trinity College, Cambridge, and more.\nEach site in The Geek Atlas focuses on discoveries or inventions, and includes information about the people and the science behind them. Full of interesting photos and illustrations, the book is organized geographically by country (by state within the U.S.), complete with latitudes and longitudes for GPS devices.\nDestinations include:\n-    Bletchley Park in the UK, where the Enigma code was broken\n-    The Alan Turing Memorial in Manchester, England\n-    The Horn Antenna in New Jersey, where the Big Bang theory was confirmed\n-    The National Cryptologic Museum in Fort Meade, Maryland\n-    The Trinity Test Site in New Mexico, where the first atomic bomb was exploded\n-    The Joint Genome Institute in Walnut Creek, California\nYou won't find tedious, third-rate museums, or a tacky plaque stuck to a wall stating that &quot;Professor X slept here.&quot; Every site in this book has real scientific, mathematical, or technological interest -- places guaranteed to make every geek's heart pound a little faster. Plan a trip with The Geek Atlas and make your own discoveries along the way.\n\nAbout the Author\nJohn Graham-Cumming is a wandering programmer who's lived in the UK, California, New York and France. Along the way he's worked for a succession of technology start-ups, written the award-winning open source POPFile email program and churned out articles for publications such as The Guardian newspaper, Dr Dobbs, and Linux Magazine. His previous effort writing a book was the obscure and self-published computer manual GNU Make Unleashed which saturated its target market of 100 readers. Because he has a doctorate in computer security he's deeply suspicious of people who insist on being called Dr., but doesn't mind if you refer to him as a geek.","torrent":{"xt":"urn:btih:d2277f824eb136c7877d3b833a34f687aa4255d9","amp;dn":"The+Geek+Atlas+-+128+Places+Where+Science+%26amp%3B+Technology+Come+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2277f824eb136c7877d3b833a34f687aa4255d9","infoHashBuffer":{"type":"Buffer","data":[210,39,127,130,78,177,54,199,135,125,59,131,58,52,246,135,170,66,85,217]},"announce":[],"urlList":[]}}