{"title":"7_Wonders_1.0.apk","uid":7624827,"size":4219144,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:d25931f5589f33834ee6e975ca107a24ac725f4a&amp;dn=7_Wonders_1.0.apk&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Waiting55","files":-1,"time":1347411836,"description":"This is an unauthorized port, and has been removed from the play store.\n\n\n\n7 Wonders is a board game created by Antoine Bauza in 2010 and won several prestigious prizes. It is one of the highest rated games on BoardGameGeek.7 Wonders is a card-based civilization game. It uses a card-drafting mechanic where, once per turn, each player selects a card to play from their hand, then passes the remaining cards to the next player. This is repeated until 6 out of the 7 cards dealt have been played. The game is played over three decks representing three ages. At the end of each age, military conflicts are resolved between neighbors. Resource trading is also possible between neighbors throughout the game. Once all three decks have been played, players tally their scores in different developed areas (civil, scientific, commercial). The player with the most points wins. If you are not familiar with the rules of this game, please download them from BoardGameGeek.This implementation lets the user take on 2 to 6 computer opponents. Hot-seat multi-person playing is also possible.The user is encouraged to sharpen his skills by playing for different &quot;wonders&quot;, against a varying number of opponents. Some wonder combinations are harder to master than others.","torrent":{"xt":"urn:btih:d25931f5589f33834ee6e975ca107a24ac725f4a","amp;dn":"7_Wonders_1.0.apk","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d25931f5589f33834ee6e975ca107a24ac725f4a","infoHashBuffer":{"type":"Buffer","data":[210,89,49,245,88,159,51,131,78,230,233,117,202,16,122,36,172,114,95,74]},"announce":[],"urlList":[]}}