{"title":"Alma Mater - Music From The Vatican","uid":5187450,"size":64144367,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d2f8e964a2663e032d5e73a51295db6a0bc84986&amp;dn=Alma+Mater+-+Music+From+The+Vatican&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"an32thj","files":-1,"time":1259528805,"description":"Alma Mater: Featuring The Voice of Pope Benedict XVI\n\n\n  1. Sancta Dei Genitrix\t 6:39\t\t  \n  2. Mater Ecclesiae\t         5:23\t\n  3. Advocata Nostra\t         5:41\t\n  4. Benedicta Tu\t         6:39\t\t\n  5. Causa Nostrae Laetitiae\t 6:33\t\n  6. Auxilium Christianorum\t 4:04\t\n  7. Regina Coeli\t         6:52\t\n  8. Magistra Nostra             7:44\n\nDecca Records\n\n\n\nAlma Mater is a stirring and highly emotional collection of eight original pieces of modern classical music. The release is a true event, marking the very first time that the Voice of Pope Benedict XVI has been captured on disc, speaking and singing in Latin, Italian, Portuguese, French and German, thanks to the audio recordings of Vatican Radio. Proceeds from the album sales will be used to provide music education for underprivileged children around the world.\n\nThe album will feature His Holiness Pope Benedict XVI, reciting and singing passages and prayers, accompanied by The Choir of the Philharmonic Academy of Rome, conducted by Monsignor Pablo Colino, Maestro Emeritus of St. Peter's Basilica and recorded in St Peter's Basilica. The world famous Royal Philharmonic Orchestra plays on all of the specially commissioned contemporary tracks, and was recorded at the iconic Abbey Road studios in London.\n\nSimon Boswell, Stefano Mainetti and Nour Eddine are the three contemporary composers who have contributed the eight specially commissioned pieces of music for Alma Mater. Vincent Messina, producer of Alma Mater, commented, &quot;These three composers are world class and my first choices for the album. A happy co-incidence is that Stefano is Catholic, Simon is `undeclared' and Nour Eddine is Muslim, thus perfectly representing our aim to produce an album that has universal appeal to all of those who love beautiful music.&quot; Collectively, the trio of writers boasts an impressive resume of film scores, TV series and stage productions from around the world. \n\n\n\n","torrent":{"xt":"urn:btih:d2f8e964a2663e032d5e73a51295db6a0bc84986","amp;dn":"Alma+Mater+-+Music+From+The+Vatican","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2f8e964a2663e032d5e73a51295db6a0bc84986","infoHashBuffer":{"type":"Buffer","data":[210,248,233,100,162,102,62,3,45,94,115,165,18,149,219,106,11,200,73,134]},"announce":[],"urlList":[]}}