{"title":"Call of Duty Black Ops II Multiplayer all DLCs and Updates[8.25.","uid":8848750,"size":6165532985,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d33133394cdc612fba18d9d8a994c4b8a73f9c9e&amp;dn=Call+of+Duty+Black+Ops+II+Multiplayer+all+DLCs+and+Updates%5B8.25.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"gamerguuy","files":14,"time":1377466821,"description":"Hello everyone and welcome to my page.\n\nPlay Multiplayer and Zombies with FourDeltaOne; this is an alpha release. What it means is that dedicated servers/Public matches do not work as of yet. You have to add friends onand play with them, or play with bots.\n\n\n\nAfter extensively searching around for a good torrent with simplified instructions and downloading individual files over the span of days, I've finally decided to put my own torrent together. \n\nHow is this different from others you say? I've made the instructions simplified so it will be easier for anyone to understand. Unlike other torrents, I'll also be seeding for a good amount of time with decent upload speed. \n\nIMPORTANT: You need &quot;Call of Duty Black Ops II-SKIDROW&quot; base game for these files to work. It is not included in this torrent and may be downloaded by visiting the following link: https://thepiratebay.se/torrent/7819067/Call_of_Duty_Black_Ops_II-SKIDROW\n\n\nThis torrent contains following files:\n-Update 1 and 2 \n-Update 3\n-T6M---Pre-pre-Alpha ( Required for Vengeance dlc to work)\n-DLC 1 ( Nuketown and Revolution)\n-DLc 2 ( Uprising)\n-DLC 3( Vengeance)\n-op2-t6m-dlc3 ( Required for the game to work)\n\n\n*Optional \n-Winrar to unzip the files\n-Nuketown and Revolution Unlocker for legit version of the game(don't use unless you own BO2 on steam)\n\n\nInstallation Instructions:\n-Install Call of Duty Black Ops 2, if you haven't already.\n1)Install Update 1 and 2.exe ( Make sure you choose the path correctly).\n2)Install Update 3. ( Make sure you choose the path correctly)\n3)Unzip &quot;T6M---Pre-pre-Alpha&quot; and paste the files first to the main installation folder.\n4)Unzip &quot;DLC Pack Nuketown and Revolution&quot;  and copy all files to the main installation folder and overwrite.\n5)Unzip &quot;DLC Pack Uprising&quot; and copy all files to the main installation folder and overwrite.\n6)Unzip  &quot;DLC Pack Vengeance&quot; and copy all files to the main installation folder and overwrite.\n7)Unzip &quot;op2-t6m-dlc3&quot; and copy all files to the main installation folder and overwrite.\n8)Finally, go toand click on &quot;register&quot; in the top right corner of the screen. After confirming your registration, launch the either  &quot;t6mp.exe&quot; or &quot;t6zm.exe&quot; and enter your details in the loging screen. Enjoy your game.\n\n\nIncluded in a notepad is a checksum of all files in case if you wish to verify the integrity of the files.( If you don't know what it is or what it does, leave it as it is.)\n\nAlso included is a zombie trainer that works as of 8/25/2013. it's a decent trainer and keeps me occupied when I get bored playing of solo game.\nNote: Please use it for solo player purposes only! I do not take any liability for the abuse of trainer and will not be held liable in case \nyour account gets banned fromUse at your own risk!\n\n\nFeel free to ask me if you run into problems and I will try to answer to the best of my knowledge. You may also add me onMy username is: gamerguuy .\n\nFrom this torrent and onwards,if my torrents have no seeders, you can request in the comment section and I will seed for you as soon as I can. Keep an eye out for Apocalypse\nDLC in the near future. \n\nEnjoy the game and remember to seed, I'd appreciate it! :)\n\n[gamerguuy]","torrent":{"xt":"urn:btih:d33133394cdc612fba18d9d8a994c4b8a73f9c9e","amp;dn":"Call+of+Duty+Black+Ops+II+Multiplayer+all+DLCs+and+Updates%5B8.25.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d33133394cdc612fba18d9d8a994c4b8a73f9c9e","infoHashBuffer":{"type":"Buffer","data":[211,49,51,57,76,220,97,47,186,24,217,216,169,148,196,184,167,63,156,158]},"announce":[],"urlList":[]}}