{"title":"Bad Romeo By Leisa Rayven ( ARC )EPUB,MOBI,AZW3 ~KnightinKat","uid":11554927,"size":2084653,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d33762ab48a05587890c6d9483130327e3eaad7f&amp;dn=Bad+Romeo+By+Leisa+Rayven+%28+ARC+%29EPUB%2CMOBI%2CAZW3+%7EKnightinKat&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"machoos","files":6,"time":1416812100,"description":"Bad Romeo By Leisa Rayven ARC EPUB,MOBI,AZW3~KnightinKat\n\n\nLanguage: English | Format: EPUB,MOBI,AZW3\nGenre: Romance,\nISBN: 9781743534762\n\nAbout:\n\n\nADVANCE READER COPY\n\nWhile performing the greatest love story of all time, they discovered one of their own . . .\n\nCassie Taylor was just another acting student with big dreams at her prestigious performing arts college . . . then she met Ethan Holt. She was the good girl actress. He was the bad boy on campus. But one fated casting choice for Romeo and Juliet changed it all. Like the characters they were playing on stage, Cassie and Ethan's epic romance seemed destined. Until it ended in tragedy when he shattered her heart.\n\nNow they've made it to Broadway where they're reunited as romantic leads once again - and their passionate scenes force them they're forced to confront the heartbreaking lows and pulse-pounding highs of their intense college affair. For Ethan, losing Cassie was his biggest regret - and he's determined to redeem himself. But for Cassie, even though Ethan was her first and only great love, he hurt her too much to ever be trusted again.\n\nThe trouble is, working with him again reminds her that people who rub each other the wrong way often make the best sparks. And when it comes to love, sometimes it's the things that aren't good for us that are the most irresistible.\n\nDon't miss the intoxicating romance beloved by over two million fans online - a story that'll captivate you and hold you breathless until the final page.\n\nReview\n\n&quot;Leisa Rayven crashes onto the romance scene: laughing, flirting, and just daring us to put Bad Romeo down. I couldn't!&quot;- Christina Lauren, New York Times bestselling author of Beautiful Bastard \n\n&quot;An unputdownable debut! Filled with delicious tension that will make your palms sweat, toes curl and heart race.&quot;- Alice Clayton, New York Times bestselling author of Wallbanger\n\n&quot;The perfect combination of hot and hilarious, Bad Romeo is utterly dazzling. I loved it!&quot;- Katy Evans, New York Times bestselling author of Real\n \n&quot;I gobbled this book up in one sitting. The emotions between the characters were superb. The new hottest book couple!&quot; - Jennifer Probst, New York Times bestselling author of The Marriage Bargain\n\n______________________________________________________________________________________________________________________________\nfor any queries and reseeds if the file is not downloading pm/request reseed.\n\nIf you do like my uploads do support me by commenting and rating the torrent . also please help me keep the torrent alive by sharing and seeding.. !\n\nCheers \n~KnightinKat","torrent":{"xt":"urn:btih:d33762ab48a05587890c6d9483130327e3eaad7f","amp;dn":"Bad+Romeo+By+Leisa+Rayven+%28+ARC+%29EPUB%2CMOBI%2CAZW3+%7EKnightinKat","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d33762ab48a05587890c6d9483130327e3eaad7f","infoHashBuffer":{"type":"Buffer","data":[211,55,98,171,72,160,85,135,137,12,109,148,131,19,3,39,227,234,173,127]},"announce":[],"urlList":[]}}