{"title":"Tyrian - Fully Vista &amp; XP compatible!","uid":5013121,"size":12507190,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d33ebd4fbadcc5556fa8c9c04a57d4e4c629cc25&amp;dn=Tyrian+-+Fully+Vista+%26+XP+compatible%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"inb4","files":-1,"time":1248098299,"description":"OpenTyrian 2.1 - Full free game now finally working in Windows XP and Vista!\n\n\nTyrian is an arcade-style vertical scrolling shooter. The player controls a space ship fitted with different weapons (front and back, linked to the same button, and up to two external pods with their own buttons) and other equipment; the game is mostly fast-paced but easily memorizable and it presents a variety of enemies (some flying, some fixed, some on rails) and bosses, with many occurrences of fixed and/or indestructible obstacles.\n\nA peculiar feature of Tyrian is that it is very forgiving of enemy hits: before the player's starship is destroyed it must take enough damage to exhaust several points of shields and armor (the difference is that shields regenerate during play while armor is recovered only with specific powerups and between levels).\n\nAnother unusual characteristic of the game is that weapon powerups are very rare: main weapons, sidekick weapons, and equipment such as shields, energy generators (which determine how fast weapons fire and shields recharge), and different ships are bought in interlevel menus; front and back weapons can be upgraded or downgraded at each of 11 power levels. Available money corresponds directly to score.\n\nThe multiple linked weapons, the equipment-buying system and the shield/armor hit points in Tyrian are similar to game mechanics in Raptor: Call of the Shadows, another PC game from the same period[citation needed].\n\nTyrian was a departure from the prevalent &quot;serious&quot; style of shooters, due to the cartoon-like artwork and the abundance of silly (or at least strange) dialogue and content.\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Tyrian_(video_game)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Tyrian_(video_game)&lt;/a&gt; &lt;a href=&quot;\nhttp://code.google.com/p/opentyrian/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://code.google.com/p/opentyrian/&lt;/a&gt;","torrent":{"xt":"urn:btih:d33ebd4fbadcc5556fa8c9c04a57d4e4c629cc25","amp;dn":"Tyrian+-+Fully+Vista+%26+XP+compatible%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d33ebd4fbadcc5556fa8c9c04a57d4e4c629cc25","infoHashBuffer":{"type":"Buffer","data":[211,62,189,79,186,220,197,85,111,168,201,192,74,87,212,228,198,41,204,37]},"announce":[],"urlList":[]}}