{"title":"The Science and Politics of Cancer, G. Edward Griffin 2005","uid":3540100,"size":122193132,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:d3456269fde621742ab910b0b659e0c0bf3d7ddb&amp;dn=The+Science+and+Politics+of+Cancer%2C+G.+Edward+Griffin+2005&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ReVIsed","files":1,"time":1160969710,"description":"A 2005 speech given by G. Edward Griffin on Laetrile, Amygdalin, Vitamin B17 as cancer therapy. If you are new to this topic, then you might want to watch this first:\n------------------------------------------------------------------------\nA World Without Cancer: The Story of Vitamin B 17\n\nG. Edward Griffin marshals the evidence that cancer is a deficiency disease - like scurvy or pellagra - aggravated by the lack of an essential food compound in modern man&amp;#039;s diet. That substance is vitamin B17. In its purified form developed for cancer therapy, it is known as Laetrile.\n\nThis story is not approved by orthodox medicine. The FDA, the AMA, and The American Cancer Society have labeled it fraud and quackery. Yet the evidence is clear that here, at last, is the final answer to the cancer riddle.\n\nWhy has orthodox medicine waged war against this non-drug approach? The author contends that the answer is to be found, not in science, but in politics - and is based upon the hidden economic and power agenda of those who dominate the medical establishment.\n\nWith billions of dollars spent each year on research, with other billions taken in on the sale of cancer-related drugs, and with fund-raising at an all-time high, there are now more people making a living from cancer than dying from it. If the solution should be found in a simple vitamin, this gigantic industry could be wiped out over night. The result is that the politics of cancer therapy is more complicated than the science.\n &lt;a href=&quot;\nhttp://video.google.com/videoplay?docid=4312930190281243507&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://video.google.com/videoplay?docid=4312930190281243507&lt;/a&gt;","torrent":{"xt":"urn:btih:d3456269fde621742ab910b0b659e0c0bf3d7ddb","amp;dn":"The+Science+and+Politics+of+Cancer%2C+G.+Edward+Griffin+2005","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3456269fde621742ab910b0b659e0c0bf3d7ddb","infoHashBuffer":{"type":"Buffer","data":[211,69,98,105,253,230,33,116,42,185,16,176,182,89,224,192,191,61,125,219]},"announce":[],"urlList":[]}}