{"title":"Advances in Biodiesel Production -  Processes and Technologies","uid":8221315,"size":14103511,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d48165cb305d41f5bf548d9925be8347483e5c76&amp;dn=Advances+in+Biodiesel+Production+-++Processes+and+Technologies&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"imarion","files":-1,"time":1362443834,"description":"Advances in Biodiesel Production: Processes and Technologies By Rafael Luque, Juan Antonio Melero\n2012 | 304 Pages | ISBN: 0857091174 | PDF | 13 MB\n\n\n\nBiodiesel is one of the main biofuels capable of substituting fossil fuel usage in compression ignition vehicles, and is used in a variety of fuel blends worldwide. First generation biodiesel has been used in national markets for some time, with fuel quality standards in place for this purpose. There remain, however, several restrictions to a sustainable and long term market development, which is influenced by many factors, including food vs. fuel pressures. The development of advanced biodiesel, aimed at more sustainable and effective feedstock utilization along with improved processing routes for increasing production efficiency and fuel quality, represents the future for this industry and for the continued and increasing use of biodiesel fuels in transportation.\n\nThis book provides a comprehensive and timely reference on the development of second generation biodiesel preparation processes and technologies. Initial chapters review the life cycle assessment, socio-economic and sustainability issues associated with second generation biodiesel, as well as feedstocks and standards. This coverage is extended by chapters reviewing advanced biodiesel production processes and technologies, including particular emphasis on the development of methods and catalysts. ","torrent":{"xt":"urn:btih:d48165cb305d41f5bf548d9925be8347483e5c76","amp;dn":"Advances+in+Biodiesel+Production+-++Processes+and+Technologies","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d48165cb305d41f5bf548d9925be8347483e5c76","infoHashBuffer":{"type":"Buffer","data":[212,129,101,203,48,93,65,245,191,84,141,153,37,190,131,71,72,62,92,118]},"announce":[],"urlList":[]}}