{"title":"Mala vida.[ebook].","uid":6210428,"size":5325019,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d54132a23e0ad6a0764faaf53d3b6ce0ddf11b83&amp;dn=Mala+vida.%5Bebook%5D.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"zurera","files":-1,"time":1298966458,"description":"Corre el aÃƒÂ±o 1345 y en Francia reina el caos. La nobleza y el clero, mÃƒÂ¡s corruptos e intrigantes que nunca, no logran imponer moral ni ley. Bandas de forajidos se suman al hambre y a las epidemias, sembrando el pÃƒÂ¡nico en una poblaciÃƒÂ³n ya amedrentada por el convencimiento de que el fin del mundo se aproxima. Mientras unos pocos quieren redimirse mediante penitencias, son muchos los que buscan el consuelo de los goces carnales y se refugian en el Bosque de Piedra, entre Valence y AviÃƒÂ±ÃƒÂ³n. Sobre esas rocas en forma de falo la astuta Marion ha construido un burdel tan singular e imaginativo como ella misma, y de tan diversa oferta como sus putas; jÃƒÂ³venes reciÃƒÂ©n salidas de la niÃƒÂ±ez, matronas opulentas, bellezas de modales seÃƒÂ±eros y hasta alguna amazona de carÃƒÂ¡cter feroz. Todas pueden satisfacer los antojos masculinos, no en balde estÃƒÂ¡n adiestradas por Marion y saben que de esa capacidad depende su supervivencia. Por su parte, madame Marion ha roto con RÃƒÂ©mi el Tuerto y, demostrando que los celos del bandido eran fundados, ahora vive con el joven Yvain un idilio sin tregua, a sabiendas de que pronto dejarÃƒÂ¡ de ser deseable, algo mÃƒÂ¡s cruel para ella que todos los augurios del Apocalipsis. Mala Vida sumerge al lector en una pasado histÃƒÂ³rico reconstruido fielmente gracias a unos personajes de sobras verosÃƒÂ­miles. Porque nada es tan humano como la rebeldÃƒÂ­a de esos aventureros, que luchan por convertir cada dÃƒÂ­a de su precaria existencia en un festejo de la sensualidad. Y, para excusar su escasa virtud, nada mÃƒÂ¡s idÃƒÂ³neo que la ironÃƒÂ­a y el jocoso lenguaje de Suzanne Bernard, la autora de esta novela deliciosa que celebra la carne sin olvidar los placeres de la mente.","torrent":{"xt":"urn:btih:d54132a23e0ad6a0764faaf53d3b6ce0ddf11b83","amp;dn":"Mala+vida.%5Bebook%5D.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d54132a23e0ad6a0764faaf53d3b6ce0ddf11b83","infoHashBuffer":{"type":"Buffer","data":[213,65,50,162,62,10,214,160,118,79,170,245,61,59,108,224,221,241,27,131]},"announce":[],"urlList":[]}}