{"title":"Grays Anatomy","uid":5696116,"size":79487949,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:d56bfa581391e87c06b136957dda6d3eacb178ef&amp;dn=Grays+Anatomy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"The_Turbinator","files":1,"time":1279310230,"description":"Gray's Anatomy: The Anatomical Basis of Clinical Practice, Expert Consult - Online and Print, 40 Ed\n\n\nChurchill Livingstone | 2008 | ISBN: 0443066841 | 1576 pages | CHM | 75 MB\n\n\n\nA universal landmark in medicine ever since Drs. Henry Gray and H.V. Carter published the first edition in 1858, Gray's Anatomy now celebrates its 150th anniversary! From state-of-the-art coverage of important new areas such as functional neuroimaging, embryogenesis, and biomechanics . . . through a comprehensively revamped, lavish full-color art program . . . as well as convenient access to the complete contents online, with downloadable illustrations, the new 40th Edition sets a new world standard for accuracy, clarity, and clinical relevance.\n\n\nIt is THE place to turn when you want to be sure about the anatomical considerations that pertain to safe and effective practice. You will find it an invaluable clinical resource, a pleasure to consult, and a reference that you'll be proud to have on your shelf.\n\n* Fastidious editing by an esteemed group of clinicians and anatomists, with support from hundreds of contributors and specialist reviewers worldwide, ensures the most detailed and dependable coverage of anatomy available anywhere, including in-depth information on normal variants.\n* A regional organization collects all relevant material on each body area together in one place, for easy clinical reference.\n\n* Meticulously enhanced and updated artwork throughout - with 2,000 images now in full color - provide a more consistent, coherent view of every anatomical detail, providing practitioners across all specialties with the best, most clinically helpful visual understanding available.\n* 200 completely new radiologic, CT, MR, and other imaging studies vividly capture anatomy as it is primarily seen by physicians.\n* Significantly expanded clinical discussions emphasize considerations that may affect medical care.\n* Online access via Expert Consult allows you to reference the book's complete contents from any computer, fully searchable, and download thousands of detailed anatomical illustrations.\n\nYour purchase entitles you to access the web site until the next edition is published, or until the current edition is no longer offered for sale by Elsevier, whichever occurs first. If the next edition is published less than one year after your purchase, you will be entitled to online access for one year from your date of purchase. Elsevier reserves the right to offer a suitable replacement product (such as a downloadable or CD-ROM-based electronic version) should access to the web site be discontinued.","torrent":{"xt":"urn:btih:d56bfa581391e87c06b136957dda6d3eacb178ef","amp;dn":"Grays+Anatomy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d56bfa581391e87c06b136957dda6d3eacb178ef","infoHashBuffer":{"type":"Buffer","data":[213,107,250,88,19,145,232,124,6,177,54,149,125,218,109,62,172,177,120,239]},"announce":[],"urlList":[]}}