{"title":"Argo by Antonio Mendez","uid":7825263,"size":1524871,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d57f508b42fe643ba91d29e8d1377500fbd615ac&amp;dn=Argo+by+Antonio+Mendez&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"acidr0p","files":2,"time":1352914349,"description":"Epub and mobi format\n\nBook description:\n\nThe true, declassified account of CIA operative Tony Mendez's daring rescue of American hostages in Iran that inspired the critically-acclaimed film directed by and starring Ben Affleck, and co-starring John Goodman, Alan Arkin, and Bryan Cranston.\n\nOn November 4, 1979, Iranian militants stormed the American embassy in Tehran and captured dozens of American hostages, sparking a 444-day ordeal and a quake in global politics still reverberating today. But there is a little-known drama connected to the crisis: six Americans escaped. And a top-level CIA officer named Antonio Mendez devised an ingenious yet incredibly risky plan to rescue them before they were detected.\n\nDisguising himself as a Hollywood producer, and supported by a cast of expert forgers, deep cover CIA operatives, foreign agents, and Hollywood special effects artists, Mendez traveled to Tehran under the guise of scouting locations for a fake science fiction film called Argo. While pretending to find the perfect film backdrops, Mendez and a colleague succeeded in contacting the escapees, and smuggling them out of Iran.\n\nAntonio Mendez finally details the extraordinarily complex and dangerous operation he led more than three decades ago. A riveting story of secret identities and international intrigue, Argo is the gripping account of the history-making collusion between Hollywood and high-stakes espionage.","torrent":{"xt":"urn:btih:d57f508b42fe643ba91d29e8d1377500fbd615ac","amp;dn":"Argo+by+Antonio+Mendez","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d57f508b42fe643ba91d29e8d1377500fbd615ac","infoHashBuffer":{"type":"Buffer","data":[213,127,80,139,66,254,100,59,169,29,41,232,209,55,117,0,251,214,21,172]},"announce":[],"urlList":[]}}