{"title":"The Story of England - Michael Wood (BBC 2010 - Complete)","uid":9069697,"size":2935832974,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d5abc40ac52636ed884ca86fba20596912074171&amp;dn=The+Story+of+England+-+Michael+Wood+%28BBC+2010+-+Complete%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Robin1966","files":9,"time":1382179014,"description":"TV : Documentary : TV quality : English\n\n\nGroundbreaking series in which Michael Wood tells the story of one place throughout the whole of English history. The village is Kibworth in Leicestershire in the heart of England - a place that lived through the Black Death, the Civil War and the Industrial Revolution and was even bombed in World War Two.\n\nEpisode 1 - Romans to Normans\nWith the help of the local people and using archaeology, landscape, language and DNA, Michael uncovers the lost history of the first thousand years of the village, featuring a Roman villa, Anglo-Saxons and Vikings and graphic evidence of life on the eve of the Norman Conquest.\n\nEpisode 2 - Domesday to Magna Carta\nWood's unique portrait moves on to 1066 when the Normans build a castle in Kibworth. He reveals how occupation affected the villagers from the gallows to the alehouse, and shows the medieval open fields in action in the only place where they still survive today.\n\nWith the help of the residents, he charts events in the village leading to the people's involvement in the Civil War of Simon de Montfort. Intertwining the local and national narratives, this is a moving and informative picture of one local community through time.\n\nEpisode 3 - The Great Famine and the Black Death\nWood's fascinating tale reaches the catastrophic 14th century. Kibworth goes through the worst famine in European history, and then, as revealed in the astonishing village archive in Merton College Oxford, two thirds of the people die in the Black Death.\n\nHelped by today's villagers - field walking and reading the historical texts - and by the local schoolchildren digging archaeological test pits, Wood follows stories of individual lives through these times, out of which the English idea of community and the English character begin to emerge.\n\nEpisode 4 - Peasants' Revolt to Tudors\nWood's gripping tale moves on to dramatic battles of conscience in the time of the Hundred Years' War. Amazing finds in the school archive help trace peasant education back to the 14th century and we see how the people themselves set up the first school for their children.\n\nSome villagers join in a rebellion against King Henry V, while others rise to become middle class merchants in the textile town of Coventry. On the horizon is the Protestant Reformation, but the rise of capitalism and individualism sow the seeds of England's future greatness.\n\nEpisode 5 - Henry VIII to the Industrial Revolution\nThe tale reaches the dramatic events of Henry VIII's Reformation and the battles of the English Civil War. We track Kibworth's 17th century dissenters, travel on the Grand Union Canal and meet an 18th century feminist writer from Kibworth who was a pioneer of children's books.\n\nThe story of a young highwayman transported to Australia comes alive as his living descendents come back to the village to uncover their roots. Lastly, the Industrial Revolution comes to the village with framework knitting factories, changing the village and its people forever.\n\nEpisode 6 - Victoria to the Present Day\nIn this final episode, helped by today's villagers Michael uncovers the secret history of a Victorian village more colourful than even Dickens could have imagined. Recreating their penny concerts of the 1880s, visiting World War I battlefields with the school and recalling the Home Guard, local land girls and the bombing of the village in 1940, the series finally moves into the brave new world of 'homes for heroes' and the villagers come together to leave a reminder of their world for future generations.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:d5abc40ac52636ed884ca86fba20596912074171","amp;dn":"The+Story+of+England+-+Michael+Wood+%28BBC+2010+-+Complete%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5abc40ac52636ed884ca86fba20596912074171","infoHashBuffer":{"type":"Buffer","data":[213,171,196,10,197,38,54,237,136,76,168,111,186,32,89,105,18,7,65,113]},"announce":[],"urlList":[]}}