{"title":"Countdown To Final Crisis 2007 HollyAndHarley FANEDIT bsg4you","uid":9202808,"size":62875308,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:d5bfe8614531bf9e2bcaa40daff7e56a205f00ba&amp;dn=Countdown+To+Final+Crisis+2007+HollyAndHarley+FANEDIT+bsg4you&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bsg4you","files":3,"time":1384628227,"description":"Countdown To Final Crisis 2007 HollyAndHarley FANEDIT bsg4you\n\nTHIS FANEDIT ONLY INCLUDES HOLLY ROBINSON'S AND HARLEEN QUINZEL'S STORY FROM COUNTDOWN\n\nDo you like the DC Comics character Holly Robinson (Selina Kyle's best friend, roommate and Catwoman for about a year)?\n\nDo you like Harleen Quinzel (aka Harley Quinn, the Joker's sometimes girlfriend and partner in crime)?\n\nIf yes, this 100 page FANEDIT of Holly and Harley's adventures during the Countdown comic series that led up to Final Crisis should be very enjoyable. The story picks up with Holly leaving Gotham since she's wrongly wanted for the killing of Black Mask. While trying to make a new start in Metropolis Holly meets Harley at a very particular women's shelter. From there the adventure kicks into gear and they travel the world and beyond and eventually even have superpowers granted to them to battle on Apokolips. In the end Holly and Harley are back in Gotham pondering their interstellar adventure and how good it is to be home. They actually get the last panels of the entire series nicely bringing everything to a close. This is the last story starring Holly Robinson in the Pre-Flashpoint New Earth era and so far there's no indication she'll come back to the DC world. Hopefully a well written Holly can return as she's a great character in her own right.\n\nThis fanedit removes all of the non-Holly, non-Harley story content and includes a custom cover and 10 custom pages. Plus, all 3 original covers from Countdown that include Holly and Harley are included at the end.\n\nNote, there were a lot of non-Holly, non-Harley panels when they are on Apokolips and in Cadmus Labs. All of their panels with dialog are included as are panels where they're referred to. But some of the story may jump while various supers (Donna Tory, Hal Jordon, etc) are doing things. It doesn't take away from Holly and Harley at all and the chaotic state of the events are well summed up by this exchange on Apokolips:\nMary Marvel: What's going on?\nHolly Robinson: I gave up trying to figure it out.\n\nSOURCE - Countdown DC Comics 2007 June 06 to 2008 April 23 Issues:\nfirst number is issue order(second is cover number)\n05(47)-13(39) 15(37) 17(35)-18(34) 21(31)-23(29) 25(27)\n31(21) 33(19) 35(17) 37(15) 40(12)-46(06) 48(04) 51(01)\nMany thanks to the original scanners and posters!\n\nCountdown Holly Robinson and Harley Quinn FANEDIT\nEnglish CBR (RAR compression) 1 FANEDIT issue 62868613bytes\nPages: 100 total\n001 custom cover\n96 comic panels (10 custom using GIMP)\n03 original covers (at the end)\n\nIf you like this fanedit, please check out other fanedits, webisodes, trailers, commentaries and podcasts from Battlestar Galactica, Star Trek Enterprise, DC Comics and others at: &lt;a href=&quot; https://thepiratebay.se/user/bsg4you/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/user/bsg4you/&lt;/a&gt; \n\nPlease enjoy and leave any corrections, criticism, comments and requests. Thanks, bsg4you","torrent":{"xt":"urn:btih:d5bfe8614531bf9e2bcaa40daff7e56a205f00ba","amp;dn":"Countdown+To+Final+Crisis+2007+HollyAndHarley+FANEDIT+bsg4you","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5bfe8614531bf9e2bcaa40daff7e56a205f00ba","infoHashBuffer":{"type":"Buffer","data":[213,191,232,97,69,49,191,158,43,202,164,13,175,247,229,106,32,95,0,186]},"announce":[],"urlList":[]}}