{"title":"Ninja Bugeicho [DivX - Jap - Sub Ita Eng Esp Prt] [Tntvillage]","uid":5855361,"size":739659060,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d675b358d2849d0fed08f094bd90930372c286b8&amp;dn=Ninja+Bugeicho+%5BDivX+-+Jap+-+Sub+Ita+Eng+Esp+Prt%5D+%5BTntvillage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zabuza89","files":5,"time":1285546052,"description":"NINJA BUGEI-CHO\nCronache delle Imprese dei Ninja / Band of Ninja\n\nfrom the famous Sampei Shirato's Manga\n\nÃ‚Â«Questa ÃƒÂ¨ una storia di guerra, del raggiungimento dell'obiettivo passo dopo passo. Questo ÃƒÂ¨ il motivo per cui esistiamo e per cui continuiamo a vivere.Ã‚Â»\n\nÃ‚Â«Our story is about war, about the attainment of the objective step by step. This is the reason why we were born, and the reason why we're still living.Ã‚Â»\n\nAudio\n\nJAPANESE\n\nSoftSubs\n\nITALIAN - ENGLISH - SPANISH - PORTUGUESE\n\n.: Movie Infos :.\n\nTitle:  Ninja Bugei-Cho\nNation:  JAPAN\nYear: 1967                             \nGenre:  Animation | History | Adventure | War\nDirector:  Nagisa Oshima\nVoice: \nYoshiyuki Fukuda\t ... \tMufu-dojin\n\tJuro Hayano\t... \tCapo Raiunton\n\tHikaru Hayashi\t... \tTokichiro Kinoshita \n\tHideo Kanze\t... \tNobutsuna Kamiizumi \n\tHÃƒÂ´sei Komatsu\t... \tOnikichi / Zoruko \n\tAkiko Koyama\t... \tAkemi \n\tNoriko Matsumoto\t... \tHotarubi \n\tShoichi Ozawa\t... \tNarratore \n\tKei SatÃƒÂ´\t... \tShuzen Sakagami\n\tNobuo Tanaka\t... \tMunetoshi Yaguy \n\tRokko Toura\t... \tKagemaru \n\tShigeru Tsuyuguchi\t... \tMitsuhide Akechi \n\tFumio Watanabe\t... \tNobunaga Oda / Kynnyo \n\tKei Yamamoto\t... \tJutaro Yuki  \n\nRuntime: 135 min.\n\nIMDB Link &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0062044/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0062044/&lt;/a&gt;\n\n.: Trama/Plot :.\n\n[ITA]Al tramonto dell'epoca Sengoku si alternano e si intrecciano le vicendi di vari uomini, donne, bambini, ninja, samurai e nobili che versando il proprio e l'altrui sangue in nome di una causa o per vendetta faranno la storia del Giappone.\n\n[ENG] At Sengoku Era sunset alternate and intertwine the stories of several men, women, kids, ninja, samurai and nobles who paying with their own and others blood in the name of a cause or for revenge will do the history of Japan.\n\n.: Info :.\n\n[ITA]Di Ninja Bugeicho non esiste solo la versione cartacea di Shirato: la storia ÃƒÂ¨ stata impressa su pellicola cinematografica negli anni '60, ad opera di Nagisa Oshima, che firmÃƒÂ² cosÃƒÂ¬ uno dei film piÃƒÂ¹ sperimentali di cui si abbia memoria.\nMolti registi e produttori, visto il successo dell'opera di Shirato, avevano pensato ad una sua trasposizione cinematografica. Era un progetto allettante, ma alla fine tutti vi rinunciavano. Motivo? Le difficoltÃƒÂ  tecniche per la sua realizzazione erano troppo grandi. Ad esempio, era estremamente complicato al tempo (siamo negli anni '60) gestire gli scenari vastissimi che il manga richiedeva, o riprodurre i movimenti dei ninja o degli animali che dovevano partecipare all'azione. L'unico che decise di andare a fondo in questa impresa e che effettivamente realizzÃƒÂ² il film di Ninja Bugeicho fu - appunto - Nagisa Oshima. Oshima ÃƒÂ¨ stato un regista che ha fatto dello sperimentalismo la sua parola d'ordine: in particolare, una delle cose che rimproverava al cinema giapponese degli anni '60 era proprio quella di essersi tutto sommato cristallizzato, di aver perso lo slancio e il coraggio verso la sperimentazione, verso il nuovo. Ninja Bugeicho era una sfida che sarebbe stata vinta solo muovendosi in direzione di strade alternative, per questo Oshima decise di accettarla. E del resto, quale migliore storia per un regista dallo spirito rivoluzionario se non una che parlava appunto di rivoluzioni? La soluzione che adottÃƒÂ² Oshima fu tanto semplice all'apparenza quanto complessa nella sua realizzazione: davanti alle difficoltÃƒÂ  elencate qua sopra, il regista scartÃƒÂ² l'idea di usare attori veri in carne ed ossa. Ma non scelse nemmeno l'alternativa animare la storia. Ninja Bugeicho diventa, quindi, un &quot;anime immobile&quot;: l'illusione dell'animazione ÃƒÂ¨ data solo dal movimento della telecamera, che inquadra le tavole originali in bianco e nero di Shirato. Gli attori sono linee su carta, dotate di voce grazie ai doppiatori.\n\n[ENG] Ninja Bugeicho is not only the title of an exciting manga, but also of a movie directed in the '70s by Nagisa Oshima, one of the most experimental productions ever filmed. The great success gained by Shirato's work titillated the creativity of many directors: transforming Kagemaru's story into a film was an attractive project, but in the end everyone gave up, because of some insurmountable, practial difficulties. Cinematographic technology between the 60s and the 70s was not enough advanced yet to reproduce - for example - the movements of Shirato's characters, their fastness and agility.\nThe only one who made the dream of a movie from Ninja Bugeicho come true was Nagisa Oshima, a director who have always bet on experimentalism. There was only one way to make a story like Ninja Bugeicho a picture show: finding alternative solutions. After all, which other story could be filmed in a rivolutionary way rather than a story about revolution? Oshima's solution was apparently the simplest one: it was impossible to reproduce realistically the plates of Shirato, so why not just filming the plates themselves? This does not mean to animate them: what Oshima did, in fact, was to move the camera over the drawings, adding sounds effects and actors' voices in the background. The result was a kind of 'motionless anime', where there was just the illusion of the movement. \n\nSUBTITLES NOTE:\n\n[ITA] I Sottotitoli sono stati resi possibili grazie all'opera di Lan Awn Shee, che ha tentato di risistemare in italiano i subs automatici inglese dal cinese di questo film, io ho finito il lavoro. \nRingrazio poi chi ha dato una sistemata ai subs automatici inglesi e dai quali sono stati poi tratti i subs spagnoli e portoghesi (non ne garantisco la correttezza di questi tre). In questi ultimi tre ho perÃƒÂ² ripristinato i nomi originali, poichÃƒÂ© la versione cinese aveva i nomi cambiati, sempre grazie all'opera di Lan.\n\n[ENG] Unfortunatly on internet it's easy find the subs, but all are automatic subs from a chinese version, so it's difficult understand and the characters names were changed... I (and others) have rebuilt the subs from zero in italian, with the original names. Then I've found some subs in english, spanish and portuguese correct from the base of the automatic subs. In this subs I've changed the chinese name with the japanese original names. I did not check if this three .srt are correct 100%, but they are more correct of the automatic translation, and you can understand the story. Maybe with these someone can do more correct subtitles one day.\n\n.: Report Avinaptic :.\n\n[ Info sul file ]\n\nNome: Ninja Bugeicho.avi\nData: 9/09/2010 12:25:00\nDimensione: 739,288,584 bytes (705.041 MB)\n\n[ Info generiche ]\n\nDurata: 01:59:20 (7159.659659 s)\nTipo di contenitore: AVI\nStreams totali: 2\nTipo stream n. 0: video {Video}\nTipo stream n. 1: audio {Audio}\nAudio streams: 1\n\n[ Dati rilevanti ]\n\nRisoluzione: MOLTO ALTA (640 x 480)\nLarghezza: multipla di 32 (BENE)\nAltezza: multipla di 32 (BENE)\n\n[ Traccia video ]\n\nFourCC: DIVX/DX50\nRisoluzione: 640 x 480\nFrame aspect ratio: 4:3 = 1.333333\nPixel aspect ratio: 1:1 = 1\nDisplay aspect ratio: 4:3 = 1.333333\nFramerate: 23.976 fps\nFrames totali: 171660\nStream size: 657,638,392 bytes\nBitrate: 734.826428 kbps\nQf: 0.099766\nKey frames: 1604 (0; 300; 304; 319; 330; ... 171598)\nNull frames: 0\nMin key int: 1\nMax key int: 300\nKey int medio: 107.019950\nRitardo: 0 ms\n\n[ Traccia audio ]\n\nAudio tag: 0x55 (MP3)\nBitrate (contenitore): 64 kbps VBR\nCanali (contenitore): 2\nFrequenza (contenitore): 48000 Hz\nChunks: 298301\nStream size: 70,307,472 bytes\nPreload: 456 ms\nMax A/V diff: 481 ms\nTipo: MPEG-1 Layer III\nChunk-aligned: SÃƒÂ¬\nEmphasis: none\nMode: joint stereo\nRitardo: 0 ms\n\n[ Info sulla codifica MPEG4 ]\n\nUser data: DivX503b1307p\nPacked bitstream: SÃƒÂ¬\nQPel: No\nGMC: No\nInterlaced: No\nAspect ratio: Square pixels\nQuant type: H.263\n\n[ Profile compliancy ]\n\nProfilo da testare: MTK PAL 6000\nRisoluzione: Ok\nFramerate: 23.976 &lt;&gt; 25\n\nYou can find more info on this, and more of 35000 torrents, on Tntvillage community, the biggest italian torrents community with more of 330000 users.\nVisit www.tntvillage.scambioetico.org/ and good downloads!","torrent":{"xt":"urn:btih:d675b358d2849d0fed08f094bd90930372c286b8","amp;dn":"Ninja+Bugeicho+%5BDivX+-+Jap+-+Sub+Ita+Eng+Esp+Prt%5D+%5BTntvillage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d675b358d2849d0fed08f094bd90930372c286b8","infoHashBuffer":{"type":"Buffer","data":[214,117,179,88,210,132,157,15,237,8,240,148,189,144,147,3,114,194,134,184]},"announce":[],"urlList":[]}}