{"title":"The Mod Squad S01E01 Pilot-The Teeth of the Barracuda  DVDRip  D","uid":4348006,"size":682011162,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d7d22cdcc2ff2952ed781ff1e66023a6193f3b44&amp;dn=The+Mod+Squad+S01E01+Pilot-The+Teeth+of+the+Barracuda++DVDRip++D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"lee.ka","files":4,"time":1218991284,"description":"The Mod Squad \nABC, 1968 - 1973\nMichael Cole, Peggy Lipton, Clarence Williams III, Tige Andrews.  Produced by Aaron Spelling and Danny Thomas.\n\nAnyone over the age of 50 probably has a memory of the Mod Squad, a new type of cop show that exemplified what were the best of the 1960&amp;#039;s &quot;counter-culture&quot; radical ideas.\n\nLinc, Julie, and Pete (Clarence Williams III, Peggy Lipton, and Michael Cole) were three petty criminals on probation that were recruited as undercover cops.  Linc was an intelligent, caring black man from Watts, caught in the riots; Pete was a rich kid who decided not to live/party off daddy&amp;#039;s money; Julie was a runaway who was decidedly not a &quot;bimbo.&quot;\n\nThe three undercover cops were close friends who cared about each other and society, and used their wits and intelligence as unconventional cops to infiltrate the counterculture and arrest the real bad guys, the ones preying on the kids.  They carried no guns or police badges, and did not fink on their own generation.  They questioned everything, including the morality of their arrests and even their own motives.  The show tackled some of the tough topics that society was experiencing at the time - race relations, drug use, abortion, unwed mothers - with sensitivity and compassion.  And perhaps they showed the older generation that there were some redeeming qualities in this younger generation after all.\n\n\n\nS01E01 Pilot-The Teeth of the Barracuda\nFirst aired: 9/24/1968\n \nThe daughter of a California gubernatorial candidate is caught with drugs and is blackmailed.  Watch for Harrison Ford as a beach patrol cop who busts Pete.\n\nCast: Clarence Williams III (Linc), Peggy Lipton (Julie), Michael Cole (Pete), Tige Andrews (Capt. Greer)\n \nGuest cast: Simon Scott (Chief Metcalf) , Brooke Bundy (Tina Williams/Sutton), Addison Powell (Jonathan Sutton), Gary Vinson (Beau Graves), Fred Beir (Frank Durant), Lonny Chapman (Lt. Wheeler), Noam Pitlik (Wiley), Robert DoQui (Cully Smith), Larry Thor (Doctor), Harrison Ford (Beach Patrol Cop (Uncredited)) \n\nDVD&gt;DivX/640x480/1114kbps/23.976fps/mp3/48KHz/stereo/104Kbps/74min/650Mb","torrent":{"xt":"urn:btih:d7d22cdcc2ff2952ed781ff1e66023a6193f3b44","amp;dn":"The+Mod+Squad+S01E01+Pilot-The+Teeth+of+the+Barracuda++DVDRip++D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7d22cdcc2ff2952ed781ff1e66023a6193f3b44","infoHashBuffer":{"type":"Buffer","data":[215,210,44,220,194,255,41,82,237,120,31,241,230,96,35,166,25,63,59,68]},"announce":[],"urlList":[]}}