{"title":"Coldplay - X and Y [24 bit FLAC] vinyl","uid":8219008,"size":1379961566,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d7d767ce8724bc610fd421bbec4366b780157af0&amp;dn=Coldplay+-+X+and+Y+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"24.96","files":-1,"time":1362426244,"description":"  Coldplay - X and Y (2005) [24 bit FLAC] vinyl\n\n  Released: 2005\n  Genre: Pop/Rock\n  Style: Alternative, Indie Rock\n  Codec: FLAC\n  Bit Rate: ~ 2,900 kbps\n  Bits Per Sample: 24\n  Sample Rate: 96,000 Hz\n\n  A1 Square One\n  A2 What If\n  A3 White Shadows\n\n  B1 Fix You\n  B2 Talk\n  B3 X&amp;Y\n\n  C1 Speed Of Sound\n  C2 A Message\n  C3 Low\n\n  D1 The Hardest Part\n  D2 Swallowed In The Sea\n  D3 Twisted Logic\n  D4 Til Kingdom Come\n\n  After Radiohead stubbornly refused to accept the mantle of world's biggest and most important rock band by releasing the willfully strange rocktronica fusion Kid A in 2000, Coldplay stepped up to the plate with their debut, Parachutes. Tasteful, earnest, introspective, anthemic, and grounded in guitars, the British quartet was everything Radiohead weren't but what the public wanted them to be, and benefited from the Oxford quintet's decision to abandon rock stardom for arcane art rock. Parachutes became a transatlantic hit and 2002's sequel, A Rush of Blood to the Head, consolidated their success by being bigger and better than Parachutes, positioning Coldplay to not be just the new Radiohead, but the new U2: a band that belongs to the world but whose fans believe that the music is for them alone. To that end, Coldplay's third album, X&amp;Y -- slightly delayed so it follows Rush of Blood by nearly three years, but that's no longer than the time separating OK Computer and Kid A, or The Unforgettable Fire and The Joshua Tree -- is designed to be the record that elevates Coldplay to the major leagues, where they are at once the biggest and most important band in the world. It's deliberate and sleek, cinematic and pristine, hip enough to sample Kraftwerk and blend in fashionable retro-'80s post-punk allusions without altering the band's core. Indeed, X&amp;Y is hardly a bold step forward but rather a consolidation of Coldplay's strengths, particularly their skill at crafting surging, widescreen epics. But if X&amp;Y highlights their attributes it also brings Coldplay's weaknesses into sharp relief. Forget the fact that they, by any stretch of the imagination, do not rock -- rocking is simply against their nature. They are a meditative band, reflecting on their emotions instead of letting them go in a cathartic blast of noise and rhythm. This isn't a problem -- after all, there have been plenty of great bands that do not rock &amp; roll -- but their terminal politeness does cripple their music, preventing it from being as majestic as its aspirations. Coldplay is well scrubbed and well behaved, possessing a textbook education in classic rock and the good sense to never stretch any farther than needed. They are the perfect middlebrow rock band -- clean, pristine, and rational, seemingly smart since they never succumb to pounding, primal riffs, but also not weird enough to be genuine art rock. It's ambitious, yet its ambitions are modest, not risky, so their ambitions can be fulfilled without breaking a sweat. And since their sweeping yet subdued theatricality does recall the more majestic moments of Radiohead and U2, they have won millions of fans, but another crucial reason that Coldplay have a broad appeal is that lead singer/songwriter Chris Martin never tackles any large issues, preferring to endlessly examine his feelings. Like on Parachutes and Rush of Blood, all the songs on X&amp;Y are ruminations on Martin's doubts, fears, hopes, and loves. His words are earnest and vague, so listeners can identify with the underlying themes in the songs, and his plain, everyman voice, sighing as sweet as a schoolboy, is unthreatening and unassuming, so it's all the easier for listeners to project their own emotions into the song. But for as impeccable as X&amp;Y is -- and, make no mistake, it's a good record, crisp, professional, and assured, a sonically satisfying sequel to A Rush of Blood to the Head -- it does reveal that Martin's solipsism is a dead-end, diminishing the stature of the band. Where U2 is big in sound, scope, ambition, and intent, Coldplay is ultimately big music about small things, and even if X&amp;Y is a strong, accomplished album, its limited, narcissistic point of view is what prevents the quartet from inheriting the title of the biggest and most important band in the world.","torrent":{"xt":"urn:btih:d7d767ce8724bc610fd421bbec4366b780157af0","amp;dn":"Coldplay+-+X+and+Y+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7d767ce8724bc610fd421bbec4366b780157af0","infoHashBuffer":{"type":"Buffer","data":[215,215,103,206,135,36,188,97,15,212,33,187,236,67,102,183,128,21,122,240]},"announce":[],"urlList":[]}}