{"title":"East Asian Cinemas Exploring Transnational Connections on Film","uid":11677833,"size":2770324,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d7d85e992fbdd8db05494b11171ea1f5dfd62491&amp;dn=East+Asian+Cinemas+Exploring+Transnational+Connections+on+Film&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zombie_rox","files":1,"time":1422948361,"description":"East Asian cinema is among the most exciting and influential in the world. The popularity of Chinese martial arts films, Japanese horror, and new Korean cinema has attracted popular and critical attention on a global scale, with films from the region circulating as arthouse, cult, blockbuster and &quot;extreme&quot; cinema, or as Hollywood remakes. This book explores developments in the global popularity of East Asian cinema, with particular emphasis on crossovers, remakes, hybrids and co-productions. It examines changing cinematic traditions in Asia alongside the &quot;Asianisation&quot; of western cinema. It explores the dialogue not only between &quot;East&quot; and &quot;West,&quot; but between different cinemas in the Asia Pacific. What do these trends mean for global cinema? How are co-productions and crossover films changing the nature of Hollywood and East Asian cinemas? Individual essays include case studies of Park Chan-wook, Infernal Affairs, Seven Samurai, Princess Mononoke and Kill Bill.\n\nPublisher: I. B. Tauris; First Edition edition (June 10, 2008)\nLanguage: English\nISBN-10: 1845116151\nISBN-13: 978-1845116156\n\nEditorial Reviews\nAbout the Author\nLeon Hunt is a Senior Lecturer in Film and TV Studies, Brunel University. His books include 'Kung Fu Cult Masters: From Bruce Lee to Crouching Tiger'. Leung Wing-Fai is Learning Development Officer (Film) at the National Museum of Photography, Film &amp; Television, Bradford. Her 'Lost in Translation' column appears on the Hong Kong Express website","torrent":{"xt":"urn:btih:d7d85e992fbdd8db05494b11171ea1f5dfd62491","amp;dn":"East+Asian+Cinemas+Exploring+Transnational+Connections+on+Film","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7d85e992fbdd8db05494b11171ea1f5dfd62491","infoHashBuffer":{"type":"Buffer","data":[215,216,94,153,47,189,216,219,5,73,75,17,23,30,161,245,223,214,36,145]},"announce":[],"urlList":[]}}