{"title":"Geek Magic with Tomas Medina","uid":8315762,"size":889345071,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:d8149246ba020ba6d7e40305a2e1c3139c784bfa&amp;dn=Geek+Magic+with+Tomas+Medina&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"lethal111","files":33,"time":1364582868,"description":"Geek Magic with Tomas Medina (DVD) Human curiosities alive on the inside. WARNING: Content not suitable for viewers under 18.\n\nYou've heard of people with uncanny, unimaginable abilities. Personalities like Serpentina the snake charmer, Wee Willie the 400 pound fat boy, Bobo the human pin cushion and Tessie the Tattooed Woman. Imagine joining their ranks and performing the following feats of bizzareism:\n\nSwallow and Maninpulate Razor Blades\nProduce Live Bugs\nBecome a Human Spittoon\nIngest an Inflated Balloon\nDrink Motor Oil\nChew on Broken Glass\nAnd Much More!\n\nThese Stunts - to name but a few - are explained in excruciating (and often far too great) detail on Tomas Medina's Geek Magic DVD. This magic is not intended for the faint of heart - or stomach. \n\nIt's all alive, on film, for your viewing and learning pleasure: on the inside! \n\nWARNING: This DVD is not suitable for anyone under the age of 18. Performances and explanations are for entertainment and informational purposes only. Buyer assumes full responsibility and shall not hold the producers, performers, or any other parties involved with the production and/or distribution of this DVD responsible for any ill effects resulting from the viewing of this DVD. If you have any doubt in your ability to safely perform the mindless, silly, downright, insane stunts explained herein, DO NOT ATTEMPT THEM.","torrent":{"xt":"urn:btih:d8149246ba020ba6d7e40305a2e1c3139c784bfa","amp;dn":"Geek+Magic+with+Tomas+Medina","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8149246ba020ba6d7e40305a2e1c3139c784bfa","infoHashBuffer":{"type":"Buffer","data":[216,20,146,70,186,2,11,166,215,228,3,5,162,225,195,19,156,120,75,250]},"announce":[],"urlList":[]}}