{"title":"Why Love Hurts A Sociological Explanation By Eva Illouz [PDF]","uid":8618888,"size":3854733,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d8aaed5c10cb269cfb64257ef30f37d7f85ed2f7&amp;dn=Why+Love+Hurts+A+Sociological+Explanation+By+Eva+Illouz+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"theBooks","files":-1,"time":1372322120,"description":" &lt;a href=&quot;http://www.plentyofebooks.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.plentyofebooks.net/&lt;/a&gt;\n\nWhy Love Hurts: A Sociological Explanation\nAuthor(s): Eva Illouz\nPublisher: Polity\nDate: 2012\nPages: 304\nFormat: PDF\nLanguage: English\nISBN-10: 0745661521\nISBN-13: 978-0745661520\nSize: 3.77 MB\n\n----------------------------------------------------------------------------------\n----------------------------------------------------------------------------------\n\nDescription:\n\n----------------------------------------------------------------------------------\n----------------------------------------------------------------------------------\n\nFew of us have been spared the agonies of intimate relationships. They come in many shapes: loving a man or a woman who will not commit to us, being heartbroken when we're abandoned by a lover, engaging in Sisyphean internet searches, coming back lonely from bars, parties, or blind dates, feeling bored in a relationship that is so much less than we had envisaged - these are only some of the ways in which the search for love is a difficult and often painful experience.\n\nDespite the widespread and almost collective character of these experiences, our culture insists they are the result of faulty or insufficiently mature psyches. For many, the Freudian idea that the family designs the pattern of an individual's erotic career has been the main explanation for why and how we fail to find or sustain love. Psychoanalysis and popular psychology have succeeded spectacularly in convincing us that individuals bear responsibility for the misery of their romantic and erotic lives. The purpose of this book is to change our way of thinking about what is wrong in modern relationships. The problem is not dysfunctional childhoods or insufficiently self-aware psyches, but rather the institutional forces shaping how we love.\n\nThe argument of this book is that the modern romantic experience is shaped by a fundamental transformation in the ecology and architecture of romantic choice. The samples from which men and women choose a partner, the modes of evaluating prospective partners, the very importance of choice and autonomy and what people imagine to be the spectrum of their choices: all these aspects of choice have transformed the very core of the will, how we want a partner, the sense of worth bestowed by relationships, and the organization of desire.\n\nThis book does to love what Marx did to commodities: it shows that it is shaped by social relations and institutions and that it circulates in a marketplace of unequal actors.\n\n----------------------------------------------------------------------------------\n----------------------------------------------------------------------------------\n\nReviews:\n\n----------------------------------------------------------------------------------\n----------------------------------------------------------------------------------\n\n&quot;A bold, thought-provoking book.&quot;\n--Times Higher Education\n\n&quot;An important book... full of arresting ideas about love in our time&quot;\n--Los Angeles Review of Books\n\n&quot;A significant achievement, a major analysis of love and an important contribution to sociology. It deserves to have a wide readership wherever love is.&quot;\n--The Australian\n\n&quot;Like any sociologist worth her salt, Illouz pushes readers to consider how our experience of love might largely be created by the kind of society we live in. Tracing a sort of history of emotions through archives and literature since the Regency era, she argues that in earlier times people's feelings about love and sentiment were quite different from those we take as self-evident... It is not our own fault love hurts, Illouz tells us; it is inherent to our modern condition.&quot;\n--Inside Story\n\n&quot;Recently named one of the most important thinkers of the future by German newspaper Die Zeit, Illouz could very well be the twenty-first century's next great public intellectual.&quot; \n--Guernica: A Magazine of Art &amp; Politics\n\n&quot;No one will be able to discuss love without referring to this book.&quot; \n--Die Zeit\n\n----------------------------------------------------------------------------------\n----------------------------------------------------------------------------------\n\nAbout the Author:\n\n----------------------------------------------------------------------------------\n----------------------------------------------------------------------------------\n\nEva Illouz is Rose Isaac Chair of Sociology at the Hebrew University of Jerusalem and a member of the Center for the Study of Rationality. Her previous books include Cold Intimacies: The Making of Emotional Capitalism and Consuming the Romantic Utopia: Love and the Cultural Contradictions of Capitalism. Her book Oprah Winfrey and the Glamour of Misery won the American Sociological Association, Culture Section Best Book Award, in 2005.\n\n----------------------------------------------------------------------------------\n----------------------------------------------------------------------------------\n\nNo Password or Surveys. Guaranteed!!!\n\nPlease seed the torrent if you want to Help :)\n &lt;a href=&quot;\nhttp://www.plentyofebooks.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.plentyofebooks.net/&lt;/a&gt;\n\n----------------------------------------------------------------------------------\n----------------------------------------------------------------------------------","torrent":{"xt":"urn:btih:d8aaed5c10cb269cfb64257ef30f37d7f85ed2f7","amp;dn":"Why+Love+Hurts+A+Sociological+Explanation+By+Eva+Illouz+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8aaed5c10cb269cfb64257ef30f37d7f85ed2f7","infoHashBuffer":{"type":"Buffer","data":[216,170,237,92,16,203,38,156,251,100,37,126,243,15,55,215,248,94,210,247]},"announce":[],"urlList":[]}}