{"title":"Series 7 NASD Markets and Regulations Disk 1.avi","uid":3783535,"size":680181040,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:d8c1166b6b10578aa32e1f760d23ca0ef77f9f26&amp;dn=Series+7+NASD+Markets+and+Regulations+Disk+1.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"pkclipper","files":1,"time":1188008288,"description":"Each DVD is approximately 75-120 minutes in length. Topics include: Markets and Regulations, Bond Concepts, The Municipal Bond Market, Fundamentals of Options, Advanced Option Strategies and Margin Accounts, and Investment Companies.\n\nDisk 1\nMarkets and Regulations - Covers self-regulatory organizations, the issuance of securities, and the differences between trading on an exchange and trading over-the-counter.\n\nDisk 2\nBond Concepts - Discusses the fundamentals of debt instruments, including yield calculations, pricing, and various types of risk.\n\nDisk 3\nMunicipal Bond Market - Explains the issuance of municipal bonds, the formation of a syndicate, and MSRB rules. Also discussed at length are characteristics of general obligation bonds and revenue bonds.\n\nDisk 4\nFundamentals of Options - Covers the components of an options contract, strategies for call and put options, and profit and loss analysis.\n\nDisk 5\nAdvanced Option Strategies and Margin Accounts - Begins with advanced option positions, including spreads, straddles, and combinations. The second half covers long and short margin accounts and margin calculations.\n\nDisk 6\nInvestment Companies - Examines the similarities and differences between open-end and closed-end funds and how investment company shares are bought and sold. Also discussed are the many types of fund shares that are available.\n","torrent":{"xt":"urn:btih:d8c1166b6b10578aa32e1f760d23ca0ef77f9f26","amp;dn":"Series+7+NASD+Markets+and+Regulations+Disk+1.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8c1166b6b10578aa32e1f760d23ca0ef77f9f26","infoHashBuffer":{"type":"Buffer","data":[216,193,22,107,107,16,87,138,163,46,31,118,13,35,202,14,247,127,159,38]},"announce":[],"urlList":[]}}