{"title":"Scream of the Ants","uid":8200314,"size":1468791264,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d8de1da394e042052a078f05479ba6f95bb19385&amp;dn=Scream+of+the+Ants&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":6,"time":1361998713,"description":"First of all, this is not a movie for everyone. It is a blend of a feature film and a documentary, but if you ask me - perfectly put together.\n\nThe plot (if there is one) takes place in India. Many wonderful scenes from the hard life of its' people intertwine with dialogs between two main characters (who don't even have names), and their conversations with local people, in which they talk about life, religion and comfort in life.\n\nI expect that many viewers, like the Male character, will not find anything beautiful or comforting in this movie, but only pain and suffering. But it seems to me that the movie does not even try to give any answers, but only to show some viewpoints. In particular, I remember a scene near the end, where a teacher says to a group of kids: &quot;close your eyes and just smell&quot;. To me it seemed as if the director says: &quot;do not try to understand everything you see, just accept it&quot;. And really, there were many scenes that I did not understand, but managed to find beauty inside.\n\ns a newlywed couple boards a train bound for India and are forced to reconcile atheism and faith in director Mohsen Makhmalbaf's spiritual-themed drama. He is a non-believer that is consumed by doubt, and she has faith that life's answers will come to her through prayer. Though there is little that this newlywed couple can agree upon -- including the prospect of having children -- they do love each other and are intent upon sharing a spiritual honeymoon. In the midst of a philosophical debate, a holy man on the tracks forces the train to grind to a halt. While the local beggars revere the man for his power over the imposing locomotives, the truth is much less mystical. Years ago the man failed in committing suicide on the tracks when the oncoming train saw him and slowed down. These days he is compelled by the beggars to reenact the &quot;miracle&quot; daily so that the train will stop and they can collect alms from the passengers. ~ Jason Buchanan, Rovi\n\n\nDialogue List: &lt;a href=&quot;\nhttp://www.makhmalbaf.com/doc/070717060853ScreamoftheAnts.doc&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.makhmalbaf.com/doc/070717060853ScreamoftheAnts.doc&lt;/a&gt;","torrent":{"xt":"urn:btih:d8de1da394e042052a078f05479ba6f95bb19385","amp;dn":"Scream+of+the+Ants","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8de1da394e042052a078f05479ba6f95bb19385","infoHashBuffer":{"type":"Buffer","data":[216,222,29,163,148,224,66,5,42,7,143,5,71,155,166,249,91,177,147,133]},"announce":[],"urlList":[]}}