{"title":"5 Day Yoga with Ashley Turner x264 aac [MP4]","uid":11819130,"size":1340473840,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:d9649cf8eadae40746cfc1d8e01823b1baf043dd&amp;dn=5+Day+Yoga+with+Ashley+Turner+x264+aac+%5BMP4%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"elessedilgirl","files":9,"time":1429220108,"description":"Filmed in a lush garden overlooking the Pacific Ocean, this comprehensive series offers five different 15-minute yoga sessions. The Strength &amp; Stamina practice focuses on toning the lower body with a strong series of standing poses. Energy &amp; Flexibility is an uplifting session designed to increase flexibility, release physical tension and leave you feeling energized. The Core Power sequence focuses on toning and strengthening the abdominals as well as conditioning the cardiovascular system. The Stretch &amp; Restore session systematically releases tension commonly held in the upper back, neck and shoulders to help improve posture and leave you feeling revitalized. The Stress Relief &amp; Meditation segment is a perfect combination of standing and seated poses to flush out stress followed by a simple, potent breath meditation for calm clarity. Choose one practice each day or link several together to create a custom yoga program that can help you look and feel better than ever.\n\nAshley Turner is one of the premiere yoga teachers in Los Angeles. She holds a Master's in Counseling Psychology and is known for her unique approach to yoga: a combination of physical instruction and mental application to help her students channel energy, release stress and improve fitness. Named in the Who s Who of Power Yoga by Yoga Journal, Ashley has been featured in other prestigious publications such as Health, Women's Health and YogiTimes. With a list of clientele that includes models, Hollywood creatives, distinguished business leaders and renowned musicians, Ashley has taught yoga in group classes, international retreats, and private sessions for over ten years.\n\nIntroduction 2.28\nStrength &amp; Stamina 14.40\nEnergy &amp; Flexibility 14.41\nCore Power 17.22\nStretch &amp; Restore 17.00\nStress Relief &amp; Meditation 16.53\nCool Down 7.39\n\nVideo; x264; 720*404 (16:9); 1744 kbps; 23.976 fps\nAudio; aac; 160 kbps; 2 ch; 48.0 Khz","torrent":{"xt":"urn:btih:d9649cf8eadae40746cfc1d8e01823b1baf043dd","amp;dn":"5+Day+Yoga+with+Ashley+Turner+x264+aac+%5BMP4%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9649cf8eadae40746cfc1d8e01823b1baf043dd","infoHashBuffer":{"type":"Buffer","data":[217,100,156,248,234,218,228,7,70,207,193,216,224,24,35,177,186,240,67,221]},"announce":[],"urlList":[]}}