{"title":"Sex Freak XXX DVDRip","uid":12158572,"size":1281074843,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:d9e0eb75f58a09bafdfd41d9ec91c8c41cc0aa09&amp;dn=Sex+Freak+XXX+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Ctrlme","files":6,"time":1437832701,"description":"Sex Freak XXX DVDRip\n-----------------------------------------\nScreenshot(s):   &lt;a href=&quot;\nhttp://imgctrl.com/image/CUX&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/CUX&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgctrl.com/image/CUQ&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/CUQ&lt;/a&gt;\n\n   Scene 1. Nyrobi, Stephanie Swift, Tom Byron\n   Scene 2. Paisley Hunter, 2 guys\n   Scene 3. Lennox, Paisley Hunter, 2 guys, Dave Hardman, Frank Towers\n   Scene 4. Caressa Savage, Dorian Grant, Kim Kitaine, Lovette\n   Scene 5. Missy, Nici Sterling, Alex Sanders\n   Scene 6. Lovette, John Decker\n   Scene 7. Lovette, 3 guys, John Decker, Michael J. Cox, Nick East\n\n   Adam Film World Awards, 1996\n       Winner: Best Film\n\n   AVN Awards, 1997\n       Winner: Best Anal Sex Scene: Film, Lovette\n\n   XRCO Awards, 1996\n       Winner: Best Film\n\nGreg Dark's latest movie uses\nvoodoo dolls to make the babes do the nasty stuff.  It starts with Nyrobi\nKnight watching Stephanie Swift get fucked with a condom covered\ndick which the guys cums into and emptys all over her face.  Steph\nthen chews on the rubber while Nyrobi gets it in the ass from the guy. =\n\nSecond scene - Paisley Hunter's clothes are cut off by two guys dressed\nup in giant fly garb complete with wings and facemasks.  They lick her\nbutt, finger her ass, dp her into oblivion and jerk off onto a glass jar\ncontaining her voodoo doll.  She licks their scum off the jar.\n\nScene 3 - 3 guys in devil's suits gang up on some exotic dark skinned\nbabe with 4 piercings in her nose, belly, clit, and hair covered pussy lip.\n\nThey lick her asshole quite a bit before Paisley joins the party.  Then\nthe exotic babe gets it up the hershey highway but good as she screams\nthroughout the long ordeal and begs them constantly to fuck her harder\nand faster while calling herself a slut.  She's right - she is a slut.  \n\nScene 4 - 4 girls lez it up while some guys watch them and jerk off including\nsome guy with a cunt.  Unfortunately the only anal in this scene is\nsome butt licking and fingering, plus the appearance of some anal\nbeads that are sadly never put to use.  Why even bring them out?  We'll\nnever know.\n\nScene 5 - Nici Sterling sucks a guy off while Missy licks his asshole.\nHe returns the favor and licks her asshole while her tongue is replanted\nin Nici's asshole.  Then Nici get's analed, a prelude to an even better\nanal with Missy.  The guy cums into her ass crack and Nici licks up the\nsauce before he reinserts it into Missy's ass for more anal fun.  \n\nScene 6 -  Some guy licks and fingers Lovette's ass, then fucks her\nwhile she eats some food.  Her cream filled desert cake gets smeared all\nover her face and big tits.  Then she eats half a peach, lets the guy cum\non her fruit, then licks the cum off and continues to eat.  Must have\nbeen hungry.\n\nScene 7 - Lovette returns with 5 guys dressed in skeleton suits.  They\nstick their bony skeleton fingers in her shaved cunt and tight ass, give\nher some anal, followed by a dp.  Then each guy gets another turn in\nher ass doggie style.  There's so many anals I lost count.  Finally each\nguy unloads on her face.  Great weird movie.\n\n   Ctlme Ultra Fast Speeds / SpeedTest Proof\n----------------------------------------------- &lt;a href=&quot;\nhttp://www.speedtest.net/result/4529516639.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.speedtest.net/result/4529516639.png&lt;/a&gt;","torrent":{"xt":"urn:btih:d9e0eb75f58a09bafdfd41d9ec91c8c41cc0aa09","amp;dn":"Sex+Freak+XXX+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9e0eb75f58a09bafdfd41d9ec91c8c41cc0aa09","infoHashBuffer":{"type":"Buffer","data":[217,224,235,117,245,138,9,186,253,253,65,217,236,145,200,196,28,192,170,9]},"announce":[],"urlList":[]}}