{"title":"Green Remodeling: Changing the World One Room at a Time","uid":8346737,"size":106398968,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:da0138c7d62acaa21b046232f964b38c96439c6c&amp;dn=Green+Remodeling%3A+Changing+the+World+One+Room+at+a+Time&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1365227131,"description":"Green Remodeling: Changing the World One Room at a Time\nNew Society | David R. Johnston | 2004 | HQ PDF+OCR | ISBN: 0865714983 | 400 pages | 101 Mb\n\nWhether because of changing lifestyles or simply because houses are becoming outdated, millions of North Americans are renovating their homes every year, spending more money annually on renovation than on new-home construction. But renovations can be fraught with unintended consequences like indoor air pollution. How do you remodel in a healthy, environmentally friendly way?\n\nGreen Remodeling is a comprehensive guide. It first points out the advantages of remodeling. Buildings are responsible for 40% of worldwide energy flow and material use; so how you remodel can make a difference. Upgrading furnaces, cabinets and toilets means less fossil fuel pollution, reduced resource depletion and fewer health risks. Green remodeling is more energy-efficient, more resource-conserving, healthier for occupants and creates buildings that are more affordable to build, operate and maintain.\n\nThe book then discusses simple green renovation solutions for homeowners, focusing on key aspects of the building, including foundations, framing, plumbing, windows, heating and finishes. Room by room, it outlines the intricate connections that make the house work as a system. For example, how new windows may affect the structure and mechanical systems of the rooms below, the health of the family and the future of old-growth forests. Then, in an easy-to-read format complete with checklists, personal stories, expert insights and an extensive resource list, it covers easy ways to save energy, conserve natural resources and protect the health of loved ones. Addressing all climates, this is a perfect resource for conventional homeowners, as well as for architects and remodeling contractors.","torrent":{"xt":"urn:btih:da0138c7d62acaa21b046232f964b38c96439c6c","amp;dn":"Green+Remodeling%3A+Changing+the+World+One+Room+at+a+Time","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da0138c7d62acaa21b046232f964b38c96439c6c","infoHashBuffer":{"type":"Buffer","data":[218,1,56,199,214,42,202,162,27,4,98,50,249,100,179,140,150,67,156,108]},"announce":[],"urlList":[]}}