{"title":"By Way Of Deception: The Making And Unmaking Of A Mossad Officer","uid":11550574,"size":3980595,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:da0e0106f7ff344adad01fe60b6b3fa5ddd634c8&amp;dn=By+Way+Of+Deception%3A+The+Making+And+Unmaking+Of+A+Mossad+Officer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"HowdyDooDoo","files":-1,"time":1416775772,"description":"The # 1 New York Times best seller the Israeli foreign intelligence agency The Mossad tried to ban. The making of a Mossad officer is the true story of an officer in Israel's most secret agency. The first time the Mossad came calling, they wanted Victor Ostrovsky for their assassination unit, the kidon. He turned them down. The next time, he agreed to enter the grueling three-year training program to become a katsa, or intelligence case officer, for the legendary Israeli spy organization. By Way of Deception is the explosive chronicle of his experiences in the Mossad, and of two decades of their frightening and often ruthless covert activities around the world. Penetrating far deeper than the bestselling Every Spy a Prince, it is an insider's account of Mossad tactics and exploits. In chilling detail, Ostrovsky asserts that the Mossad refused to share critical knowledge of a planned suicide mission in Beirut, leading to the death of hundreds of U.S. Marines and French troops. He tells how they tracked Yasser Arafat by recruiting his driver and bodyguard; how they withheld information on the whereabouts of American hostages, paving the way for the Iran-Contra scandal; and how their intervention into secret UN negotiations led to the sudden resignation of ambassador Andrew Young and the downfall of his career. By Way of Deception describes the shocking scope and depth of the Mossad's influence, disclosing how Jewish communities in the U.S., Europe, and South America are armed and trained by the organization in secret ?self-defense? units, and how Mossad agents facilitate the drug trade in order to pay the enormous costs of its far-flung, clandestine operation. And it portrays a network that has grown dangerously out of control, as internal squabbles have led to the escape of terrorists and the pursuit of policies completely at odds with the interests of the state of Israel. This document is possibly the most important and controversial book of its kind since Spycatcher","torrent":{"xt":"urn:btih:da0e0106f7ff344adad01fe60b6b3fa5ddd634c8","amp;dn":"By+Way+Of+Deception%3A+The+Making+And+Unmaking+Of+A+Mossad+Officer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da0e0106f7ff344adad01fe60b6b3fa5ddd634c8","infoHashBuffer":{"type":"Buffer","data":[218,14,1,6,247,255,52,74,218,208,31,230,11,107,63,165,221,214,52,200]},"announce":[],"urlList":[]}}