{"title":"Siralim v1.0.14-FAS","uid":10942079,"size":25882501,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:da2d08c422b56bc9dce140d2faf4748dedf539a8&amp;dn=Siralim+v1.0.14-FAS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Nimbleton","files":-1,"time":1409552137,"description":"Siralim v1.0.14-FAS\n\n\nYou are the king (or queen!) of the thriving kingdom of Siralim. It is your duty to protect your kingdom and its people from the dangers lurking beyond your castle's walls. Summon hundreds of unique creatures to fight by your side as you adventure through randomly generated dungeons and complete randomly generated quests. Find rare treasure and use it to upgrade your castle, empower your creatures, learn new spells, and much more.\n\nHere's a taste of what Siralim has to offer:\n\n    Adventure through endless randomly generated dungeons and complete randomly generated quests with a roguelike aesthetic.\n    Capture and summon any of 229 unique creatures to fight by your side in strategic battle. Each creature has its own distinct abilities that change the way you approach each fight. Choose a team of six creatures with abilities that complement each other for maximum success.\n    Support your creatures by casting over 120 devastating spells.\n    Fight in challenging battles that require thoughtful strategy rather than mindless button mashing. The AI is very intelligent and you cannot afford to let your guard down.\n    Upgrade your castle to add new rooms and features, to unlock new creatures, or to entice new citizens to live in your kingdom.\n    Craft and enchant equipment to augment your creatures' power or to grant them new abilities. There are over 300 different crafting materials to collect and use.\n    Craft powerful eggs which will someday hatch into god-like creatures.\n    Fight in your kingdom's battle arena for fame, glory, and treasure.\n    Summon powerful boss fights using magical sigils. If you can defeat these bosses, you will be rewarded with powerful artifacts for your creatures to use in battle.\n    Infinite playability. There are no level caps, no restrictions, and the game never ends. Want to play until your character is level 937? Go for it.\n    A roguelike overworld where you can see your enemies approach you before battle begins. Navigate strategically if you want to avoid the most dangerous battles.\n    Looking for an even greater challenge? Play the game in optional permadeath mode, where each battle might be your last. \n\nAnd here's some even better news: the game is already released!\nVisit www.siralim.com and try our free demo, purchase the game, and join our community!\n\nFAQ\n----------\nQ: What platforms is Siralim for?\nA: For now, we are focusing on Windows, Mac, iOS, and Android. Other platforms may be targeted in the future. Note that the open beta version of Siralim is for Windows only, but the game will be released for these other platforms at the same time as the Windows release.\n\nQ: What are your plans now that Siralim has been released?\nA: We plan to release large, frequent content updates. We also want to add multiplayer support (PvP, trading, leaderboards, events, etc) at some point as well. We will also look into releasing the game on additional platforms such as Linux and PS Vita.\n\nQ: What games was Siralim inspired by?\nA: Our most significant inspiration is the original Dragon Warrior Monsters series for Gameboy. As you can see, the art style is quite similar to those games. The main difference is that Siralim is less story-driven and more focused on refined gameplay and depth. We also drew inspiration from other games including Castle Quest 2 and a little bit from Master of Magic.","torrent":{"xt":"urn:btih:da2d08c422b56bc9dce140d2faf4748dedf539a8","amp;dn":"Siralim+v1.0.14-FAS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da2d08c422b56bc9dce140d2faf4748dedf539a8","infoHashBuffer":{"type":"Buffer","data":[218,45,8,196,34,181,107,201,220,225,64,210,250,244,116,141,237,245,57,168]},"announce":[],"urlList":[]}}