{"title":"World War III","uid":3925349,"size":68287348,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:da366d71518701b681f3dec623e30cb024cc80c5&amp;dn=World+War+III&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Zero_Assassin","files":4,"time":1197053585,"description":" &lt;a href=&quot;http://en.wikipedia.org/wiki/World_War_III_(comics)#52&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://en.wikipedia.org/wiki/World_War_III_(comics)#52&lt;/a&gt;\n\n\n52\n\nThe title World War III was also used in 2007 for a six-issue limited series written by Keith Champagne (#1-2) and John Ostrander (#3-4), and drawn by Ethan Van Sciver. It tells the story of Black Adam&amp;#039;s rage against humanity after his family was murdered, and he can only be stopped when the entire superhero community rallies together. The mini-series was a tie into DC&amp;#039;s weekly comic book series, 52, occurring on &quot;Week 50&quot; of the series, which takes place during the missing year following Infinite Crisis. Indeed, 52 was inititally conceived to explain many of the drastic changes that occurred in the DC Universe during that missing year; however, the series ultimately evolved in a different direction, focusing on its own cast of characters, and consequently, World War III was conceived to revisit the original intent of the series and explain the changes that occurred. [1]\n\n[edit] Synopsis\n\nFive weeks before the main events of the series, Martian Manhunter tries to telepathically fight Black Adam following his complete obliteration of Bialya, but is overwhelmed by his darkest memory and flees into space, from where he will observe the upcoming battle, which is narrated through his point of view.\n\nDuring week 50, Black Adam rampages all over the planet, plunging it into fear and vandalism. Father Time unsuccessfully tries to stop him on American shores, and when falling debris from the battle threatens New York City, Firestorm is forced out of retirement, along with Firehawk, while Nightwing (hinted to be Jason Todd while in the role by his ruthlessness) tries to stop looting in streets.\n\nIn the meantime, J&amp;#039;onn observes Supergirl return from the 31st century. Unstable from the time travel she passes through J&amp;#039;onn. Her form stabilizes as she plunges to Earth.\n\nEvery hero then tries to do his best in his respective roles, with Harvey Dent defending Gotham from Killer Croc, the Doom Patrol trying to halt Black Adam&amp;#039;s rampage in Pisa and Donna Troy taking over Wonder Woman&amp;#039;s mantle. In Sub Diego the effects of the Geiss serum are wearing off, turning the population into air-breathers again, except for Aquagirl and a few others, who asks for the help of Aquaman. The latter confers with the sea-gods, Poseidon and Triton, asking for the power to save the Subdiegoans. The gods, while denying any involvement with the aquatic humans&amp;#039; fate, grants Aquaman powers, with a ritual meant to give him the power of the &quot;dark gods&quot; of Atlantis, involving his new aquatic hand and the bones of his severed former one. Aquaman succeeds in raising back a big portion of Sub Diego, saving his inhabitants, but he&amp;#039;s transfigured in a monstrous, amnesiac and almost mad form, the Dweller in the Depths.\n\nJ&amp;#039;onn continues following Black Adam&amp;#039;s trail, distracting his thoughts from the Justice Society, once again united to give aid to the suffering populace. He finds him battling the Teen Titans, asking vengeance for their supposed betrayal of Osiris. He kills Young Frankenstein and Terra, causing J&amp;#039;onn to come back to Earth, and alerting Checkmate. Kate Spencer&amp;#039;s cover as Manhunter is almost blown, still her pursuing of the greater good convinced J&amp;#039;onn to enact another step in his maturation: he goes to his former police district as John Jones, revealing himself to his former friends, and burning his former detective agency to the ground to prevent himself from ever assuming a disguise again.\n\nFinally Black Adam is stopped in China by the Great Ten, who allows the Justice Society and the other superheroes to join in battle. J&amp;#039;onn himself shows up, fighting actively with Adam, and using his link with him to fill his mind with images from the destruction of Mars and from every death he has caused during World War III. Black Adam is halted for a few minutes, just the time needed for Captain Marvel to force a magic lightning bolt on him, turning Black Adam back to Teth-Adam and changing his magic word into an unknown one. This lightning also wounds J&amp;#039;onn, who nevertheless is able to awake in his One Year Later form, freed from the forced link with Adam&amp;#039;s mind, but willing to rethink his whole life as a Martian being on Earth, and no more an alien being pretending to be as human as possible.\n\nFrom their satellite base, the Monitors declare the end of &quot;World War III&quot;, intended as the war of one man against the whole world, but they do express fear for an even darker event looming over Earth.","torrent":{"xt":"urn:btih:da366d71518701b681f3dec623e30cb024cc80c5","amp;dn":"World+War+III","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da366d71518701b681f3dec623e30cb024cc80c5","infoHashBuffer":{"type":"Buffer","data":[218,54,109,113,81,135,1,182,129,243,222,198,35,227,12,176,36,204,128,197]},"announce":[],"urlList":[]}}