{"title":"My Dinner with Andre (870MB version) moviesbyrizzo","uid":6589815,"size":913281643,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:db8a732e3f8c2727ff6404ce816da52670db2be5&amp;dn=My+Dinner+with+Andre+%28870MB+version%29+moviesbyrizzo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"moviesbyrizzo","files":-1,"time":1312782854,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0082783/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0082783/&lt;/a&gt;\n\nConverted from the dvd9 Criterion Collection edition which also\nyielded two brief clips of interviews with the two main actors of \nthe movie which are included here for your edification equally.\n\n870MB version - also available 1.59GB version posted separately\n\n720 X 480 at 881k video bitrate, 192k audio for those fans of this\nstuff that have made clear they want to fully get the goods on this movie.\nFor the better video version avail yourselves of our 1.59GB version instead,\nI suggest - as it offers 1800k video bitrate quality at 224k audio too\n\nSRT subtitles in English (template which may be used to instantl;y translate\nto any other kanguage using the freely available donation supported &quot;Subtitles\nEditor&quot; utility from Denmark's nikse.dk along with the free &quot;Google translate&quot;\nwebsite facility or what have you), along with French Spanish and Portuguese.\n\n\n&quot;My Dinner with Andre - 1981&quot; is a movie that strives for profundity while\ninstead bordering at all times on the inane. A complete lack of connection \nto what are real human ideas of relating and sharing in beauty that comes from\na fullness of true human emotions free of retarding instincts and insane drives\nto make thngs somehow weird and strange and alien which gives meaning to those\nthat lack this basis for their own idea of genius.\n\nIt is quite true that &quot;speaking in a feign&quot; or to cause somehow having to\nconstantly read between the lines suggests an arrogance towards the audience in\nthis sort of mindset which doesnt wish to or want to revaeal its own agenda for\nwhat makes its own existentialism - which is generally intolerable by comparison\nI submit, if it is to be &quot;brought out into the open&quot; - suffice it to say\nThat &quot;to throw a teddy bear into the air&quot; in order to astound the 140 people\nwatching may seem like the thrill of a lifetime to a small mind, however\nthere is a lack of credibility established on the part of the advocates\nof such a lifestyle of &quot;constantly venting&quot; inane psychosis - to those that\nmust now decide if the experiment has run its course and needs to be declared\na dismal failure in what is human history for better notions that are more\nthan just equal to the sensibly inane.\n\n\nMichael Rizzo Chessman\nmoviesbyrizzo\n","torrent":{"xt":"urn:btih:db8a732e3f8c2727ff6404ce816da52670db2be5","amp;dn":"My+Dinner+with+Andre+%28870MB+version%29+moviesbyrizzo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db8a732e3f8c2727ff6404ce816da52670db2be5","infoHashBuffer":{"type":"Buffer","data":[219,138,115,46,63,140,39,39,255,100,4,206,129,109,165,38,112,219,43,229]},"announce":[],"urlList":[]}}