{"title":"Survivor - Eye of the Tiger (Soundtrack: Rocky lll) (2nafish)","uid":5394047,"size":151576580,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:dbdcb40840494c48c4892da2c3adb8d39b3f727c&amp;dn=Survivor+-+Eye+of+the+Tiger+%28Soundtrack%3A+Rocky+lll%29+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"2nafish","files":-1,"time":1267167905,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nNote: This video is a &quot;Movies &amp; Music&quot; video so it has 2 logos.\n\n\n\n&quot;Eye of the Tiger&quot; is a song performed by the American rock band Survivor from the album Eye of the Tiger, released in 1982. It was used at the request of Sylvester Stallone for the film Rocky III. The mix of the song heard in the film features tiger growls, though these are omitted on the album and single versions.\n\n&quot;Eye of the Tiger&quot; topped the Billboard Hot 100 singles chart for six weeks beginning July 24, 1982. The single was number two on the Billboard Top Pop Singles of 1982 year-end chart and number one on the Cash Box Top 100 Pop Singles year-end chart. &quot;Eye of the Tiger&quot; also reached number one in the UK, Irish and Australian charts. The single was certified platinum by the Recording Industry Association of America in 1982, representing two million records sold in the U.S. Survivor won the Grammy Award for Best Rock Performance by a Duo or Group with Vocal for &quot;Eye of the Tiger&quot;. The song received an Academy Award nomination for Best Original Song and was voted &quot;Favorite Song&quot; by the People's Choice Awards (in a tie with &quot;Truly&quot; by Lionel Richie).\n\nIn an interview with Songfacts, co-writer Jim Peterik explained the song's title.\n\n    At first, we wondered if calling it 'Eye Of The Tiger' was too obvious. The initial draft of the song, we started with 'It's the eye of the tiger, it's the thrill of the fight, rising up to the spirit of our rival, and the last known survivor stalks his prey in the night, and it all comes down to survival.' We were going to call the song 'Survival.' In the rhyme scheme, you can tell we had set up 'rival' to rhyme with 'survival.' At the end of the day, we said, 'Are we nuts?' That hook is so strong, and 'rival' doesn't have to be a perfect rhyme with the word 'tiger.' We made the right choice and went with 'Eye Of The Tiger.\n\nThe song was listed at #21 on Billboard's All Time Top 100 and was named the 63rd best hard rock song of all time by VH1.\n\nEye of the Tiger is the third album by the American rock band Survivor, released in 1982. It features the title track, which is the theme song of the film Rocky III.\n\nThis is one of their very few studio albums still commercially available, as Volcano Entertainment took a great deal of their releases out of print in August of 2009.\n\nSurvivor is an American rock band formed in Chicago in 1978. The band achieved its greatest success in the 1980s with its pop rock sound, which garnered many charting singles, especially in the United States. The band is best known for its Double Platinum-certified 1982 mega-hit &quot;Eye of the Tiger&quot;, the theme song for the motion picture Rocky III (US #1 for 6 weeks). Singles like &quot;Burning Heart&quot; (US #2), &quot;The Search Is Over&quot; (US #4), &quot;High on You&quot; (US #8) and &quot;I Can't Hold Back (US #13) continued to chart in the mid-1980s.\n\nThe band tweaked its musical direction in 1988 with the release of the slightly heavier Too Hot to Sleep, but due to changes in the music industry and shift of popularity towards glam metal bands like MÃƒÂ¶tley CrÃƒÂ¼e and Poison, the album barely reached the Billboard 200 in the United States. Because of this, the band split. Singer Jimi Jamison later toured as 'Survivor' in the mid-1990s, to the chagrin of the rest of the band. Jamison re-united with the band's other members in 2000 and the band released Reach in 2006, but Jamison left the band after its release and was replaced by Robin McAuley. The band has continued to tour with McAuley into 2008.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:dbdcb40840494c48c4892da2c3adb8d39b3f727c","amp;dn":"Survivor+-+Eye+of+the+Tiger+%28Soundtrack%3A+Rocky+lll%29+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dbdcb40840494c48c4892da2c3adb8d39b3f727c","infoHashBuffer":{"type":"Buffer","data":[219,220,180,8,64,73,76,72,196,137,45,162,195,173,184,211,155,63,114,124]},"announce":[],"urlList":[]}}