{"title":"Deformation and Fracture of Solid-State Materials","uid":12127874,"size":11451233,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dbf96dd1be1dc30397d56d1b1ca1dc27feaf82ca&amp;dn=Deformation+and+Fracture+of+Solid-State+Materials&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1436971937,"description":"Deformation and Fracture of Solid-State Materials - Sanichiro Yoshida (Springer, 2015).pdf\n\nISBN 978-1-4939-2097-6\n\nThis volume introduces a comprehensive theory of deformation and fracture to engineers and applied scientists. Here comprehensive means that the theory can describe all stages of deformation from elastic to plastic and plastic to fracturing stage on the same basis (equations). The comprehensive approach is possible because the theory is based on a fundamental physical principle called the local symmetry, or gauge invariance, as opposed to phenomenology.\n\nProfessor Yoshida explains the gist of local symmetry (gauge invariance) intuitively so that engineers and applied physicists can digest it easily, rather than describing physical or mathematical details of the principle. The author also describes applications of the theory to practical engineering, such as nondestructive testing in particular, with the use of an optical interferometric technique called ESPI (Electronic Speckle-Pattern Interferometry).The book is not a manual of applications. Instead, it provides information on how to apply physical concepts to engineering applications","torrent":{"xt":"urn:btih:dbf96dd1be1dc30397d56d1b1ca1dc27feaf82ca","amp;dn":"Deformation+and+Fracture+of+Solid-State+Materials","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dbf96dd1be1dc30397d56d1b1ca1dc27feaf82ca","infoHashBuffer":{"type":"Buffer","data":[219,249,109,209,190,29,195,3,151,213,109,27,28,161,220,39,254,175,130,202]},"announce":[],"urlList":[]}}