{"title":"AGI- Super Tuning The Factory Rifle","uid":4779645,"size":1456344678,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:dbfaf5e5cbefa7116d0b90b75c0e79a93176220b&amp;dn=AGI-+Super+Tuning+The+Factory+Rifle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"x_DontTreadOnMe_x","files":-1,"time":1237333784,"description":"Full credit goes to apex001 of Demonoid for providing this, simply moving it here so it gets more downloads.\n\n&quot;Before you go out and spend hundreds, possibly thousands of dollars on a new Custom rifle, first squeeze all the potential performance out of the rifles that you already own! In this course Darrell will show you how to cut your group sizes in half or more by improving the rifles function using existing parts and by employing the tricks of custom gun makers that you can do yourself. Save Big Bucks by &quot;Saving&quot; your existing barrel by recrowning, setting back and re-throating the chamber. When to do Cryo work and stress relief, heavy, pinned, recoil lug, blueprinting the action and lapping the lugs, bedding for 100% contact and all the details of perfect stock fit.\n\nPlus- trick after market parts that really work, proper barrel break-in techniques, fitting a special firing pin, trigger, bolt stop and Why. Everything that you need to know to tune up your factory rifle is covered in this course.\n\nAlthough most applicable to the Remington 700 and Winchester Model 70 rifles which are covered in detail, many of the techniques can be applied to numerous other models as well.\n\nNotes: This includes the technical manual/blueprint directly from the DVD!&quot;\n\n~~~\n\nI am always adding new things, so check this account often.\n\nVisit roguesci (dot) org (slash) theforum, and register, for the world's longest running largest explosives and weapons forum on the web!","torrent":{"xt":"urn:btih:dbfaf5e5cbefa7116d0b90b75c0e79a93176220b","amp;dn":"AGI-+Super+Tuning+The+Factory+Rifle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dbfaf5e5cbefa7116d0b90b75c0e79a93176220b","infoHashBuffer":{"type":"Buffer","data":[219,250,245,229,203,239,167,17,109,11,144,183,92,14,121,169,49,118,34,11]},"announce":[],"urlList":[]}}