{"title":"Paul Westerberg - 1993 - 14 Songs  [EAC - FLAC]","uid":5030023,"size":330966434,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:dc5666207a056d3632facfc33eab6f748c478feb&amp;dn=Paul+Westerberg+-+1993+-+14+Songs++%5BEAC+-+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"bludStain","files":-1,"time":1248873294,"description":"\n\nPaul Westerberg - 1993 - 14 Songs  [EAC - FLAC]\n\nNot my rip but worth sharing.  \n\n01 - Knockin on Mine     Westerberg     3:43\n02 - First Glimmer     Westerberg     4:55\n03 - World Class Fad     Westerberg     3:27\n04 - Runaway Wind     Westerberg     4:23\n05 - Dice Behind Your Shades     Westerberg     4:11\n06 - Even Here We Are     Westerberg     1:39\n07 - Silver Naked Ladies     Westerberg     4:38\n08 - A Few Minutes of Silence     Westerberg     3:17\n09 - Someone I Once Knew     Westerberg     3:06\n10 - Black Eyed Susan     Westerberg     3:33\n11 - Things     Westerberg     3:21\n12 - Something Is Me     Westerberg     2:18\n13 - Mannequin Shop     Westerberg     3:11\n14 - Down Love     Westerberg     2:15\n\n\n\nReview    by Jack Rabid, The Big Takeover\nPaul Westerberg's second solo LP (we all know the Replacements' final All Shook Down was really not a band LP) is a damn sight better than his first, with a batch of really nice tunes and some renewed enthusiasm (it's not as much of a downer); still, it's hard to resist the belief that he's capable of more than this. The fault is two-fold: One, fire co-producer Matt Wallace, who is more and more looming as the villain on Paul's last three LPs. The most convincing recordings here are the two crude demos Westerberg set down alone in the kitchen of his house. His voice and tune devastate or kindle one's inner emotions by themselves. Compare these naked pathos with the somewhat rote &quot;Knockin' on Mine&quot; (a rip-off of Don't Tell a Soul's &quot;Talent Show&quot;) or the just-tossed-off &quot;Things,&quot; and it appears the lack of warmth in Wallace's familiar sound is pulling Paul's otherwise tremendous fervor down. Secondly, the first six Replacements' LPs all had more convincing material than this, culminating in the terrific Pleased to Meet Me. When inspired, he can still recall some of those heights: &quot;Dice Behind Your Shades&quot; remembers that former intimacy and sharp hooks, as do bits of &quot;First Glimmer,&quot; &quot;Runaway Wind,&quot; and the attempts at old raucous pounders, &quot;Silver Naked Ladies&quot; and &quot;World Class Fad.&quot; But they all still fall short of his former one-in-a-zillion singer/songwriter greatness. In fact, what really saves him on this record is his singing -- since the melodies and riffs are just good, not great, it takes a vocalist of his throaty gifts to deliver the pleasure. At times tender, sometimes who-gives-a-crap, other times amused or mildly sad and pensive, Westerberg makes us shower singers jealous over how much he can convey with just his pipes. All the more reason to record future albums by himself in his kitchen? Or how about Westerberg &quot;unplugged&quot; from his living room? Talent like this is always best raw, whether &quot;Kids Won't Follow&quot; or &quot;Never Mind&quot; or &quot;Kiss Me on the Bus.&quot; He'll never get that from Wallace, but he'll still shine through anyway. ","torrent":{"xt":"urn:btih:dc5666207a056d3632facfc33eab6f748c478feb","amp;dn":"Paul+Westerberg+-+1993+-+14+Songs++%5BEAC+-+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc5666207a056d3632facfc33eab6f748c478feb","infoHashBuffer":{"type":"Buffer","data":[220,86,102,32,122,5,109,54,50,250,207,195,62,171,111,116,140,71,143,235]},"announce":[],"urlList":[]}}