{"title":"Steam Generators: Description and Design by Donatello","uid":6454901,"size":17358202,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dcb94a50acd8ee3beb5e34335949fec7bba00716&amp;dn=Steam+Generators%3A+Description+and+Design+by+Donatello+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"abuel-3bbas","files":1,"time":1307551471,"description":"Steam Generators: Description and Design by Donatello Annaratone\nProduct Description\nThis book originates from 35 years of teaching Steam Generators to graduate students at the Politecnico of Milan, and from 45 years of professional activity in this area. This book has been written for practicing designers, users, and engineers of steam generators in order to guide them through practical problems and help avoiding technical mistakes. Technical studies and solutions for various applications are presented, and the author presents some of his original studies.\n\nFrom the Back Cover\nThe contents of this book originates from 35 years of teaching Steam Generators to graduate students at the Politecnico of Milan, Italy and from 45 years of professional activity in this area. This book has been written for practising designers, users, and engineers of steam generators in order to guide them through practical problems and help avoiding technical mistakes. Also the academic scientists and university students who are interested in problems of power generation can find useful information.\nThe first part of the book presents the different types of generators which are installed either in industrial plants like power plants. In particular boilers for energy of regenerative sources are included. Information about the optimized solutions, the energetic saving, and the mistakes to be avoided is given to the designer. In the second section both, the thermodynamic calculation and the fluid dynamics are developed according to rigorous scientific criteria. In this section, the author presents several of his original studies. Finally, optimizing criteria are illustrated and computer calculations are shown according to the calculation criteria that are indicated in the book.\nAn appendix includes an in-depth analysis of a few topics discussed in previous chapters and a study about finned tubes.\n\nProduct Details\nHardcover: 427 pages\nPublisher: Springer; 1 edition (October 21, 2008)\nLanguage: English\nISBN-10: 9783540777144\nISBN-13: 978-3540777144\nASIN: 3540777148\n\n[poly-technic.blogspot]\n","torrent":{"xt":"urn:btih:dcb94a50acd8ee3beb5e34335949fec7bba00716","amp;dn":"Steam+Generators%3A+Description+and+Design+by+Donatello+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dcb94a50acd8ee3beb5e34335949fec7bba00716","infoHashBuffer":{"type":"Buffer","data":[220,185,74,80,172,216,238,59,235,94,52,51,89,73,254,199,187,160,7,22]},"announce":[],"urlList":[]}}