{"title":"Disappearing Palestine","uid":6564489,"size":1676707,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dd55ee273957458960c60b3c288dc611c9e47c07&amp;dn=Disappearing+Palestine&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rajin.33","files":1,"time":1311617654,"description":"Jonathan Cook (born 1965) is a British writer and a freelance journalist based in Nazareth, Israel, who writes about the Middle East, and more specifically, the Israeli-Palestinian conflict.\n\nThis book is describes how Palestine is fast disappearing and fulfilling the objectives of Israel's founding fathers. Over many decades, Israel has developed and refined policies to disperse, imprison and impoverish the Palestinian people, in a relentless effort to destroy them as a nation. It has industrialized Palestinian despair through ever more sophisticated systems of curfews, checkpoints, walls, permits and land grabs. Cook analyzes how Israel has transformed the West Bank and Gaza into laboratories for testing the infrastructure of confinement, creating a lucrative &quot;defense&quot; industry by pioneering the technologies needed for urban warfare, \ncrowd control and collective punishment.\n\nAntony Loewenstein is an atheist Jewish-Australian political activist, freelance  journalist, author and blogger who is based in Sydney. states , &quot;Cook bravely skewers the mainstream narrative of a Jewish state constantly striving for peace with the Palestinians.&quot; According to Lowenstein, Cook argues that Israel &quot;pursues policies that lead to civil war and partition,&quot; and that this idea of dissolving many of the nations of the Middle East, shared by the neocons and the Bush administration, was developed by Israel's security establishment in the 1980s.[10] Cook discusses an essay authored by Oded Yinon and published by the World Zionist Organisation in 1982 which advocated for Israel's transformation into a regional imperial power via the fragmentation of the Arab world, &quot;into a mosaic of ethnic and confessional groupings that could be more easily manipulated&quot; (p. 107). A review of the book in The Jordan Times called it, &quot;well-researched and very readable.&quot;\n\n\nBefore another very interesting upload by a famous Israeli Gideon Levy, I think you might be interested to check out these interesting series where Gideon Levy discusses the findings of his most recent book, The Punishment of Gaza. \n\n ","torrent":{"xt":"urn:btih:dd55ee273957458960c60b3c288dc611c9e47c07","amp;dn":"Disappearing+Palestine","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd55ee273957458960c60b3c288dc611c9e47c07","infoHashBuffer":{"type":"Buffer","data":[221,85,238,39,57,87,69,137,96,198,11,60,40,141,198,17,201,228,124,7]},"announce":[],"urlList":[]}}