{"title":"Cloud And Virtual Data Storage Networking - Your Journey To Effi","uid":9831535,"size":8359003,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ddd8b6b75e1b550d387ae137252e877e27ad7349&amp;dn=Cloud+And+Virtual+Data+Storage+Networking+-+Your+Journey+To+Effi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1395847179,"description":"Hardcover: 400 pages\nPublisher: Auerbach Publications (August 26, 2011)\nLanguage: English\nISBN-10: 1439851735\nISBN-13: 978-1439851739\n\nThe amount of data being generated, processed, and stored has reached unprecedented levels. Even during the recent economic crisis, there has been no slow down or information recession. Instead, the need to process, move, and store data has only increased. Consequently, IT organizations are looking to do more with what they have while supporting growth along with new services without compromising on cost and service delivery.\n\nCloud and Virtual Data Storage Networking, by savvy IT industry veteran Greg Schulz, looks at converging IT resources and management technologies for facilitating efficient and effective delivery of information services, including enabling of Information Factories. Regardless of your experience level, Schulz guides you through the various technologies and techniques available for achieving efficient information services delivery. Coverage includes:\n\nInformation services delivery model options and best practices\nMetrics for efficient E2E IT management\nServer, storage, I/O networking, and data center virtualization\nConverged and cloud storage services (IaaS, PaaS, SaaS)\nData protection for virtual, cloud, and physical environments\nData footprint reduction and data protection modernization\nHigh availability, business continuance, and disaster recovery\nThis much-needed reference brings together technology themes and topics that are converging in IT and data center environments for enabling effective information services, in a practical and hype-free manner. When it comes to IT clouds and virtualization, you must look before you leap. This book will help you address the questions of when, where, with what, and how to leverage cloud, virtual, and data storage networking as part of your IT infrastructure.\n\nA video of Greg Schulz discussing his new book is featured on the CRC Press YouTube channel.\n\nVisit Slideshare to view a slide presentation based on the book.\n\nAbout the Author\nGreg Schulz is the founder of the StorageIO Group, a technology analyst advisory and consultancy firm focused on data infrastructure topics providing services to technology vendors, end users, media and financial including venture capital organizations. Greg has gained diverse industry insight from being in the trenches in IT data centers. He has held numerous positions including programmer, server and storage systems administrator, performance and capacity analyst, disaster recovery consultant, as well as a server and storage planner at companies including an electrical power generating and transmission utility, financial services and transportation firms.\n\nShifting gears, Greg worked for storage and networking companies including MTI, INRANGE, and CNT in a variety of roles ranging from systems engineering and sales to marketing and Sr. technologist. Before founding the StorageIO Group in 2006, Greg was a Sr. Analyst at the Evaluator group covering virtualization, SAN, NAS and associated storage management tools, techniques, best practices and technologies.\n\nMr. Schulz has been involved with various storage related organizations including the Computer Measurement Group, Storage Networking Industry Association, and RAID Advisory Board. Greg is extensively published on a global basis and regularly appears in print, on-line as well as in person presenting and key note speaking at conferences, seminars and private events around the world on data infrastructure and related management topics. In addition to his reports, blogs, twitter tweets, columns, articles, tips, pod casts, videos and webcasts, Greg is also the author and illustrator of the book The Green and Virtual Data Center (CRC Press), Resilient Storage Networks - Designing Flexible Scalable Data Infrastructures (Elsevier) as well as a co-author and contributor for many other book projects including The Resilient Enterprise (Symantec/Veritas).\n\nGreg is regularly quoted and interviewed as one of the most sought after independent advisors providing perspectives, commentary, and opinion on IT industry activity. In addition to his commentary, he has articles, columns, tips, presentations, Webcasts, and podcasts appearing in leading industry trade venues including Computerworld, Enterprise Storage Forum, Search Storage, Search 5MB, Storage Decisions, Data Center Decisions, Processor, SNW, Network world, zJournal, Byte and Switch, eWeek, eChannel, Computer weekly, CMG and many others along with having a top ranked blog and twitter site. Learn more at www.storageioblog.com or on twitter @storageio.","torrent":{"xt":"urn:btih:ddd8b6b75e1b550d387ae137252e877e27ad7349","amp;dn":"Cloud+And+Virtual+Data+Storage+Networking+-+Your+Journey+To+Effi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ddd8b6b75e1b550d387ae137252e877e27ad7349","infoHashBuffer":{"type":"Buffer","data":[221,216,182,183,94,27,85,13,56,122,225,55,37,46,135,126,39,173,115,73]},"announce":[],"urlList":[]}}