{"title":"Small Signal Audio Design (2010) - (Malestrom)","uid":5956977,"size":15069959,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:de4bb476bc9ac6cc0b0d28a4ca4e7654f43ad0dc&amp;dn=Small+Signal+Audio+Design+%282010%29+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"malestrom_HH","files":-1,"time":1289766299,"description":"Douglas Self, &quot;Small Signal Audio Design&quot;\nFo-cal Press 2010 | ISBN-10: 0240521773, 0080963226 | 576 Pages | PDF \n\nSmall Signal Audio Design is a unique guide to the design of high-quality circuitry for preamplifiers, mixing consoles, and a host of other signal-processing devices. Learn to use inexpensive and readily available parts to obtain state-of-the-art performance in all the vital parameters of noise, distortion, crosstalk and so on. Focusing mainly on preamplifiers and mixers this practical handbook gives you an extensive repertoire of circuits that can be put together to make almost any type of audio system.\n\nA resource packed full of valuable information, with virtually every page revealing nuggets of specialized knowledge never before published. Essential points of theory that bear on practical performance are lucidly and thoroughly explained, with the mathematics kept to an essential minimum. Douglas' background in design for manufacture ensures he keeps a wary eye on the cost of things. Includes a chapter on power-supplies, full of practical ways to keep both the ripple and the cost down, showing how to power everything.\n\nDouglas wears his learning lightly, and this book features the engaging prose style familiar to readers of his other books The Audio Power Amplifier Design Handbook and Self on Audio. You will learn why mercury cables are not a good idea, the pitfalls of plating gold on copper, and what quotes from Star Trek have to do with PCB design.\n\n*Provides an enormous amount of knowledge in one unique volume, making it an essential guide to design principles and practice in the wide are of small-signal audio\n\n*Includes numerous circuit blocks with all component values given so you can build on them and easily adapt them to your own requirements\n\n*Lavishly illustrated with diagrams and graphs, and full of practical measurements on real circuitry so you can be sure just how well it will perform","torrent":{"xt":"urn:btih:de4bb476bc9ac6cc0b0d28a4ca4e7654f43ad0dc","amp;dn":"Small+Signal+Audio+Design+%282010%29+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de4bb476bc9ac6cc0b0d28a4ca4e7654f43ad0dc","infoHashBuffer":{"type":"Buffer","data":[222,75,180,118,188,154,198,204,11,13,40,164,202,78,118,84,244,58,208,220]},"announce":[],"urlList":[]}}