{"title":"Queen-A Night At The Music Hall (FLAC) [tntvillage]","uid":5076583,"size":701618273,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:de9fd4fe33ee8ce7dc696609cdffa5815dd59630&amp;dn=Queen-A+Night+At+The+Music+Hall+%28FLAC%29+%5Btntvillage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zachAlford","files":27,"time":1251902142,"description":"Queen-A Night At The Music Hall (FLAC) [tntvillage]\n\nTitle: A Night At The Music Hall\nArtist: Queen\nGenre: Rock\nYear: City: Boston, MA, USA \nVenue: Music Hall \nDate: January 30, 1976\nRecording length: 97 minutes (2 CD, complete) \nQuality: A \nSource: Audience \n\n\nThis version of Ogre Battle is perhaps its definitive delivery by Freddie Mercury. His voice is in great shape, and he embellishes many of the songs with ease, reflecting nothing but pure dedication to his craft. \n\nBrian, after White Queen: &quot;It's nice to be here, our second night in Boston. How are ya? You look really nice. This is a number which features Freddie tinkling the ivories for a very short time called Flick Of The Wrist.&quot; \n\nFreddie: &quot;We'd like to do a little medley for you - that's when my piano comes back on again [referring to his monitor, as the audience can hear him playing a few chords]. It's a slightly different medley from... it's exactly the same one as last night, but slightly different to the one we did last year. We're gonna start off... ah, my piano's back on... with a little segment from a number - I think you know it, this one - we'll start off with a number called Bohemian Rhapsody.&quot; \n\nFreddie, after the medley: &quot;That was a slightly different rendition of Bring Back That Leroy Brown. Now we're going to feature Brian May on guitar. Would you like that? Alright, we used to feature him in a number called Son And Daughter, but we're going to do a newer number this time, one you haven't heard us do before - unless you were here last night, of course. This is called Brighton Rock.&quot; After Brian's solo, the band have a bit of trouble going into the bit of Son And Daughter, making for an interesting moment. Otherwise, they are in full force. \n\nStone Cold Crazy is a blistering version, as is Doing All Right. Roger Taylor is all over the map in the coda of the latter. His drum break in Keep Yourself Alive is superb as well. \n\nFreddie introduces Lazing On A Sunday Afternoon as &quot;a typically English ditty.&quot; After a lukewarm response following the short song, he says, &quot;You'll get used to that one.&quot; After a gutsy version of Seven Seas Of Rhye, he introduces Liar as &quot;a song that's done a lot for us.&quot; \n\nBrian, after Liar: &quot;Thanks for everything. Thanks for the banner. Thanks for all those nice things you brought us. This is near the end - it's a number written by Freddie. It's called In The Lap Of The Gods...Revisited.&quot; \n\nBrian offers some dazzling guitar work in a ripping version of Jailhouse Rock. \n\nDISC 1\nBohemian Rhapsody (tape &amp; rock part)\nOgre Battle\nSweet Lady\nWhite Queen\nFlick Of The Wrist\nBohemian Rhapsody (verses)\nKiller Queen\nThe March Of The Black Queen\nBohemian Rhapsody (reprise)\nBring Back That Leroy Brown\nBrighton Rock\nSon And Daughter\nThe Prophet's Song\nStone Cold Crazy\nDoing All Right\n\nDISC 2\nLazing On A Sunday Afternoon\nKeep Yourself Alive\nSeven Seas Of Rhye\nLiar\nIn The Lap Of The Gods...Revisited\nNow I'm Here\nBig Spender/Jailhouse Rock/God Save The Queen\n\n\nTaped by Dan Lampinski, this is perhaps the best-sounding audience recording of Queen from the decade. The stereo sound beautifully captures the channel separation of Brian and Freddie's solo spots. Even Freddie's tambourine is clearly heard in Keep Yourself Alive and Liar. \n\nThe stunning clarity of this recording can only make one imagine (or recall) how truly great the band sounded live, and appreciate the quality work of their in-house sound mixer. \n\nSimply put, this is early Queen at their very best - essential listening for any fan of rock music. Queen Productions will be hard-pressed to come up with an official release that can top this. \n\nBreakdown was quick to bootleg the recording. Less than a week after it was shared online for free, the &quot;Boston Rhapsody&quot; bootleg CDRs were announced. Wardour soon bootlegged it as well, entitling it &quot;A Night At Boston.&quot;\n","torrent":{"xt":"urn:btih:de9fd4fe33ee8ce7dc696609cdffa5815dd59630","amp;dn":"Queen-A+Night+At+The+Music+Hall+%28FLAC%29+%5Btntvillage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de9fd4fe33ee8ce7dc696609cdffa5815dd59630","infoHashBuffer":{"type":"Buffer","data":[222,159,212,254,51,238,140,231,220,105,102,9,205,255,165,129,93,213,150,48]},"announce":[],"urlList":[]}}