{"title":"Il.Curioso.Caso.Di.Benjamin.Button.2008.iTALiAN.MD.DVDSCR.XviD.S","uid":4722825,"size":1382547456,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ded0be6df4f450230e2276384a6791f175f663cf&amp;dn=Il.Curioso.Caso.Di.Benjamin.Button.2008.iTALiAN.MD.DVDSCR.XviD.S&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Volpebianca","files":2,"time":1234608990,"description":":::Scheda del film:::\nTitolo originale: The Curious Case of Benjamin Button\nNazionalitÃƒÂ : U.S.A.\nAnno:  2008\nGenere: Drammatico\nRegia: David Fincher\nData di uscita:13/02/2009\nCast: Brad Pitt, Cate Blanchett, Tilda Swinton, Elle Fanning, Jason Flemyng, Julia Ormond, Taraji P. Henson, Josh Stewart, Peter Donald Badalamenti II, Chandler Canterbury, Joshua DesRoches, Joel Bissonnette, Donna DuPlantier, Deneen Tyler, David Ross Paterson\n\n:::Trama:::\nBenjamin Button nasce il giorno della fine della prima guerra mondiale, ÃƒÂ¨ un bimbo in fasce ma ha la salute di un novantenne: artrite, cataratta, sorditÃƒÂ . Dovrebbe morire il giorno dopo e invece piÃƒÂ¹ passa il tempo piÃƒÂ¹ ringiovanisce. La sua ÃƒÂ¨ una vita al contrario che attraversa il Novecento americano sempre alla ricerca del primo e unico amore, una donna molto piÃƒÂ¹ emancipata, libera e in linea con il suo tempo di lui. L'unico momento in cui si potranno trovare sarÃƒÂ  all'incrociarsi delle loro etÃƒÂ : &quot;Mi amerai ancora quando sarÃƒÂ² vecchia?&quot;, chiede lei. &quot;E tu mi amerai ancora quando avrÃƒÂ² l'acne?&quot; risponde lui.\nFincher sceglie di narrare una storia con un espediente classico: a partire dalla modernitÃƒÂ , attraverso le memorie di un diario letto alla protagonista ormai anziana e in punto di morte. Fotografa tutto virando verso il seppia e opta per la calligrafia spinta, cosa che ovatta il racconto con l'indulgenza e il fascino di cui sono dotati i ricordi. Il risultato ÃƒÂ¨ un'agiografia del passato che vince sul presente (New Orleans ieri e oggi con Katrina alle porte), una prospettiva a ritroso indulgente e favolistica sugli Stati Uniti che non affronta nessun tema davvero e che, cosa bene piÃƒÂ¹ grave, manca di emozionare con sinceritÃƒÂ .\nBenjamin Button ringiovanisce invece di invecchiare ma questo non ha nessun effetto sulla trama nÃƒÂ¨ tantomeno serve a dare una visione particolare degli eventi in cui ÃƒÂ¨ coinvolto o della societÃƒÂ  in cui ÃƒÂ¨ inserito, come avveniva invece con la stupiditÃƒÂ  di Forrest Gump (il paragone inaffrontabile con l'opera di Zemeckis sorge spontaneo data la sostanziale identitÃƒÂ  della struttura della storia).\nIl curioso caso di Benjamin Button sembra chiedersi unicamente &quot;Come si comporterebbe un vecchio con la testa di un bambino? E come un giovane con l'esperienza di un vecchio?&quot;, tentando di conseguenza una riflessione sulla morte e sulle possibilitÃƒÂ  di sfruttare al massimo la propria vita. &quot;Non sai mai cosa c'ÃƒÂ¨ in serbo per te&quot; ripete a Benjamin la madre adottiva, evitando accuratamente di citare scatole di cioccolatini.\nGigantesco il lavoro fatto sull'invecchiamento e il ringiovanimento digitali di Brad Pitt, entrambi ottenuti sperimentando una tecnica innovativa di motion capture. Il risultato ÃƒÂ¨ evidente: in ogni caso il personaggio ÃƒÂ¨ sempre lui, Brad Pitt, anche quando gli somiglia veramente poco. Meno celebrata invece Cate Blanchett che, invecchiata e ringiovanita anch'essa per esigenze di copione, supplisce alla frequente mancanza di digitale con la solita prestazione fuori da ogni ordinarietÃƒÂ .\n\nQualitÃƒÂ  audio 6/7(piu pulito della precedente versione FREE)  e video 7.","torrent":{"xt":"urn:btih:ded0be6df4f450230e2276384a6791f175f663cf","amp;dn":"Il.Curioso.Caso.Di.Benjamin.Button.2008.iTALiAN.MD.DVDSCR.XviD.S","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ded0be6df4f450230e2276384a6791f175f663cf","infoHashBuffer":{"type":"Buffer","data":[222,208,190,109,244,244,80,35,14,34,118,56,74,103,145,241,117,246,99,207]},"announce":[],"urlList":[]}}