{"title":"Abigail Williams - In the Absence of Light mp3 (2010) a2k","uid":11539558,"size":120363469,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:df6eb71baf4abb873346f2f52d49b28496e73cb9&amp;dn=Abigail+Williams+-+In+the+Absence+of+Light+mp3+%282010%29+a2k&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"analogkid6103","files":9,"time":1416616751,"description":"\n1. Hope the Great Betrayel 06:44  \n2. Final Destiny of the Gods 08:15  \n3. The Mysteries That Bind the Flesh 06:51  \n4. Infernal Divide 04:59  \n5. In Death Comes the Great Silence 06:17\n6. What Hells Await Me 04:47  \n7. An Echo in Our Legends 04:59  \n8. Malediction 07:01\n\nAbigail Williams is a metal band hailing from Phoenix, Arizona, formed in the summer of 2005 by Sorceron. The band's sound originally was sort of melodic death metal with keyboards, taking influences from hardcore and black metal. But it wasn't until the fall of 2006 when the band refined its sound, losing the original singer while original guitar player (Ken) Sorceron moved to vocals to opt for a more aggressive approach. The track &quot;Watchtower&quot; shaped the sound of the band into what Kerrang! Magazine has called &quot;The bloody birth of 'Black Metalcore'&quot; (though the band does not agree with the label).\n\nThe band signed with Candlelight Records in 2006, and soon released their debut effort, the Legend EP. However, in April 2007, the band seemingly called it quits, with founders Sorceron and keyboardist Ellyllon citing personal issues as the cause of the band's collapse. Fortunately, all was not lost. By October of 2007, Sorceron announced his intention to reconvene the band and with those personal differences resolved once and for all, both he and Ellyllon returned to the fold with renewed enthusiasm and determination.\n\nAs of 2008 they have developed a sound more akin to symphonic black metal than their earlier material. With the recording processes in the works before the lineup was finalized, Trym Torson of Emperor/Zyklon fame was enlisted as session drummer, and appears on all but 3 of the debut full length's tracks. And soon after, the lineup was completed, as Sorceron and Ellyllon are now joined by guitarists Mike and Bjornthor, bassist Plaguehammer and drummer Samus. With James Murphy (Obituary, Testament, Death) as producer, the band's debut full length, &quot;In The Shadow Of A Thousand Suns&quot; was released by Candlelight Records in 2008.\nGenre:\tBlack\nBitrate:\t320k\nSize:\t114.0 MB\nShow/Hide Files: \t\n8 files","torrent":{"xt":"urn:btih:df6eb71baf4abb873346f2f52d49b28496e73cb9","amp;dn":"Abigail+Williams+-+In+the+Absence+of+Light+mp3+%282010%29+a2k","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df6eb71baf4abb873346f2f52d49b28496e73cb9","infoHashBuffer":{"type":"Buffer","data":[223,110,183,27,175,74,187,135,51,70,242,245,45,73,178,132,150,231,60,185]},"announce":[],"urlList":[]}}