{"title":"Marie Harte - Talson Temptations Series (4 books)","uid":10527867,"size":1222773,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:df86ac2c155d5396b24c759e458a2b1e5164b447&amp;dn=Marie+Harte+-+Talson+Temptations+Series+%284+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ONLYMOBI","files":-1,"time":1405070745,"description":"TALSON'S WAIT\nDomineering, dangerous and downright huge, Roarke Talson owns Jamie for the next three years. It's 2109, and the government has found a way to deal with the national debt. Indentured service. She might have been duped into debt, but she's not stupid. Jamie made sure to put a no-sex clause in her contract. There's just one problem. She can't stop thinking about her boss. Sexy and commanding, he's the face of her ultimate fantasy, and a nightmare employer. She's met every challenge he's thrown at her and refuses to drop, no matter how hard he works her.\n\nWhen Jamie does the wrong thing for the right reason, she assumes Talson will throw her in jail and not think twice. In an effort to escape, she ambushes him and flees, but not before taking a kiss and a bit more from the man.\n\nShe hadn't counted on him getting free so quickly, that he might be half alien, or that he'd hunt her down with more than vengeance on his mind. \n\nTALSON'S TEST \nZaret Talson 'Or Fal--Z--knows what he wants, and it isn't a mate. But when he's besieged by dreams of a sexy woman scorching the skies when she's not entwined with him and his brother, he fears the dreams are a sign of his future.\n\nHis brother looks forward to the threesome--all the fun without the commitment. Z wants to run the other way, because he'll be tied to her if she proves to be his. He's foreseen it.\n\nAdri 'San Fal may look human, but like Z, she's Otra, an alien species not altogether welcome on Earth. Part of a particular clan of Otra who can handle fire, she's blonde, unlike the majority of her kind. Hiding in plain sight is easy--until her past finds her. Desperate to escape, she runs into the one man destined to be her doom, or her salvation.\n\nTALSON'S NET\nKidnapping Rowe Trainer, co-heir to Chartrell Shipping, might not have been the smartest thing Val Talson's ever done, but he wants answers, fast. He couldn't have expected the beautiful little bully to be half-human, nor could he have anticipated that she could turn the tables on him so easily. She's powerful, and he's learned to be wary. \n\nHis violent arousal in her presence makes little sense. Lust he appreciates, but the deeper draw to his rival baffles him. Soon he can't think of anything but Rowe. When he finds her again, he gets more than he bargained for--attraction not only to Rowe, but to her bodyguard as well. Then add the shock of her Selection--a female Otra's readiness to mate. \n\nVal doesn't intend to give in easily. He'll handle rogue saboteurs, Rowe's larger-than-life bodyguard, and the idea that he's entered the Testing, the time in a male Otra's life when he's ready to bond to his destined mate. As for Rowe...Val's more than willing to give her what she deserves. And then some.\n\nTALSON'S MATCH\nRomec Talson is the last of his brothers to find a mate, and he's in no hurry. So it's a relief to check on the strange progress of one of the family's shipping terminals on Earth, away from the manipulations of his happily mated siblings. The last thing he expects to encounter at Port Chase is the woman of his dreams. A supposed human glaring at him with dark eyes--Otra, alien eyes. And then there are her accusations that Talson Shipping is running an illegal drug trade.\n\nTara Drake has no idea why the stranger at her door makes her hot and bothered, but if he works for the Talsons, she wants no part of him. Unfortunately, her body has a will of its own. Learning she's not human is just the beginning of the surprises coming her way. Because love has no rhyme or reason in the face of fate, Tara must make a choice to accept her destiny or deny herself true happiness.","torrent":{"xt":"urn:btih:df86ac2c155d5396b24c759e458a2b1e5164b447","amp;dn":"Marie+Harte+-+Talson+Temptations+Series+%284+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df86ac2c155d5396b24c759e458a2b1e5164b447","infoHashBuffer":{"type":"Buffer","data":[223,134,172,44,21,93,83,150,178,76,117,158,69,138,43,30,81,100,180,71]},"announce":[],"urlList":[]}}