{"title":"The Fugs Second Album","uid":4588659,"size":41204847,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:dfa26311751fdbd668dd6a05449b7b2aa514b8f3&amp;dn=The+Fugs+Second+Album&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"madziar","files":15,"time":1229737425,"description":"From Allmusic: The Fugs:\n\n&quot;Arguably the first underground rock group of all time, the Fugs formed at the Peace Eye bookstore in New York's East Village in late 1964. The nucleus of the band throughout their many personnel changes was Peace Eye owner Ed Sanders and fellow poet Tuli Kupferberg. Sanders and Kupferberg had strong ties to the beat literary scene, but charged, in the manner of their friend Allen Ginsberg, full steam ahead into the maelstrom of '60s political involvement and psychedelia. Surrounded by an assortment of motley refugees from the New York folk and jug band scene (including Steve Weber and Peter Stampfel of the Holy Modal Rounders), some of whom could barely play their instruments, the group nonetheless was determined to play rock &amp; roll their way -- which meant rife with political and social satire, as well as explicit profanity and sexual references, that were downright unheard of in 1965.\n\nThe Second Album:\n\n&quot;Like Reed, the revolutionary tag is placed on the Fugs for the sheer frankness they used to deal with the taboo. But whereas Reed dealt with the dark sides of promiscuity and drug use, the Fugs celebrate it, and most times in a very exhibitionist way. Biting social commentary, as on &quot;Doin' All Right,&quot; is articulately done, and while being listenable, is not outstanding in musical terms. Bonus tracks, such as &quot;Carpe Diem,&quot; are nice additions, and &quot;Wide Wide River,&quot; which has a faux gospel feel, is appropriate for the sermonizing the Fugs do on the song, as throughout the album. Overall, The Fugs Second Album is an interesting historical footnote&quot;\n\n\n\n\nTrack list:\n\n 1 Frenzy 2:04\n 2 I Want to Know 2:00\n 3 Skin Flowers 2:20\n 4 Group Grope 3:40\n 5 Coming Down 3:46\n 6 Dirty Old Man 2:49\n 7 Kill for Peace 2:07\n 8 Morning, Morning 2:07\n 9 Doin' All Right 2:37\n 10 Virgin Forest  11:17\n 11 I Want to Know [live] 2:37\n 12 Mutant Stomp [live] 2:58\n 13 Carpe Diem 3:39\n 14 Wide, Wide River 2:51\n 15 Nameless Voices Crying for Kindness 2:52\n\t\n\nIn glorious m4a format!\n\n\n\n","torrent":{"xt":"urn:btih:dfa26311751fdbd668dd6a05449b7b2aa514b8f3","amp;dn":"The+Fugs+Second+Album","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfa26311751fdbd668dd6a05449b7b2aa514b8f3","infoHashBuffer":{"type":"Buffer","data":[223,162,99,17,117,31,219,214,104,221,106,5,68,155,123,42,165,20,184,243]},"announce":[],"urlList":[]}}