{"title":"NubileFilms - Jassie Gold (Take Your Time) [.mp4]","uid":10813050,"size":216962948,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:dfbb7703eef8166de17c3b38055b4c2343d1a05e&amp;dn=NubileFilms+-+Jassie+Gold+%28Take+Your+Time%29+%5B.mp4%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"-MosT-WanteD-","files":1,"time":1408444779,"description":"Feeling a little bit shy and nervous, Jassie Gold approaches her lover Timo Hardy and poses with her miniskirt pulled up to reveal her sheer panties that she rolls down her legs while Timo takes pictures. When she indicates that it's time to put the camera down, though, Timo knows that playtime is just beginning.\n\nSliding Jassie's miniskirt up to her hips, Timo slids his hand between her legs to go to work rubbing her sensitive clit. Next he peels the rest of Jassie's clothes off and then stays passive as she returns the favor. The blonde is happy to get down on her knees and suck her lover's cock until it is rock hard once she reveals that particular tasty treat.\n\nWhen the couple moves their lovemaking to the bedroom, Timo takes advantage of the chance to really dive in to Jassie's bare muff. Using just the tip of his tongue in her juicy slit, he drives her crazy with slow strokes until she is primed and ready for his big cock pushed deep into her tight puss.\n\nThey take things nice and slow at first as Timo slides into Jassie's wet heat. When they switch to a spooning position things get a little faster, but it's not until Jassie climbs aboard Timo's rock hard cock and starts a wild ride that she finds true orgasmic bliss.\n\nAfter sucking her pussy juices off of her lover's dick, Jassie goes down on her hands and knees and sticks her rump up in the air to open up her cum hungry twat once again for her lover's pleasure. She takes her doggy style pussy pounding with moans of pure ecstasy until her final orgasm milks out Timo's climax as well. He pulls out at the last second, cumming all over Jassie's waiting ass in a love shower that leaves her sticky and satisfied.\n\n============================================\n &lt;a href=&quot;\nhttp://imgruby.com/?v=400516&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgruby.com/?v=400516&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgruby.com/?v=460476&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgruby.com/?v=460476&lt;/a&gt;","torrent":{"xt":"urn:btih:dfbb7703eef8166de17c3b38055b4c2343d1a05e","amp;dn":"NubileFilms+-+Jassie+Gold+%28Take+Your+Time%29+%5B.mp4%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfbb7703eef8166de17c3b38055b4c2343d1a05e","infoHashBuffer":{"type":"Buffer","data":[223,187,119,3,238,248,22,109,225,124,59,56,5,91,76,35,67,209,160,94]},"announce":[],"urlList":[]}}