{"title":"Kevin B. MacDonald's Jewish Trilogy","uid":11675508,"size":16330394,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dfd69d304686b32db3c02bf06ebc7283d1a86bb1&amp;dn=Kevin+B.+MacDonald%27s+Jewish+Trilogy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":4,"time":1422843103,"description":"A PEOPLE THAT SHALL DWELL ALONE: JUDAISM AS A GROUP EVOLUTIONARY STRATEGY\n\nA study of Judaism from an evolutionary perspective. The author argues that Judaism has grown with an evolutionary strategy characterised by endogamy, resistance to genetic and cultural assimilation, sacrifice between Jews and eugenic practices aimed at high intelligence.\n\nPublisher: Praeger Publishers; 1st edition (November 8, 1994)\nLanguage: English\nISBN-10: 0275948692\nISBN-13: 978-0275948696\n\nSEPARATION AND ITS DISCONTENTS: TOWARD AN EVOLUTIONARY THEORY OF ANTI-SEMITISM\n\nMacDonald develops a theory of anti-Semitism based on an evolutionary interpretation of social identity theory--a major approach to group conflict in contemporary social psychology. Beginning in the ancient world, anti-Semitism has existed under a variety of religious and political regimes. MacDonald explores several theoretically important common themes of anti-Semitic writings such as Jewish clannishness and cultural separatism, economic and cultural domination of gentiles, and the issue of loyalty to the wider society. Particular attention is paid to three major manifestation of Western anti-Semitism: the development of institutionalized anti-Semitism in the Roman Empire, the Iberian Inquisitions, and the phenomenon of Nazism. All of these movements exhibited a powerful gentile group cohesion in opposition to Judaism as a group strategy, and MacDonald argues that each may be analyzed as a reaction to the presence of Judaism as a highly successful group evolutionary strategy. Because of the repeated occurrence of anti-Semitism, Jews have developed a highly flexible array of strategies to minimize its effects. These include: crypsis during periods of persecution, controls on Jewish behavior likely to lead to anti-Semitism, and the manipulation of gentile attitudes toward Jews. This controversial work challenges prevailing views; students and scholars involved with evolutionary approaches to human behavior and Jewish Studies will be interested, as will social scientists and historians in general.\n\nPublisher: AuthorHouse (November 13, 2003)\nLanguage: English\nISBN-10: 1410792617\nISBN-13: 978-1410792617\n\nTHE CULTURE OF CRIQIQUE: AN EVOLUTIONARY ANALYSIS OF JEWISH INVOLVEMENT IN TWENTIETH-CENTURY INTELLECTUAL AND POLITICAL MOVEMENTS\n\nMacDonald provides a theoretical analysis and review of data on the widespread tendency among highly influential, Jewish-dominated intellectual movements to develop radical critiques of gentile culture that are compatible with the continuity of Jewish identification. These movements are viewed as the outcome of the fact that Jews and gentiles have different interests in the construction of culture and in various public policy issues (e.g. immigration policy, Israel). Several of these movements attempt to combat anti-Semitism by advocating social categorization processes in which the Jew/gentile distinction is minimized in importance. There is also a tendency to develop theories of anti-Semitism in which ethnic differences and resource competition are of minimal importance. From the perspective of the intellectual structures developed by these movements, anti-Semitism is analyzed as an indication of psychopathology among gentiles. In some cases, these movements appear to be attempts to develop a fundamental restructuring of the intellectual basis of gentile society in ways conducive to the continued existence of Judaism.\n\nParticular attention is paid to Boasian anthropology, psychoanalysis, leftist political ideology and behavior, and the Frankfurt School of Social Research. Each of these movements can be characterized as an authoritarian political movement centered around a charismatic leader who strongly identified as a Jew and who was idolized by his disciples who were also predominantly Jewish. Regarding immigration policy, Jewish political and intellectual activity was motivated less by a desire for higher levels of Jewish immigration than by opposition to the implicit theory that America should be dominated by individuals with northern and western European ancestry. Jewish policy was aimed at developing an America charcterized by cultural pluralism and populated by groups of people from all parts of the world rather than by a homogeneous Christian culture and populated largely by people of European descent. This is a controversial analysis of particular interest to those concerned with evolutionary approaches to human behavior, with Judaica, and with an evolutionary perspective on history and psychology.\n\nPublisher: 1st Books Library; Revised edition (August 15, 2002)\nLanguage: English\nISBN-10: 0759672229\nISBN-13: 978-0759672222","torrent":{"xt":"urn:btih:dfd69d304686b32db3c02bf06ebc7283d1a86bb1","amp;dn":"Kevin+B.+MacDonald%27s+Jewish+Trilogy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfd69d304686b32db3c02bf06ebc7283d1a86bb1","infoHashBuffer":{"type":"Buffer","data":[223,214,157,48,70,134,179,45,179,192,43,240,110,188,114,131,209,168,107,177]},"announce":[],"urlList":[]}}