{"title":"A Brief History of Superheroes","uid":11526505,"size":1270660,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e1559dc39fe56316cf42f1ea3148fa3a371975d5&amp;dn=A+Brief+History+of+Superheroes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1416537938,"description":"A Brief History of Superheroes by Brian J. Robb\nEnglish | 2014 | ISBN: 1472110552 | 304 pages | PDF | 1 MB\n\nThis is a fascinating written exploration of the superhero phenomenon, from its beginnings in the depths of Great Depression to the blockbuster movies of today. For over 90 years, superheroes have been interrogated, deconstructed, and reinvented. In this wide-ranging study, Robb looks at the diverse characters, their creators, and the ways in which their creations have been reinvented for successive generations. Inevitably, the focus is on the United States, but the context is international, including an examination of characters developed in India and Japan in reaction to the traditional American hero. Sections examine: the birth of the superhero, including Superman, in 1938; the DC family (Superman, Batman, Wonder Woman and The Justice Society/League of America), from the 1940s to the 1960s; the superheroes enlistment in the war effort in the 1940s and 50s; their neutering by the Comics Code; the challenge to DC from the Marvel family (The Fantastic Four, Spider-Man, and The X-Men), from the 1960s to the 1980s; the superhero as complex anti-hero; superheroes deconstructed in the 1980s (The Watchmen and Frank Miller's Batman), and their politicization; independent comic book creators and new publishers in the 1980s and 90s; superheroes in retreat, and their rebirth at the movies in blockbusters from Batman to Spider-Man and The Avengers","torrent":{"xt":"urn:btih:e1559dc39fe56316cf42f1ea3148fa3a371975d5","amp;dn":"A+Brief+History+of+Superheroes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1559dc39fe56316cf42f1ea3148fa3a371975d5","infoHashBuffer":{"type":"Buffer","data":[225,85,157,195,159,229,99,22,207,66,241,234,49,72,250,58,55,25,117,213]},"announce":[],"urlList":[]}}