{"title":"The Real Benghazi Story - Aaron Klein","uid":11707248,"size":419660,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e15a65b14b647590798f03303651d2b141378aec&amp;dn=The+Real+Benghazi+Story+-+Aaron+Klein&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"starxteel","files":1,"time":1424180635,"description":"\n\nWhat difference does it make? Read it for yourself to find out.\n\nBigger than Watergate! Bigger than Iran-Contra! Ten times bigger than both, said one representative. The Bengahzi scandal may have been covered up by the White House, but the truth is about to come out. The Real Benghazi Story is a ground-breaking investigative work that finally exposes some of the most significant issues related to the murderous September 11, 2012, attack-information with current national security implications.  \n\nInvestigative journalist and New York Times best-selling author Aaron Klein provides the answers many have longed for from the secretive activities transpiring inside the doomed facility to shocking new details about the withholding of critical protection at the U.S. special mission. Learn about what really happened to Ambassador Chris Stevens that fated night, the central role Hillary Clinton actually played in the scandal, and more!  \n\nAlso answered for the first time is why the State Department hired armed members of the al-Qaeda-linked February 17 Martyrs Brigade to protect the facility. New reasons are revealed for not sending air support or Special Forces during the assault, while extensively probing not only jihadist groups but also possible state actors behind the attack. These are just some of the new details to be revealed in this game-changing book.\n\n\nAbout the Author:\n Aaron Klein is an investigative journalist and Jerusalem bureau chief for WorldNetDaily.com. He is a regular on top American radio shows and appears frequently on Fox News Channel and Al Jazeera. He is the author of Schmoozing with Terrorists and The Late Great State of Israel, as well as the host of Aaron Klein Investigative Radio for New York's WABC, the largest radio talk station in the United States","torrent":{"xt":"urn:btih:e15a65b14b647590798f03303651d2b141378aec","amp;dn":"The+Real+Benghazi+Story+-+Aaron+Klein","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e15a65b14b647590798f03303651d2b141378aec","infoHashBuffer":{"type":"Buffer","data":[225,90,101,177,75,100,117,144,121,143,3,48,54,81,210,177,65,55,138,236]},"announce":[],"urlList":[]}}