{"title":"Dent May - Warm Blanket [2013] [EAC.Log,Cue.FLAC]","uid":9500264,"size":287371392,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e190ba3842d6aafa2d4e735820a05569b613aa61&amp;dn=Dent+May+-+Warm+Blanket+%5B2013%5D+%5BEAC.Log%2CCue.FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":14,"time":1390210559,"description":"Artist: Dent May\nRelease: Warm Blanket \nReleased: 2013\nLabel: Paw Tracks\nCatalog#: PAW 042CD\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle: pop,rock\n\nimage\n\n\n\n1 Turn Up The Speakers\n2 Let Them Talk\n3 Born Too Late\n4 Yazoo\n5 Corner Piece\n6 Do I Cross Your Mind?\n7 It Takes A Long Time\n8 I'm Ready To Be Old\n9 Endlessly\n10 Found A Friend\n11 Summer Is Over\n\n\n\n\nDent May's 2012 album Do Things revealed the one-time ukulele strummer to be something of a whiz at writing and producing laid-back disco that made for a perfect summer dance party soundtrack. Along with the tunes that aimed for the dancefloor, May also showed he could knock off classic Beach Boys/Harry Nilsson/Van Dyke Parks-style pop with grace and style. His next album, 2013's Warm Blanket, cuts down on the disco dancing and focuses more on the easygoing but very heartfelt songcraft. There's still a loose-limbed undercurrent to quite a few of the songs, most notably the slow-grooving &quot;Let Them Talk&quot; and the slyly funky soft rock jam &quot;Born Too Late,&quot; and vintage synths do still dot the landscape from time to time. Mostly, though, the album sounds like it was concocted with May behind the keys of a grand piano plugging away until he found some perfectly sunny chords to sing along with. After that, he splashes on guitars, drums, and the occasional strings and horns until the songs shine like the reflection of the sun on a calm body of water. Even though May's transformation on Do Things was near brilliant, his shift here is almost as impressive. The songs, arrangements, and May's tender wisp of a voice all fit together perfectly. A more traditional kind of fit that maybe you've heard before somewhere else, but May injects the sound with enough of his own personality to make it all sound fresh and new. His charming lyrical persona helps make it all unique, too, as his tales of fragile love, unrequited love, growing up, and life and how to live it, are universal and totally personal at the same time. Check &quot;I'm Ready to Be Old&quot; for a uniquely Dent May perspective on life. Along with all that good stuff, the songs themselves are catchy as hell. &quot;Born Too Late&quot; is impossible to shake out of your head after just one listen, &quot;Yazoo&quot; is a lovely waltz that shows off the understated power of May's vocals as he channels Nilsson throughout, and &quot;It Takes a Long Time&quot; is a melancholy pop gem that lopes along languidly but cuts deep. Any of the songs that make up the rest of the album could have been inserted in that short list of highlights and the result would be the same. May has hit on something real and warmly touching here, melodically rich and full of life. Warm Blanket is a tiny masterpiece of unassuming modern pop that you'll overlook at your own risk..","torrent":{"xt":"urn:btih:e190ba3842d6aafa2d4e735820a05569b613aa61","amp;dn":"Dent+May+-+Warm+Blanket+%5B2013%5D+%5BEAC.Log%2CCue.FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e190ba3842d6aafa2d4e735820a05569b613aa61","infoHashBuffer":{"type":"Buffer","data":[225,144,186,56,66,214,170,250,45,78,115,88,32,160,85,105,182,19,170,97]},"announce":[],"urlList":[]}}