{"title":"Glee - S01E05 - The Rhodes Not Taken [Np]","uid":5938824,"size":366653234,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e1a741e55a1c699661ea6b69fa56089f03cef150&amp;dn=Glee+-+S01E05+-+The+Rhodes+Not+Taken+%5BNp%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"NoahPuckerman","files":1,"time":1289063327,"description":"Name: Glee\nSeason: 1\nEpisode: 5\nEpisode Name: The Rhodes Not Taken\nOriginal Air Date on TV: September 30, 2009\n\n\nEpisode Plot\n(Via: Wikipedia)\n\nWith star Rachel Berry no longer part of the glee club, director Will Schuester worries about the team's forthcoming performance at Invitationals. He discovers that April Rhodes, a member of the club from his own high school days, never actually graduated, and convinces her to return to the glee club. Having failed to achieve her Broadway dreams, April is now an alcoholic, and goes about winning the favor of the existing club members by unconventional means, including getting Kurt (Chris Colfer) drunk and teaching Mercedes (Amber Riley) and Tina (Jenna Ushkowitz) to shoplift. Guidance counselor Emma Pillsbury (Jayma Mays) warns Will that April is corrupting the students. Will asks April to sober up, admitting that she was the reason he joined the glee club and that he had a crush on her in high school. The two of them sing an impromptu duet of Heart's &quot;Alone&quot; at the local bowling alley, and April promises to change.\n\nClub member Finn is concerned for his future, believing his girlfriend Quinn (Dianna Agron) to be pregnant with his child. Emma suggests that instead of aiming to attend college on a football scholarship, Finn should utilize his musical talent. Finn believes the club's only chance of performing well at Nationals rests with Rachel, and attempts to convince her to return to the club. Finn finds Rachel and flirts with her. Later he takes her bowling, and when Rachel says she was never appreciated in Glee, Finn says he appreciates her. On her last bowl, Rachel scores a strike, and in a celebratory hug, Rachel kisses Finn. Finn asks her to come back to Glee, Rachel asks about Quinn but Finn says 'I don't know what's going to happen in the future but right now, all I know is that I want to spend more time with you.' This, along with the fact that Rachel is unhappy with the play due to being bullied by the theater director Sandy Ryerson (Stephen Tobolowsky), leads her to relent and quit her role in the school play in favor of glee club. Kurt, Mercedes and Tina try to guess what's wrong with Quinn. Puck says 'Are you guys really that stupid?' and tells them that Quinn is pregnant, but tells them Finn is the father. A moment later Rachel enters and says she is returning to Glee, but the 'scandal' has sent Glee into shock. Mercedes tells Rachel that Quinn is pregnant and Kurt tells her the father is Finn. Rachel is left stunned and speechless. Rachel confronts Finn, slaps him, calls him a liar and asks him why he didn't tell her Quinn was pregnant. She also says she's a fool for going on a date with him, for letting him kiss her and for 'actually thinking you had feelings for me.' Finn says he does have feelings for her and he says 'even though I didn't tell you the whole truth,' he tells her 'that kiss was real.' Rachel, furious, says 'Well, whatever it was, it ruined any chance of me ever coming back to Glee.' and she storms off. Rachel goes to see Sue, and tells her she'll come back to the play if changes are made regarding Sandy. Sue agrees, gives her full artistic control, but Rachel isn't happy. Following a performance of Carrie Underwood's &quot;Last Name&quot;, April receives the standing ovation she always dreamed of, and realizes it is time to find a new dream. She leaves the club without a lead singer for their second performance, leading to Rachel stepping in and rejoining the club for an ensemble performance of Queen's &quot;Somebody to Love&quot;.\n\nI Will Be Uploading All Glee Episodes As Single Files Then All Together (:\nI Will Also Be Uploading All Albums To Each Season (:\n\nEnjoy (: &amp; Please Seed \n\nThanks\n\n- [Np]","torrent":{"xt":"urn:btih:e1a741e55a1c699661ea6b69fa56089f03cef150","amp;dn":"Glee+-+S01E05+-+The+Rhodes+Not+Taken+%5BNp%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1a741e55a1c699661ea6b69fa56089f03cef150","infoHashBuffer":{"type":"Buffer","data":[225,167,65,229,90,28,105,150,97,234,107,105,250,86,8,159,3,206,241,80]},"announce":[],"urlList":[]}}