{"title":"Electribe 101 - Electribal Memories (1990)@flac","uid":9550436,"size":535238221,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e20589420c3b51c54e4957d394bcf1bd9f1ef17a&amp;dn=Electribe+101+-+Electribal+Memories+%281990%29%40flac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"alekow1","files":-1,"time":1391243890,"description":"Billie Ray Martin's unique, dreamy vocals are backed up by hypnotic trance beats with a real soul feel. \n&quot;Talking with myself&quot;, &quot;Heading for the night&quot; and &quot;You're walking&quot; are (in my opinion) the best tunes for turning the lights down low to, kicking off one's shoes and chilling out. The only turkey on the album is &quot;Electribal Memories&quot; which to be frank, is completely pointless when you compare it to the other tunes that do have some intrinsic meaning. Electribe 101's music has haunted me for 8 years (BEG BORROW OR STEAL to hunt down the 7 inch version of talking with myself, it's REALLY dreamy) even though the band no longer exists (Billie has gone solo and the others are now with the Groove Corporation). \nAll in all, a great album.    Scott Tunstall (AMG)\n\n\n\n\n\nCARRYING THE TORCH\n\nIf you love sickness then Electribe 101 are the heart's dancing cardiographers and this album is some kind of a definitive chart of the ups and downs of emotional fever.\nYou can slice Electribe 101 any want you want and they still come out looking like an ideal pop case study. Even on paper the arrangement of three self-controlled Birmingham studio boys and a wayward German soul singer is a pop bore's delight. Think of the theorising possibilities provided by the three Brum Kraftwerk-turned-dance lovers opening up their machinery to the ghostly presence of a Deutsche Aretha Franklin. Then stick on the record and forget the theories.\n'Electribal Memories' us too seamless a record to be picked apart. The studio-centred 101-ers draw serious inspiration from current House and Techno modes but their usage is far too subtle to make this anything like just a dance album. It's more that the pulse of clubland has been co-opted to frame the sublime ache of Billy Ray Martin's voice. From track one to eight this is a hugely effecting electro-blues glide through red light zones of pure feeling.\nFor all the hypnotic undertow, Electribe songs are by no means simply trance music. These people write focused, traditional songs, which have an unnerving ability to home in on the pressure points of desire and melancholy. Through the shimmering, cruising groove of 'Lipstick On My Lover' to the torch-House classic 'Tell Me When The Fever Ended' there is a confessional thread, an allegiance to scary sol-baring, which combined with Billy's edge of delirium delivery, is truly gorgeously unsettling.\nThere is no attention grabbing aural trickery here and there are no novelty grooves, but Electribe still manage to extend the boundaries of House music (or maybe move the goalposts), pushing it into an eerie, half-lit world of abandonings and abandonment where all defences are down. It is sorrow-soaked but never maudlin. Their cover version of 'Inside Out' is dizzily sensual, the rolling bleeps and staccato keyboards of 'Diamond Dove' are turbulently dreamy and 'You're Walking (Peeping Tom Mix)' is a perfect nervy neon city soundtrack.\nOn a par with The Beloved's album for its ability to blackmail the emotions while simultaneously seducing the body, 'Electribal Memories' is probably the least trivial dance record made this year. \nHeart sickness at its most delicious, and if there's a cure for that, you don't want it. (9) Review by Roger Morton (NME?)\n\n &lt;a href=&quot;\nhttp://i.imgur.com/BPVT5QR.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/BPVT5QR.jpg&lt;/a&gt;\n\n\n01. Talking With Myself    [6:22]\n02. Lipstick On My Lover    [6:21]\n03. You're Walking (Peeping Tom Mix)    [6:03]\n04. Inside Out    [5:58]\n05. Diamond Dove    [7:51]\n06. Heading For The Night    [4:08]\n07. Tell Me When The Fever Ended    [4:42]\n08. Talking 2    [6:04]\n09. Electribal Memories    [10:36]\n10. You're Walking (Corporate Def Mix)    [8:17]\n11. Talking With Myself (Frankie Knuckles Mix) (12'' Version)    [7:49]\n12. Tell Me When The Fever Ended (Larry Heard Mix) (12'' Version)    [5:03]\n\n\n\nLabel: Phonogram\nReleased: 1990\nCatalogue: 842 965-2\n\n\n\n\n\n\nCodec: Flac\nCompression Level: 6\nQuality: High\n\n\nCD-rip by alekow (EAC and Flac)\nCovers Included (600dpi)\n\n\n\n\n\n\n\n\n\nEnjoy, Seed and Share\n","torrent":{"xt":"urn:btih:e20589420c3b51c54e4957d394bcf1bd9f1ef17a","amp;dn":"Electribe+101+-+Electribal+Memories+%281990%29%40flac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e20589420c3b51c54e4957d394bcf1bd9f1ef17a","infoHashBuffer":{"type":"Buffer","data":[226,5,137,66,12,59,81,197,78,73,87,211,148,188,241,189,159,30,241,122]},"announce":[],"urlList":[]}}