{"title":"Applied Sociology - Roles and Activities of Sociologists in Dive","uid":7877491,"size":126218271,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e24ff29d1f8e348aa4fc24f03e56f954631ad123&amp;dn=Applied+Sociology+-+Roles+and+Activities+of+Sociologists+in+Dive&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dchani","files":-1,"time":1354382549,"description":"Should there be an increased emphasis on applied sociology \nin the discipline? What are the implications for conventional undergraduate and graduate training of developing applied sociology \nprograms? Will the growth of applied sociology seriously hinder \ntheory building and basic research? What does sociology have to \noffer persons interested in nonacademic careers? Are ample and diverse positions really available for sociologists outside academia? \nWill sociology lose its respectability within the university if it encourages applied work? To what extent must applied sociologists \ncompromise personal values? Can applied sociologists really help \nthe groups and organizations that employ them successfully achieve \ntheir goals? \nThese and similar questions have been argued persistently in \nthe published literature, at national and regional conventions, in \ngraduate and undergraduate seminars, and in nearly every setting \nin which sociologists convene to discuss informally their discipline \nand careers. But interest in applied sociology in the 1980s represents more than just a continuation of the arguments and soul \nsearching of the past. Rather, because sociology approaches maturity at a time when academic employment opportunities, basic research support, and public appreciation for the enterprise are declining, the discipline is confronted with answering for itself the \nquestion of its future robustness, if not its viability. \nFor a significant number in the discipline, developing applied sociology programs and fostering nonacademic work opportunities offer the only sensible solution to present and projected \ndeclines in recruits, resources, and recognition. These advocates \nrepresent an unusual alliance: some are scholars of distinction \nwhose contributions have received extensive peer recognition; \nsome are long-time workers in the field of applied sociology; others are &quot;born-again&quot; applied sociologists whose conversions are \ncomparatively recent; and still others are part of the growing contingent of relatively young sociologists who see their futures tied \nto the growth of applied sociology. All are represented among the \nauthors of chapters in this book.","torrent":{"xt":"urn:btih:e24ff29d1f8e348aa4fc24f03e56f954631ad123","amp;dn":"Applied+Sociology+-+Roles+and+Activities+of+Sociologists+in+Dive","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e24ff29d1f8e348aa4fc24f03e56f954631ad123","infoHashBuffer":{"type":"Buffer","data":[226,79,242,157,31,142,52,138,164,252,36,240,62,86,249,84,99,26,209,35]},"announce":[],"urlList":[]}}