{"title":"Star Trek 2-The Wrath Of Khan (FLAC)","uid":5029747,"size":396301619,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e26152fea31132e26f13c68c1566191882c57ae4&amp;dn=Star+Trek+2-The+Wrath+Of+Khan+%28FLAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"spotted_jackal","files":-1,"time":1248861686,"description":"&quot;Star Trek The Wrath Of Khan - The Original\n\n\n\nSoundtrack&quot;\n\n\n\n\n\nStar Trek II: The Wrath of Khan is a 1982 motion picture released by Paramount Pictures. The film is the second feature based on the Star Trek science fiction franchise. The plot features James T. Kirk (William Shatner) and the crew of the starship USS Enterprise facing off against the genetically-engineered tyrant Khan Noonien Singh (Ricardo MontalbÃƒÂ¡n), a character who first appeared in the 1967 Star Trek television series episode &quot;Space Seed&quot;. When Khan escapes from a 15-year exile to exact revenge on Kirk, the crew of the Enterprise must stop him from acquiring a powerful terraforming device named Genesis. The film concludes with the death of Enterprise crewmember Spock (Leonard Nimoy), beginning a story arc that continues through 1986's Star Trek IV: The Voyage Home.\n\n\n\nAfter the lackluster critical and commercial response to Star Trek: The Motion Picture, series creator Gene Roddenberry was forced out of the sequel's production. Executive producer Harve Bennett wrote the film's original outline, which Jack B. Sowards developed into a full script. Director Nicholas Meyer completed the final script in 12 days, without accepting a writing credit. Meyer's approach evoked the swashbuckling atmosphere of the original series, and the theme was reinforced by James Horner's musical score. Leonard Nimoy only reprised his role as Spock because the character's death was intended to be irrevocable. Negative test audience reaction to Spock's death led to significant revisions of the ending without Meyer's consent. The production used various cost-cutting techniques to keep within budget, including utilizing miniatures from past projects and re-using effects footage from the previous movie. Among the film's technical achievements is the first complete feature film sequence created entirely with computer-generated graphics.\n\n\n\n\n\n\n\nJames Roy Horner (born August 14, 1953) is an American composer and conductor of orchestral and film music. He is noted for the integration of choral and electronic elements in many of his film scores, and for frequent use of Celtic musical elements. Horner won two Academy Awards for his score and song compositions for the film Titanic in 1997.\n\nHorner was born in Los Angeles, California, the son of Austrian immigrants Joan (nÃƒÂ©e Fraenkel) and Harry Horner, who was a production designer, set designer and occasional film director.\n\n\n\nHorner started playing piano at the age of five. His early years were spent in London, where he attended the Royal College of Music and studied under GyÃƒÂ¶rgy Ligeti. He received his bachelor's degree in music from the University of Southern California, and eventually earned a master's and started working on his doctorate at the University of California, Los Angeles where he studied with Paul Chihara, among others. After several scoring assignments with the American Film Institute in the 1970s, he finished his teaching of music theory at UCLA and turned to film scoring.\n\n\n\nIn his youth, Horner was acquainted with Carrie Goldsmith, daughter of the famous composer and peer Jerry Goldsmith\n\n","torrent":{"xt":"urn:btih:e26152fea31132e26f13c68c1566191882c57ae4","amp;dn":"Star+Trek+2-The+Wrath+Of+Khan+%28FLAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e26152fea31132e26f13c68c1566191882c57ae4","infoHashBuffer":{"type":"Buffer","data":[226,97,82,254,163,17,50,226,111,19,198,140,21,102,25,24,130,197,122,228]},"announce":[],"urlList":[]}}