{"title":"One Kiss Can Lead To Another - Girl Group Sounds, Lost &amp; Found","uid":5066615,"size":1625814867,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e365dae382e95943961988dd5f97ea286a3e93ba&amp;dn=One+Kiss+Can+Lead+To+Another+-+Girl+Group+Sounds%2C+Lost+%26+Found&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"sowingmyseed","files":132,"time":1251043152,"description":"The importance of the girl group sound of the early '60s is often overlooked in the traditional telling of the history of rock &amp; roll. In most accounts, after the first wave of rockers either died (Buddy Holly, Eddie Cochran), quit (Little Richard), went into the army (Elvis), or married a cousin (Jerry Lee Lewis), hordes of one-named teen idols (Fabian, Frankie, Dion) and smoothies (Bobby Rydell, Paul Anka) took over and rock music withered away until the Beatles rescued it. This narrow-minded opinion leaves out so much amazing music (Del Shannon, Jackie Wilson, the Everly Brothers, Lou Christie, the start of Motown, the Beach Boys, and the surf sound as well as so much classic R&amp;B) that it makes your head hurt. Add to that list of amazing music the girl group sound. Add the Ronettes, the Shirelles, the Chiffons, Little Eva, and the Cookies. Add a style of music that when it's happy is just about the most exuberant sound on earth and when it's sad can completely rip your heart out. The sheer amount of girl group collections that have been released are a testament to the power of the sound, and with the release of Rhino's One Kiss Can Lead to Another: Girl Group Sounds Lost and Found, maybe even the rock snobs will get over themselves and get on board. Those who already are hip to the power of the girl group sound will be floating on a cloud after just one look at the track listing. Most of the major movers and shakers from behind the mics (everyone from the Shangri-Las, Barbara Lewis, Maxine Brown, to Dusty Springfield, Jackie DeShannon, and the Toys) and the mixing board (Jeff Barry, Ellie Greenwich, the Tokens, Tony Hatch, Shadow Morton, Bob Crewe, and Bert Berns) are here along with loads of acts that range from the obscure (Dorothy Berry, Sadina, Sylvan, the Pussycats) to the literally unknown (Marsha Gee). Best of all there are almost no hits to be found. There's no &quot;Leader of the Pack,&quot; no &quot;Stop! in the Name of Love,&quot; no &quot;Going to the Chapel.&quot; Instead the compilers focus on under-rated or rare songs by the top names and the best songs by the second-tier and below artists. This decision means that there are no tracks that are overused or obvious and that the disc is brimming with surprises and new discoveries to all but the most in-the-know girl group fanatics. Even they might find something here that will knock their bobby socks off, and if not, at least they are in for almost five hours of pure fun.\n\nRhino's designers must have had fun too when coming up with the look of the set; it is packaged in a miniature hat box, the liner notes are made to look like a diary, and each separate disc is housed in a mock compact. Very cute, but a retailer's nightmare, no doubt. The liner notes themselves are mostly wonderful, especially co-compiler Sheila Burgel's nifty track-by-track annotations, and there are tons of great photos, including a shot of the Shangri-Las in the studio that is almost worth the price of the set alone. The music is the real draw, however; the four discs and 120 songs are lovingly chosen and sequenced with great care, making sure to keep things interesting by blending styles, tempos, and moods in a glittering display of pop genius. The compilers (Sheryl Farber and Gary Stewart) make remarkably few missteps and quite a few brilliant decisions. The first and most important one was to cast a very wide net when gathering tracks, namely by looking to the U.K. for artists. There was very fertile scene there in the early to mid-'60s that produced some major talent like Dusty Springfield, Sandie Shaw, and Lulu. Indeed some of the collection's most exciting tracks are drawn from the U.K. vaults like Petula Clark's pounding rocker &quot;Heart,&quot; Lulu's even more pounding rocker &quot;I'll Come Running&quot; (featuring some wild guitar from session whiz Jimmy Page), P.P. Arnold's definitive version of &quot;The First Cut Is the Deepest,&quot; and Dusty's majestic cover of the Baby Washington song &quot;I Can't Wait to See My Baby's Face.&quot; Another fine strategy was picking artists who weren't usually associated with the girl group sound (like Dolly Parton, Connie Francis, Brenda Lee, Skeeter Davis, Toni Basil, and Wanda Jackson) as it adds some historical interest and all the tracks are really quite good too, especially Francis' &quot;Don't Ever Leave Me&quot; and Jackson's &quot;Funnel of Love.&quot; They also chose to stretch the definition of the girl group sound to include late-'60s soul (the Lovelites' &quot;How Can I Tell My Mom &amp; Dad,&quot; the Flirtations' &quot;Nothing But a Heartache&quot;), garage rock (the Luv'd Ones' &quot;Up Down Sue,&quot; the What Four's &quot;I'm Gonna Destroy That Boy&quot;), and tame psychedelia (Goldie &amp; the Gingerbreads' &quot;Walking in Different Circles,&quot; the Chiffons' &quot;Nobody Knows What's Going On (In My Mind But Me)&quot;). Lastly the inclusion of many songs like Reperata &amp; the Delrons' &quot;I'm Nobody's Baby Now,&quot; the Honeys' Brian Wilson-produced &quot;The One You Can't Have,&quot; and Alder Ray's &quot;Cause I Love Him&quot; that are influenced by the productions of Phil Spector helps to offset the lack of any Spector-produced tracks. It seems that ABKCO Records keeps a very firm (and pricey) leash on the songs they own, so that means no prime Ronettes, no Crystals, and no Darlene Love (except when she is fronting the Blossoms). It also means that there are no tracks from the Cameo-Parkway vaults, so no Dee Dee Sharp, Orlons, or Candy &amp; the Kisses either. Amazingly, the high quality of the tracks that are here mean you don't miss the exclusions too much. In fact there are so many great songs that listing the highlights would read like a reprint of the back cover of the box. Still, a few stand out as some of the best the girl group sound had to offer, like Cathy Saint's &quot;Big Bad World,&quot; Twinkle's over-the-top death ballad (a girl group specialty that is well represented here) &quot;Terry,&quot; the Exciters' &quot;He's Got the Power,&quot; Earl-Jean's &quot;I'm Into Something Good,&quot; the Girlfriends' &quot;My One and Only Jimmy Boy,&quot; the Cake's &quot;Baby, That's Me,&quot; the Girls' &quot;Chico's Girl,&quot; Patty &amp; the Emblems' raucous live version of &quot;Mixed Up, Shook Up Girl,&quot; Evie Sands' &quot;I Can't Let Go,&quot; and Dorothy Berry's perfect &quot;You're So Fine.&quot; That is a staggering chunk of solid gold, but the amazing thing is that you could grab any ten songs at random and come up with an extract just as strong.\n\nOf course, with any collection like this there are going to be questions about songs and artists that don't appear. A short memory search might reveal big names like Baby Washington, Helen Shapiro, and the Dixie Cups (!), smaller names like the Pixies Three and Marcie Blaine, or songs like the Orchids' &quot;Oo-Chang-a-Lang&quot; and the Delicates' &quot;Stop Shovin' Me Around.&quot; Any girl group fan will have additions to the list, but the great thing about One Kiss Can Lead to Another is that there are no obvious choices to remove to make room for anyone else. Each track fits just right and to take one out would be just plain painful. A follow-up set with more artists from around the world (France especially), more obscure artists, and even more rare tracks from the big names is definitely in order. If it's anything like One Kiss Can Lead to Another: Girl Group Sounds Lost and Found, it'll be thrilling from beginning to end and bring fans of the girl group sound (and great pop music) nothing but joy and happiness. ~ Tim Sendra, All Music Guide","torrent":{"xt":"urn:btih:e365dae382e95943961988dd5f97ea286a3e93ba","amp;dn":"One+Kiss+Can+Lead+To+Another+-+Girl+Group+Sounds%2C+Lost+%26+Found","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e365dae382e95943961988dd5f97ea286a3e93ba","infoHashBuffer":{"type":"Buffer","data":[227,101,218,227,130,233,89,67,150,25,136,221,95,151,234,40,106,62,147,186]},"announce":[],"urlList":[]}}