{"title":"Children of Achilles: The Greeks in Asia Minor Since the Days of","uid":11734629,"size":1327033,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e4c49a3d30ded8dd034392ebcb996443d934105a&amp;dn=Children+of+Achilles%3A+The+Greeks+in+Asia+Minor+Since+the+Days+of&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1425512233,"description":"Since the days of Troy historic lands of Asia Minor have been home to Greeks. They are steeped in a rich fusion of Greek and Turkish culture and the histories of both are irrevocably entwined, fatefully connected. Children of Achilles tells the epic and ultimately tragic story of the Greek presence in Anatolia, beginning with the Trojan War and culminating in 1923 with the devastating population exchange that followed the Turkish War of Independence. The once magnificent, now ruined, cities that cluster along the Aegean and Mediterranean coasts of Turkey are reminders of a civilization that produced the first Hellenic enlightenment, giving birth to Homer, Herodotus and the first philosophers of nature. For more three millennia the Anatolian Greeks preserved their identity and culture as the tides of history washed over them, enduring conflicts that historians since Herodotus have seen as an unending clash of civilizations between East and West. Today, the memory of the Greek diaspora from Asia Minor lives on in the music of rebetika, the threnodies known as amanadas, and the poetry of Seferis, and even now the descendants of those exiles speak with nostalgia of 'i kath'imas Anatoli' - our own Anatolia, their lost homeland. This, told for the first time, is their story, from glorious beginnings to a bitter end, a story that continues to echo through the ages and across continents","torrent":{"xt":"urn:btih:e4c49a3d30ded8dd034392ebcb996443d934105a","amp;dn":"Children+of+Achilles%3A+The+Greeks+in+Asia+Minor+Since+the+Days+of","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4c49a3d30ded8dd034392ebcb996443d934105a","infoHashBuffer":{"type":"Buffer","data":[228,196,154,61,48,222,216,221,3,67,146,235,203,153,100,67,217,52,16,90]},"announce":[],"urlList":[]}}