{"title":"Bill Haley &amp; His Comets - Rock Around the Clock [Live, 1955]","uid":9932169,"size":117549060,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e536b84e43a2195d28e40473daf1d44c766e3052&amp;dn=Bill+Haley+%26amp%3B+His+Comets+-+Rock+Around+the+Clock+%5BLive%2C+1955%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1397117034,"description":"Bill Haley &amp; His Comets - Rock Around the Clock [Live, 1955].VOB\n\n\nHQ very rare live performance music video from a promo DVD with 2 &amp; 6 channel Dolby AC3. &quot;Rock Around the Clock&quot; is a rock and roll song in the 12-bar blues format written by Max C. Freedman and James E. Myers (the latter under the pseudonym &quot;Jimmy De Knight&quot;) in 1952. The best-known and most successful rendition was recorded by Bill Haley and His Comets in 1954 for American Decca. It was a number one single on both the US and UK charts and also re-entered the UK Singles Chart in the 1960s and 1970s. \n\nIt was not the first rock and roll record, nor was it the first successful record of the genre (Bill Haley had American chart success with &quot;Crazy Man, Crazy&quot; in 1953, and in 1954, &quot;Shake, Rattle and Roll&quot; sung by Big Joe Turner reached No. 1 on the Billboard R&amp;B chart). Haley's recording nevertheless became an anthem for rebellious Fifties youth and is widely considered to be the song that, more than any other, brought rock and roll into mainstream culture around the world. The song is ranked No. 158 on the Rolling Stone magazine's list of The 500 Greatest Songs of All Time.\n\nOn July 9, 1955, &quot;Rock Around the Clock&quot; became the first rock and roll recording to hit the top of Billboard's Pop charts, a feat it repeated on charts around the world. The song stayed at this place for eight weeks. The record was also no.1 for seven weeks on the Cashbox pop singles chart in 1955. The Bill Haley version also hit number three on the R&amp;B charts.\n\nBill Haley &amp; His Comets was an American rock and roll band that was founded in 1952 and continued until Haley's death in 1981. The band, also known by the names Bill Haley and The Comets and Bill Haley's Comets (and variations thereof), was the earliest group of white musicians to bring rock and roll to the attention of white America and the rest of the world. From late 1954 to late 1956, the group placed nine singles in the Top 20, one of those a number one and three more in the Top Ten.\n\nBandleader Bill Haley had previously been a country music performer; after recording a country and western-styled version of &quot;Rocket 88&quot;, a rhythm and blues song, he changed musical direction to a new sound which came to be called rock and roll.\n\nAlthough several members of the Comets became famous, Bill Haley remained the star. With his spit curl and the band's matching plaid dinner jackets and energetic stage behavior, many fans consider them to be as revolutionary in their time as The Beatles or The Rolling Stones were a decade later.\n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/(We%27re_Gonna)_Rock_Around_the_Clock&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/(We%27re_Gonna)_Rock_Around_the_Clock&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/LaNAMAAfH&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/LaNAMAAfH&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video : MPEG2 Video 720x576 (4:3) 25fps 8600kbps\n   Audio1: Dolby Digital AC3 48000Hz 6ch 448kbps\n   Audio2: Dolby Digital AC3 48000Hz stereo 224kbps\n   Duration: 00:01:56\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.3\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:e536b84e43a2195d28e40473daf1d44c766e3052","amp;dn":"Bill+Haley+%26amp%3B+His+Comets+-+Rock+Around+the+Clock+%5BLive%2C+1955%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e536b84e43a2195d28e40473daf1d44c766e3052","infoHashBuffer":{"type":"Buffer","data":[229,54,184,78,67,162,25,93,40,228,4,115,218,241,212,76,118,110,48,82]},"announce":[],"urlList":[]}}