{"title":"Burn Notice Temporada 1 Subtitulos espaÃƒÂ±ol","uid":4628325,"size":5055590400,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e635f358a15c7feda488b72a73431056d694853c&amp;dn=Burn+Notice+Temporada+1+Subtitulos+espa%C3%83%C2%B1ol&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"gruke","files":-1,"time":1231289864,"description":"Primera Temporada \n\n\nCuando un espÃƒÂ­a es despedido, no reciben una carta del departamento de recursos humanos, lo consideran &quot;quemado&quot;. Mientras se encuentra en una misiÃƒÂ³n internacional, el agente Michael Westen (Jeffrey Donovan) recibe este aviso y se vuelve intocable. Sin tener ni idea de por quÃƒÂ© o quiÃƒÂ©n ha decidido retirarle, Michael regresa a su hogar familiar en Miami, en donde sin dinero, estÃƒÂ¡ decidido a averiguar la razÃƒÂ³n para su sÃƒÂºbito despido. Incapaz de utilizar sus contactos habituales y obligado a permanecer alejado del radar de los espÃƒÂ­as, pondrÃƒÂ¡ su entrenamiento en operaciones especiales para ayudar a aquellos a los que la policÃƒÂ­a no quiere o no puede ayudar, para cubrir asÃƒÂ­ los costes de su investigaciÃƒÂ³n personal. La mayor parte de la gente estarÃƒÂ¡ emocionada por estar en las cÃƒÂ¡lidas y atractivas arenas de South Beach. Sin embargo, Michael Westen no es como la mayorÃƒÂ­a de la gente. DespuÃƒÂ©s de 10 aÃƒÂ±os sirviendo a su paÃƒÂ­s, trabajando en Europa del Este y en paÃƒÂ­ses asiÃƒÂ¡ticos como agente encubierto, Michael estÃƒÂ¡ viviendo la peor pesadilla de todo espÃƒÂ­a. Mientras estÃƒÂ¡ en medio de una peligrosa misiÃƒÂ³n en Nigeria, los contactos de Michael le informan de que ha sido declarado como &quot;quemado&quot;. Esta situaciÃƒÂ³n pone en peligro su vida, congela sus cuentas bancarias, le lleva de regreso a Miami y le coloca en cada lista gubernamental de &quot;hombre a seguir&quot;. Como no pueden sacarle sus habilidades o la informaciÃƒÂ³n que conoce, le retiran sus medios y sus recursos para asegurarse de que nunca jamÃƒÂ¡s pueda volver a trabajar en ese mundo.\n\n\n","torrent":{"xt":"urn:btih:e635f358a15c7feda488b72a73431056d694853c","amp;dn":"Burn+Notice+Temporada+1+Subtitulos+espa%C3%83%C2%B1ol","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e635f358a15c7feda488b72a73431056d694853c","infoHashBuffer":{"type":"Buffer","data":[230,53,243,88,161,92,127,237,164,136,183,42,115,67,16,86,214,148,133,60]},"announce":[],"urlList":[]}}