{"title":"A World History of Photography (Art Ebook).pdf","uid":10221928,"size":134679864,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e692d6f0b1aea8eda4912506c5098bee06c0c6ce&amp;dn=A+World+History+of+Photography+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"STBGD","files":-1,"time":1401054863,"description":"pdf / English / Abbeville Press / 1997 / 3rd Edition / 696p\n\nThis sumptuously illustrated volume, hailed as an indispensable work on the subject, has now been updated to address the latest developments in all aspects of photography, from postmodern installations to digitization.\nA World History of Photography encompasses the entire range of the medium, from the camera lucida to the latest computer technology, and from Europe and the Americas to the Far East. It investigates all aspects of photography-aesthetic, documentary, commercial, and technical-while placing it in historical context. Included among the more than 800 photographs by men and women are both little-known and celebrated masterpieces, arranged in stimulating juxtapositions that illuminate their visual power.\n\nDr. Rosenblum's chronicle of photography is authoritative and unbiased, tracing both chronologically and thematically the evolution of this young art. Exploring the diverse roles that photography has played in the communication of ideas, Dr. Rosenblum devotes special attention to topics such as portraiture, documentation, advertising, and photojournalism, and to the camera as a medium of personal artistic expression. Profiles are provided of individual photographers who made notable contributions to the medium or epitomized a certain style.\n\nComplementing the extensive illustrations woven into the text are seven in-depth albums of outstanding examples of portraiture, landscape, social and scientific documentation, color photography, and photojournalism. Also included are three technical histories, illustrated with labeled line drawings, which clearly explain important developments in photographic equipment, materials, and processes throughout the medium's history.A time line, a glossary, and a bibliography-all updated for this new edition-supply additional invaluable information.\n\nThe far-ranging text, numerous special features, and handsome, user-friendly design make this volume informative, visually exciting, and accessible for general and advanced students, collectors, photographers, and anyone else who loves photography. Not only an encyclopedic reference source for the entire history of photography, it also offers fresh images and observations, encouraging readers to look at and think about photographs in new and expansive ways.\n\nOther Details: 820 illustrations, 83 in full color 696 pages 8 3/4 x 8 3/4&quot; Published 1997","torrent":{"xt":"urn:btih:e692d6f0b1aea8eda4912506c5098bee06c0c6ce","amp;dn":"A+World+History+of+Photography+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e692d6f0b1aea8eda4912506c5098bee06c0c6ce","infoHashBuffer":{"type":"Buffer","data":[230,146,214,240,177,174,168,237,164,145,37,6,197,9,139,238,6,192,198,206]},"announce":[],"urlList":[]}}