{"title":"Tosca[1976]_(PlacidoDomingo_RainaKabaivanska)","uid":4106877,"size":1114580328,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e789c75464fb56434f894616e670bf3a3465b481&amp;dn=Tosca%5B1976%5D_%28PlacidoDomingo_RainaKabaivanska%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ricksp","files":3,"time":1206849530,"description":"Director: Gianfranco de Bosio\n\nProduction: Harald Gericke\n\nConductor: Bruno Bartoletti with New Philharmonia Ochestra\n\nDuration: 115 min\n\nSubtitles: English and Italian\n\nPlot: THE scene is laid in Rome in 1800, at the time of the battle of Marengo. Cesar Angelotti, a politica prisoner, has escaped and takes refuge in the Church of Saint Andrea Alla Valle, where he surprises the painter, Cavaradossi, at work. Cavaradossi, recog nising in him the Consul of the late Roman Republic and an old friend of his, arranges to convey him through a secret passage in an adjoining chapel which leads out to his own villa garden, where he can hide in a dry well. Whilst making these arrangements he is interrupted by his sweetheart, Tosca, a singer, who demands admission; and thrusting Angelotti into the chapel, Cavaradossi admits the beautiful singer, who is of a jealous disposition, and whose suspicions have been aroused by the closed door. He soothes her ruffled feelings, however, and at length sends her away happy. Then, as he enters the chapel, a cannon shot announces that the prisoners escape has become known, and, knowing that every moments delay means danger, the painter decides to accompany the refugee himself. Angelotti by this time has arrayed himself in some feminine garments left in the chapel by his sister for his disguise, and the pair escape through the secret passage just as a crowd of citizens pour into the church, headed by the wicked Scarpia, Chief of Police, by whose malice Angelotti had been unjustly imprisoned, and who has now tracked him to this spot. The crowd are rejoicing in a rumour that Napoleon has been defeated at Marengo; and with them comes Tosca, whose jealous suspicions of her lover are stirred afresh by Scarpia showing her a ladys fan he has discovered in the chapel. Scarpia has conceived a violent passion for Tosca, and determines to make her his mistress; and as he suspects Cavaradossi of aiding the escaped Angelotti, he thinks to rid himself of his rival by bringing him to execution for his present shielding of a State prisoner. He therefore bids his chief spy and attendant, Spoletta, follow Tosca, believing that she will seek her lover. This ruse is successful, and Cavaradossi is found and brought to a chamber in the Palace Farnese, where Scarpia is expecting Tosca, who is to sing at the Queens festival that evening in honour of the supposed victory.\n\nWhen Cavaradossi is brought in he refuses to reveal his friends hiding-place, and manages to whisper to Tosca to keep the secret also; but the cruel Scarpia orders him to be tortured in the chamber beyond, whilst he himself makes his infamous proposals to Tosca. The singer scornfully refuses to listen to his advances; but her anger is soon changed to grief and despair on hearing the groans of her tortured lover in the room beyond. The vile Scarpia now offers to release her lover from the torture if she will reveal the hiding-place of Angelotti, and at last Tosca, unable to bear more, gasps out that the refugee is in the well in Cavaradossis garden. The tortured man is then brought forth, but is full of grief on learning of Toscas forced betrayal of his friend; but the news is now brought that Angelotti had, before her confession, been taken, and has killed himself, and that the news of Napoleons defeat is false, and that he has gained a victory instead. The furious Scarpia therefore gives orders for Cavaradossi to be instantly shot, but as he is led away Tosca, on being left alone with the tyrant, passionately pleads for his life. Scarpia now offers to save her lover if she will grant his evil desires and become his; and at last the despairing Tosca consents. Scarpia declares that a mock execution will have to take place, but that blank cartridges shall be fired; and Tosca also persuades him to write a passport for herself and her lover to leave the city. Whilst Scarpia is writing this, Tosca snatches up a knife from the table, and when he flings down the pen and prepares to embrace her she plunges it into his heart.\n\nIn Act 3 Tosca appears at the place of execution and tells her lover of the mock death he is to feign; for Scarpia had pretended to give the promised instructions to his attendants before signing her passport, but-alas for poor Tosca ! - he has bidden them make the execution a real one after all. Cavaradossi therefore parts calmly from his sweetheart when the soldiers come to lead him forth, and Tosca remains to see him fall, as arranged, intending to escape with him afterwards when the soldiers have gone. Cavaradossi is put in place and, as the volley rings out, he falls to the ground and remains motionless, as though dead; and after awhile the soldiers cover him with a cloth and depart. Then Tosca hastens to her fallen lovers side and eagerly pulls aside the cloth, awaiting his expected caress; but to her horror she finds that real shot has been used and that he is dead. As she utters a cry of grief and despair, Spoletta and a crowd of officials enter the courtyard, full of excitement, having discovered that Scarpia has been killed, and suspecting the singer as his slayer; but before they can reach her Tosca rushes to the parapet of the tower, and casting herself over the battlements falls dead on the pavement below.\n\nCast: Raina Kabaivanska (Tosca), Placido Domingo (Mario Caravadosi), Sherrill Milnes (Il Barone Scarpia), Giancarlo Luccardi (Angelotti), Mario Ferrara (Spoletta), Alfredo mariotti (Il Sagrestano), Bruno Grella (Sciarrone), Domenico Medici (Carceriere)","torrent":{"xt":"urn:btih:e789c75464fb56434f894616e670bf3a3465b481","amp;dn":"Tosca%5B1976%5D_%28PlacidoDomingo_RainaKabaivanska%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e789c75464fb56434f894616e670bf3a3465b481","infoHashBuffer":{"type":"Buffer","data":[231,137,199,84,100,251,86,67,79,137,70,22,230,112,191,58,52,101,180,129]},"announce":[],"urlList":[]}}