{"title":"Destruction of Meaning by Simon Hardy","uid":10742635,"size":261332,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e791d2b5a938a4c822422d2f8e0e7385bba0152e&amp;dn=Destruction+of+Meaning+by+Simon+Hardy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"octubre","files":-1,"time":1407778178,"description":"Destruction of Meaning by Simon Hardy\n\nPublication Date: August 5, 2013\n\nIn a post-ideological world, where the dominant politics seeks to minimise the states responsibilities and expand the control of the market over society, we witness a process whereby the meaning of words and political terms is dramatically distorted and undermined. The loss of meaning in political terminology (for instance, where a pro-free market liberal like President Obama can be called a socialist by mainstream media) is related to a loss of empowerment and increasing alienation in a market driven economy which values the 'new individual' above collective, historically contextualised subjectivity.\n\nThe argument of the book is that since the Thatcher/Reagan revolution the move to the political right internationally, the collapse of the Berlin wall and the &quot;end of history&quot; paradigm there has been a loss of meaning in our own lives as individuals. The modernist projects of progressive change and empowerment are considered dead. Consumerism and white noise media saturation frustrate our abilities to relate to the real world around us.\n\nThis book seeks to make a contribution to the debate (or lack thereof) concerning how the post-political malaise that infects many Western societies is part of a decline in both political discourse and cultural forms. Unless we address the growing credibility gap between how we are governed and relate to institutions of power, as well as the media that represents them, then we are unable to generate new modernist paradigms which can restart history. As such the liberal democratic-free market model remains hegemonic despite its apparent failings in the face of economic and social decline post 2008.","torrent":{"xt":"urn:btih:e791d2b5a938a4c822422d2f8e0e7385bba0152e","amp;dn":"Destruction+of+Meaning+by+Simon+Hardy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e791d2b5a938a4c822422d2f8e0e7385bba0152e","infoHashBuffer":{"type":"Buffer","data":[231,145,210,181,169,56,164,200,34,66,45,47,142,14,115,133,187,160,21,46]},"announce":[],"urlList":[]}}