{"title":"Till Death Do Us Part      5 B/W  Original Screen   Plays.","uid":6228355,"size":1732894582,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e7bdc1a11e1842f622e7dc36bff41c55bf3f3bf0&amp;dn=Till+Death+Do+Us+Part++++++5+B%2FW++Original+Screen+++Plays.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"OLDLIMEY4","files":5,"time":1299602185,"description":"Till Death Us Do Part is a British television sitcom that aired on BBC1 from 1965 to 1968, 1970, and from 1972 to 1975. First airing as a Comedy Playhouse pilot, the series aired for seven series until 1975. Six years later, ITV continued the sitcom, calling it Till Death.... From 1985 to 1992, the BBC produced a sequel In Sickness and in Health.\n\nCreated by Johnny Speight, Till Death Us Do Part centred on the East End Garnett family, led by patriarch Alf Garnett (Warren Mitchell), a reactionary white working-class man who holds racist and anti-socialist views. His gentle and long-suffering wife Else was played by Dandy Nichols, and his daughter Rita by Una Stubbs. Rita's bright but layabout husband Mike Rawlins (Antony Booth) is a socialist. The character Alf Garnett became a well known character in British culture, and Mitchell played him on stage and television up until 1998, when Speight died.\n\nIn addition to the spin-off In Sickness and in Health, Till Death Us Do Part was re-made in many countries, from Brazil to Germany (Ein Herz und eine Seele), and Hong Kong (All in a Family), with the most notable remake being the long-running 1970s American series, All in the Family.\n\nMany episodes from the first three series are thought to no longer exist, having been wiped in the late 60s and early 70s as was the policy at the time.","torrent":{"xt":"urn:btih:e7bdc1a11e1842f622e7dc36bff41c55bf3f3bf0","amp;dn":"Till+Death+Do+Us+Part++++++5+B%2FW++Original+Screen+++Plays.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7bdc1a11e1842f622e7dc36bff41c55bf3f3bf0","infoHashBuffer":{"type":"Buffer","data":[231,189,193,161,30,24,66,246,34,231,220,54,191,244,28,85,191,63,59,240]},"announce":[],"urlList":[]}}