{"title":"[PSX] In Cold Blood (2 - Disc) [NTSC]","uid":11179399,"size":729921456,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:e7d4ea5437a54dce75e073f30e613636296e234f&amp;dn=%5BPSX%5D+In+Cold+Blood+%282+-+Disc%29+%5BNTSC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Big_dude","files":-1,"time":1412840701,"description":"In Cold Blood for Playstation One                                 Rel. 05/30/2001\n\n \n\nFormat:        CD-R NTSC-USA\nLang.:         English\nDiscs:         2\nImage:         CCD/SUB/IMG\nRating:        Teen\nTheme:         Action Adventure\nRequirements:  Modded/Chipped Playstation or Ps2, Breaker Pro/Boot-cd, \n               Game Enchancer/Built-in Mod, or psx emulator.\n               (You only need to use one of these mentioned methods)\n\n\nCompressed with 7zip. Game was tested and works.\n\n\n\nNote: No Psone Backup Disc/game or copy will work unless your Psone or Ps2 \n      Console is modded, or if you use a Boot Disc like Breaker Pro, or\n      Use a Game Enchancer Plug in Port which is like a boot disc and\n      Can Load Backups. For Multi Disc PS1 games on a modded/chipped console\n      you don't have to worry on inserting next disc.  However if using\n      a boot disc like breaker pro you still have to double swap using disc\n      or an original ps1 game once disc starts spining faster you quickly swap\n      in your disc backup to load.\n\n\n\nRelease Notes - Psx emulator is included if you need it.\n\n\n\nGame Description:\n\nIn the near future, Cold War has reignited between USA and People's Republic of China. CIA has requested assistance of British MI6 to send an agent into Volgia, a fictional state under control of General Nagarov which he founded after the dissolution of the Soviet Union. The player takes control of John Cord, MI6 agent chosen for the assignment. His investigation turns out to be anything but simple.\n\nIn Cold Blood has characteristics of an adventure game, a stealth game, and a shooter. It relies on puzzle-solving but also includes action segments. Progress in the game is mostly achieved by collecting items and talking to various characters to find clues. Many conversations consist of multiple-choice dialogues. At certain points it is necessary to use stealth to proceed undetected, or attempt to solve the situation violently. Combat is fairly simple and consists of melee fighting (punches) or shooting.\n\n\nBurn with Alcohol 120% (Included).\n\n\nSet DataType to Playstation (Write Method Raw/Dao) and burn at 8x Speed.\n\n\nUse Verbatim or Tayio Yuden CD-R Media for best quality, or if other media isn't\nworking.\n\n\nIf this is working fine for you let us know post a comment.\n\n\nAttention -\n\nDisc 2 had some read errors during dumping even though it is in perfect condition.\nIf at some point in game when running disc 2 you have errors in game or it crashes,\nor freezes please post a comment so I can delete this torrent.\n\nThere may be protection on disc 2 for this game if you have problems post a comment.\n\n\n\nPlease Support This Torrent, Seed and Enjoy!\t\t","torrent":{"xt":"urn:btih:e7d4ea5437a54dce75e073f30e613636296e234f","amp;dn":"%5BPSX%5D+In+Cold+Blood+%282+-+Disc%29+%5BNTSC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7d4ea5437a54dce75e073f30e613636296e234f","infoHashBuffer":{"type":"Buffer","data":[231,212,234,84,55,165,77,206,117,224,115,243,14,97,54,54,41,110,35,79]},"announce":[],"urlList":[]}}