{"title":"From Hobbits to Hollywood Essays on Peter Jackson's Lord of the ","uid":11404149,"size":3630621,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e82705d1e5d765b6194ea354cd41404375894d49&amp;dn=From+Hobbits+to+Hollywood+Essays+on+Peter+Jackson%27s+Lord+of+the+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zombie_rox","files":1,"time":1415456358,"description":"Peter Jackson's film version of 'The Lord of the Rings' (2001-2003) is the grandest achievement of 21st century cinema so far. But it is also linked to topical and social concerns including war, terrorism, and cultural imperialism. Its style, symbols, narrative, and structure seem always already linked to politics, cultural definition, problems of cinematic style, and the elemenal mythologies that most profoundly capture our imaginations. 'From Hobbits to Hollywood: Essays on Peter Jackson's Lord of the Rings' treats Jackson's trilogy as having two conditions of existence: an aesthetic and a political. Like other cultural artefacts, it leads a double life as 'objet d'art' and public statement about the world, so that nothing in it is ever just cinematically beautiful or tasteful, and nothing is ever just a message or an opinion. Written by leading scholars in the study of cinema and culture 'From Hobbits to Hollywood' gives Jackson's trilogy the fullest scholarly interrogation to date. Ranging from interpretations of 'The Lord of the Rings' ideological and philosophical implications, through discussions of its changing fandoms and its incorporation into the Hollywood industry of stars, technology, genre, and merchandising, to considerations of CGI effects, acting, architecture and style, the essays contained here open a new vista of criticism and light, for ardent fans of J.R.R. Tolkien, followers of Jackson, and all those who yearn for a deeper appreciation of cinema and its relation to culture.\n\nPublisher: Editions Rodopi B.V. (1 August 2006)\nLanguage: English\nISBN-10: 9042016825\nISBN-13: 978-9042016828","torrent":{"xt":"urn:btih:e82705d1e5d765b6194ea354cd41404375894d49","amp;dn":"From+Hobbits+to+Hollywood+Essays+on+Peter+Jackson%27s+Lord+of+the+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e82705d1e5d765b6194ea354cd41404375894d49","infoHashBuffer":{"type":"Buffer","data":[232,39,5,209,229,215,101,182,25,78,163,84,205,65,64,67,117,137,77,73]},"announce":[],"urlList":[]}}