{"title":"Eminem Discography (Infinite, Eminem Show, Curtain Call, Relapse","uid":7153533,"size":4421893838,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e85c3b4383d8f7af5326fc5630cf45750f301ba0&amp;dn=Eminem+Discography+%28Infinite%2C+Eminem+Show%2C+Curtain+Call%2C+Relapse&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"n17n3uq","files":168,"time":1333386246,"description":"Marshall Bruce Mathers III (born October 17, 1972),[1] better known by his stage name Eminem (often stylized as EMINÆŽM) and by his alter ego Slim Shady, is an American rapper, record producer, songwriter and actor. Eminem's popularity brought his group, D12, to mainstream recognition. As well as being a member of the Detroit rap group D12, Eminem is also one half of the Detroit hip hop duo Bad Meets Evil, with Royce da 5'9&quot;. Eminem is one of the best-selling artists in the world and is the best selling artist of the 2000s.[2] He has been listed and ranked as one of the greatest artists of all time by many magazines including the Rolling Stone magazine which has ranked him 82nd on its list of The 100 Greatest Artists of All Time.[3] The same magazine has declared him The King of Hip Hop.[4] Including his work with D12 and Bad Meets Evil, Eminem has achieved ten number-one albums on the Billboard 200. He has sold more than 42 million tracks and 41 million albums in the United States,[5] and nearly 90 million albums worldwide.[6]\n\nEminem quickly gained popularity in 1999 with his major-label debut album, The Slim Shady LP. That first album, The Marshall Mathers LP and his third major album, The Eminem Show, all won Grammy Awards, making Eminem the first artist to win Best Rap Album for three consecutive LPs. The Marshall Mathers LP is also considered one of Eminem's best and most successful albums. Eminem then went on hiatus after touring in 2005. He released his first album since 2004's Encore, titled Relapse, on May 15, 2009. In 2010, Eminem released his seventh studio album Recovery, which was an international success. Recovery was also named the best selling album worldwide of 2010 joining The Eminem Show, which was the best seller of 2002. Eminem won Grammy Awards for both Relapse and Recovery, giving him a total of 13 Grammys in his career. Eminem has named Masta Ace, Big Daddy Kane, Newcleus, the Beastie Boys, Dr. Dre, Tupac Shakur, AZ, Nas, and Ice-T amongst others as his influences.\n\nEminem has opened other ventures since the beginning of his success. He founded his own record label, Shady Records with his manager Paul Rosenberg. He also has his own radio channel, Shade 45. Eminem began an acting career in 2002, when he starred in the hip hop drama film 8 Mile in which he won the Academy Award for Best Original Song, becoming the first rap artist ever to win the award.[7] He is also set to star in the 2013 films Shady Talez and Have Gun, Will Travel. He has also made cameo appearances in The Wash (2001), Funny People (2009) and television series Entourage.","torrent":{"xt":"urn:btih:e85c3b4383d8f7af5326fc5630cf45750f301ba0","amp;dn":"Eminem+Discography+%28Infinite%2C+Eminem+Show%2C+Curtain+Call%2C+Relapse","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e85c3b4383d8f7af5326fc5630cf45750f301ba0","infoHashBuffer":{"type":"Buffer","data":[232,92,59,67,131,216,247,175,83,38,252,86,48,207,69,117,15,48,27,160]},"announce":[],"urlList":[]}}