{"title":"Marvel NOW! Week 64/All-New Marvel NOW! Week 7 02/05/2014","uid":9573479,"size":534729292,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:e8a7b6a88863593a9e7c4191e9ed2ebd4dc67746&amp;dn=Marvel+NOW%21+Week+64%2FAll-New+Marvel+NOW%21+Week+7+02%2F05%2F2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"yarrrjun","files":14,"time":1391664189,"description":"Hi folks! As per usual, I didn't see a collected torrent for this week's Marvel NOW! titles yet, so I thought I'd upload one. \nIncluded are:\n\n\nAll New Invaders 002\nAvengers A.I. 009\nBlack Widow 003\nCaptain America 016.NOW\nIron Man 021\nLoki, Agent of Asgard 001\nMighty Avengers 006\nMs. Marvel 001\nNew Avengers 014\nPunisher 001\nSuperior Carnage Annual 001\nSuperior Foes of Spider-Man 008\nWolverine 001\nX-Men 010.NOW\n\n\nIf you like them and have the money, BUY THEM and support your favorite creators, writers, artists, local comic shops and publishers. \n\nSeriously, buy the comics you have money for. But only the ones you think deserve your money-- vote with your dollars, and also make your voices heard. Marvel has a pretty good internet presence, which also means they read emails, tweets, tumblr responses, facebook comments. They've shown that they are solely focused on sales numbers-- vote with yr money, and tell them with words (not curses). They WILL listen, eventually. You know-- the internets.\n\nAll my thanks to all the uploaders and scanners and seeders out there! Enjoy! (and seed!)\n\n\nThis week's personal commentary: haven't spent a lot of time on good ol' /602 here on TPB this week, but I did see VikTSlick uploaded an Agents of Atlas collection that you have to czech out if you like: SHIELD, Jimmy Wu, superscience, secret societies, kung fu flicks from the 60s and 70s, sci fi from the 50s, monster flicks from the 50s and 60s, any kind of pulp fiction, great writing, or any combination of the aforementioned.\n\nI'm SUPER thrilled about Ms. Marvel and getting some more desi/south Asian representation in comics. So far, the handful of desi or south Asian characters that are in Marvel/DC combined are 1. not ever MAIN characters, and 2. they're almost universally bland and stereotypical. We're people, too. I don't think of myself as a Bengali Tiger stereotype-- my tattoos are &quot;New Jersey, My Ancestral Homeland&quot; lyrics and a tribute to Odin and his self-sacrifice in exchange for knowledge. We're all different skin colors and personality types and interests, just like everybody else. I'm glad the characters in Ms. Marvel are written like real (comic book) people.\n\nWeirded out by Punisher moving settings to LA, but it should be pretty interesting, too. LA is a very interesting and different beast, compared to NYC. Superior Foes continues to steamroll its way to excellence, and Wolverine... Wolverine is back at #1. Except for when they need to celebrate the 500th issue or whatever. They should just retitle it to Wolverine: [Insert storyline title here], so that restarting at #1 is somewhat legitimate.\n\nEnjoy your Marvels for the week, folks!","torrent":{"xt":"urn:btih:e8a7b6a88863593a9e7c4191e9ed2ebd4dc67746","amp;dn":"Marvel+NOW%21+Week+64%2FAll-New+Marvel+NOW%21+Week+7+02%2F05%2F2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8a7b6a88863593a9e7c4191e9ed2ebd4dc67746","infoHashBuffer":{"type":"Buffer","data":[232,167,182,168,136,99,89,58,158,124,65,145,233,237,46,189,77,198,119,70]},"announce":[],"urlList":[]}}