{"title":"Baker, C D - The Journey of Souls Trilogy (epub)","uid":10648443,"size":1771020,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e982d261935533684f1d44c03e37582db4a367f8&amp;dn=Baker%2C+C+D+-+The+Journey+of+Souls+Trilogy+%28epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"gratefuldawg77","files":3,"time":1406576748,"description":"Crusade of Tears\n\n\n\nCrusade of Tears will transport you back to the 13th Century and the dark era of the Children's Crusade, when 50,000 French and German children were falsely inspired to reclaim the Holy City. Author C.D. Baker masterfully paints an unforgettable portrait that blends thoroughly researched historical accounts with a compellingly personal plot that focuses on a small band of pilgrims, led by stouthearted Wil, his eager brother Karl, and their gentle sister Maria.\nThis realistic story of faith in the midst of extraordinary hardships will speak to you from across the centuries and far into the future. &lt;a href=&quot;\nhttp://www.goodreads.com/book/show/16176510-crusade-of-tears&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.goodreads.com/book/show/16176510-crusade-of-tears&lt;/a&gt;\n\n\nQuest of Hope\n\n\n\nQuest of Hope is the second book in The Journey of Souls Series and is written as a companion to Crusade of Tears. It begins with the birth of Heinrich, the father of two of the young crusaders, and follows his amazing life during the mysterious times we call the Middle Ages. Confronted by oppressive lords, religious abuse, and the dangers of ignorance, Heinrich, like all of us, is bound to a life perspectively shaped by the confines of his world. While called to the service of others far away, he but discovers that his sons have joined the crusade of children! In a desperate pursuit to save them, Heinrich, turns to face the daunting Alps, the perils of bloodlust, and his own soul's despair until Truth offers him - like us - rescue with its wonderful gift of hope. &lt;a href=&quot;\nhttp://www.goodreads.com/book/show/16176518-quest-of-hope?from_search=true&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.goodreads.com/book/show/16176518-quest-of-hope?from_search=true&lt;/a&gt;\n\n\n\n\nPilgrims of Promise\n\n\n\nUnsuccessful in their mission to reach Jerusalem and to rescue her from Islam, Wil and a band of children begin the journey back home. They have endured starvation, disease and the horrors of watching their young comrades die or killed on their pilgrimage. Where is God? Why were they sent on such a mission by the Church? Vivid and haunting, the final book in this trilogy reveals some of humanity's most atrocious acts toward the innocent, and yet, simultaneously, some of the greatest kindnesses. It is strangely, not all that different from today. The reader who dares to follow these children on their way home, will be stronger, kinder and better for the journey","torrent":{"xt":"urn:btih:e982d261935533684f1d44c03e37582db4a367f8","amp;dn":"Baker%2C+C+D+-+The+Journey+of+Souls+Trilogy+%28epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e982d261935533684f1d44c03e37582db4a367f8","infoHashBuffer":{"type":"Buffer","data":[233,130,210,97,147,85,51,104,79,29,68,192,62,55,88,45,180,163,103,248]},"announce":[],"urlList":[]}}