{"title":"MTV Icon-The Cure","uid":3913835,"size":288088064,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:ea19f0d0254d8917760ba78aa05ce67d41298386&amp;dn=MTV+Icon-The+Cure&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"andythecurefan","files":4,"time":1196325482,"description":"The Cure was awarded the MTV Icon for 2004. The ceremony included performances of Cure songs by the bands AFI (&quot;Just Like Heaven&quot;), blink-182 (&quot;A Letter to Elise&quot;), Razorlight (&quot;Boys Don't Cry&quot;) and the Deftones (&quot;If Only Tonight We Could Sleep&quot;), and was hosted by Marilyn Manson.\n\nMTV ICON THE CURE\n\nThe inaugural MTV Icon tribute show celebrates the career of one band or recording artist each year in recognition of their significant contribution to music, music video, and pop culture. In the past the annual show has paid tribute to Janet Jackson in 2001, followed by honorees Aerosmith in 2002, and Metallica in 2003.\n\nThis year (2004) MTV chose to shine the spotlight onto the 25-year career of The Cure. With over 27 million albums sold worldwide, The Cure aka Robert Smith (vocals, guitar), Simon Gallup (bass), Perry Bamonte (guitar), Jason Cooper (drums &amp; percussion) and Roger O?Donnell (keyboards) were spawned in 1979, and their eponymous debut album ?Three Imaginary Boys? signalled the beginning of an emotionally charged 25-year career. The Cure captured legions of adoring fans by breaking all the rules with their nerve-shredding intensity, and their continuing influence is evident in a whole new generation of acclaimed young bands.\n\nRecorded at London's Old Billingsgate Market on 17th September, MTV Icon The Cure featured performances and testimonials from a whole host of artists and celebrities who have been influenced by the band, their videos and their music. Hosted by Marilyn Manson and including blinding tribute performances by the likes of Blink 182, The Deftones, AFI and Razorlight, as well as an explosive finale from The Cure themselves, it's a show not to be missed.\n\n","torrent":{"xt":"urn:btih:ea19f0d0254d8917760ba78aa05ce67d41298386","amp;dn":"MTV+Icon-The+Cure","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea19f0d0254d8917760ba78aa05ce67d41298386","infoHashBuffer":{"type":"Buffer","data":[234,25,240,208,37,77,137,23,118,11,167,138,160,92,230,125,65,41,131,134]},"announce":[],"urlList":[]}}