{"title":"Radlberger - Der hyperbolische Kegel nach Walter Schauberger (20","uid":3513983,"size":3768959,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ea2db14683e20bd7b12e90dcf5eecd2dca5ff8b4&amp;dn=Radlberger+-+Der+hyperbolische+Kegel+nach+Walter+Schauberger+%2820&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"red_gonzo","files":1,"time":1155985498,"description":"For english-only speaking:\nThis book is in german. English title would be: The hyperbolic cone from Walter Schauberger (2002).  This book explains in a simple manner how certain hyperbolic curves are connected with vortex-like movement which seems to be nature&amp;#039;s prefered choice of moving things around. Walter, the son of the famous austrian natural philosopher Viktor Schauberger, explains what his father meant when he often said about our technology: &quot;You move in a wrong way!&quot;. 110 pages, many pictures.\n\nFur Deutschsprachige:\nDieses Buch, usrprunglich als Diplomarbeit verfasst, erklart auf einfache und nachvollziehbare Weise die Herkunft und den Aufbau des hyperbolischen Kegels nach Walter Schauberger. Zentrales Thema ist die mehrfache Verbindung der naturlichen Wirbelbewegung mit harmonikalen Gesetzmassigkeiten, sowie eine eingehende Untersuchung der unterschiedlichen Eikurven. Neben bisher noch unbeschriebenen mathematischen Zusammenhangen werde u.a. folgende Themen behandelt: Nichteuklidische Geometrie, Kepler und Schauberger, Goldener Schnitt, Lambdoma, Logarithmische und hyperbolische Spirale, Harmonik bei Schauberger, Weiterfuhrende Gedanken zum Kegel. 110 Seiten, viele Abbildungen.\n","torrent":{"xt":"urn:btih:ea2db14683e20bd7b12e90dcf5eecd2dca5ff8b4","amp;dn":"Radlberger+-+Der+hyperbolische+Kegel+nach+Walter+Schauberger+%2820","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea2db14683e20bd7b12e90dcf5eecd2dca5ff8b4","infoHashBuffer":{"type":"Buffer","data":[234,45,177,70,131,226,11,215,177,46,144,220,245,238,205,45,202,95,248,180]},"announce":[],"urlList":[]}}