{"title":"Grimm Fairy Tales Wonderland 1-12 (1440+2048px-HD) (TaruTariat-N","uid":8961390,"size":838247604,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:ea91a2f2ab9ce32b132f84c0367a9ac3fb3691e9&amp;dn=Grimm+Fairy+Tales+Wonderland+1-12+%281440%2B2048px-HD%29+%28TaruTariat-N&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"blackcanary","files":-1,"time":1380125236,"description":"This torrent includes both 1440px and 2048px-HD versions\n*Note: You can download both or only choose which version you'd prefer by deselecting the one you don't want when you add the torrent to your client software.  If you're adding the torrent via magnet link, you can deselect any undesired file in the list of files once the torrent has begun downloading.\n========================================================\n\nEnglish | CBR | 12 Issues\n\nGrimm Fairy Tales presents Wonderland #1-12\nPublisher:  Zenescope\nPublication Date:  July 25, 2012 - June 26, 2013\n\nWriters:  Raven Gregory (#1-10), Patrick Shand (#11-12)\nPencilers:  U Ken Marion (#1), Sheldon Goh (#2, 4-9, 11-12), Jacob Bear (#3), Gerard Conte (#6), EJ Morges (#9), Francesco Di Pastena (#10), and JG Miranda (#12)\nColorists:  Thomas Bonvillain (#1), Felipe Gaona (#2), Ramon Ignacio Bunge (#3), and Ulises Grostieta (#4-9, 11), Francesca Zambon (#10), and Leonardo Paciarotti (#12)\nLetterer:  Jim Campbell\n\nWonderland #1-5\nWonderland returns with full force as Calie Liddle and her daughter, Violet, continue to hide from the very madness that still might be searching for them. But how long can they hide before having to face what they fear most? While Calie fights to protect her only daughter from danger, the Queen of Spades bides her time in Wonderland as she builds an army to finally take control of the realm and destroy the Queen of Hearts. Meanwhile, a new Mad Hatter has been born and he's not what anyone sees coming!\n\nWonderland #6-10\nAfter defeating the malevolent spirit of her long dead brother and escaping the terror of a town possessed by the insanity of the Mad Hatter, Calie and her daughter Violet disappear into the city of Los Angeles hoping to evade Wonderland's ever extending reach. But the duo is fast to learn that no matter where they run, or where they hide...wonderland will find them.\n\nWonderland #11\nCalie and Violet find themselves still on the run from Wonderland giving up any attempts at living a normal existence. They try to stay one step ahead of its reach but even as their life on the road continues, beings from the sinister realm spread their evil influence across the Midwestern land. Elsewhere a middle age traveling salesman obsessed with being the best of the best will find that in the world of Wonderland insanity is on sale and all roads lead to madness. And what dark secret does he hold that will give birth to an all new denizen of Wonderland? Find out here in this not to be missed issue!\n\nWonderland #12\nCalie and Violet continue their journey cross country as they attempt to stay beyond Wonderland's reach. Elsewhere, a homely girl cashier at a local grocery store finds herself using the stories she reads to escape from her dreary existence but will quickly discover that although the grass does seem greener on the other side... The madness that lies in wait may be a price to great to bare. Don't miss out on this stand-alone issue that serves as a great jumping on point for new readers!\n\nThanks goes to Tarutaru, theProletariat, Re-em, Binary, 2Radbits, and ArtNet for this release.\n\nDon't know how to view this comic book?  Use CDisplayEx or another comic book reader application. &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8956400&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8956400&lt;/a&gt;","torrent":{"xt":"urn:btih:ea91a2f2ab9ce32b132f84c0367a9ac3fb3691e9","amp;dn":"Grimm+Fairy+Tales+Wonderland+1-12+%281440%2B2048px-HD%29+%28TaruTariat-N","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea91a2f2ab9ce32b132f84c0367a9ac3fb3691e9","infoHashBuffer":{"type":"Buffer","data":[234,145,162,242,171,156,227,43,19,47,132,192,54,122,154,195,251,54,145,233]},"announce":[],"urlList":[]}}