{"title":"Fortune and Glory - Total Sell Out (Brian Michael Bendis)","uid":4446308,"size":56819721,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:ec3721e184e25f29ada68320476f37d27a115b07&amp;dn=Fortune+and+Glory+-+Total+Sell+Out+%28Brian+Michael+Bendis%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mmdsx","files":-1,"time":1224055395,"description":"Fortune &amp; Glory + Total Sell Out (by Brian Michael Bendis)\n\n\nFortune &amp; Glory is a 3-issue mini-series published bimonthly by Oni Press in late 1999 and early 2000.\nIt was written and illustrated by Brian Michael Bendis and it was autobiographic..\nIt dealt with his experiences at the time he was trying to break into Hollywood as a screenwriter.\n\nTotal Sell Out is a graphic novel that was published by Image in 2003.\nIt was written and illustrated by Bendis as well.\nBut this work was a collection of short stories, some in the manner of Fortune &amp; Glory; some others, fictional crime stories.\n\nThe issues included in this torrent are:\nFortune and Glory #1 of 3 (1999)\nFortune and Glory #2 of 3 (2000)\nFortune and Glory #3 of 3 (2000)\nTotal Sell Out (2003)\n\nQuote:\nFortune &amp; Glory\nFar more hospitable material for Bendis' art can be found in the three issues of 2000's Fortune and Glory (126 pages in TPB). In this autobiographical comic from Oni, he ventures into the outer rings of Hollywood hell to pitch his comics for movie development. The rigors of realism are abandoned for a spare and wholeheartedly cartoony style, one better matched to the caricatures of La La Land's support staff and to the figure Bendis carves of himself.\n\nTotal Sell Out\nDiscernment is in shorter supply in Total Sell Out (154 pages), a dredge net full of material retrieved from unguessable depths. In it, short pieces are divvied into segments highlighting collaborations, autobiography, &quot;Schtick,&quot; portfolios, and puff essays. For the insatiable devotee it represents a sampler of Bendis' trivial preoccupations, shallow opinions, recitations stripped of insight, autobiography played for laughs, pop culture fascinations, limp satirical jabs and visualized disappointments along the order of those detailed above. For the satiable, it has its smiley-face moments.\n\nFrom The Comics Journal","torrent":{"xt":"urn:btih:ec3721e184e25f29ada68320476f37d27a115b07","amp;dn":"Fortune+and+Glory+-+Total+Sell+Out+%28Brian+Michael+Bendis%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec3721e184e25f29ada68320476f37d27a115b07","infoHashBuffer":{"type":"Buffer","data":[236,55,33,225,132,226,95,41,173,166,131,32,71,111,55,210,122,17,91,7]},"announce":[],"urlList":[]}}