{"title":"UFC Apk + Data V1.7.873884","uid":13107324,"size":589744334,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:ed445d8fda6e82306d49a5fe1a7a0f3ced367017&amp;dn=UFC+Apk+%2B+Data+V1.7.873884&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"tiropitaki","files":2,"time":1451343127,"description":"Step into the Octagon® with EA SPORTS™ UFC® for mobile! Collect your favorite UFC fighters, throw down in competitive combat, and earn in-game rewards by playing live events tied to the real world of the UFC.\r\n\r\nFEEL THE FIGHT\r\nEA SPORTS UFC brings the intensity of MMA to your fingertips like never before. HD-quality visuals, intuitive touch controls, and action-packed gameplay create a unique combat experience for novice and veteran fight fans alike.\r\n\r\nTRAIN YOUR ULTIMATE FIGHTER\r\nChoose from over 70 fighters in four divisions and begin your journey to the top. From a Cain Velasquez takedown to Georges St-Pierre’s Superman punch, each athlete boasts a unique set of special moves. Win bouts, unlock new opponents, earn coins, and level up abilities – all while building your UFC legacy. Battle through your career and invest in training to watch your abilities skyrocket.\r\n\r\nPLAY LIVE EVENTS, EARN EXCLUSIVE REWARDS\r\nPlay some of UFC’s biggest real-world bouts through in-game Live Events. Play fight cards for upcoming UFC events and earn exclusive in-game rewards. The more you play, the more rewards you earn! Rise to the top of the leaderboard and watch your payoff grow.\r\n\r\nFIGHT YOUR WAY TO GLORY\r\nClimb the ranks and hone your striking, wrestling, and submission skills along the way. With no lives or limits to how much you can play, there’s always another fight just around the corner. See how you stack up against your division’s best and earn in-game rewards for dominating UFC icons in grueling Main Event matchups. Your battle for UFC glory starts now.\r\n\r\nEnter the Octagon and feel the fight!\r\n\r\nWhat's new in this version:\r\nAre you up for the challenge? Go head-to-head against your biggest rivals and climb the EA SPORTS™ UFC® ranks in our latest update, including:\r\nAll-new Head-to-Head Mode with Seasons\r\nAmazing rewards for winning fights and climbing the ranks\r\nIntense 5-fighter back-and-forth matches that allow you to challenge rivals\r\n30 day resets in Seasons\r\nThanks for playing EA SPORTS™ UFC®! Let us know what you think by rating the game after you try out the latest update.\r\n\r\nInstall APK,Place data folder in SDCard/Android/Obb/ and play.\r\nRequires Android:  2.3.3+","torrent":{"xt":"urn:btih:ed445d8fda6e82306d49a5fe1a7a0f3ced367017","amp;dn":"UFC+Apk+%2B+Data+V1.7.873884","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed445d8fda6e82306d49a5fe1a7a0f3ced367017","infoHashBuffer":{"type":"Buffer","data":[237,68,93,143,218,110,130,48,109,73,165,254,26,122,15,60,237,54,112,23]},"announce":[],"urlList":[]}}