{"title":"The Stooges - Studio Discography 1969-2007 [FLAC]","uid":8376967,"size":1363902588,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ede91ad942cde61028de4ec230ddf150b94f063b&amp;dn=The+Stooges+-+Studio+Discography+1969-2007+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rudown78","files":95,"time":1366077115,"description":"The Stooges - Studio Discography 1969-2007 [FLAC]\n\n\n\nDuring the psychedelic haze of the late '60s, the grimy, noisy and relentlessly bleak rock &amp; roll of the Stooges was conspicuously out of time. Like the Velvet Underground, the Stooges revealed the underside of sex, drugs, and rock &amp; roll, showing all of the grime beneath the myth. The Stooges, however, weren't nearly as cerebral as the Velvets. Taking their cue from the over-amplified pounding of British blues, the primal raunch of American garage rock, and the psychedelic rock (as well as the audience-baiting) of the Doors, the Stooges were raw, immediate, and vulgar. Iggy Pop became notorious for performing smeared in blood or peanut butter and diving into the audience. Ron and Scott Asheton formed a ridiculously primitive rhythm section, pounding out chords with no finesse -- in essence, the Stooges were the first rock &amp; roll band completely stripped of the swinging beat that epitomized R&amp;B and early rock &amp; roll. During the late '60s and early '70s, the group was an underground sensation, yet the band was too weird, too dangerous to break into the mainstream. Following three albums, the Stooges disbanded, but the group's legacy grew over the next two decades, as legions of underground bands used their sludgy grind as a foundation for a variety of indie rock styles, and as Iggy Pop became a pop culture icon. \n\n\n1. The Stooges (1969)\n2. Fun House (1970)\n3. Raw Power (1973)\n4. The Weirdness (2007)\n\n\nAll files have been verifired by audiochecker and each album contains full artwork. Enjoy!!!","torrent":{"xt":"urn:btih:ede91ad942cde61028de4ec230ddf150b94f063b","amp;dn":"The+Stooges+-+Studio+Discography+1969-2007+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ede91ad942cde61028de4ec230ddf150b94f063b","infoHashBuffer":{"type":"Buffer","data":[237,233,26,217,66,205,230,16,40,222,78,194,48,221,241,80,185,79,6,59]},"announce":[],"urlList":[]}}