{"title":"Social Perception and Social Reality (2012) by Lee J. Jussim","uid":10126972,"size":2490085,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ee278ff1ad945b4131a020be6b53807f8ea772ed&amp;dn=Social+Perception+and+Social+Reality+%282012%29+by+Lee+J.+Jussim&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":-1,"time":1399778224,"description":"Social Perception and Social Reality - Why Accuracy Dominates Bias and Self-Fulfilling Prophecy (2012) by Lee J. Jussim.pdf\n\nSocial Perception and Social Reality contests the received wisdom in the field of social psychology that suggests that social perception and judgment are generally flawed, biased, and powerfully self-fulfilling. Jussim reviews a wealth of real world, survey, and experimental data collected over the last century to show that in fact, social psychological research consistently demonstrates that biases and self-fulfilling prophecies are generally weak, fragile, and fleeting. Furthermore, research in the social sciences has shown stereotypes to be accurate.\n\nJussim overturns the received wisdom concerning social perception in several ways. He critically reviews studies that are highly cited darlings of the bias conclusion and shows how these studies demonstrate far more accuracy than bias, or are not replicable in subsequent research. Studies of equal or higher quality, which have been replicated consistently, are shown to demonstrate high accuracy, low bias, or both. The book is peppered with discussions suggesting that theoretical and political blinders have led to an odd state of affairs in which the flawed or misinterpreted bias studies receive a great deal of attention, while stronger and more replicable accuracy studies receive relatively little attention. In addition, the author presents both personal and real world examples (such as stock market prices, sporting events, and political elections) that routinely undermine heavy-handed emphases on error and bias, but are generally indicative of high levels of rationality and accuracy. He fully embraces scientific data, even when that data yields unpopular conclusions or contests prevailing conventions or the received wisdom in psychology, in other social sciences, and in broader society.\n\n486 pages\nPublisher: Oxford University Press; 1 edition (April 6, 2012)\nLanguage: English\nISBN-10: 0195366603\nISBN-13: 978-0195366600","torrent":{"xt":"urn:btih:ee278ff1ad945b4131a020be6b53807f8ea772ed","amp;dn":"Social+Perception+and+Social+Reality+%282012%29+by+Lee+J.+Jussim","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee278ff1ad945b4131a020be6b53807f8ea772ed","infoHashBuffer":{"type":"Buffer","data":[238,39,143,241,173,148,91,65,49,160,32,190,107,83,128,127,142,167,114,237]},"announce":[],"urlList":[]}}