{"title":"Geology of the Sierra Nevada","uid":8923262,"size":11974533,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eeb08e6b9d19985bec2bd7475d9a6512f6e1a7a1&amp;dn=Geology+of+the+Sierra+Nevada&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"livhre","files":-1,"time":1379306118,"description":"Writing with verve and clarity, Mary Hill tells the story of the magnificent Sierra Nevada-the longest, highest, and most spectacular mountain range in the contiguous United States. Hill takes us from the time before the land which would be California even existed, through the days of roaring volcanoes, violent earthquakes, and chilling ice sheets, to the more recent history of the Sierra's early explorers and the generations of adventuresome souls who followed. The author introduces the rocks of the Sierra Nevada, which tell the mountains' tale, and explains how nature's forces, such as volcanic eruptions, earthquakes, faulting, erosion, and glaciation formed the range's world-renowned scenery and mineral wealth, including gold. For thirty years, the first edition of Geology of the Sierra Nevada has been the definitive guide to the Sierra Nevada's geological history for nature lovers, travelers, hikers, campers, and armchair explorers. This new edition offers new chapters and sidebars and incorporates the concept of plate tectonics throughout the text. * Written in easy-to-understand language for a wide audience. * Gives detailed information on where to view outstanding Sierra Nevada geology in some of the world's most beloved natural treasures and national parks, including Yosemite. * Provides specific information on places to see glaciers and glacial deposits, caves, and exhibits of gold mines and mining equipment, many from Gold Rush times","torrent":{"xt":"urn:btih:eeb08e6b9d19985bec2bd7475d9a6512f6e1a7a1","amp;dn":"Geology+of+the+Sierra+Nevada","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eeb08e6b9d19985bec2bd7475d9a6512f6e1a7a1","infoHashBuffer":{"type":"Buffer","data":[238,176,142,107,157,25,152,91,236,43,215,71,93,154,101,18,246,225,167,161]},"announce":[],"urlList":[]}}