{"title":"OpenOffice 3.3.0 Windows x86 en-US Application windows/software","uid":6160499,"size":143432120,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:eeb444aa863286dcc87efcabb1f6df83d5b98144&amp;dn=OpenOffice+3.3.0+Windows+x86+en-US+Application+windows%2Fsoftware&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"dharan007","files":1,"time":1297196940,"description":"OpenOffice.org 3\n\n\nOpenOffice.org 3 is the leading open-source office software suite for word processing, spreadsheets, presentations, graphics, databases and more. It is available in many languages and works on all common computers. It stores all your data in an international open standard format and can also read and write files from other common office software packages. It can be downloaded and used completely free of charge for any purpose. \n\n\nOpenOffice.org 3.3 New Features\n\nProductivity Enhancements\nNew Custom Properties Handling\nEmbedding of Standard PDF Fonts\nNew Narrow Font Family\nIncreased Document Protection in Writer and Calc\nAutomatic Decimals Digits for &quot;General&quot; format in Calc\n1 Million Rows in a Spreadsheet\nNew Options for CSV (Comma Separated Value) Import in Calc\nInsert_Drawing_Objects_in_Charts\nHierarchical_Axis_Labels_for_Charts\nImproved Slide Layout Handling in Impress\nManual Setting for Primary Key Support for Databases\nSupport of Read-Only Database Registrations\nNew Math Command 'nospace'\nInternationalization\nAdditional Locale Data\nUsability and Interface\nCommon Search Toolbar\nNew Easier to Use Print Interface\nMore Options for Changing Case\nRedesign of Thesaurus\nResetting Text to the Default Language in Writer\nText Rendering of Form Controls in Writer\nChanged Defaults for Charts\nColored Sheet Tabs in Calc\nAdapt to Marked Selection for Filter Area in Calc\nSort Dialog for DataPilot in Calc\nDisplay Custom Names for DataPilot Fields, Items and Totals in Calc\nDeveloper Features and Extensibility\nGrid Control Enhancements\nNew MetaData Node for Database\nExtending Database Drivers Using Extensions\nSources for this document:\nFull technical release notes\nQA list of new features\nOpenOffice.org Engineering Blog GullFOSS\n\nProductivity Enhancements\nNew Custom Properties Handling\n OpenOffice.org allows users to define any number of custom document properties as name/value pairs in the File &gt; Properties dialog. With version 3.3 it is possible to also define DateTime values and values that contain a duration.\n\n\n\n\n\nEmbedding of Standard PDF Fonts\nIn previous versions, the standard PDF standard fonts (Times, Helvetica, Courier, Symbol and ZapfDingbats) were only embedded into the resulting PDF when the resulting file was of the PDF/A type, since the PDF/A standards requires this. In version 3.3, you can optionally embed these fonts in all PDF documents created by OpenOffice.org to enhance display accuracy in PDF viewers.\nNew Narrow Font Family\nOracle contributed a narrow font family to the free and open source Liberation font families. Being metrically compatible to the Arial Narrow font, widely used on Microsoft Windows systems, this font family now completes the Liberation family and delivers a compatible and free set of fonts available on all platforms.\nIncreased Document Protection in Writer and Calc\n OpenOffice.org Writer and Calc now allow two levels of document protection. As before, you can save a document with a password that prevents unauthorized users to read the content. Now you can also set a password to protect a document against unwanted changes.\nThis way, you can make the content of a document available for reading to a selected group of people, and for reading and editing to a different group. This behaviour is now compatible with Microsoft Word and Excel file protection.\n\n\n\n\n\n\n\n\nAutomatic Decimals Digits for &quot;General&quot; format in Calc\nIn OpenOffice.org Calc, numbers formatted with the &quot;General&quot; number format will display as many decimal digits as required. In former versions, a maximum of 2 decimal digits were displayed with the &quot;General&quot; number format.\n1 Million Rows in a Spreadsheet\nOpenOffice.org Calc spreadsheets now support 1,048,576 (1 Million) rows instead of 65,536 rows.\nNew Options for CSV (Comma Separated Value) Import in Calc\n Two new options are available when importing CSV files that contain data separated by specific characters.\nThese options determine whether quoted data will always be imported as text, and whether OpenOffice.org Calc will automatically detect all number formats, including special number formats such as dates, time, and scientific notation. The detection depends on the language settings.\nInsert Drawing Objects in Charts\n The Chart functionality is enhanced and now supports drawing objects. The drawing toolbar allows to insert simple shapes such as lines, rectangles and text objects and even complex shapes such as cubes, symbols, block arrows, flowcharts and stars. The drawing objects can be edited by several dialogs which can be opened via the context menu. Also the font and formatting of text objects can be changed.\nFor further details of this new feature please see the GullFOSS blog article.\nHierarchical Axis Labels for Charts\n If the categories in charts that get their data from spreadsheet span multiple rows and multiple columns, the direction of the first data series is detected. If the data for the first series comes from rows, the categories are split into multiple rows. Otherwise the categories are split into multiple columns. The split categories are then applied as different hierarchical labels at the x-axis.\n\n\n For charts with own data (typically used in Impress or Writer), there is a new icon to add text columns, which then will be used for the different levels in the x-axis labels.\nFor further details of this new feature please see the GullFOSS blog article.\n\n\n\nImproved Slide Layout Handling in Impress\n Handling of slide layouts in presentations is vastly improved. The content type of slide sections is now defined directly on the slide by clicking on one of the four content type icons: table, chart, picture, or movie, or entering text directly.\n\n\n\n\n This reduces the number of slide layout varieties making the layout selection much clearer. In addition, you can now also assign layouts to slides and create new slides with a specific layout using the toolbar. One new toolbar element is used to add a new slide (or duplicate the currently selected slide).\nA similar toolbar element is used to assign a layout to the currently selected slide, or reset the layout to the assigned layout after making changes.\n\n\n\nManual Setting for Primary Key Support for Databases\nWhen connecting to a database via an ODBC, JDBC, or ADO driver, Base used to apply a heuristic method to determine whether the database supports primary keys. In some cases, this heuristic method failed. Therefore, version 3.3 introduces an explicit option to declare primary key support. When this setting is enabled, Base will always assume that the database supports primary keys, regardless of the result of the heuristic analysis.\nSupport of Read-Only Database Registrations\nIn OpenOffice.org, database registrations are stored in the application configuration files. Therefore, it is possible to deploy additional configuration fragments containing additional registrations. If those configuration fragments are declared as read-only (by using the usual configuration mechanisms for this), OpenOffice.org now blocks modifications (editions, removal) of the corresponding registration entry.\nNew Math Command 'nospace'\nIt will now be possible to explicitly remove the small horizontal space that always gets applied between two elements. The syntax is nospace { el1 el2 ... }\nUsability and Interface\nCommon Search Toolbar\n Usage data indicated that a large portion of OpenOffice.org users want to quickly search inside a document's text. This is now possible using the new &quot;Find&quot; toolbar containing a search field, and a next and previous button.\nNew Easier to Use Print Interface\n The print dialog has been completely revamped in OpenOffice.org 3.3 to allow for a more efficient and usable printing experience.\nAn integrated preview is available to show the appearance of the document to be printed, and all relevant settings can be made from within this one dialog, including number of pages, collation settings, document objects to print or hide, page order, print multiple pages, and much more.\nFor further details of this new feature please see the GullFOSS blog article.\nMore Options for Changing Case\nWith version 3.3, you have more options for changing the case of a selected text portion. Apart from toggling uppercase and lowercase, you can now set the case to sentence case (first letter capitalized), capitalize every word, or invert the current case.\nRedesign of Thesaurus\n The thesaurus dialog has been redesigned for better usability. In addition, a new &quot;Synonyms&quot; sub menu in the default context menu allows you to select a synonym for the currently selected word right away.\n\n\n\n\n\n\n\nResetting Text to the Default Language in Writer\n You can now reset the language of text back to the default language using the language status bar or the Tools &gt; Language menu.\n\n\n\nText Rendering of Form Controls in Writer\nForm controls in text documents now render their text the same way the document itself does, thus making the appearance of controls as part of a text flow much more seamless and consistent.\nChanged Defaults for Charts\nSeveral defaults have changed for OpenOffice.org charts: larger size, larger font size, no black borders, better 3D look and more.\nColored Sheet Tabs in Calc\n Each sheet in an OpenOffice.org Calc document can now be assigned a color for its tab in the Sheet tabs area at the bottom left of the window.\nAdapt to Marked Selection for Filter Area in Calc\n In OpenOffice.org Calc, a selection is now shrunk to the actually used data columns when enabling a filter (AutoFilter, StandardFilter, AdvancedFilter).\nUsers can select an entire row by clicking on a row header and expect a filter to operate on the data below the selected row. If one single row is selected the selection is shrunk to the actually used data columns and then expanded over all contiguous data rows below. Selecting only a portion of a row behaves similar by expanding the selected columns over the data rows. An area selected, e.g. more than one entire row, is shrunk to the actual used data columns.\n\n\nSort Dialog for DataPilot in Calc\n The DataPilot (sometimes known as Pivot Table) now supports a convenient way of sorting and filtering entries using a special popup window.\nFor further details of this new feature please see the GullFOSS blog article.\n\n\n\n\n\n\n\n\n\n\n\n\nDisplay Custom Names for DataPilot Fields, Items and Totals in Calc\nDataPilot fields, items and totals can now be assigned custom display names by typing into the corresponding cell in the DataPilot table.\nInternationalization\nAdditional Locale Data\nArabic (Algeria) [ar-DZ], Bafia (Cameroon) [ksf-CM], Bushi (Mayotte) [buc-YT], Campidanese (Sardinia) [sro-IT], Gallurese (Sardinia) [sdn-IT], Gikuyu (Kenya) [ki-KE], Latgalian (Latvia) [ltg-LV], Logudorese (Sardinia) [src-IT], Maithili (India) [mai-IN], Malagasy Plateau (Madagascar) [plt-MG], Maore (Mayotte) [swb-YT], Papiamentu (Netherlands Antilles) [pap-AN], Rusyn (Slovakia) [rue-SK], Rusyn (Ukraine) [rue-UA], Sassarese (Sardinia)[sdc-IT], Sorbian, Tahitian (French Polynesia) [ty-PF], Upper Sorbian (Germany) [hsb-DE], Yoruba (Nigeria) [yo-NG]\nDeveloper Features and Extensibility\nGrid Control Enhancements\nThe grid control now accepts additional data types like numbers or images. The XGridDatamodel method\naddRow(string headerName, sequence&lt;string&gt; data)\nhas changed to\naddRow(string headerName, sequence&lt;any&gt; data)\nYou can now control the appearance of a grid control using additional parameters for horizontal and vertical alignment, row background colors, line colors, and text colors For more information and examples, see the OpenOffice.org Wiki pages.\nNew MetaData Node for Database\nYou can now define a new property in a database driver's xcu file. This is enabled by default for MySQL (JDBC) and ADO (including Microsoft Access) drivers. The property is defined in the MetaData section.\n  &lt;node oor:name=&quot;SupportsColumnDescription&quot; oor:op=&quot;replace&quot;&gt;\n      &lt;prop oor:name=&quot;Value&quot; oor:type=&quot;xs:boolean&quot;&gt;\n          &lt;value&gt;true&lt;/value&gt;\n      &lt;/prop&gt;\n  &lt;/node&gt;\n  \nWhen this property is enabled, the table designer will display the column description beside the normal description which is used as help text.\nExtending Database Drivers Using Extensions\nSome database drivers do not support special features like altering view definitions or adding/dropping table keys. Starting with OpenOffice.org 3.3, the \ncorresponding interfaces can be implemented by an extension:\n\n\n  com.sun.star.sdb.tools.XViewAccess\n\n  com.sun.star.sdb.tools.XTableRename\n\n  com.sun.star.sdb.tools.XTableAlteration\n\n  com.sun.star.sdb.tools.XKeyAlteration\n\n  com.sun.star.sdb.tools.XIndexAlteration\n\n\n &lt;a href=&quot; http://www.openoffice.org/dev_docs/features/3.3/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.openoffice.org/dev_docs/features/3.3/index.html&lt;/a&gt;","torrent":{"xt":"urn:btih:eeb444aa863286dcc87efcabb1f6df83d5b98144","amp;dn":"OpenOffice+3.3.0+Windows+x86+en-US+Application+windows%2Fsoftware","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eeb444aa863286dcc87efcabb1f6df83d5b98144","infoHashBuffer":{"type":"Buffer","data":[238,180,68,170,134,50,134,220,200,126,252,171,177,246,223,131,213,185,129,68]},"announce":[],"urlList":[]}}