{"title":"Linotype Gold Edition 1.7 - Gigantic collection of professional","uid":3620733,"size":131394055,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:ef5219bbe7fed7058d7af5e7e151bf02a651f9d1&amp;dn=Linotype+Gold+Edition+1.7+-+Gigantic+collection+of+professional&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"danelectro","files":1,"time":1171739150,"description":"Linotype Gold Edition 1.7\n\n3,900 typefaces from this highly desirable collection with Mac OS X compatibility. The Gold Edition update provides font users with the most comprehensive collection of top quality Linotype in state-of-the-art technological formats.\n\nAll fonts are available in the Postscript format. Linotype has meticulously reproduced these top quality fonts in Postscript to meet the high demands of the graphic industry, especially for imagesetting and use with high-grade laser printers. The newly produced Postscript fonts also include central European and Greek fonts.\n\nProfessional users will appreciate many other details in their daily work. For instance, Linotype Gold Edition 1.7 features a dedicated euro symbol for over 1,900 typefaces, including customized designs for all respective weights. And for the fonts without a unique euro symbol, generic versions are available in four weights: normal and bold, with or without serifs.\n\nMore information about this premiere Linotype compilation and the highlights of the update can be accessed online via www.linotype.com.\n\nLinotype GmbH, based in Bad Homburg, Germany and a member of the Heidelberg Group, looks back onto a history of 119 years. Building on its strong heritage, Linotype develops state-of-the-art font technology and offers more than 6,000 original fonts, covering the whole typographic spectrum from antique to modern, from east to west, and from classical to experimental.","torrent":{"xt":"urn:btih:ef5219bbe7fed7058d7af5e7e151bf02a651f9d1","amp;dn":"Linotype+Gold+Edition+1.7+-+Gigantic+collection+of+professional","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef5219bbe7fed7058d7af5e7e151bf02a651f9d1","infoHashBuffer":{"type":"Buffer","data":[239,82,25,187,231,254,215,5,141,122,245,231,225,81,191,2,166,81,249,209]},"announce":[],"urlList":[]}}