{"title":"[Yves Chapleur ,Philippe Delannoy , Slawomir Jarosz]Carbohydrate","uid":11245695,"size":23349502,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ef7859e74e0954983d2aeeda09d62374a00a448f&amp;dn=%5BYves+Chapleur+%2CPhilippe+Delannoy+%2C+Slawomir+Jarosz%5DCarbohydrate&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zombie_rox","files":1,"time":1413736303,"description":"Volume 40 of Carbohydrate Chemistry: Chemical and Biological Approaches demonstrates the importance of the glycosciences for innovation and societal progress. Carbohydrates are molecules with essential roles in biology and also serve as renewable resources for the generation of new chemicals and materials. Honouring Professor Andre Lubineau's memory, this volume resembles a special collection of contributions in the fields of green and low-carbon chemistry, innovative synthetic methodology and design of carbohydrate architectures for medicinal and biological chemistry. Green methodology is illustrated by accounts on the industrial development of water-promoted reactions (C-glycosylation, cycloadditions) and the design of green processes and synthons towards sugar-based surfactants and materials. The especially challenging transformations at the anomeric center are presented in several contributions on glycosylation methodologies using iron or gold catalysis, electrochemical or enzymatic (thio)glycosylation, exo-glycal chemistry and bioengineering of carbohydrate synthases. Then, synthesis and structure of multivalent and supramolecular oligosaccharide architectures are discussed and related to their physical properties and application potential, e.g. for deepening our understanding of biological processes, such as enzymatic pathways or bacterial adhesion, and design of antibacterial, antifungal and innovative anticancer vaccines or drugs.\n\nProduct Description\nAbout the Author\nDr Yves Queneau, Research Director at CNRS, is Head of the Organic and Bioorganic Chemistry Laboratory at INSA Lyon, Deputy-Director of the &quot;Institut de Chimie et Biochimie Moleculaires et Supramoleculaires&quot; (ICBMS), University of Lyon, France and Honorary Professor at the University of Hull, UK. After his doctorate on aqueous Diels-Alder reactions involving glycodienes under the supervision of Professor Andre Lubineau (Orsay, 1988) he was appointed as CNRS fellow and worked on cycloaddition reactions towards complex sugars. He then spent one year in 1992 in Professor Samuel J. Danishefsky's group in Memorial Sloan Kettering Cancer Center in New York, USA. He later moved to Lyon in a mixed CNRS-industrial research facility dedicated to sucrose chemistry (1995-2003) before joining its present position where he develops his research in organic and biological chemistry with a particular interest for the use of carbohydrates as renewable raw materials. \n\nPublisher: Royal Society of Chemistry (25 March 2014)\nLanguage: English\nISBN-10: 184973965X\nISBN-13: 978-1849739658","torrent":{"xt":"urn:btih:ef7859e74e0954983d2aeeda09d62374a00a448f","amp;dn":"%5BYves+Chapleur+%2CPhilippe+Delannoy+%2C+Slawomir+Jarosz%5DCarbohydrate","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef7859e74e0954983d2aeeda09d62374a00a448f","infoHashBuffer":{"type":"Buffer","data":[239,120,89,231,78,9,84,152,61,42,238,218,9,214,35,116,160,10,68,143]},"announce":[],"urlList":[]}}