{"title":"STAR TREK LEGACY: THE ULTIMATE UNIVERSE MOD","uid":3885932,"size":679601258,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ef963e769653eb068302fd485387e596e50f945d&amp;dn=STAR+TREK+LEGACY%3A+THE+ULTIMATE+UNIVERSE+MOD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MindwipeCJG","files":3,"time":1194873153,"description":"This Is a total conversion mod for the game startrek legacy developed by a non profit fan based team and is free to distribute\n\n\nThis has been, and will continue to be, a wild ride.\n \nOn to the nitty gritty. You can select which directory to install the mod into, although It has been set to the default Legacy directory. This installer puts all the files in the proper places inside your Legacy Game. It is recommended that you have a brand new install of Legacy for this mod. That install should include Official Patches 1.1 and 1.2 for Multiplayer. If you wish to see the correct chunking of nacelles and such things when they are blown off your ship, you can only do this in single player in an unpatched game. Note that this mod DOES work well in an unpatched version of Legacy.\n\nNote the Many new game modes in the Ultimate Universe, many originally authored by TJoz. Battlefest Mode by MaxLoef, and Exploration Mode by Chris Jones.\n\n   The Ultimate Universe is fully Multiplayer compatible. We have found that using a program called Hamachi &lt;http://www.hamachi.cc/&gt; helps when connecting for Multiplayer - use the LAN setting. \n\nA utility is included to allow for the six races in the Ultimate Universe to be selectable in Multiplayer. All players that join the game will need to have the same 4 races selected so they don&amp;#039;t get the &quot;different version&quot; error when trying to join. \n\nIt doesn&amp;#039;t matter what order you pick the races in as long as you choose the same 4 races as everyone else.  It sorts them and once they are changed it updates the boxes to the races that are currently selected although possibly shown in different boxes than you selected.  There is no need to use the Default button between race changes just choose your new selections.\n\nThis same utility allows for switching the default race in the mode maps - default is Federation. You can also disable the on screen displays for movie making or scenic screenshots. Muldrf authored this utility.\n\nUpgrade system, here! Upgrade/Refit your ships in the ship select area. Max Loef and Phoenix, with credits to Tjoz for the initial upgrade system and upgrade system odf template..\n\nNew Interface from Mindwipe..\n\nSome ships, as you&amp;#039;ll see, are still stock. Our Goal is to replace all the stock ships with newer better looking ones. \n\nThere are 6 playable races in Single Player and Multiplayer Modes. Cardassian and Vulcan are selectable in addition to the original four (see above for multiplayer notes). The menus are different and less laggy, as you might notice, good for low end PC&amp;#039;s.\n\n More features of this mod..\n\n1.   Originally the game had a max player limit of 4 player we have extended that 6 and 8 player maps, through Trickester&amp;#039;s original Community Mod.\n2.   Larger, more dramatic Explosions (by Miri&amp;#039;s Hot/Max Loef/Mindwipe) - New Explosion Audio as well.\n3.   We have approximately 70+ new maps added.\n4.   Historical Missions added - Wrath of Khan (scripted to end properly), The Die Is Cast, Enterprise Incident, First Contact, Paradise Lost, etc...\n5.   Special Modes with approximately 130+ ships in battles - Single Player - also some Original missions, One On One, System Conquest, Survival, and Armada mode. There are lite versions of many of these. \n6.   AI Ships More aggressive. Smaller ships, when in numbers, may fly in formation.\n7.   Lots of new ships ranging from ENT, TOS, TMP, and TNG era&amp;#039;s with a few future ships.\n8.   New Repair interface / Faster repair rates\n9.   Enemy Ships repair themselves in game..\n10.  Overhaul of stock interface, now a friendlier interface.\n11. Some elements of the &amp;#039;Tactical Enhancement Mod&amp;#039; included\n12. You can tractor any ship.. note that their engines are disabled when you do that - permantly - still - the tractor beams may have some use down the line..\n\nSee the included readme folder for more features..\n\nKnown Bugs:\n\n1. The special mode missions in Single Player do not end properly, yet. You need to escape out of the game manually. Note that the scripting tools released by Bethesda in August 2007 will help to solve this problem. We think you&amp;#039;ll find it only a minor inconvenience at this time. \n2. The Occasional Dancing Torpedo - on very few ships.\n\nTeam Members\n\n Director of Ultimate Universe \n-Chris Jones - USA \n\nAdvisors/Contributors\n-Victor1st - &lt;http://www.startrek-gamers.com/&gt;  - Scotland \n-Writeall - USA\n\nAssistant Director\n-Mindwipe - England \n\nPR Dept\n-Mindwipe - England\n-Phoenix  - England\n\nDirector Of Cinematography\n-Mindwipe - England\n\nCinematographer\n-Laserdisc   - USA\n\nWebsite/Webmasters\n-Chris Jones - USA\n-Remore      - USA \n\nMappers\n-JC2006 - England \n-Ebak - England \n-Max Loef - The Netherlands\n-Phoenix - England\n-Chris Jones - USA\n\nSpecial Game Modes / Maps \n-Tjoz - Australia \n\nModelers / Model Porters (from 1 game to another) \n-Design Exporter - Moonraker - USA \n-Maxloef - The Netherlands \n-Grunt - USA \n-Achilles / Raw Models/New Models - England \n-Phoenix - UK\n-Remore - USA \n-Enigma - USA \n-Modelplease - Outalanceshipyard - USA\n\nAI\n-Remore  - USA\n\nProgrammers/Scripters\n-Remore  - USA\n-Max Loef  - The Netherlands\n\nTextures\n-Phoenix - England\n-Aircav - USA \n-MeteoraFallen - USA \n\nProgrammers/Interface\n-Exporter - Moonraker - USA \n-Coder I - Genty - England\n-Interface - Tjoz - Australia \n\nRace Switching/Hud Removal/Multiplayer race swtiching Ultility\n\nGFX Artist / Explosion packs \n-Background images/some maps - SirShaw - USA \n-Explosions - Miri&amp;#039;s Hot - USA \n\nGraphics\n-Meteorafallen - USA \n-SirShaw - USA\n-Nataku - Scotland \n\nODF Files\n-Chris Jones - USA \n-Capt Ryugi Kazamaru - USA \n-JC2006 - England \n-Gamemaster - USA \n-Phoenix - England\n-Remore  - USA\n\nXML Scripters \n-Tjoz - Australia \n-Gamemaster - USA \n\nAudio/Video Tech\n-Audio/Video - Mindwipe - England\n-Audio - Chris Jones - USA \n\nStress Testing / Beta Testers \n-Gamemaster   - USA\n-Captain Ryugi Kazamaru - USA\n-Laserdisc               -USA\n-Miri&amp;#039;s Hot              -USA\n\nOfficial Beta Testers\n-Laserdisc - USA \n\nMoral Support\n-Sunshine - USA\n-Vixen Bondi - England\n-The Nagging Bitch - England\n-Briana      - USA\n-Duck - USA (Some beta testing)\n\nSome UUM Features.\n\n1. All new TOS from Moonraker - including a new Dreadnought - TOS Proxima eliminated. Use of the New TOS by anybody - requires the direct permission of Chris Jones AND Writeall. \n2. New Breen, Cardassian (including Stations), Dominion, and a new Fed Achilles Class from Phoenix Fett.. all with HI RES Textures from Sovereign001. \n3. New Photons - visuals and audio - for TOS, TMP,  Early TNG, DS9, Voyager, and First Contact - thanks to Max Loef\n4. Big Big bases...(some - not all)\n5. Vulcans&amp;#039; R Us (tjoz balancing act) - new Vulcans in the works.\n6. Klingons and Romulans are lots of fun - Many new Variants/Ships\n7. The Original Single player campaign is fun, and beatable..\n8. Many mode maps, and a liquid nebula skirmish map or two..\n9. New Fed Ship - Rigel Class Heavy Cruiser.. Created/Kitbashed by Max Loef\n10. Armada Mode map with all small ships involving the Jem&amp;#039;Hadar - from Tjoz.\n11. Target Practice maps added to all Eras of 1 on 1, by JC2006\n12. Some 1 on 1 maps allow for 2 or more ships, if the ship you are fighting against is going to slaughter you in 1 ship.. \n13. Paradise Lost - Historical Deep Space Nine Battle, is here. Play as the Defiant or the Lakota - Specially Balanced by Chris Jones for maximum fun factor..\n14. Lots of New Enterprise Era ships implemented by Max Loef!!!\n15. Cungi&amp;#039;s Excelsior Escort Class included - with permission.\n16. Cardassian Phaser and Torpedo audio is unique!\n17. ALL NEW EXCELSIOR MODELS - from scratch - By MOONRAKER!!\n\nGAMEMASTER SPECIFICS:\n\nRebalance of Klingons and Romulans\nPulse Phaser speeds have been increased for Feds, Klingons, and Romulans.\nTorpedos have been sped up for more realism. \nHeavy Cruiser Odf has been properly linked to the Prometheus.\nRepair file has been linked to the Lakota file.\nChanged repair file include for the TNG Oberth.\nCloaking has been extended\nCloaking has been individualized for the scouts.\nLong range Sensors have been increased on time.\nUSS White Fox has been added as an Intrepid variant circa 2383\nAcceleration has been improved.\nTurn rates have been increased.\nVoid map - in conjunction with JC2006.\nStress testing of Multiplayer and Skirmish modes.\nRebalance of Single Player Campaign\nModifications/Adjustments to many campaign maps\nIndividualized Hero Physics - Hero Pack\nTotal game physics\n\nThe Ultimate Universe Borg Pack - Brand New Borg Cube\n\nWith this new Cube you will enjoy the maps\n\n1. Wolf359\n2. First Contact (specially balanced - Defiant version included)\n3. Unimatrix One and Two\n4. One on One Vs. the Cube (This is Tough)\n5. The Borg Attack (Get Armoured Voyager)\n6. Special Mode Borg Maps - Survival, Armada\n\nA slew of new maps will be included. The Cube will take on..\n\n1. Klingons. Recall in &amp;#039;Best of Both Worlds&amp;#039; that Admiral Hansen said the Klingons were sending ships. They did.\n2. Romulans. The Praetor would not be proud of this, lol..\n3. Vulcans - This one&amp;#039;s fun - Vulcans in formation.\n4. The Dominion - you may know that the Dominion share a border with the Borg. It is conceivable that they have clashed.\n5. Cardassians.\n6. Temporal Cold War - 2 maps - If Archer had not been able to stop the freighter in &amp;#039;Regeneration&amp;#039;  - A cube makes its way to Sector 001 in the Ent Timeline... and progresses ahead to TOS era.\n\nThe Breen take on the Borg in a Survival Map or 2 .. Looks much cooler with this new Cube.\n\nWhat if in the Enterprise episode &amp;#039;Regeneration&amp;#039;, Archer had not been able to stop that &amp;#039;Alien&amp;#039; freighter? You could theorize that the &amp;#039;Temporal Cold War&amp;#039; got involved here and the Borg managed to get a Cube to Earth in the Ent timeline. Some of the Starfleet ships, the ones who did not engage the Borg, survived and evolved into TOS era - where another Cube battle took place...\n\nAny and all use of this model and texture must be approved by the creators.  Use without formal approval from all party&amp;#039;s involved in its creation, it will be deemed as a fraudulent claim of rights to having built the model and or created the texture.  In such cases you will be asked to immediately cease using the model and or texture.  \n \nPermissions for use if this new cube must be sought from the following:\n \nChris Jones\nMoonraker\nWriteall \n\nTHE ULTIMATE DOMINION\n\nNew Wrath of Khan Mission in the Historical Missions section of Non-Campaign.. Complete with proper music. The mission will end properly depending the outcome.\n\nALL NEW EXPLOSIONS from Miri&amp;#039;s Hot - the best yet\n(Borg Cube blows out chunks when it loses key systems)\n\nAlso from Miri..\nUI Folder ( Controls .XML)  A little tweak I found, gets ship closer to middle of screen.\nConfig.cfg file (I set the cfg_CameraFOV to .785) gets great detail this way.\n\nNew Weapon effects and Animations from Max Loef\nNew Starbase - all eras - Moonraker model ported by Grunt.\n\nEXPLORATION MODE with lotsa maps!! BIG ONES!!!\n\nNew TMP ships from Moonraker\n\n1. Jenghiz Class (single nacelle)\n2. Akula Class\n3. Abbe Class Torpedo Cruiser\n4. Constitution Refit (including Khan version)\n5. Soyuz Class (TMP and TNG Eras)\n6. Miranda variants - all eras\n\nNew Wolf359 ships - LC Models ported by Max Loef, including a new one called &amp;#039;The Springfield&amp;#039; Class. \n\nNew Historical mission by Phoenix - Way of The Warrior - using the new Deep Space Nine model - with realistic weaponry. This one&amp;#039;s a blast!\n\n1. Many new one on ones  - reoraganized, updated screenies\n2. ships - ships - ships (new and updates)\n* Mnemosyne class (Grunt Port of Wicked Zombie&amp;#039;s model)\n* Jem&amp;#039;hadar Super Carrier (Phoenix Ports)\n* Dominion Heavy Carrier\n* Planetary Defender\n* Strike Cruiser\n* Galor\n* Keldon\n* Hideki\n* Runabout-Class Shuttle (with and without pod)\n* Perigrin-Class Fighter\n* Dominion Warship\n* Dominion Light Cruiser\n* Dominion Heavy Cruiser\n* Breen Dreadnaught\n* Breen Scout\n* Breen Light Cruiser\n* Breen Cruiser\n* Breen Heavy Cruiser\n* Dominion Fighter\n* Dominion Heavy Fighter\n* Barkus Class Cardassian\n* Hutet Class Cardassian\n* Delta Class (CoolguyLi)\n* New Intrepid Class - Rick Knox from BC (Max)\n* New Akira Class - SNS from BC (Max)\n* Selfridge Class (Port by Phoenix)\n* Formidable (Ports and new design: Phoenix)\n* Enterprise Era BOP (Max Loef - made from scratch!)\n\n* New ships and fixes from CoolGuyLi27\n1) Nimitz\n2) Delta\n3) Explorer\n4) Lafayette\n\nGRUNT PORTS:\n\nExcalibur (TNG)\nAgean (Chief Brex)\nStarbases (Moonraker)\nDryDocks (BC Ports, with permission)\n\nNew skirmish maps - including Deneb Encounter and Serolia - Big map -big planets - wormholes (Max)\n\nHistorical Mission  - The Jem&amp;#039;Hadar - uses wormholes\nMap by JC2006\n\nPermissions:\n\nThe content of this mod cannot be used in any other mod without permissions from the original authors - \n\nPrimary contacts are Chris Jones, Mindwipe, Moonraker, Writeall, Max Loef, Gamemaster, Phoenix. If unsure contact me directly - &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;f5969d879c869f9a9b9086b5969d879c869f9a9b90869294989c9b92db9b9081&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\nObviously if you wish to use use something from this mod that is authored by someone outside this mod - you need the original author&amp;#039;s permission.\n\nSome Mods authored by some good folk on the Official Bethsoft Forums and on Legacy Files.. There will be a separate folder for Readmes and credits in your game folder after install.  \n\nThis mod and these files are not supported by Maddoc or Bethesda Softworks and they are not responsible for any damages to your game directory. As with all mods you are using them at your own risk. The Ultimate Universe does not come with an uninstaller.\n\n&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;b7d4dfc5dec4ddd8d9d2c4f7d4dfc5dec4ddd8d9d2c4d0d6daded9d099d9d2c3&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\nEnjoy..\n\nThe Ultimate Universe Mod Team\n","torrent":{"xt":"urn:btih:ef963e769653eb068302fd485387e596e50f945d","amp;dn":"STAR+TREK+LEGACY%3A+THE+ULTIMATE+UNIVERSE+MOD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef963e769653eb068302fd485387e596e50f945d","infoHashBuffer":{"type":"Buffer","data":[239,150,62,118,150,83,235,6,131,2,253,72,83,135,229,150,229,15,148,93]},"announce":[],"urlList":[]}}