{"title":"PBS Frontline - The Merchants of Cool (2001)","uid":3625848,"size":757103947,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:efb2a8b64b6af4e03ed22b74de46d3c71a426ced&amp;dn=PBS+Frontline+-+The+Merchants+of+Cool+%282001%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"grinreaper_CCE","files":3,"time":1172344639,"description":"They are the merchants of cool: creators and sellers of popular culture who have made teenagers the hottest consumer demographic in America. But are they simply reflecting teen desires or have they begun to manufacture those desires in a bid to secure this lucrative market? And have they gone too far in their attempts to reach the hearts--and wallets--of America&amp;#039;s youth?\n\nFRONTLINE correspondent Douglas Rushkoff examines the tactics, techniques, and cultural ramifications of these marketing moguls in &quot;The Merchants of Cool.&quot; Produced by Barak Goodman and Rachel Dretzin, the program talks with top marketers, media executives and cultural/media critics, and explores the symbiotic relationship between the media and today&amp;#039;s teens, as each looks to the other for their identity.\n\nTeenagers are the hottest consumer demographic in America. At 33 million strong, they comprise the largest generation of teens America has ever seen--larger, even, than the much-ballyhooed Baby Boom generation. Last year, America&amp;#039;s teens spent $100 billion, while influencing their parents&amp;#039; spending to the tune of another $50 billion.\n\nBut marketing to teens isn&amp;#039;t as easy as it sounds. Marketers have to find a way to seem real: true to the lives and attitudes of teenagers; in short, to become cool themselves. To that end, they search out the next cool thing and have adopted an almost anthropological approach to studying teens and analyzing their every move as if they were animals in the wild.\n\nTake MTV. Long considered to be the arbiter of teen cool, the late 1990s saw MTV&amp;#039;s ratings on the wane. To counter the slide, MTV embarked on a major teen research campaign, the hallmark of which was its &quot;ethnography study&quot;-- visiting teens&amp;#039; homes to view first hand their lives, interests and ask some quite personal questions.\n\nBut what lessons do MTV and other companies draw from this exhaustive and expensive study of teenagers&amp;#039; lives? Does it result in a more nuanced portrait of the American teen? In &quot;The Merchants of Cool,&quot; FRONTLINE introduces viewers to the &quot;mook&quot; and the &quot;midriff&quot; -- the stock characters that MTV and others have resorted to in order to hook the teen consumer.\n\nThe &quot;midriff&quot;--the character pitched at teenage girls, is the highly-sexualized, world-weary sophisticate that increasingly populates television shows such as Dawson&amp;#039;s Creek and films such as Cruel Intentions. Even more appealing to marketers is the &quot;midriff&amp;#039;s&quot; male counterpart, the &quot;mook.&quot; Characterized mainly by his infantile, boorish behavior, the &quot;mook&quot; is a perpetual adolescent: crude, misogynistic--and very, very, angry.\n\nBut also very lucrative. To appeal to the &quot;mook,&quot; MTV has created programs such as Spring Break -- a televised version of teen beach debauchery--as well as a weekly program capitalizing on the current wrestling craze.\n\n&quot;What this system does is it closely studies the young, keeps them under constant surveillance to figure out what will push their buttons,&quot; says media critic Mark Crispin Miller. &quot;And it blares it back at them relentlessly and everywhere.&quot;\n\nOf course, there is resistance to the commercial machine. FRONTLINE takes viewers to downtown Detroit, where media analyst Rushkoff speaks with teens at a concert by the Detroit-based Insane Clown Posse, purveyors of a genre of music that&amp;#039;s become known as &quot;rage rock.&quot; When asked to describe what appeals to them about such music, the teens invariably respond that it belongs to them; it hasn&amp;#039;t yet been taken and sold back to them at the mall. Full of profanity, violence, and misogyny, rage rock is literally a challenge thrown up to marketers: just try to market this!\n\nBut marketers have accepted the challenge: rage rock is now big business. Not only has Insane Clown Posse become mainstream, but much bigger acts like Eminem and Limp Bizkit are breaking sales records and winning industry accolades in the form of Grammy nominations and other mainstream music awards.\n\nIn &quot;The Merchants of Cool,&quot; correspondent Rushkoff details how MTV and other huge commercial outlets orchestrated the rise of Limp Bizkit--despite the group&amp;#039;s objectionable lyrics--and then relentlessly promoted them on-air.\n\nBut in doing so, critics ask, is MTV truly reflecting the desires of today&amp;#039;s teenagers, or are they stoking a cultural infatuation with music and imagery that glorifies violence and sex as well as antisocial behavior and attitudes?\n\nIn today&amp;#039;s media-saturated environment, such questions, it seems, are becoming increasingly difficult to answer.\n\n&quot;It&amp;#039;s one enclosed feedback loop,&quot; Rushkoff says. &quot;Kids&amp;#039; culture and media culture are now one and the same, and it becomes impossible to tell which came first--the anger or the marketing of the anger.&quot;\n\nTherein lies the danger of today&amp;#039;s teen-driven economy, observers say: As everyone from record promoters to TV executives to movie producers besieges today&amp;#039;s teens with pseudo-authentic marketing pitches, teenagers increasingly look to the media to provide them with a ready-made identity predicated on today&amp;#039;s version of what&amp;#039;s cool. Rather than empowering youngsters, the incessant focus on their wants and desires leaves them adrift in a sea of conflicting marketing messages.\n\n&quot;Kids feel frustrated and lonely today because they are encouraged to feel that way,&quot; Miller tells FRONTLINE. &quot;You know, advertising has always sold anxiety and it certainly sells anxiety to the young. It&amp;#039;s always telling them that they are not thin enough, they&amp;#039;re not pretty enough, they don&amp;#039;t have the right friends, or they have no friends...they&amp;#039;re losers unless they&amp;#039;re cool. But I don&amp;#039;t think anybody, deep down, really feels cool enough, ever.&quot;\n\nAnd as more and more teens look to the media to define what they should think and how they should behave, even some cool hunters are no longer sure that their work isn&amp;#039;t having a negative impact.\n\n&quot;Even though I work at MTV...I am starting to see the world more like someone who&amp;#039;s approaching forty than someone who&amp;#039;s twenty,&quot; says Brian Graden, the channel&amp;#039;s president of programming. &quot;And I can&amp;#039;t help but be worried that we are throwing so much at young adults so fast. And that there is no amount of preparation or education or even love that you could give a child to be ready.&quot;\n &lt;a href=&quot;\nhttp://www.pbs.org/wgbh/pages/frontline/shows/cool/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.pbs.org/wgbh/pages/frontline/shows/cool/&lt;/a&gt;\n\nTech specs (courtesy of SUPER) \n\nGeneral #0 \nFormat : AVI \nFormat/Info : Audio Video Interleave \nFormat/Family : RIFF \nFile size : 699 MiB \nPlayTime : 54mn 30s \nBit rate : 1784 Kbps \nWriting application : VirtualDubMod 1.5.10.1 (build 2439/release) \nWriting library : VirtualDubMod build 2439/release \n\nVideo #0 \nCodec : DivX 5 \nCodec/Family : MPEG-4 \nCodec settings/BVOP : No \nCodec settings/QPel : No \nCodec settings/GMC : 0 \nCodec settings/Matrix : Default \nPlayTime : 54mn 30s \nBit rate : 1638 Kbps \nWidth : 608 pixels \nHeight : 448 pixels \nAspect ratio : 4/3 \nFrame rate : 29.970 fps \nResolution : 8 bits \nChroma : 4:2:0 \nInterlacement : Progressive \nBits/(Pixel*Frame) : 0.201 \nWriting library : DivX 5.2.1 (DrDivX106) \n\nAudio #0 \nCodec : MPEG-1 Audio layer 3 \nCodec profile : Dual mono \nPlayTime : 54mn 30s \nBit rate : 133 Kbps \nBit rate mode : VBR \nChannel(s) : 2 channels \nSampling rate : 48 KHz \nResolution : 16 bits \n\n-------------------------------------------------------\n\nIncluded also is an hour long interview of Michael Tsarion referring to this documentary and elaborating on its context:\n\nMichael Tsarion joins us for an excellent subscriber interview on the theme of his web stream and DVD entitled &quot;The Subversive Use of Sacred Symbolism in the Media&quot;. We begin talking about Rushkoff&amp;#039;s PBS documentary: &quot;The Merchants of Cool&quot;. Michael help us dissect some pieces of the documentary and talk about omissions and hints within it. We talk about the incredible amount of time, money and research that goes into studying the biggest market &quot;resource&quot; out there today - the teenager. We talk about &quot;guilt money&quot;, the mentality of marketers, the medes and the merchants. Michael addresses the connection between psychology and advertising. We bring up the connection between &quot;the Mook&quot; and ODD (Oppositional Defiance Disorder)? We address the total draining of spirit of the true rebel. We end on talking about the &quot;suicide cult&quot;, with people like Jim Morrison, Curt Cobain and Jimmie Hendrix in the forefront. Also tune into our latest regular show with Michael.\n &lt;a href=&quot;\nhttp://www.redicecreations.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.redicecreations.com/&lt;/a&gt;\n\n===============================================================================\nLearn the true nature of the world, come visit our huge dedicated e-library and forums @ &lt;a href=&quot;\nhttp://conspiracycentral.net:6969/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://conspiracycentral.net:6969/index.html&lt;/a&gt;  &lt;a href=&quot;\nhttp://conspiracycentral.info/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://conspiracycentral.info/index.php&lt;/a&gt;\n===============================================================================","torrent":{"xt":"urn:btih:efb2a8b64b6af4e03ed22b74de46d3c71a426ced","amp;dn":"PBS+Frontline+-+The+Merchants+of+Cool+%282001%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"efb2a8b64b6af4e03ed22b74de46d3c71a426ced","infoHashBuffer":{"type":"Buffer","data":[239,178,168,182,75,106,244,224,62,210,43,116,222,70,211,199,26,66,108,237]},"announce":[],"urlList":[]}}