{"title":"Tony Joe White...The Shine(2010)[FLAC]","uid":6958702,"size":379568106,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f014eef4e076c001cc109c3a657332e14fa9c7b6&amp;dn=Tony+Joe+White...The+Shine%282010%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":24,"time":1326691368,"description":"[img]http://www.jpc.de/image/w600/front/0/0742451032321.jpg[/img]\n[color=Red]The Shine[2010] Swamp Records 57220[/color] \n\n[img]http://i128.photobucket.com/albums/p180/SonAfterDark/tracklistlatest.png[/img]\n\n 1  Season Man White 5:00 \n  2  Ain't Doing Nobody No Good White, White 4:47 \n  3  Paintings on the Mountain White, White 5:43 \n  4  Tell Me Why White 6:12 \n  5  All White 5:39 \n  6  Long Way from the River White 6:07 \n  7  Strange Night White 4:29 \n  8  Something to Soften the Blow White, White 4:56 \n  9  Roll Train Roll White, White 5:42 \n  10  A Place to Watch the Sun Go Down White 4:08 \n\nThe 21st century saw Tony Joe White resume his recording and performing career, and experience a resurgence of critical interest in his older music as well. Since 2002, &quot;the Swamp Fox&quot; has recorded sporadically for his own Swamp imprint, and also had his back catalog remastered and reissued. Earlier in 2010, Rhino Handmade made available That On the Road Look, a previously unreleased live date. The Shine is a (mostly) low-key, basic affair. White wrote or co-wrote everything here with his wife, Leann. The band is a quintet: White plays guitars and harmonica with drummer Jack Bruno, cellist John Catchings, bassist George Hawkins, and Tyson Rogers on piano, organ, and Wurlitzer. The sound is warm and raw; the album feels like it was cut mostly live from the floor (with guitar and vocal overdubs added) and it's full of natural atmospherics. White's acoustic nylon-string guitar is prevalent, sometimes more so than his quavering, downright spooky baritone. His electric six-string work paints the backdrop. The only real exceptions are the downright rocker &quot;Strange Night,&quot; where White displays everything that Mark Knopfler copped from his style inside of five minutes. The levels feel off, overloaded; the vocals come from the backdrop as the guitars and drums smoulder, smoke, and bubble. A broken love song, everything in it bleeds into everything else: it expresses pain as an immediate, crushing experience; it evokes everything from anger to tenderness. &quot;Something to Soften the Blow&quot; is an electric country waltz, sad, beautiful, and lonely. The protagonist is desperate for comfort in seeking a one-night stand from what is perhaps a sympathetic other. White somehow manages to pull off his plea without coming off as pathetic; he wears his brokenness with dignity. &quot;Season Man&quot; is a classic White minor-key narrative about a drifter. &quot;Ain't Doing Nobody No Good&quot; is a droning swamp blues, full of dread and sinister purpose. &quot;Long Way from the River&quot; is a backbeat-driven deeply atmospheric folk song that contains a classic White line: &quot;When you're running with the swamp, the rain is gonna fall.&quot; &quot;Roll Train Toll&quot; is pure Delta-style folk-blues, played solo on a steel-string acoustic guitar; it's loaded with a quiet yet ever-present menace ready to break the surface, though it never does, and is all the more effective as a result. Ultimately, The Shine is White's most consistent and gratifying offering since he began recording again. \n\ncd ripped by EAC\n\nplease seed\n\n[url]http://dickthespic.org/2012/01/13/tony-joe-white/[/url]","torrent":{"xt":"urn:btih:f014eef4e076c001cc109c3a657332e14fa9c7b6","amp;dn":"Tony+Joe+White...The+Shine%282010%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f014eef4e076c001cc109c3a657332e14fa9c7b6","infoHashBuffer":{"type":"Buffer","data":[240,20,238,244,224,118,192,1,204,16,156,58,101,115,50,225,79,169,199,182]},"announce":[],"urlList":[]}}