{"title":"Raving Rabbids Party Collection [PAL][Wii][Multi5][Spanish][www.","uid":5954921,"size":8458880422,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:f0af6b9b80802855d7ec774100f070945f542137&amp;dn=Raving+Rabbids+Party+Collection+%5BPAL%5D%5BWii%5D%5BMulti5%5D%5BSpanish%5D%5Bwww.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"consolasatope","files":88,"time":1289678082,"description":"En total esta recopilaciÃƒÂ³n te proporciona 175 minijuegos con los que jugar con la familia o animar esas fiestas locas que todos celebramos de vez en cuando.\n\nLos conejitos mÃƒÂ¡s alocados y demonÃƒÂ­acos que jamÃƒÂ¡s has podido imaginar han invadido el mundo de Rayman convirtiÃƒÂ©ndole a ÃƒÂ©l y a todos sus amigos en simples esclavos.\nPrisionero en una celda, como si de un gladiador de circo romano se tratase, Rayman tendrÃƒÂ¡ que enfrentarse a multitud de burlas y pruebas que estos chiflados conejos le impondrÃƒÂ¡n. SÃƒÂ³lo Rayman puede superar todas estas pruebas con ÃƒÂ©xito y conseguir la popularidad y el respeto de esta peculiar raza caÃƒÂ³tica de conejitos. Si lo consigue, podrÃƒÂ¡ llegar a ocupar el puesto de su lÃƒÂ­der y alcanzar asÃƒÂ­ su libertad y la de sus amigos.\n\nCaracterÃƒÂ­sticas Principales:\nÃ‚Â· Explotando todos las posibilidades del mando y tecnologÃƒÂ­a Wii disfruta de Rayman como nunca antes has podido. Gran diversidad de pruebas en las que disfrutarÃƒÂ¡s y reirÃƒÂ¡s como nunca antes con Rayman.\nÃ‚Â· MÃƒÂ¡s de 70 pruebas a las que sobrevivir en un mundo impactante de contrastes.\nÃ‚Â· Carreras con mÃƒÂ¡gicas criaturas, combates con los alocados conejos, bailes hipnotizantes, apunta y dispara con singulares objetos como desatascadotes de tuberÃƒÂ­as, retos alocados y divertidos como el lanzamiento de vacas, ordeÃƒÂ±ar cerdos y muchos, muchos mÃƒÂ¡s? Intenso y desafiante modo Multijugador. - Deja que fluya la adrenalina en competiciones con hasta 4 amigos en frenÃƒÂ©ticas y alocadas pruebas.\nÃ‚Â· Por Primera vez, personaliza a Rayman con tu propio estilo: a medida que haces a Rayman mÃƒÂ¡s famoso y popular para los conejitos, desbloquearÃƒÂ¡s desde disfraces y objetos para tu celda como las canciones y mÃƒÂºsica que mÃƒÂ¡s te guste.\nÃ‚Â· Explora el fantÃƒÂ¡stico Mundo de Rayman: visualmente impactante lleno de contrates y divertidas situaciones haciendo honor a la calidad y valores acostumbrados de Rayman pero aÃƒÂºn mÃƒÂ¡s innovador y original \n\n","torrent":{"xt":"urn:btih:f0af6b9b80802855d7ec774100f070945f542137","amp;dn":"Raving+Rabbids+Party+Collection+%5BPAL%5D%5BWii%5D%5BMulti5%5D%5BSpanish%5D%5Bwww.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0af6b9b80802855d7ec774100f070945f542137","infoHashBuffer":{"type":"Buffer","data":[240,175,107,155,128,128,40,85,215,236,119,65,0,240,112,148,95,84,33,55]},"announce":[],"urlList":[]}}