{"title":"Freeing Your Child from Anxiety by Tamar Chansky","uid":14469001,"size":2971091,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f0e38e597fe96e9393f2674147f3a20a591b3cda&amp;dn=Freeing+Your+Child+from+Anxiety+by+Tamar+Chansky&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Dr.Soc","files":1,"time":1461886625,"description":"Freeing Your Child from Anxiety: Powerful, Practical Solutions to Overcome Your Child's Fears, Worries, and Phobias by Tamar Chansky Ph.D.\r\nHarmony | March 30, 2004 | English | ISBN: 0767914929 | 320 pages | EPUB | 3 MB\r\n\r\nAnxiety is the number one mental health problem facing young people today. Childhood should be a happy and carefree time, yet more and more children today are exhibiting symptoms of anxiety, from bedwetting and clinginess to frequent stomach aches, nightmares, and even refusing to go to school. Parents everywhere want to know: All children have fears, but how much is normal? How can you know when a stress has crossed over into a full-blown anxiety disorder? Most parents don’t know how to recognize when there is a real problem and how to deal with it when there is. \r\n\r\nIn Freeing Your Child From Anxiety, a childhood anxiety disorder specialist examines all manifestations of childhood fears, including social anxiety, Tourette’s Syndrome, hair-pulling, and Obsessive Compulsive Disorder, and guides you through a proven program to help your child back to emotional safety. \r\n\r\nNo child is immune from the effects of stress in today’s media-saturated society. Fortunately, anxiety disorders are treatable. By following these simple solutions, parents can prevent their children from needlessly suffering today—and tomorrow","torrent":{"xt":"urn:btih:f0e38e597fe96e9393f2674147f3a20a591b3cda","amp;dn":"Freeing+Your+Child+from+Anxiety+by+Tamar+Chansky","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0e38e597fe96e9393f2674147f3a20a591b3cda","infoHashBuffer":{"type":"Buffer","data":[240,227,142,89,127,233,110,147,147,242,103,65,71,243,162,10,89,27,60,218]},"announce":[],"urlList":[]}}