{"title":"Sebastian Fitzek: De gijzeling, De therapie, De Wreker (e-pub) T","uid":6466169,"size":1378811,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f2bfc11f22805ed485a20377f9281ed1d7d688a7&amp;dn=Sebastian+Fitzek%3A+De+gijzeling%2C+De+therapie%2C+De+Wreker+%28e-pub%29+T&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Vlinder2","files":-1,"time":1307924680,"description":"Sebastian Fitzek\n\n(digitaal boek) \n\n\n\nDe gijzeling \n\nBeschrijving\n Vandaag is haar laatste dag... De gerenommeerde forensisch psychologe Ira Samin heeft haar zelfmoord zorgvuldig voorbereid. De dood van haar oudste dochter kan ze onmogelijk verwerken. Maar op het allerlaatste moment wordt Ira naar een gijzeling bij een radiozender geroepen. Een psychopaat houdt in de studio een groepje mensen onder schot en speelt een macaber spel: tijdens een uitzending belt hij willekeurig mensen op. Als ze opnemen met een specifieke zin, laat hij een gijzelaar vrij. Doen ze dat niet, dan schiet hij er een dood. De man dreigt net zolang door te spelen tot zijn verloofde bij hem in de studio wordt gebracht. Zij is echter maanden geleden omgekomen bij een ernstig auto-ongeluk, maar de gijzelnemer is er heilig van overtuigd dat ze nog leeft en dat er een samenzwering van de overheid in het spel is. Ira begint aan de schier uitzichtloze onderhandelingen, in de wetenschap dat er miljoenen mensen met haar meeluisteren. Sebastian Fitzek (Berlijn, 1971) is de auteur van De therapie en De gijzeling, waarvan in Duitsland meer dan een half miljoen exemplaren over de toonbank gingen. Ook in Nederland en BelgiÃƒÂ« heeft Fitzek inmiddels een grote schare liefhebbers. 'Dit is reclame voor het spannende boek!' Crimezone, vier sterren 'Toonde Fitzek bij zijn debuut De therapie al dat hij een auteur is om te onthouden, na het lezen van De gijzeling ontkom je er niet aan. Werkelijk een boek met een geniaal verhaal en een prachtig en onvoorspelbaar einde.' Bookreviews.nl \n\n\n\n\nDe therapie\n\nBeschrijving\n Geen getuigen. Geen sporen. Geen lijk. Josy, de zieke 12-jarige dochter van psychiater Viktor Larenz verdwijnt onder mysterieuze omstandigheden. Er wordt nooit meer iets van haar vernomen. Vier jaar na de verdwijning van zijn dochter trekt Larenz zich terug in een afgelegen vakantiehuis op een eiland. Op een dag duikt daar de mooie Anna op. Ze wil bij Dr. Larenz in therapie omdat ze last heeft van waanvoorstellingen. Daarin duikt steeds een jong meisje op, dat net zo spoorloos verdwenen is als Josy. Viktor hoort haar met tegenzin aan, maar dan blijken er opmerkelijk veel overeenkomsten te zijn met de verdwijning van Josy. Anna beschrijft details die een buitenstaander niet kan weten. In de hoop dat ze hem meer over de verdwijning kan vertellen, stemt Dr. Larenz toe in de therapie. Maar gaandeweg lijken de vermoeiende en emotionele sessies meer en meer op een dramatisch verhoor en gebeuren er vreemde en onverklaarbare dingen op het eiland... De Nederlandse pers over De therapie: 'Een buitengewoon knappe psychologische thriller met een sterk verrassingseffect.' 'Een waanzinnig goede psychologische thriller die lang in je geheugen blijft hangen. Heel, heel erg mooi!' Sebastian Fitzek (Berlijn, 1971) is de auteur van De therapie en De gijzeling, waarvan in Duitsland meer dan een half miljoen exemplaren over de toonbank gingen. Ook in Nederland en BelgiÃƒÂ« heeft Fitzek inmiddels een grote schare liefhebbers.\n\n\nDe Wreker\n\nBeschrijving\n Toen Robert Stern met deze ongewone ontmoeting instemde, wist hij niet dat hij daarmee een afspraak met de Dood aanging. Nog minder wist hij dat de Dood ongeveer 1 meter 43 lang was, gympies droeg en op een godverlaten industrieterrein glimlachend zijn leven binnen zou wandelen. Op een dag bekent de tienjarige Simon een moord aan advocaat Robert Stern - een moord die hij vijf jaar voor zijn geboorte pleegde. Stern staat voor een raadsel. Zijn verbazing slaat echter om in ontzetting als hij in de kelder die Simon hem beschreven heeft inderdaad een de stoffelijke resten van een mens aantreft. Deze vondst is slechts het begin van een bizar avontuur. In zijn brievenbus vindt Stern een dvd met beelden van een tienjarig jongetje dat sprekend lijkt op Sterns zoontje Felix, die kort na zijn geboorte is overleden. De voice-over op de dvd beveelt Stern om binnen een week alle moorden waarover Simon vertelt na te trekken, zonder de politie in te schakelen. Voldoet hij aan deze eis, dan zal hij Stern in contact brengen met Felix. Hiermee begint een gruweltocht door de schimmige onderwereld van Berlijn. Er komen smerige zaken aan het daglicht, zaken die hij ondanks al zijn beroepservaring nooit voor mogelijk had gehouden. Wat is er destijds precies gebeurd op de kinderafdeling van het ziekenhuis waar Felix stierf? Sebastian Fitzek (Berlijn, 1971) is de auteur van De therapie en De gijzeling, waarvan in Duitsland al meer dan een half miljoen exemplaren over de toonbank gingen. Ook in Nederland en BelgiÃƒÂ« heeft Fitzek inmiddels een grote schare liefhebbers. 'Zijn derde thriller van hoog internationaal niveau. Fitzek is het Duitse wonderkind van de psychothriller.' Bild am Sonntag \n\nTBS","torrent":{"xt":"urn:btih:f2bfc11f22805ed485a20377f9281ed1d7d688a7","amp;dn":"Sebastian+Fitzek%3A+De+gijzeling%2C+De+therapie%2C+De+Wreker+%28e-pub%29+T","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2bfc11f22805ed485a20377f9281ed1d7d688a7","infoHashBuffer":{"type":"Buffer","data":[242,191,193,31,34,128,94,212,133,162,3,119,249,40,30,209,215,214,136,167]},"announce":[],"urlList":[]}}