{"title":"Syndicate Wars with CD music","uid":4386685,"size":356604130,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f2c38ef4eec68cab2d34ceb3722cb5361d20caa1&amp;dn=Syndicate+Wars+with+CD+music&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Spaik79","files":1,"time":1220954795,"description":"///////////////// Game Info ////////////////////\n\n               SYNDICATE WARS\n       Bullfrog Productions Ltd. 1996\n\n              Platform: PC\n                 Genre: Real-time tactics\n            Protection: it is old\n                Ripped: Multilanguage\n          Size on disk: ~498MB\n                 \n                  More info:\n  &lt;a href=&quot; http://en.wikipedia.org/wiki/Syndicate_Wars&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://en.wikipedia.org/wiki/Syndicate_Wars&lt;/a&gt;\n        &lt;a href=&quot; http://syndicate.lubie.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://syndicate.lubie.org/&lt;/a&gt;\n\n\n////////////////// Read ME //////////////////////\n\nIf you haven't played Syndicate Wars before then\nyou need to understand that this game IS OLD.\nIt does not have the eye-candy that you have been\nused to and it will break your mind with awkward\ncamera and movement controls. You have been warned.\n\nThere are only few things that make people play\nSyndicate games over and over for decades.\nIT IS CLASSIC. IT IS CYBERPUNK. IT HAS MINIGUNS\nAND FUCKING NUCLEAR GRENADES. IT HAS CYBERNETIC\nLIMBS AND PSYCHOTROPIC DRUGS AND MIND CONTROL.\nAlso, you get to blow up banks for the money.\n\nRunning Syndicate Wars on a modern computer is a\nbit tricky. For one thing SW is a DOS game and it\nis a very high end at that, utilizing destructible\n3D environment that was very rare back then.\n\nThere are three ways you can run Syndicate Wars.\n1) play it on an old computer running DOS\n2) play it on a virtualized old computer running DOS\n3) play it on a decent computer with DosBox\n\nThis package uses the third method. It has a\npreinstalled english language (sorry, i ripped\noff other languages to save space) Syndicate Wars\nall patched up and ready to go with the preinstalled\nand configured DosBox.\n\nThis little package of mine also has the CD audio\nbackground music which is usually unavailable\nin your generic Syndicate Wars abandonware.\n\n\n/////////////// INSTALLATION ///////////////////\n\nJust extract the package into your chosen location.\nThe default location is C:\\SWARS\\ but you may\nchoose othervise.\n\nIF you want to play from any other location than\nC:\\SWARS\\ then you need to edit a few files.\n\n- Swars shortcut\n1) Right click and choose Properties\n2) Edit the &quot;Target&quot; and &quot;Start in&quot; fields to point\nto your location. Note that Target has three paths\nyou need to edit.\n\n- Setsound shortcut (if you need to change the\nsound device)\nSame as above\n\n- Play.bat\non the first line edit the path to point into\nswars_mini.cue\n\n\n/////////////// PLAYING IT ///////////////////\n\nStart the game from Swars shortcut.\nYou do not need to mount the image, the dosbox\ndoes it by itself.\nIf everything goes well you should see two black\nDOS screens popping up and some lines of text,\nthats the DosBox.\nThen the game should start in one of the DosBox\nwindows. Click inside it and you are in game\n(it captures your mouse, to get out you need\nto alt-tab)\n\nAlt-Enter toggles you between fullscreen and\nwindowed mode.\n\nNOTE!\nThere are several annoyances when running Swars\nwith dosbox:\n1) the first menu loops back to intro movie in a\nfew seconds unless you click on the menu buttons.\n2) the few bugs that are in the original game are\nstill in there.\n3) performance related annoyances, read on...\n\n\n/////////////// PERFORMANCE ///////////////////\n\nThe thing about DosBox is that it performs a bit\ndifferently on different machines.\n\nIt all comes down to how much CPU cycles your computer\ncan give to the game. If you give too much the game\neither runs too fast or becomes choppy and stutters.\nIf you give too little the game starts to lag.\nIf you have a poor low end laptop then it is\npossible you won't find a sweet well performing\nspot between lag and stuttering.\n\nAlso to be noted that the game menus need way less\npower than the actual ass kicking, so unless you\nhave good computer that can run the menus on high\ncycles without stuttering (like mine) and dont mind\nthe menu animations going by in high-speed, you will\nfind yourself adjusting cycles between every mission.\n\nFortunately Dosbox gives easy access to adjusting\nCycles.\n\nCTRL+F11 = Less Cycles\nCTRL+F12 = More Cycles\nThe amount of cycles is visible on the window title\nin windowed mode.\n\nThe preset is 120000 Cycles. That is when my home\ncomputer runs both the menus and the ground missions\nwith good performance. The menus are quite fast, but\nthere is no choppiness or sound breaking.\nYou might need to reduce this to 80000 or even less.\n\nIf you can determine your sweet cycle speed you can\nset it as default by editing the configuration file\n\\dosbox\\swars.conf with notepad.\n\n\n///////////////////////////////////////////////////\n\nFor more info on game in all aspects i\nsuggest you read Mefistotelis' website at\nhttp://syndicate.lubie.org/\n\nPS. I take no credit on any of the methods to run\nthe game with musics etc. I only used an evening to\nfind all the information and to download the files\nand patches and making it all work in a compact and\nportable manner.\n\nPPS. POOSLICE\n\nCheers,\nSpike79","torrent":{"xt":"urn:btih:f2c38ef4eec68cab2d34ceb3722cb5361d20caa1","amp;dn":"Syndicate+Wars+with+CD+music","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2c38ef4eec68cab2d34ceb3722cb5361d20caa1","infoHashBuffer":{"type":"Buffer","data":[242,195,142,244,238,198,140,171,45,52,206,179,114,44,181,54,29,32,202,161]},"announce":[],"urlList":[]}}