{"title":"WB Waterbondage 6 movies 2251 2280 2283 2293 2343 16802","uid":8881272,"size":3354076428,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:f4b43638d9decb8625172c9305843469026d8c3d&amp;dn=WB+Waterbondage+6+movies+2251+2280+2283+2293+2343+16802&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"sezame","files":6,"time":1378328510,"description":"\nThis pack contains 6 movies:\n\n\n2251_jenya.mp4\n\nBefore the shoot Jenya says: &quot;I can handle bondage, I love orgasms and I think I'm okay with water...but all 3 together, I have no idea if I can handle that&quot;. We put her to the test on our Matrix Wall and make her submit to all 3 time and time again and we didn't stop there! By the end of the shoot we had a tired but happy model that could barely walk from cumming so hard and who was begging to do it all again!\n\nScreens: http://www.waterbondage.com/site/shoot/2251-Jenya.html\n\n--------------------------------------------------------------------\n\n2280_star.mp4\n\nSome like to fight back, some love to please their Dom...Star is different. She likes to be looked after, to be someone's pet...to be punished when she is bad and be rewarded when she is good. Chanta has a special connection with Star and can make her suffer through more difficult bondage than she is accustomed to, she can also make her cum harder and more often than anyone else. So vulnerable, so beautiful; Star will always be welcome here.\n\nScreens: http://www.waterbondage.com/site/shoot/2280-Star.html\n\n--------------------------------------------------------------------\n\n2283_lola.wmv\n\nLola has never been with a woman, she is bi-curious but intimidated by a powerful female taking full of control of her. She is introduced to tough bondage, water orgasms and an 8 inch strap on cock that makes her cum hard. Her dripping pussy is washed out and a hook pulls at her ass, when she is [REDACTED] to orgasm this time she squirts all over her face. Again she needs to be cleaned and is bound to the Wheel of Misfortune for a very challenging submersion scene!\n\nScreens: http://www.waterbondage.com/site/shoot/2283-Lola.html\n\n--------------------------------------------------------------------\n\n2293_haydee.wmv\n\nWhat does it mean to be a lifestyle submissive? Does it require being a slave 24 hours a day? Does it mean doing everything you are told without question? Perhaps it involves facing your fears to satisfy someone else.\n\nHaydee is here to please her real life Master and Mistress. It is their fantasy to see her bound, gagged and humiliated on the world wide web...it is our fantasy to be the ones binding her and of course it is Haydee's fantasy to please us all\n\nScreens: http://www.waterbondage.com/site/shoot/2293-Haydee.html\n\n--------------------------------------------------------------------\n2343_ava.wmv\n\nThere is only one Ava Devine! This girl loves it all; bondage, anal sex, multiple orgasms and being at the complete mercy of someone else. Never have we met such a horny slut! At the beginning of the shoot she says &quot;I'm a sex addict, no man has ever been able to keep up with me!&quot; We tie her tight, scrub her clean, fuck all of her holes and give her a very intense spin on the Rotisserie, by the end of the shoot the real question was; can we keep up with Ava Devine?\n\nScreens: http://www.waterbondage.com/site/shoot/2343-Ava-Devine.html\n\n--------------------------------------------------------------------\n16802_Darling.mp4\n\nDarling returns for a revival installment of wet, tight bondage. This single element induces shock and pleasure for the submissive subject.\n\nHer wet body bound and strung up onto one leg. Doused and soaked, her titties drip while she struggles to maintain her balance. The stream of water jets blast her into exhaustion before being vibed and denied.\n\nHer limbs tied and pulled spread as her neck is tied and attached to a bucket soon to weighted with water. She splashes around to avoid the hosing only to tighten the rope around her neck. Her breathes are shorten by blasts of water at her face and pussy. Then she is made to cum and thrash around as clothespins bite into her skin.\n\nDarling challenges herself to be hogtied and submerged. One dunk at a time, she increases the duration. She is finger fucked and made to cum, experiencing an underwater orgasm for the first time.\n\nScreens: http://www.waterbondage.com/site/shoot/16802-Water-Bondage-Screams-Orgasms-and-Big-Wet-Titties.html\n\n--------------------------------------------------------------------","torrent":{"xt":"urn:btih:f4b43638d9decb8625172c9305843469026d8c3d","amp;dn":"WB+Waterbondage+6+movies+2251+2280+2283+2293+2343+16802","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4b43638d9decb8625172c9305843469026d8c3d","infoHashBuffer":{"type":"Buffer","data":[244,180,54,56,217,222,203,134,37,23,44,147,5,132,52,105,2,109,140,61]},"announce":[],"urlList":[]}}