{"title":"Active Hard Disk Monitor Pro 3.1.6","uid":7735939,"size":12750464,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f5a5a2d93b3585d21b92d126b22e1b1bf9790bf5&amp;dn=Active+Hard+Disk+Monitor+Pro+3.1.6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"wallpwallpapers","files":-1,"time":1350487035,"description":"Active@ Hard Disk Monitor is a disk utility that checks and monitors the status of your hard drives to help prevent data loss. The system is based on the Self-Monitoring Analysis and Reporting Technology (S.M.A.R.T.). This software monitors hard disk parameters such as Temperature, Head Flying Height and Spin-Up Time and notifies a user when a critical condition occurs. Disk Monitor also displays hard disk information, current S.M.A.R.T. attributes and the overall status of the hard disk's health.\n\nAdvanced disk scan allows you to detect bad sectors on a disk surface. The software can be launched automatically at Windows startup and monitor the system in the background. A very useful feature of this program is that it displays the temperature of your hard disk drive as an icon from the taskbar.\n\nHere are some key features of &quot;Active@ Hard Disk Monitor&quot;:\nPerformance Monitoring and Control:\nÂ· Provides background hard disk performance monitoring and control over the disk's state.\nS.M.A.R.T. Technology:\nÂ· Based on Self Monitoring Analysis and Reporting Technology (S.M.A.R.T.).\nScanning Disks for Bad Sectors:\nÂ· Able to scan and display bad sectors on a disk's surface.\nSystem Tray Icon:\nÂ· Shows current disk temperature in the System Tray\nE-mail and Popup notifications:\nÂ· Sends an e-mail or a popup notification automatically if critical conditions appear.\nS.M.A.R.T. Attributes:\nÂ· Displays current values of S.M.A.R.T. attributes, giving the extensive information about your hard disk's state.\nDisk Information:\nÂ· Provides detailed hard disk information such as Serial/Model Number, Number of cylinders, and so on.\nLaunch at Windows startup:\nÂ· Can be launched automatically at Windows startup and monitor the HDD(s) in the background.\nEvent logs and reports:\nÂ· Generates event log and S.M.A.R.T. reports with detailed information about disk(s) activity over the period of time.\nRemote Administration and Monitoring:\nÂ· Shows disks status and information and receives notifications from remote computers in local or global network.\nSimple and intuitive UI:\nÂ· Easy to use user interface makes a hard disk monitoring a straightforward task.","torrent":{"xt":"urn:btih:f5a5a2d93b3585d21b92d126b22e1b1bf9790bf5","amp;dn":"Active+Hard+Disk+Monitor+Pro+3.1.6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5a5a2d93b3585d21b92d126b22e1b1bf9790bf5","infoHashBuffer":{"type":"Buffer","data":[245,165,162,217,59,53,133,210,27,146,209,38,178,46,27,27,249,121,11,245]},"announce":[],"urlList":[]}}