{"title":"Poems, Letters - Zen Master Ryokan (294p) [Inua].djvu","uid":11602278,"size":11547524,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f63a9052a081e3884f981adc695334711498fd16&amp;dn=Poems%2C+Letters+-+Zen+Master+Ryokan+%28294p%29+%5BInua%5D.djvu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Inua1","files":1,"time":1417369391,"description":"Title: Great Fool: Zen Master Ryokan : Poems, Letters, and Other Writings\nAuthor: Ryokan and Ryuichi Abe\nPaperback: 376 pages\nPublisher: Univ of Hawaii Pr (June 1996)\nLanguage: English\nISBN-10: 082481777X\nISBN-13: 978-0824817770\n\nDescription:\nTaigu Ryokan (1758-1831) remains one of the most popular figures in Japanese Buddhist history. Despite his religious and artistic sophistication (he excelled in scriptural studies, in calligraphy, and in poetry), Ryokan referred to himself as &quot;Great Fool, &quot; refusing to place himself within any established religious institution. In contrast to Zen masters of his time who presided over large monasteries, trained students, or produced recondite treatises, Ryokan followed a life of mendicancy in the countryside. Instead of delivering sermons, he expressed himself through kanshi (poems composed in classical Chinese) and waka (poems in Japanese syllabary) and could typically be found playing with the village children in the course of his daily rounds of begging. Great Fool is the first study in a Western language to offer a comprehensive picture of the legendary poet-monk and his oeuvre. It includes not only an extensive collection of the master's kanshi, topically arranged to facilitate an appreciation of Ryokan's colorful world, but selections of his waka, essays, and letters. The volume also presents for the first time in English the Ryokan zenji kiwa (Curious Accounts of the Zen Master Ryokan), a firsthand source composed by a former student less than sixteen years after Ryokan's death. Consisting of anecdotes and episodes, sketches from Ryokan's everyday life, the Curious Accounts is invaluable for showing how Ryokan was understood and remembered by his contemporaries. To further assist the reader, three introductory essays approach Ryokan from the diverse perspectives of his personal history and literary work","torrent":{"xt":"urn:btih:f63a9052a081e3884f981adc695334711498fd16","amp;dn":"Poems%2C+Letters+-+Zen+Master+Ryokan+%28294p%29+%5BInua%5D.djvu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f63a9052a081e3884f981adc695334711498fd16","infoHashBuffer":{"type":"Buffer","data":[246,58,144,82,160,129,227,136,79,152,26,220,105,83,52,113,20,152,253,22]},"announce":[],"urlList":[]}}