{"title":"Ali in Wonderland And Other Tall Tales by Ali Wentworth","uid":7979139,"size":1018397,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f672b89d79276b3c78648e3a41bb6e7e8e05df8d&amp;dn=Ali+in+Wonderland+And+Other+Tall+Tales+by+Ali+Wentworth&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"azizex666","files":-1,"time":1357120331,"description":"Growing up in a family of political journalists--and daughter of President Reagan's White House social secretary--Ali Wentworth rebelled against her blue-blood upbringing, embracing Hollywood, motorcycles, even a few wildly inappropriate marriage proposals. Today she is an acclaimed comedic actress and writer, former Oprah regular, wife of political and media star George Stephanopoulos, and a mother who lets her two girls eat cotton candy before bed. Though she's settled down, her rebellious nature thrives in her comedy and her view of her crazy world.\n\nIn this addictively funny and warm memoir, she takes us through the looking glass and into the wonderland of her life, from a childhood among Washington's elite to a stint in the psych ward they called a New England prep school; days doing L.A. sketch comedy (with then-aspiring artists Will Ferrell and Lisa Kudrow) to a series of spectacularly failed loves (that eventually led her to Mr. Right). Constant throughout is her mother, Muffie--a flawlessly elegant yet firm, no-nonsense force of nature and pure WASP convictions.\n\nAs charming and off-the-wall as Ali herself, Ali in Wonderland is an entertaining look at life that is both intimate and hilarious.\n\n\n                              Format 1 - .ePUB\n\n                              Format 2 - .Mobi\n\n                          Published - February 7th 2012\n\n                All my Ebook uploads are separated by Genre Tags \n\n \n            **Support Your Favorite Authors By Buying Their Books**\n\n\n                Check out all my Magazine and ebook uploads here.\n\n                    &lt;a href=&quot; https://thepiratebay.se/user/azizex666/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/user/azizex666/&lt;/a&gt;","torrent":{"xt":"urn:btih:f672b89d79276b3c78648e3a41bb6e7e8e05df8d","amp;dn":"Ali+in+Wonderland+And+Other+Tall+Tales+by+Ali+Wentworth","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f672b89d79276b3c78648e3a41bb6e7e8e05df8d","infoHashBuffer":{"type":"Buffer","data":[246,114,184,157,121,39,107,60,120,100,142,58,65,187,110,126,142,5,223,141]},"announce":[],"urlList":[]}}