{"title":"Michael J Martinez - The Daedalus Incident","uid":10583426,"size":461062148,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f6e1886a509df0989850514b015a5bd8d3e2fa93&amp;dn=Michael+J+Martinez+-+The+Daedalus+Incident&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"arithmaldor","files":-1,"time":1405716285,"description":"Mars is supposed to be dead. Bizarre quakes are rumbling over the long-dormant tectonic plates of the planet, disrupting its trillion-dollar mining operations and driving scientists past the edges of theory and reason. However, when rocks shake off their ancient dust and begin to roll seemingly of their own volition carving canals as they converge to form a towering structure amid the ruddy terrain, Lt. Jain and her JSC team realize that their routine geological survey of a Martian cave system is anything but. The only clues they have stem from the emissions of a mysterious blue radiation, and a 300-year-old journal that is writing itself.\n\nLt. Thomas Weatherby of His Majesty's Royal Navy is an honest 18th-century man of modest beginnings, doing his part for King and Country aboard the HMS Daedalus, a frigate sailing the high seas between continents and the immense Void between the Known Worlds. With the aid of his fierce captain, a drug-addled alchemist, and a servant girl with a remarkable past, Weatherby must track a great and powerful mystic, who has embarked upon a sinister quest to upset the balance of the planets the consequences of which may reach far beyond the Solar System, threatening the very fabric of space itself.\n\nWritten by Michael J Martinez \nRead by Kristin Kalbli, Bernard Clark \nFormat: MP3 \nBitrate: 64 Kbps \nUnabridged \n\nAn interstellar swashbuckling fantasy adventure, The Daedalus Incident \ncaptures two very different frontiers: a cave system on Mars undergoing \ngeological exploration, and the open ocean of the 18th century. With \nthe discoveries of two intrepid explorers, Lt. Jain (voiced by Kristin \nKalbli) and Lt. Thomas Weatherby (voiced by Bernard Clark), and the \nincredible overlap between their worlds, this mind-bending genre mashup \ntruly takes off. Energetic performances from Kalbli and Clark make this \nalready engrossing adventure a must-listen for fans of fantasy and historical \nadventure alike.\n\n\nListening Length: 16 hours and 5 minutes\nProgram Type: Audiobook\nVersion: Unabridged\nPublisher: Audible Studios\nAudible.com Release Date: August 13, 2013\nWhispersync for Voice: Ready\nLanguage: English\n\n\nRepost of a torrent from theaudiobookbay.com\nEnjoy!","torrent":{"xt":"urn:btih:f6e1886a509df0989850514b015a5bd8d3e2fa93","amp;dn":"Michael+J+Martinez+-+The+Daedalus+Incident","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6e1886a509df0989850514b015a5bd8d3e2fa93","infoHashBuffer":{"type":"Buffer","data":[246,225,136,106,80,157,240,152,152,80,81,75,1,90,91,216,211,226,250,147]},"announce":[],"urlList":[]}}