{"title":"Vengeance Essential Clubsounds Vol.1","uid":3592071,"size":396651507,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f718c0c0d9f808e2b662ffb0f7dac5a589121ca8&amp;dn=Vengeance+Essential+Clubsounds+Vol.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"bagge_1990","files":27,"time":1168231818,"description":"Responsible for the production of Vengeance Essential Club Sounds Vol. 1 are Manuel Schleis &amp; Manuel Reuter, two of the most respected guys in the german dance industry. If you are producing dance music you most likely used sounds made by Manuel Schleis already, as he programmed sounds and factory presets exclusively for established brands such as Access, Roland, Waldorf &amp; ReFX. Beside that he is holding his own platform Vengeance Sound, making even more soundsets online available, as well as being an active producer in the dance industry, same as his partner Manuel Reuter, who is behind projects such as DJ Manian, Yanou, Cascada, Plazmatek just to mention a very few. Apart from that they have also been engaged to deliver remix works for established chart acts like 4 Strings, Pulsedriver, Dumonde etc..., so thereÃ‚Â´s no doubt that this sampling cd is done by well experienced producers who definitely know how dance music should sound like!\n\n\n\n\n2500 high quality clubsounds from the archives of Manuel Schleis &amp; Manuel Reuter\n\nall loops at 140 BPM and precisely cut\n\nall tonal sounds with exact root key\n\noptimized for maximal pressure in the clubs :)\n\nreasonable sorted in categories like CL Hihats, OP Hihats, Ride etc...\n\nno ripped loopstuff, all loops are processed or built from the scratch\n\n8 sided color CD booklet\n\nsome sounds are directly exported from our well known projects\n","torrent":{"xt":"urn:btih:f718c0c0d9f808e2b662ffb0f7dac5a589121ca8","amp;dn":"Vengeance+Essential+Clubsounds+Vol.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f718c0c0d9f808e2b662ffb0f7dac5a589121ca8","infoHashBuffer":{"type":"Buffer","data":[247,24,192,192,217,248,8,226,182,98,255,176,247,218,197,165,137,18,28,168]},"announce":[],"urlList":[]}}