{"title":"Savage Continent by Keith Lowe - ePub - velvetfog","uid":9716331,"size":2870232,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f7983790c8d7eacf750f6d5ee6dd60a11fa237c7&amp;dn=Savage+Continent+by+Keith+Lowe+-+ePub+-+velvetfog&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"velvetfog","files":-1,"time":1394165889,"description":"Savage Continent: Europe in the Aftermath of World War II by Keith Lowe in ePub format.\n\n\n\nThe Second World War might have officially ended in May 1945, but in reality it rumbled on for another 10 years ...Across Europe, landscapes had been ravaged, entire cities razed and more than 35 million people had been killed in the war. The institutions that we now take for granted - such as the police, the media, transport, local and national government - were either entirely absent or hopelessly compromised. Crime rates were soaring, economies collapsing, and the European population was hovering on the brink of starvation. In this epic book, Keith Lowe describes a continent still racked by violence, where large sections of the population had yet to accept that the war was over. He outlines the warped morality and the insatiable urge for vengeance that were the legacy of the conflict. He describes the ethnic cleansing and civil wars that tore apart the lives of ordinary people from the Baltic Sea to the Mediterranean, and the establishment of a new world order that finally brought stability to a shattered generation.\n\n\n\nFrom Keith Lowe, author of the critically acclaimed Inferno comes an 'extraordinary, disturbing and powerful' (Daily Mail) new history, Savage Continent: Europe in the Aftermath of World War II. The Second World War left Europe in chaos. Landscapes had been ravaged, entire cities razed and more than 35 million people killed. Across most of the continent, the institutions that we now take for granted - such as the police, the media, transport,local and national government - were either entirely absent or hopelessly compromised. Crime rates soared, economies collapsed, and the European population hovered on the brink of starvation.In this groundbreaking study of the years that followed the war, Keith Lowe describes a continent still racked by violence, where large sections of the population had yet to accept that the war was over. He outlines the warped morality and the insatiable urge for vengeance that were the legacy of the conflict. Based on original documents, interviews and scholarly literature in eight different languages, Savage Continent is a window on the brief, chaotic period between the end of World War II and the beginning of the Cold War. 'Deeply harrowing, distinctly troubling. Moving, measured and provocative. A compelling and plausible picture of a continent physically and morally brutalized by slaughter'\nDominic Sandbrook, Sunday Times 'Excellent', Independent 'Unbearable but essential. A serious account of things we never knew and our fathers would rather forget. Lowe's transparent prose makes it difficult to look away from a whole catalogue of horrors...you won't sleep afterwards. Such good history it keeps all the questions boiling in your mind', Scotsman Keith Lowe is widely recognized as an authority on the Second World War, and has often spoken on TV and radio, both in Britain and the United States. He is the author of the critically acclaimed Inferno: The Devastation of Hamburg, 1943 (Penguin). He lives in north London with his wife and two children.\n\n\n","torrent":{"xt":"urn:btih:f7983790c8d7eacf750f6d5ee6dd60a11fa237c7","amp;dn":"Savage+Continent+by+Keith+Lowe+-+ePub+-+velvetfog","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7983790c8d7eacf750f6d5ee6dd60a11fa237c7","infoHashBuffer":{"type":"Buffer","data":[247,152,55,144,200,215,234,207,117,15,109,94,230,221,96,161,31,162,55,199]},"announce":[],"urlList":[]}}