{"title":"101 Things to Do 'Til The Revolution - Claire Wolfe","uid":3921531,"size":59568910,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f80412832eb65b252bcae46cbc34d8c03aeeadbd&amp;dn=101+Things+to+Do+%5C%27Til+The+Revolution+-+Claire+Wolfe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"x_DontTreadOnMe_x","files":1,"time":1196822553,"description":"America is at that awkward stage. It&amp;#039;s too late to work within the system, but too early to shoot the bastards.\n\nOn the road to tyranny, we&amp;#039;ve gone so far that polite political action is as useless as a miniskirt in a convent. But most people are still standing around numb and confused, knowing somethings wrong with the country, but hoping it isn&amp;#039;t quite as bad as they&amp;#039;re beginning to suspect it is.\n\nSomethings eventually going to happen. Government will bloat until it chokes us to death, or one more tyrannical power grab will turn out to be one too many.\n\nThe &quot;revolution&quot; of the book title may never be a shooting war. I hope to hell it isn&amp;#039;t. But it will be a time of explosive change, of chaos, of entrenched power fighting for it&amp;#039;s life against the forces of freedom, or of power collapsing and leaving a vacuum. It will happen.\n\nThe ideas in this book mostly fall into three categories:\n# Self-liberation - things that are a good idea no matter what the government does or doesn&amp;#039;t do;\n# Monkey-wrenching - little irritants to help wake people up and bring the system down (bit by bit);\n# Preparation - things that could help you survive the worst of the mess, once the government&amp;#039;s fecal matter finally does hit the rotary airfoil.\n\n~~~\n\nI am always adding new things, so check this account often.\n\nVisit roguesci (dot) org (slash) theforum, and register, for the world&amp;#039;s longest running largest explosives and weapons forum on the web!","torrent":{"xt":"urn:btih:f80412832eb65b252bcae46cbc34d8c03aeeadbd","amp;dn":"101+Things+to+Do+%5C%27Til+The+Revolution+-+Claire+Wolfe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f80412832eb65b252bcae46cbc34d8c03aeeadbd","infoHashBuffer":{"type":"Buffer","data":[248,4,18,131,46,182,91,37,43,202,228,108,188,52,216,192,58,238,173,189]},"announce":[],"urlList":[]}}