{"title":"Love Drugs - Otto Snow","uid":4703593,"size":34839565,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f873eeb7f8cfe12ffbb0feaecc44a0d72dae157c&amp;dn=Love+Drugs+-+Otto+Snow&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"fdlmadness","files":2,"time":1233791962,"description":"Love Drugs is a sequel to Amphetamine Syntheses (2002) Expanded coverage of the synthesis of MDMA and other empathogens and stimulants.\nExpanding the chemistry of empathogens. MDMA from scratch. Small and large scale production is described in detail. Hot new formulas abound. Piperonyl-acetone from both safrol and isosafrol. Multiple reduction methods using common and locally available metals.\n\nMDA appeared in the 1960s and has been called the original love drug. It was the first in a series of molecules that produce empathy in humans. MDMA was appeared sporadically in the 1970s. MDEA followed ecstasy in the 1980s.\n\nThese molecules were controlled as they were being abused. Substituted phenyl amino-butanes have reduced abuse potential and greater safety margins. Yet, in 20 years, the development of safer entactogens has not taken place.\n\nLove Drugs gives the reader a look at the most innovative chemistry for entactogen production. Explicit descriptions on safrol, apiol, asarone, dimethoxyallybenzene, etc. extraction from multiple botanical sources. Reviews of conventional syntheses with tips from the original chemists. Love Drugs is an inside look into the chemistry of the entactogens, present and future. Reactions have been translated into English. Millions across the globe have used MDMA as a therapeutic tool.\n\nThere is an infinite number of new entactogens on the horizon. 150+ references. Color cover. UV Laminated. \n\nFrom the Publisher\nReactions Included are:\n\nPreparation and use of Raney Nickel Catalyst. Raney Raney Catalyst in the reduction of substituted phenyl-2-propanones. Preparation of 2,5-Dimethoxyphenylethylamine with palladium. Preparation of 2,5-DMA by the kilo using Raney Nickel. p-Methoxy-N-methylamphetamine preparation. Preparation of 3,4-Dimethyl-amphetamine. Preparation of Benzedrine. Construction of Apparatus for Catalytic Reduction. Reductions Using Palladium. Hydrogenations Using Platinum. Reductions Using Aluminum Amalgam.\n\nElectrolytic Preparation of substituted benzaldehydes from propenyl benzenes and benzoic acid. Gallic Acid from Tea Leaves.\n\nPreparation of Phenyl-2-Propanone from Ephedrine or pseudo-Ephedrine. Phenyl-2-propanones from Propenylbenzenes. Preparation of Palladium Chloride Catalyst.\tPhenyl-2-propanones from Allybenzenes. 3,4-Methylenedioxy-phenyl-2-propanone from 3,4-Methylenedioxy-phenylacetic Acid. 3,4-Methylenedioxyphenylacetic Acid Preparation from Safrol. Preparation of Phenylacetic Acid from Benzyl Cyanide. Preparation of 4-Methoxy-phenylacetic acld; 3,4-Dimethoxy-phenylacetic and 2,3-Dimethoxyphenylacetic acid. Preparation of Acetic Anhydride (several reactions described). Phenylacetaldehyde from Phenylglycidic acid or ester. Preparation of Phenyl-2-propanone from alpha-Methyl-B-(phenyl)-glycidic Acid. 3,4-Dimethoxyphenyl-2-propanone from 3,4-Dimethoxy-1,2-dihydroxypropane.\n\nGrignard Reactions: Preparation of Benzyl Magnesium Chloride Complex, Benzyl Methyl Ketone (P-2-P).\n\nPreparation of 1-Phenyl-2-propanone, 2,4-Dimethoxybenzylmethyl ketone. Preparation of Phenyl-2-propanones from Phenyl-nitropropenes. Phenyl-butanone from 1-Phenyl-2-nitro-1-butene.\n\nExtraction of Safrol from Botanicals; Asarum Arifolium; Asarum Blumei; Japanese Anise; Australian Sassafras; Daphnandra Aromatica; Cinnamomum cecicodaphne; Cinnamomum mercadoi; Cinnamomum oliveri; Cinnamomum parthenoxylon; Cinnamomum pedunculatum; Sassafras Root Bark; Doryphora Sassafras; Massoi Bark\n\nExtraction of Apiol from Botanicals; Parsley; Dill; Samphire\n\nAnethol from Pine Oil; Kobushi; Star Anise; Anise; Fennel; Sweet Cicely\n\nPreparation of 3,4-Dimethoxy-allybenzene from Botanicals; Melaleuca bracteata; 3,4-Dimethoxyphenylpropene from Eugenol.\n\nIsomerisation of Allybenzenes; 3,4-Dimethoxypropenylbenzene from 3,4-Dimethoxyallybenzene.\n\nEugenol from Botanicals: Cinnamomum culilawan; Cinnamomum pedatinervium; Cinnamomum tamala; Pimento; Pimento Leaf; Cloves.\n\nAsarone from Botanicals; Asarum Europaeum; Asarum Canadense.\n\nOxidation of 2,4,5-Trimethoxycinnamaldehyde into 2,4,5-Trimethoxybenzaldehyde.\n\nSeparation of Plant Oils by Steam Distillation; Construction of Apparatus; Operation and Purification.\n\nSassafras Oil; Extraction by Steam Distillation. Design and Construction of Volatile-Oil Stills.\n\nPreparation of Substituted Nitrostyrenes. Preparation of 2-Nitro-1-(2,5-Dimethoxy-4-Methylphenyl)-Butene-1.\n\nPreparation of Vanillin from Peat. Benzaldehyde from Toluene and Sulfuric Acid. Preparation of Benzyl Chloride from Toluene. Benzaldehyde from Benzal Chloride Using Hydrochloric Acid. Benzaldehyde from Benzal Chloride using Zinc Chloride. Manufacture of Benzaldehyde from Benzyl Chloride using Hexamine.\t Methylation of Hydroxybenzaldehydes.\n\nPrepartion of Piperonal. Preparation of Heliotropyl Chloride. Preparation of Protocatechualdehyde; p-Methoxybenzaldehyde. 2,5-Dimethoxybenzaldehyde Preparation. Preparation of 3,4,5-Trimethoxybenzaldehyde.\n\nPreparation of p-Methoxyphenylethylamine.\t Preparation of B-3-Methoxy-4: 5-methylenedioxyphenylethylamine. Preparation of Ally-phenylethylamines. Preparation of Piperonylidene-methylethyl-ketone.\n\nMethylamine Hydrochloride Preparation. Manufacture of Methylamine; Preparation of Acetamide. Preparation of Dimethyl Sulphate. Preparation of Nitroethane. Preparation of Tetranitromethane. Improved Preparation of Tetranitromethane\n\nd-Methamphetamine Separation from d,l-Methamphetamine. 2-Phenyl-3-aminobutane Preparation\n\nTableting of Phenylethylamines.\n\nLove Drugs is an assent and essential reading to anyone interested in the synthesis of MDMA, precursors and analogs.","torrent":{"xt":"urn:btih:f873eeb7f8cfe12ffbb0feaecc44a0d72dae157c","amp;dn":"Love+Drugs+-+Otto+Snow","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f873eeb7f8cfe12ffbb0feaecc44a0d72dae157c","infoHashBuffer":{"type":"Buffer","data":[248,115,238,183,248,207,225,47,251,176,254,174,204,68,160,215,45,174,21,124]},"announce":[],"urlList":[]}}