{"title":"WebDrive v9.02 - Both x86 &amp; x64 - South River - Cracked","uid":5250416,"size":16028081,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f8d44948ce2be5b3e19140549ab2af1a3ab03aa2&amp;dn=WebDrive+v9.02+-+Both+x86+%26+x64+-+South+River+-+Cracked&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bzowki","files":1,"time":1262320451,"description":"South River WebDrive v9.02 - Both x86 &amp; x64 Versions Included!\n\n\n    WebDrive is more than just an FTP Client. Unlike a typical FTP     \n    client, WebDrive allows you to open and edit server-based files    \n    without the additional step of downloading the file. Using a       \n    simple wizard, you assign a network drive letter to the FTP        \n    Server. By connecting through a virtual drive, there is no need    \n    to learn a separate FTP client interface. You access and edit      \n    files on the server the same way that you interact with files on   \n    your local PC.                                                     \n                                                                       \n    WebDrive supports additional protocols such as SFTP, WebDAV and    \n    Amazon S3. WebDrive can also connect to online storage services    \n    or your corporate SharePoint Server.                               \n                                                                       \n    Simple Set-up and Configuration                                    \n                                                                       \n    The WebDrive site manager makes it easy to define your             \n    connections. Just enter the server URL and your username and       \n    password and press &quot;connect,&quot; to map the selected drive letter to  \n    your server. You can map different directories on the same server  \n    to unique drive letters. This provides easier access to            \n    frequently updated directories. You can also map unique drive      \n    letters to different server types - one drive to an SFTP server,   \n    one to a WebDAV server and another to an FTP server or to Amazon   \n    Web Services. This functionality is not available in typical FTP   \n    software.                                                          \n                                                                       \n    Security Features                                                  \n                                                                       \n    WebDrive has built-in support for the industry standard SSL        \n    protocol. When used in conjunction with secure WebDAV, FTP, FTPS,  \n    or SFTP servers, WebDrive will open an encrypted tunnel between    \n    the client computer and the remote server; giving you secure       \n    transmission of critical data over the Internet. WebDrive can      \n    also be used as an alternative to a corporate VPN. Install the     \n    WebDrive client and an SSL enabled server, and WebDrive can act    \n    as the VPN for your company; an efficient alternative to an        \n    expensive VPN and non-secure FTP client connections.               \n                                                                       \n    Works from Within Your Favorite Applications                       \n                                                                       \n    Open your FTP files from a network drive. It's as easy as editing  \n    files in your &quot;My Documents&quot; FolderUse WebDrive to access and      \n    edit files on your server from within your favorite applications.  \n    Rather than launching an FTP Client or SFTP Client to update your  \n    files, just open the file directly from its folder on the server   \n    and the correct application will launch. When you are finished,    \n    simply click save from within the application. No additional       \n    steps to upload or download.                                       \n                                                                       \n    For example, you can open MS Word and access your FTP files from   \n    the &quot;Open&quot; menu item on the &quot;File&quot; menu. You can also open your    \n    recently edited files. Or use Microsoft Backup to create backups   \n    of your web site, by simply selecting the drive letter to be       \n    backed up.                                                         \n                                                                       \n    WebDrive works with all Windows applications                       \n                                                                       \n    Convenient Search Capability for Your Server Files                 \n                                                                       \n    WebDrive lets you search for files on your server using your       \n    desktop search software. If you use Google Desktop Search, or MSN  \n    Desktop Search, simply configure your search utility to index the  \n    files on the drive letter that WebDrive maps to your server.       \n    Imagine getting search results from your corporate FTP Server,     \n    your Apple iDisk Storage, and your local desktop in one search!    \n    DOS/Legacy Support (Command Line)                                  \n                                                                       \n    Once WebDrive has mapped a drive to your server, you can access    \n    it like a local drive. Use a DOS-prompt to use commands such as,   \n    copy, xcopy, mkdir, dir, move, etc.                                \n                                                                       \n                                                                       \n    Advanced Features...                                               \n                                                                       \n    - SFTP Support - Use WebDrive to connect to your SFTP/SSH server   \n      for fast, secure file access.                                    \n    - Amazon S3 Support - Use WebDrive to connect to your Amazon Web   \n      Services online storage account.                                 \n    - Microsoft FrontPage Support - Connect to any website running     \n      the Microsoft FrontPage extensions.                              \n    - Firewall/Proxy server support - Login through a variety of       \n      proxy servers and firewalls, including MS Proxy 2.0, SOCKS 4.3   \n      and SOCKS 5, and Raptor (gwpasswd).                              \n    - S/KEY Password Encryption - Use MD4 &amp; MD5 password encryption    \n      for supported FTP servers.                                       \n    - Foreign Language Support - Support for Far East languages, such  \n      as Japanese and Chinese, using DBCS.                             \n    - File Caching - WebDrive caches both file and directory listings  \n      for quick access. You can control the amount of disk space used  \n      for the cache, and whether to cache files, directory listings,   \n      or both.                                                         \n    - FTP resume interrupted download.                                 \n    - Support for Unix file attributes through an Explorer shell       \n      extension as well as a command line utility.                     \n    - Options to transfer files in ASCII/Binary mode based on file     \n      extension.                                                       \n                                                                       \n                                                                       \n    Changes in 9.02                                                    \n                                                                       \n    - Fixed: Windows 2000 issue that caused a dll dependency issue     \n      with crypt32.dll, this issue only effects Windows 2000           \n      platforms.                                                       \n                                                                       \n    Changes in 9.01                                                    \n                                                                       \n    - Added: ability to not test directory listing when connecting to  \n      FTP server for the cases where no LIST permissions are possible  \n      however upload permissions are. \n    - Fixed: Job scheduler was returning an &quot;access denied&quot; error on   \n      low privileged accounts.                                         \n    - Fixed: Intermittent Amazon S3 500 internal server errors.        \n      According to Amazon it's expected that their server will return  \n      this error occasionally and the recommended work around is to    \n      have the client resubmit the command after a pause.  WebDrive    \n      will now retry the command up to &quot;File transfer retry limit&quot;     \n      times and pause 2 seconds between attempts.                      \n    - Fixed: Data Execution Prevention feature of Windows would in     \n      some cases cause webdrive.exe application to terminate when the  \n      popup window was displayed.                                      \n    - Fixed: Amazon S3 duplicate folders being shown.                  \n    - Fixed: Amazon S3 display proper file modification date when      \n      given by the server.                                             \n    - Fixed: VMS FTP Server rename folder issue when moving/renaming   \n      a folder or file to a different location.  \n\n\n*** I compiled this package is because the ONLY torrent that I could find for this application had 39 Peers and 0 seeds as of 12/31/09.  When I tried to download it, all connections only had 95.9% complete.  Luckily, I was able to extract the patch from the download, download the x32 &amp; x64 clients from the internet, test and document it, then create this package.\n\nThe patch was taken from a torrent posted by TEAM BLZ whom I am not associated with.\n\nEnjoy!","torrent":{"xt":"urn:btih:f8d44948ce2be5b3e19140549ab2af1a3ab03aa2","amp;dn":"WebDrive+v9.02+-+Both+x86+%26+x64+-+South+River+-+Cracked","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8d44948ce2be5b3e19140549ab2af1a3ab03aa2","infoHashBuffer":{"type":"Buffer","data":[248,212,73,72,206,43,229,179,225,145,64,84,154,178,175,26,58,176,58,162]},"announce":[],"urlList":[]}}