{"title":"Cold War Kids - Hold My Home (2014) [FLAC]","uid":11299192,"size":274785558,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f91211f2731215514d65a1535e6473fb3a3e4106&amp;dn=Cold+War+Kids+-+Hold+My+Home+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"politux","files":-1,"time":1414368134,"description":"\n  Cold War Kids - Hold My Home (2014) [FLAC]\n\n  Genre: Rock\n  Style: Indie, Alternative\n  Source: WEB\n  Codec: FLAC\n  Bit rate: ~ 1,000 kbps\n  Bit depth: 16\n  Sample rate: 44.1 kHz\n  \n  01 All This Could Be Yours \n  02 First \n  03 Hot Coals \n  04 Drive Desperate \n  05 Hotel Anywhere \n  06 Go Quietly \n  07 Nights &amp; Weekends \n  08 Hold My Home \n  09 Flower Drum Song \n  10 Harold Bloom \n  11 Hear My Baby Call \n\n  Between their strong comeback with Dear Miss Lonelyhearts, the promising side project French Style Furs, and Hold My Home, Cold War Kids had a creative rebirth in the mid-2010s. Recorded at their own studio, the band's fifth album is charged with an intimacy and intensity that began returning to their music with Lonelyhearts. Hold My Home is even more assertive than that album, with an opening trio of songs that rank among Cold War Kids' finest. They own their anthemic power on the brash &quot;All This Could Be Yours&quot; and &quot;First,&quot; even though the song's rousing stomps and claps are at odds with Nathan Willett's uncertainty. Willett and company play with this ambivalence even more expertly on &quot;Hot Coals,&quot; where he grapples with masculinity and emotions via pithy words (&quot;What ever happened to the strong, silent type?&quot;) and punchy sounds, and later on the soulful tug-of-war between love and freedom &quot;Go Quietly.&quot; The rest of Hold My Home is nearly as strong, with Cold War Kids accomplishing many of the things they've strived for on their previous albums. &quot;Flower Drum Song&quot; is a reminder of just how powerful their music is when they hit the sweet spot between ambitious and overwrought, while the seductive keyboards and female backing vocals on &quot;Nights &amp; Weekends&quot; put some slink in their stride. Overall, the band sounds even more natural than they did on Dear Miss Lonelyhearts, whether on the appealingly garagey title track or &quot;Hear My Baby Call,&quot; which incorporates soul and R&amp;B influences effortlessly. This is some of Cold War Kids' best work since Robbers &amp; Cowards, largely and somewhat paradoxically because they've shed a lot of their early theatricality (though song titles like &quot;Harold Bloom&quot; show they haven't lost their literary bent entirely). With Hold My Home, they emerge as a more straightforward band, and also a more confident and engaging one","torrent":{"xt":"urn:btih:f91211f2731215514d65a1535e6473fb3a3e4106","amp;dn":"Cold+War+Kids+-+Hold+My+Home+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f91211f2731215514d65a1535e6473fb3a3e4106","infoHashBuffer":{"type":"Buffer","data":[249,18,17,242,115,18,21,81,77,101,161,83,94,100,115,251,58,62,65,6]},"announce":[],"urlList":[]}}