{"title":"ML for the Working Programmer - Lawrence C. Paulson.djvu","uid":8654183,"size":5616394,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f92c391d7c6eb50af61fd973a30910c44a105de8&amp;dn=ML+for+the+Working+Programmer+-+Lawrence+C.+Paulson.djvu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"moebanzor","files":1,"time":1373175320,"description":"ML for the Working Programmer\nLawrence C Paulson\n\nPublication Date: June 28, 1996 | ISBN-10: 052156543X | ISBN-13: 978-0521565431 | Edition: 2\nThe new edition of this successful and established textbook retains its two original intentions of explaining how to program in the ML language, and teaching the fundamentals of functional programming. The major change is the early and prominent coverage of modules, which the author extensively uses throughout. In addition, Paulson has totally rewritten the first chapter to make the book more accessible to students who have no experience of programming languages. The author describes the main features of new Standard Library for the revised version of ML, and gives many new examples, e.g. polynomial arithmetic and new ways of treating priority queues. Finally he has completely updated the references. Dr. Paulson has extensive practical experience of ML, and has stressed its use as a tool for software engineering; the book contains many useful pieces of code, which are freely available (via Internet) from the author. He shows how to use lists, trees, higher-order functions and infinite data structures. He includes many illustrative and practical examples, covering sorting, matrix operations, and polynomial arithmetic. He describes efficient functional implementations of arrays, queues, and priority queues. Larger examples include a general top-down parser, a lambda-calculus reducer and a theorem prover. A chapter is devoted to formal reasoning about functional programs. The combination of careful explanation and practical advice will ensure that this textbook continues to be the preferred text for many courses on ML for students at all levels.\n","torrent":{"xt":"urn:btih:f92c391d7c6eb50af61fd973a30910c44a105de8","amp;dn":"ML+for+the+Working+Programmer+-+Lawrence+C.+Paulson.djvu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f92c391d7c6eb50af61fd973a30910c44a105de8","infoHashBuffer":{"type":"Buffer","data":[249,44,57,29,124,110,181,10,246,31,217,115,163,9,16,196,74,16,93,232]},"announce":[],"urlList":[]}}