{"title":"Cindy Crawford - Shape your body","uid":5728902,"size":4467832832,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:f98d72539e954abd6f9d01c45d2f899e8882a4b3&amp;dn=Cindy+Crawford+-+Shape+your+body&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bassie-adriaan","files":38,"time":1280576789,"description":"Editorial Reviews\nAmazon.com\nAt a time when we know so much about choosing safe, effective exercises, reissuing Cindy Crawford's 1992 best-selling disaster, Shape Your Body, is inexcusable. Swimsuit-clad Cindy puts herself through flings and gyrations that show off her body but aren't any good for anyone else's. She presents one after another of the exercises that fitness professionals threw out of their routines two decades ago because they're ineffective and risky to back and joints. Her alignment is awful; her control nonexistent. She rounds her back and flings her leg into high kicks. She does squats letting her knees go way past her toes. Even when the exercises are decently chosen and performed, she does them much too quickly, relying on momentum instead of muscle power, such as two-second bent-over rows. Trainer Radu, who designed and coached this workout, should be sentenced to an eternity of fast donkey kicks, leg swings, and trunk circles.\nThis &quot;toning&quot; video would be a joke, except that you really could get hurt following it. In fact, when Shape Your Body first came out, fitness expert Peg Jordan, author of Fitness Instinct, appeared on CNN warning viewers about the risks of this video. &quot;I received a call from a chiropractor who had treated 12 patients' back injuries from that video alone!&quot; she recalls. If you've got to have this one, watch it only, don't do it. --Joan Price","torrent":{"xt":"urn:btih:f98d72539e954abd6f9d01c45d2f899e8882a4b3","amp;dn":"Cindy+Crawford+-+Shape+your+body","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f98d72539e954abd6f9d01c45d2f899e8882a4b3","infoHashBuffer":{"type":"Buffer","data":[249,141,114,83,158,149,74,189,111,157,1,196,93,47,137,158,136,130,164,179]},"announce":[],"urlList":[]}}