{"title":"Osho_The Last Testament Vol-1 #25_with photojournalist.mp4","uid":15180907,"size":519901925,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:f9bb8fb405d405c41113d9459abcd7bea4eb6aa5&amp;dn=Osho_The+Last+Testament+Vol-1+%2325_with+photojournalist.mp4&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"drugarica","files":1,"time":1467455730,"description":"Osho_The Last Testament, Vol 1, Chapter #25\r\n11 August 1985 pm in Jesus Grove,US\r\nLength: \t51 mins\r\n\r\nINTERVIEWS WITH HELMUT WERB, PHOTOJOURNALIST WITH: ROCK STAR, ITALY; MUSIC EXPRESS, GERMANY, HOLLAND; O'KEG, SWEDEN; MUSIC MAN, AUSTRIA; FI, ENGLAND; CONCRETE, MEXICO\r\n\r\nQ: I'M WORKING FOR TWELVE DIFFERENT MAGAZINES IN EUROPE AND AUSTRALIA. I ASKED EVERY SINGLE MAGAZINE TO SUBMIT ONE QUESTION, WHICH I THEN RELAY TO YOU. SO SOME OF THE QUESTIONS WILL BE DIRECTLY FROM THE MAGAZINES; ROUGHLY ONE-THIRD ARE MY OWN QUESTIONS. SOME OF THE QUESTIONS ARE VERY SIMPLE, SOME OF THEM WILL BE CONTROVERSIAL...\r\n\r\nA: I will make the simple ones also controversial.\r\n\r\nQ: SEVERAL NEWSPAPERS IN NEW YORK, UNITED STATES, REPORTED THAT THE NUMBER OF RAJNEESHEES WORLDWIDE ARE DECLINING, AND THAT YOU'RE SLOWLY RUNNING OUT OF RESOURCES. NOW AFTER SEVERAL YEARS OF SILENCE YOU HAVE STARTED TALKING AGAIN, YOU STARTED GIVING INTERVIEWS, YOU STARTED TO TALK WITH THE DISCIPLES. IS THIS PART OF A MEMBERSHIP DRIVE, OR IS IT JUST YOUR WISH TO COMMUNICATE?\r\n\r\nA: In the first place, sannyasins are increasing all over the world, so there is no question of their decrease. Secondly, I don't believe in converting anybody. I believe that the very effort to convert somebody is trespassing his freedom, his being.\r\nI can say what I want to say, but there is no effort to convert anybody to sannyas. In my whole life, I have never converted a single person to sannyas.\r\n......................\r\nI was not in the world one day, and the world has been here for millennia. Nobody asks me: &quot;Bhagwan, what have You done when You were not here for the world?&quot; Nobody asks that question. It is as relevant as the other question. One is about the past, when I was not here; one is about the future when I will not be here. But both are absolutely meaningless. I am here -- that is the only place; and I am now, that is the only time. And I don't care anything. I am not going to write a will that somebody should be my successor.\r\nThere is no need. I give freedom,...\r\n....................................\r\nQ: THE PRINCE OF HANOVER WAS ONE OF YOUR FAVORITE SANNYASINS. HE WAS VERY ILL, AND THERE IS A RUMOR THAT YOU ASKED TO CUT THE OXYGEN TO SHORTEN HIS SUFFERING. HOW DO YOU FEEL ABOUT HELPING PEOPLE TO DIE IN INDIVIDUAL CASES?\r\nA: That rumor is absolutely wrong. Do you think if the rumor had any evidence then the royal family of Germany would have remained silent? And the father of the Prince, the mother of the Prince were present at the funeral in India. The brother of the Prince was there, the wife of the Prince was there, the daughter of the Prince was there....\r\n...................................\r\nQ: IN AN INTERVIEW WITH AN AMERICAN NEWSPAPER, YOUR FORMER RANCH MANAGER BOB HARVEY, SAID THAT HE RESTORED SEVERAL MINES ON YOUR REQUEST ON THE GROUNDS OF THE RANCH -- THE OUINNS* MINE, FOR EXAMPLE. WHAT IS IN THESE MINES? AND IS IT CORRECT WHAT SANNYASIN DHYAN JOHN SAID THAT YOU; HAVE BUILT A KALI TEMPLE?\r\nA: That is absolutely wrong. Because in those three and half years while this man Bob Harvey was here, I was silent. I spoke only to Sheela. I never instructed him. That's absolutely wrong;....\r\nfree download of Osho audios and books from oshoworld(dot)com","torrent":{"xt":"urn:btih:f9bb8fb405d405c41113d9459abcd7bea4eb6aa5","amp;dn":"Osho_The+Last+Testament+Vol-1+%2325_with+photojournalist.mp4","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9bb8fb405d405c41113d9459abcd7bea4eb6aa5","infoHashBuffer":{"type":"Buffer","data":[249,187,143,180,5,212,5,196,17,19,217,69,154,188,215,190,164,235,106,165]},"announce":[],"urlList":[]}}