{"title":"The Private Afternoons Of Pamela Mann","uid":13927293,"size":1741131504,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:f9cd6686a1bca70a172ecd113cc8a42d2a0e5d8e&amp;dn=The+Private+Afternoons+Of+Pamela+Mann&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"distinc","files":1,"time":1458392045,"description":".......:::Screenshots:::.......\r\n\r\n \nhttp://imagedisco.net/?v=3945045071\r\n \nhttp://imagedisco.net/?g=3949855128\r\n\r\n\r\n\r\nDescription:\r\n\r\n\r\nClassy pornography supremo – Radley Metzger – delivers this hard core classic, widely regarded as one of the best Golden Era of Porn movies.\r\nMr Mann contacts an unnamed Private Investigator to trail his wife Pamela, whom he suspects of fooling around with guys behind his back. His investigations show that Pamela is indeed messing around. She picks up a stranger and gives him head so deep she makes Linda Lovelace look like an amateur performer.\r\nThere are sapphic shenanigans with Georgina Spelvin (her of The Devil in Miss Jones fame), sexual goings on with a politician who is a moral campaigner, gang rape by the notorious Jamie Gillis and pal. However it is revealed that everything Pamela did was staged and arranged to spice up her marriage!\r\nThe film is beautifully shot and very well acted – featuring some of the greatest performers in the hardcore pornography business. It is quite a complex film for a porno and is worth repeated viewings, not just to perv at the sex scenes but also to enjoy the intricate structure of the movie. Radley Metzger directed about 5 or 6 hardcore pornos and they are all uniformly excellent (The Opening of Misty Beethoven and The Image among them). His softcore work – especially The Lickerish Quartet – is as sexy and enjoyable as his hardcore oeuvre","torrent":{"xt":"urn:btih:f9cd6686a1bca70a172ecd113cc8a42d2a0e5d8e","amp;dn":"The+Private+Afternoons+Of+Pamela+Mann","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9cd6686a1bca70a172ecd113cc8a42d2a0e5d8e","infoHashBuffer":{"type":"Buffer","data":[249,205,102,134,161,188,167,10,23,46,205,17,60,200,164,45,42,14,93,142]},"announce":[],"urlList":[]}}