{"title":"Bayside - Sirens And Condolences","uid":4267375,"size":57495217,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f9da2a6466c91745a4019b0ac56b6624f4d14009&amp;dn=Bayside+-+Sirens+And+Condolences&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"billy_stretcher","files":14,"time":1214762341,"description":"Bayside\nSirens And Condolences\nEmo/Rock\n2004\n192Kbps CBR\n\n---------------------------------------------------------------------\n                       Tracklisting\n---------------------------------------------------------------------\n\n   1. (00:03:45) Bayside - Masterpiece\n   2. (00:03:32) Bayside - Poison In My Veins\n   3. (00:03:23) Bayside - Phone Call From Poland\n   4. (00:03:38) Bayside - Talking Of Michelangelo\n   5. (00:03:03) Bayside - Alcohol And Altar Boys\n   6. (00:05:30) Bayside - Synonym For Acquiesce\n   7. (00:04:05) Bayside - How To Fix Everything\n   8. (00:02:36) Bayside - Kellum\n   9. (00:03:05) Bayside - If You&amp;#039;re Bored\n  10. (00:03:36) Bayside - Just Enough To Love\n  11. (00:03:39) Bayside - Guardrail\n\nIncluded.............: NFO, M3U\n\nCovers...............: Front \n\nPlaying Time.........: 00:38:32\n\nTotal Size...........: 54.8 MB\n\nWhen Bayside sings of devastation and betrayal in songs like &quot;How To Fix Everything&quot; and &quot;Guardrail&quot; the emphasis is always placed equally on all parties involved. Honest self-examination, no matter how painful, brings a hope of redemption to these intimate, dark narratives of brooding and despair. &quot;I&amp;#039;m ready to take that big step, start tearing off the layers I put up, or is it too late to be anything but what I am&quot; from &quot;How To Fix Everything&quot; is a telling lyric, as it illustrates the loathing of a broken, insular heart suddenly turning inward, and finding that the blame lies inside. &quot;Masterpiece&quot; begs a friend to &quot;Just accept yourself...find something that brings you closer to complete.&quot; Though their experiences in life have tested them, Bayside has found a way to complete themselves through the writing of meaningful lyrics and beautiful melodies, accompanied by touring and the love of music. \n\nBayside formed in Long Island, NY during the winter of 2000, after the requisite line-up changes of a young band were settled, they moved rapidly, establishing a fan base on the East Coast and touring North America. While still a very young band, Bayside began to catch the attention of various tastemakers, appearing on &quot;From Brooklyn With Love,&quot; a compilation benefiting the victims of September 11th along with Taking Back Sunday, Brand New and The Reunion Show. Bayside recorded for the Dying Wish label in 2003 - the word was spreading, as the EP sold over 4,000 copies with no formal distribution and the band received in excess of 30,000 hits at mp3.com. Soon they were invited to contribute a song to &quot;Bad Scene, Everybody&amp;#039;s Fault,&quot;. \n\nThe exposure and great press from magazines like Alternative Press and Skratch brought Bayside to the attention of Victory Records, who signed the band in the fall of 2003 and encouraged them to record as soon as possible. J. Robbins was chosen to produce; the combination of his work in seminal, proto-emo band Jawbox and his production track record with bands like Hey Mercedes, The Promise Ring and Jets to Brazil was too much for the band to resist. &quot;J. understood our vision, and with his experience on both sides of the board, he helped us expand on it. Music is very meaningful to us, he helped us perform on the edge emotionally, without losing our accessibility and pop sensibilities,&quot; said Anthony. \n\nWhen asked about the darkness and melancholy expressed on &quot;Sirens and Condolences,&quot; singer/guitarist Anthony remarked, &quot;We are sort of morbid, masochistic people. We aren&amp;#039;t just writing for shock value.&quot; Songwriter/bassist Andrew is an amazingly prolific songwriter, with notebooks filled with lyrics. He explained, &quot;A lot of these songs are written about stuff that happened years ago, I want to acknowledge it without necessarily moving past it completely. I used to lash out at others until I realized I was mad at myself - on these songs, I feel that I am recognizing the old pattern and trying to change it.&quot; Anthony handles the musical chores, writing the melodies on acoustic guitar and arranging new songs on his four track for the band to hear. Jack adds his signature guitar solos and leads to fill out the songs after Anthony completes their structure, while Jim&amp;#039;s driving rhythmic foundation provides the backdrop for Bayside&amp;#039;s dynamic arrangements. The unique phrasing on &quot;Sirens and Condolences&quot; is Anthony&amp;#039;s work; he adapts Andrew&amp;#039;s lyrics syllabically to his melodies. &quot;The most important thing in a song is melody, specifically vocal melodies. I try to make the words fit what I already have in my head. I want to create phrasing that is a little different from the norm, but still showcases the melody.&quot; \n\nEnjoy! :)","torrent":{"xt":"urn:btih:f9da2a6466c91745a4019b0ac56b6624f4d14009","amp;dn":"Bayside+-+Sirens+And+Condolences","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9da2a6466c91745a4019b0ac56b6624f4d14009","infoHashBuffer":{"type":"Buffer","data":[249,218,42,100,102,201,23,69,164,1,155,10,197,107,102,36,244,209,64,9]},"announce":[],"urlList":[]}}