{"title":"Green Lantern v4 01-67 (2005-2010, Dgtl, JK+Monafekk-E)","uid":9516413,"size":2180107875,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:fa87b41c1ca9681d233e16a15c672b0a1cc15757&amp;dn=Green+Lantern+v4+01-67+%282005-2010%2C+Dgtl%2C+JK%2BMonafekk-E%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1390530335,"description":"This is the entirely of Geoff Johns' astounding run on Green Lantern, prior to the New 52 reboot in 2011. Every issue is in pristine digital form - all except the Blackest Night tie-ins are courtesy of JK-Empire, while those issues (43-52) are provided courtesy of Monafekk-Empire.\n\nWhile this volume of Green Lantern is heavily tied to various major events - Sinestro Corps War, Blackest Night and War of the Lanterns, to name a few - I think collecting the whole run in digital is worth it even it can be a bit confusing sometimes. What Johns accomplishes here is remarkable; following the events of rebirth, he almost totally rebuilds the Green Lantern Corps from scratch while giving us key new characters like Atrocitus and Larfleeze. Along the way, we get the ultimate Sinestro stories, the Secret Origin of Hal Jordan which retells his start for the modern era, a look back at Abin Sur before his death, a completely new take on the former yelllow impurity of the GL rings, and not to mention an entirely new league of Lanterns that represent nearly every bit of the emotional and color spectrums! Johns' takes on each of the core four human Green Lanterns is true to their previously established natures while being inspired and taking them in bold new directions - the same is true for his world-building of Oa, the new Guardians, the power rings, and much more. Sinestro in particularly is given a lot of depth here; he becomes a smart and lethal Machiavellian villain whose every action is understandable and justifiable given his particular experiences. There are many jaw-dropping set-pieces and &quot;holy shit!&quot; panels, and sometimes surprising moments of subtlety and examining relationships between these characters in the face of spectacular cosmic events. Johns also doesn't ignore the &quot;routine&quot; patrol life of the Lanterns, and uses a few of the Corps to explore themes such as duty, loneliness and isolation, insanity, and of course fear - the greatest weakness of a Lantern.\n\nEnough of my rambling; I hope you enjoy this set very much and PLEASE continue to seed; I will do so indefinitely. In brightest day, in blackest night...","torrent":{"xt":"urn:btih:fa87b41c1ca9681d233e16a15c672b0a1cc15757","amp;dn":"Green+Lantern+v4+01-67+%282005-2010%2C+Dgtl%2C+JK%2BMonafekk-E%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa87b41c1ca9681d233e16a15c672b0a1cc15757","infoHashBuffer":{"type":"Buffer","data":[250,135,180,28,28,169,104,29,35,62,22,161,92,103,43,10,28,193,87,87]},"announce":[],"urlList":[]}}