{"title":"WWE Smackdown Live 08.16.16","uid":15582066,"size":2258406400,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:faca1dc64d6ad0d569bdd029cc243da82d474dd4&amp;dn=WWE+Smackdown+Live+08.16.16&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Likhit789","files":4,"time":1471423618,"description":"WWE SmackDown, known as SmackDown Live or simply SmackDown, is a professional wrestling television program that debuted on August 26, 1999. The show's name is also used to refer to the SmackDown brand, in which WWE employees are assigned to work and perform on that program; the other program and brand currently being Raw.\r\n\r\nPrior to September 1, 2005, SmackDown! was broadcast on Thursday nights; from September 9, 2005 to January 9, 2015, it was broadcast on Friday nights. The show then returned to Thursday nights on January 15, 2015,[8] before moving to a live Tuesday night broadcast in July 2016. SmackDown! originally debuted in the United States on the UPN television network on April 29, 1999, but after the merger of UPN and the WB, SmackDown! began airing on The CW in September 2006. The show remained on the CW network for two years until it was moved to MyNetworkTV in October 2008.[9][10] SmackDown moved to Syfy on October 1, 2010 and remained there until December 31, 2015.[11][12] A week later, on January 7, 2016, SmackDown moved to its sister channel, USA Network.[4][5][6] It complements Raw as the second of WWE's two main weekly programs.\r\n\r\nIn its history, SmackDown has been broadcast from 162 different arenas, in 147 cities and towns, in seven different nations (the United States, Canada, the United Kingdom, Iraq in 2006 and 2007 for Tribute to the Troops, Japan in 2005, Italy in 2007, and Mexico in 2011). Due to time differences, SmackDown premieres a few hours earlier in Ireland and the United Kingdom and a day earlier in Australia, Canada, Singapore, and Philippines than the United States, except for live episodes. For international broadcast listings, see below. The show celebrated its 15th anniversary on October 10, 2014.[13]\r\n\r\nAs of July 19, 2016, SmackDown is broadcast live on Tuesday nights.[14]","torrent":{"xt":"urn:btih:faca1dc64d6ad0d569bdd029cc243da82d474dd4","amp;dn":"WWE+Smackdown+Live+08.16.16","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"faca1dc64d6ad0d569bdd029cc243da82d474dd4","infoHashBuffer":{"type":"Buffer","data":[250,202,29,198,77,106,208,213,105,189,208,41,204,36,61,168,45,71,77,212]},"announce":[],"urlList":[]}}