{"title":"Culture - Two Sevens Clash (The 30th Anniversary Edition)","uid":5373064,"size":397741820,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:fb3ff97e7e8b621e7184c614b2d91f44a28ea9c5&amp;dn=Culture+-+Two+Sevens+Clash+%28The+30th+Anniversary+Edition%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"jokersmoker","files":16,"time":1266492352,"description":"One of the masterpieces of the roots era, no album better defines its time and place than Two Sevens Clash, which encompasses both the religious fervor of its day and the rich sounds of contemporary Jamaica. Avowed Rastafarians, Culture had formed in 1976, and cut two singles before beginning work on their debut album with producers the Mighty Two (aka Joe Gibbs and Errol Thompson). Their second single, &quot;Two Sevens Clash,&quot; would title the album and provide its focal point. The song swept across the island like a wildfire, its power fed by the apocalyptic fever that held the island in its clutches throughout late 1976 and into 1977. (Rastafarians believed the apocalypse would begin when the two sevens clashed, with July 7, 1977, when the four sevens clashed, the most fearsome date of concern.) However, the song itself was fearless, celebrating the impending apocalypse, while simultaneously reminding listeners of a series of prophesies by Marcus Garvey and twinning them to the island's current state. For those of true faith, the end of the world did not spell doom, but release from the misery of life into the eternal and heavenly arms of Jah. Thus, Clash is filled with a sense of joy mixed with deep spirituality, and a belief that historical injustice was soon to be righted. The music, provided by the Revolutionaries, perfectly complements the lyrics' ultimate optimism, and is quite distinct from most dread albums of the period. \n\nAlthough definitely rootsy, Culture had a lighter sound than most of their contemporaries. Not for them the radical anger of Black Uhuru, the fire of Burning Spear (although Hill's singsong delivery was obviously influenced by Winston Rodney), nor even the hymnal devotion of the Abyssinians. In fact, Clash is one of the most eclectic albums of the day, a wondrous blend of styles and sounds. Often the vocal trio works in a totally different style from the band, as on &quot;Calling Rasta Far I,&quot; where the close harmonies, dread-based but African-tinged, entwine around a straight reggae backing. Several of the songs are rocksteady-esque with a rootsy rhythm, most notably the infectious &quot;See Them Come&quot;; others are performed in a rockers style, with &quot;I'm Alone in the Wilderness&quot; an exquisite blend of guitar and vocal harmonies. One of the best tracks, &quot;Get Ready to Ride the Lion to Zion,&quot; is a superb hybrid of roots, rocksteady, and burbling electro wizardry; its roaring lion (created who knows how) is a brilliant piece of musical theater. &quot;Natty Dread Take Over&quot; twines together roots rhythms, close harmonies, and big-band swing, while even funk and hints of calypso put in appearances elsewhere on the album. Inevitably, the roots genre was defined by its minor-key melodies, filled with a sense of melancholy, and emphasized by most groups' lyrics. But for a brief moment, roots possibilities were endless. Sadly, no other group followed Culture's lead, and even the trio itself did not take advantage of it, especially after parting ways with Gibbs. When Culture re-emerged in the mid-'80s, they swiftly moved into a reggae lite/world music mode a world apart from where they started. Thus, Clash remains forever in a class all its own. [Shanachie issued a 30th anniversary edition of the album in 2007 that adds expanded liner notes and five extra tracks made up of dubs and 12&quot; mixes.] ~ Jo-Ann Greene, All Music Guide\nTwo Sevens Clash (The 30th Anniversary Edition) Track ListingTrack# Title time lyrics 1 I'm Alone in the Wilderness 3:23 \n\n2 Pirate Days 2:49 \n\n3 Two Sevens Clash 3:28 \n\n4 Calling Rastafari 2:27 \n\n5 I'm Not Ashamed 3:59 \n\n6 Get Ready to Ride the Lion to Zion 3:24 \n\n7 Black Starliner Must Come 2:39 \n\n8 Jah Pretty Face 3:37 \n\n9 See Them a Come 3:20 \n\n10 Natty Dread Taking Over 3:45 \n\n11 See dem a Come (12&quot; Mix) 6:56 \n\n12 See dem Dub 3:58 \n\n13 Natty Dread Taking Over (! 2&quot; Mix) 7:20 \n\n14 I'm Not Ashamed (12&quot; Mix) 7:55 \n\n15 Not Ashamed Dub 4:25 \n\nCredits of Two Sevens Clash (The 30th Anniversary Edition)Herman Marquis Sax (Alto) Tommy McCook Sax (Tenor) Errol Nelson Keyboards Lloyd Parks Bass Robbie Shakespeare Guitar Sticky Percussion Errol Thompson Arranger, Producer Robert Vosgien Digital Remastering Franklyn Waul Keyboards Albert Walker Harmony Vocals Randall Grass Liner Notes Kate Simon Photography Eric &quot;Bingy Bunny&quot; Lamont Guitar LoeÃƒÂ­en Babajian Design E.T. Remixing Joe Gibbs Arranger, Producer, Engineer, Liner Notes, Remixing Harold Butler Keyboards Kenneth Lloyd Dayes Harmony Vocals Sly Dunbar Drums Bobby Ellis Trumpet Vin Gordon Trombone Lennox Gordon Guitar Joseph Hill Vocals Lenny Kaye Liner Notes \n\n\n\nEnjoyyy and Seed .","torrent":{"xt":"urn:btih:fb3ff97e7e8b621e7184c614b2d91f44a28ea9c5","amp;dn":"Culture+-+Two+Sevens+Clash+%28The+30th+Anniversary+Edition%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb3ff97e7e8b621e7184c614b2d91f44a28ea9c5","infoHashBuffer":{"type":"Buffer","data":[251,63,249,126,126,139,98,30,113,132,198,20,178,217,31,68,162,142,169,197]},"announce":[],"urlList":[]}}