{"title":"India Since Independence (Revised Edition)- Bipan Chandra [Epub ","uid":10254437,"size":2636001,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fb8622a9eeb05fb256929561223c8da96e8ba567&amp;dn=India+Since+Independence+%28Revised+Edition%29-+Bipan+Chandra+%5BEpub+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"krystine","files":-1,"time":1401391968,"description":"India Since Independence\nAuthor: Bipan Chandra\nPublished: 2008\nPublisher: Penguin\nISBN: 9788184750539\nFormat: Retail Epub and Mobi\nReader Required:\nEpub- Adobe Digital Editions, Calibre, MoonReader for Android\nMobi- Kindle app, Calibre, MoonReader for Android\n\n\nA thorough and incisive introduction to contemporary India The story of the forging of India, the world's largest democracy, is a rich and inspiring one. This volume, a sequel to the best-selling India's Struggle for Independence, analyses the challenges India has faced and the successes it has achieved, in the light of its colonial legacy and century-long struggle for freedom. The book describes how the Constitution was framed, as also how the Nehruvian political and economic agenda and basics of foreign policy were evolved and developed. It dwells on the consolidation of the nation, examining contentious issues like party politics in the Centre and the states, the Punjab problem, and anti-caste politics and untouchability. This revised edition offers a scathing analysis of the growth of communalism in India and the use of state power in furthering its cause. It also documents the fall of the National Democratic Alliance in the 2004 General Elections, the United Progressive Alliance's subsequent rise to power and the Indo-US Nuclear Deal that served to unravel the political consensus at the centre. Apart from detailed analyses of Indian economic reforms since 1991 and wide-ranging land reforms and the Green Revolution, this new edition includes an overview of the Indian economy in the new millennium. These, along with objective assessments of Jawaharlal Nehru, Indira Gandhi, Jayaprakash Narayan, Lal Bahadur Shastri, Rajiv Gandhi, Vishwanath Pratap Singh, Atal Bihari Vajpayee and Manmohan Singh, constitute a remarkable overview of a nation on the move.","torrent":{"xt":"urn:btih:fb8622a9eeb05fb256929561223c8da96e8ba567","amp;dn":"India+Since+Independence+%28Revised+Edition%29-+Bipan+Chandra+%5BEpub+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb8622a9eeb05fb256929561223c8da96e8ba567","infoHashBuffer":{"type":"Buffer","data":[251,134,34,169,238,176,95,178,86,146,149,97,34,60,141,169,110,139,165,103]},"announce":[],"urlList":[]}}