{"title":"Audio book : Richard Dawkins - The Ancestors Tale","uid":4570996,"size":128892787,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:fbbfcf529499167f48dcc83505fcb00ff0aeca83&amp;dn=Audio+book+%3A+Richard+Dawkins+-+The+Ancestors+Tale&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"LetThemEatCake","files":20,"time":1229056101,"description":"Book Description\nThe Ancestor's Tale is a pilgrimage back through time; a journey on which we meet up with fellow pilgrims along the route as we and they converge on our common ancestors. Chimpanzees join us at about 6 million years in the past, gorillas at 7 million years, orang utans at 14 million years, as we stride on together, a growing band. The journey provides the setting for a collection of some 40 tales. Each explores an aspect of evolutionary biology through the stories of characters met along the way or glimpsed from afar - the Elephant Bird's Tale, the Marsupial Mole's Tale, the Coelacanth's Tale. Together they give a deep understanding of the processes that have shaped life on Earth: convergent evolution, the isolation of populations, continental drift, the great extinctions. The tales are interspersed with prologues detailing the journey, route maps showing joining lineages, and life-like reconstructions of our common ancestors. The Ancestor's Tale represents a pilgrimage on an unimaginable scale: our goal is four billion years away, and the number of pilgrims joining us grows vast - ultimately encompassing all living creatures. At the end of the journey lies something remarkable in its simplicity and transformative power: the first, humble, replicating molecules. \n\n &lt;a href=&quot;\nhttp://www.amazon.co.uk/exec/obidos/ASIN/0752873210/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.co.uk/exec/obidos/ASIN/0752873210/&lt;/a&gt;","torrent":{"xt":"urn:btih:fbbfcf529499167f48dcc83505fcb00ff0aeca83","amp;dn":"Audio+book+%3A+Richard+Dawkins+-+The+Ancestors+Tale","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fbbfcf529499167f48dcc83505fcb00ff0aeca83","infoHashBuffer":{"type":"Buffer","data":[251,191,207,82,148,153,22,127,72,220,200,53,5,252,176,15,240,174,202,131]},"announce":[],"urlList":[]}}