{"title":"The Unbelievable Truth 1989 DVDRip Sonata Premiere","uid":9780353,"size":732487999,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fc3407385ce1427cb76460eda2fd15e77a918b3d&amp;dn=The+Unbelievable+Truth+1989+DVDRip+Sonata+Premiere&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"klinho","files":2,"time":1395094530,"description":"Writer-director Hal Hartley's first feature -- shot in less than 12 days in his backyard for a mere $200,000 -- is a dry and dark comedy about the dangerous undercurrents that exist below the surface of normal middle class existence. Over the credits, Josh (Robert Burke), a man garbed in black, is seen hitch-hiking back to his Long Island home. People ask him, &quot;Are you a priest?&quot; and Josh responds, &quot;No. I'm a mechanic.&quot; Back in Long Island in the town of Lindenhurst, beautiful and somber 17-year-old Audry (Adrienne Shelly) is busy worrying about the forthcoming apocalypse. Josh arrives in Lindenhurst and is hired by Audry's father (Chris Cooke) as a mechanic at his garage. But Audry's father worries about him, particularly when he falls in love with Audry. Her father's problems compound when Audry dumps her old boyfriend and rejects an invitation to attend Harvard. The whole town is now gossiping about Audry's new boyfriend, with rumors spreading that Josh is a mass murderer who killed two members of the family of local waitress Pearl (Julia McNeal). Pearl tells Audry, &quot;He seems like a nice man.&quot; Audry responds, &quot;Even though he killed your father and your sister?&quot; Audry finally makes her father happy when she tells him she won't see Josh again, but dad's relief is short-lived when Audry informs him she's moving to New York to become an underwear model. ","torrent":{"xt":"urn:btih:fc3407385ce1427cb76460eda2fd15e77a918b3d","amp;dn":"The+Unbelievable+Truth+1989+DVDRip+Sonata+Premiere","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc3407385ce1427cb76460eda2fd15e77a918b3d","infoHashBuffer":{"type":"Buffer","data":[252,52,7,56,92,225,66,124,183,100,96,237,162,253,21,231,122,145,139,61]},"announce":[],"urlList":[]}}