{"title":"RadioBOSS Advanced v5.1.2.0","uid":10574448,"size":28667575,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:fd2c85a44c0905167f7ce88738ad1a351d9a0a4e&amp;dn=RadioBOSS+Advanced+v5.1.2.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"NokTham","files":1,"time":1405624719,"description":"RadioBOSS provides professional radio programming engineering and automation at a fraction of what other applications cost. If you're creating programming for a terrestrial or Internet radio station, RadioBOSS lets you build sophisticated playlists with the professional features you need. \n\nRadioBOSS is also a simple to use solution to create background music for a wide range of venues: clubs, bars, restaurants, gyms and health clubs. With RadioBOSS, you can quickly create the right background music for your business and RadioBOSS will run unattended and trouble-free for months at a time.\n\nRadioBOSS includes:\nAn extremely stable Player application that controls when and how playlists are played.\nA built-in format converter so you can use the audio assets you already have on disk or hard drive.\nA simple-to-use music database to locate, track, annotate and manage your audio assets.\nA robust playlist generator with professional functionality including playlist templates, &quot;playlists within playlists&quot; and more.\n\nThe components of RadioBOSS:\t\n\nRadioBOSS - player\tThe Player is the central component of RadioBOSS. With it you can:\nLaunch and edit playlists.\nSchedule various events\nFor advertising, specify volume increase.\nAutomatic volume leveling, crossfading and silence trimming.\nUse the 'playlist within playlist' to create sophisticated multi-hour audio programming.\nEasily create random playlists\nInclude Internet streams (HTTP, MMS and FTP) in your playlists.\nApply a wide range of audio effects including echo, reverb, flanger, tempo, pitch.\nImprove the quality of any given audio asset with RadioBOSS' 12-band equalizer.\nUse your WinAMP and DirectX (through AdaptX) plugins for even more sophisticated audio engineering.\nTaking advantage of the multichannel card installed in your PC (4.0, 5.1, 7.1, etc.) output multiple channels.\nOutput metadata (upload to FTP, HTTP request, text or XML file).\nSupports Internet streaming.\nSupports individual configuration profiles - set up RadioBOSS to your specifications.\nSupports ASIO and WASAPI input and output\n\nRadioBOSS - player\tThe Playlist Generator creates playlists.\nAutomatically generate playlists for a given duration.\nGenerates playlists quickly using and reusing playlist templates.\nSupports multiple generation options.\nCreate playlists with rotations.\nCreate playlists with jingles.\nCreate playlists with hour markers and commercials.\n\nWe also provide more advanced tool: Playlist Generator Pro software (included in the RadioBOSS Advanced package).\n\nRadioBOSS - player\tThe Music Database organizes your audio assets.\nAutomatic indexing supports quick searches.\nFilter and sort to work with just records you want.\nAutomatically tracks usage statistics.\nTag any audio asset, regardless of format.\nTag mutiple audio assets.\nAdd comments to any audio asset.\n &lt;a href=&quot;\nhttp://s19.postimg.org/em8im5nxf/screenshot_44.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s19.postimg.org/em8im5nxf/screenshot_44.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://s19.postimg.org/qcmg3jgpv/screenshot_45.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s19.postimg.org/qcmg3jgpv/screenshot_45.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:fd2c85a44c0905167f7ce88738ad1a351d9a0a4e","amp;dn":"RadioBOSS+Advanced+v5.1.2.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd2c85a44c0905167f7ce88738ad1a351d9a0a4e","infoHashBuffer":{"type":"Buffer","data":[253,44,133,164,76,9,5,22,127,124,232,135,56,173,26,53,29,154,10,78]},"announce":[],"urlList":[]}}