{"title":"Pulgarcito Revista Bruguera 5 [citaltras]","uid":6155400,"size":4475574819,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:ff1ffacc77611d96016c29180c77ca12ec569edb&amp;dn=Pulgarcito+Revista+Bruguera+5+%5Bcitaltras%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"citaltras","files":-1,"time":1297018360,"description":" Pulgarcito Revista Bruguera part 5 of 6\t\nCreated by Ratio: 0.57citaltras 3 weeks ago\nComics : Other : Spanish\nPULGARCITO TORRENT 5/6\nSPANISH COMIC MAGAZINE\n\n\n\n\n\n\n\n\nContents/Indice:\n----------------\n-Pulgarcito Extra, Almanaque y Especiales (33 issues)\n-Super Pulgarcito primera epoca (1949-1951) (4 issues)\n-Super Pulgarcito segunda epoca (1970-1983) (59 issues)\n-Pulgarcito septima epoca (7th series) 1981: #001-#174 (28 issues)\n\n\n\n\nThe fifth in a series of 6 torrents with all the scanned issues of\nPulgarcito, the famous Spanish comic magazine.\nEvery torrent has 4GB or less, so the collection can be burned in 6 DVDs.\nAll the scans were downloaded from the Comic Release Group.\nFor more information or more Spanish comics visit\nlamansion-crg.net/forum\nThanks to all the scanners.\nEnjoy and seed.\n\nNEXT TORRENT #6 (last):\nPulgarcito epoca 8\nGran Pulgarcito\nMini Pulgarcito\nPulgarcito Ediciones B\n\n\n\n\nÃ‚Â¿DE QUE SE TRATA? De todos los nÃƒÂºmeros escaneados de las revistas\nPulgarcito, Super Pulgarcito, Gran Pulgarcito, etc, de Editorial\nBruguera, desde sus inicios. Son mÃƒÂ¡s de 1000 tebeos en total, casi 24\nGB. Cada torrent tiene alrededor de 4GB y cabe en un DVD.\nLos irÃƒÂ© subiendo poco a poco en una serie de torrents. Si tienes\npulgarcitos no incluidos aquÃƒÂ­, Ã‚Â¿a que esperas? escanÃƒÂ©alos.\nGracias a todos los escaneadores.\nDisfruta y sigue compartiendo.\n\n\n\n\nFrom Wikipedia:\n--------------\nPulgarcito (Spanish for &quot;Tom Thumb&quot;)\nwas a weekly illustrated magazine of Spain that was published by\nEditorial Bruguera (originally named El Gato Negro, though it retained\na black cat as its logo) from June 1921 to 1986.\n\nAn extremely popular periodical in its first years, Pulgarcito offered\nshort stories, articles, pastimes, and jokes, with only a few comic\nstrips. Economic difficulties caused by the Spanish Civil War led to\nonly 13 issues being published between 1945 and 1947, though it\nrecovered after 1952, with more prominence given to comic strips and a\nstable of new comic characters, including: Mortadelo y Filemon, Zipi y\nZape, Las hermanas Gilda, Carpanta, El professor Tragacanto,\n\nBoth IbÃƒÂ¡ÃƒÂ±ez and Jan worked on Pulgarcito during its last years. With\nthe demise of the Editorial Bruguera publishing house, Pulgarcito was\ndiscontinued.\n\n\n\n\nSUPER PULGARCITO. (1970-1983)\n-----------------------------\n\n\n\n\n\n\nEn agosto de 1970 cierra la revista semanal Gran Pulgarcito, con la promesa a sus lectores de que seguirÃƒÂ¡ apareciendo en forma de Extra, con 68 pÃƒÂ¡ginas. En octubre saldrÃƒÂ¡ esta revista heredera, pero no llevarÃƒÂ¡ exactamente ese nombre, si no el de SÃƒÂºper Pulgarcito, lo que le darÃƒÂ¡ una entidad propia. A diferencia de Mortadelo, que aparece un mes mÃƒÂ¡s tarde, SÃƒÂºper Pulgarcito parece ir dirigido a un pÃƒÂºblico mÃƒÂ¡s elitista y adinerado (15 PTA en lugar de 6, mÃƒÂ¡s cara incluso proporcionalmente a sus pÃƒÂ¡ginas).\n\nIncluye en sus pÃƒÂ¡ginas varias de las series comunes en Gran Pulgarcito: Mortadelo y FilemÃƒÂ³n, La panda, Aquiles TalÃƒÂ³n, Campeonio, Anacleto... e incluso, al principio, una mini aventura de Felix Rodriguez de la Fuente. El nuevo tebeo tiene menos participaciÃƒÂ³n de series no espaÃƒÂ±olas e incluye una aventura &quot;seria&quot;. Tras la creaciÃƒÂ³n de la revista Mortadelo, Anacleto pasa a ser el rey de las portadas hasta su final. CompartirÃƒÂ¡ muchas series con su hermana pequeÃƒÂ±a (en pÃƒÂ¡ginas), como el exitoso Sir Tim O'Theo.\n\nA finales de los 70 pasarÃƒÂ¡ por la misma transformaciÃƒÂ³n de todas las revistas Bruguera: se reducen las pÃƒÂ¡ginas, sigue aumentando el precio (esto era lÃƒÂ³gico, por la inflaciÃƒÂ³n de la ÃƒÂ©poca), pasa a ser a todo color, se multiplican las reediciones de historietas y pierde la personalidad propia al incluir cualquier serie de humor segÃƒÂºn convenga en el momento de editar.\n\nSerÃƒÂ¡ cerrada en 1983, cuando las glorias de Bruguera son ya agua pasada y se ensayan nuevos intentos para capear el temporal de problemas de diversa ÃƒÂ­ndole.\n\n1970-1983. Periodicidad: cada 5 semanas. 152 nÃƒÂºmeros. Cuaderno con grapa central, de 26 x 18,5 cm. Portadas en papel couchÃƒÂ© un poco mÃƒÂ¡s grueso que el resto. Inicialmente tiene 68 pÃƒÂ¡ginas y alterna bloques de pÃƒÂ¡ginas a todo color con bitono en naranja, mÃƒÂ¡s tarde pasan a ser 52 y todas a color. Precio 15 a 90 PTA.\n\n\n\nPULGARCITO. 7Ã‚Âª etapa (1981-1985)\n(2Ã‚Âª ÃƒÂ©poca, segÃƒÂºn denominaciÃƒÂ³n de la Editorial Bruguera)\n-------------------------------------------------------\n\n\n\n\n\n\n\nLa mÃƒÂ¡s histÃƒÂ³rica revista de Bruguera es cerrada en 1981 y reestructurada con un aspecto bien distinto de los tebeos de la editorial. Tiene un formato de bolsillo, pero grueso, lo que le hace llevar una encuadernaciÃƒÂ³n de pegado en lugar del habitual grapado, a imitaciÃƒÂ³n de las ediciones de Disney en Italia (Don Miki, Dumbo). Su orientaciÃƒÂ³n serÃƒÂ¡ mÃƒÂ¡s infantil que el de otras revistas.\n\nEl personaje estrella de la publicaciÃƒÂ³n fue Pulgarcito, realizado por Jan, un personaje que estÃƒÂ¡ lÃƒÂ©vemente inspirado en el del cuento, y que alcanzÃƒÂ³ un gran nivel de calidad. AquÃƒÂ­ tambiÃƒÂ©n naciÃƒÂ³ Tete Cohete, de IbÃƒÂ¡ÃƒÂ±ez. Otras series ya existentes, pero con nuevas historietas, se publicaron con el formato adaptado para su tamaÃƒÂ±o (pequeÃƒÂ±o, como Pulgarcito), entre ellas, AnÃƒÂ­bal (Rojas de la CÃƒÂ¡mara), El profesor Tragacanto (Martz Schmidt), Cacharrilandia (AynÃƒÂ©) y Cinco Amiguetes (Rovira).\n\nSe incorpora series procedentes de USA (Tom y Jerry), de Alemania (Fix y Foxi), de BÃƒÂ©lgica (Lanitas, Los Pitufos) o de Holanda (Bermudillo, el genio del hatillo).\n\nComo ya habÃƒÂ­a ocurrido en casi todas las publicaciones Bruguera en los aÃƒÂ±os anteriores, se fue llenando de material reeditado, muchÃƒÂ­simo mÃƒÂ¡s econÃƒÂ³mico ya que no pagaba derechos de autor. Dos aÃƒÂ±os despuÃƒÂ©s de su inicio, deja de publicarse la serie principal, debido a la consagraciÃƒÂ³n de Jan a su personaje principal: Super LÃƒÂ³pez. Ambas circustancias harÃƒÂ¡n decaer las ventas hasta que sea cerrada esta etapa, en 1985.\n\n1982-1985. 178 nÃƒÂºmeros ordinarios y algunos extraordinarios. EncuadernaciÃƒÂ³n rÃƒÂºstica (pegado) de 100 pÃƒÂ¡ginas, todas en color. 13 x 18,5 cm, con portadas en papel couchÃƒÂ©.\n\n\n\n---------------------------------------------------\nIf you liked this torrent be sure to download also:\n-Pulgarcito Revista Bruguera part 1/6\n-Pulgarcito Revista Bruguera part 2/6\n-Pulgarcito Revista Bruguera part 3/6\n-Pulgarcito Revista Bruguera part 4/6\n-Mortadelo 0-100\n-Mortadelo 101-200\n-Mortadelo 201-300\n---------------------------------------------------","torrent":{"xt":"urn:btih:ff1ffacc77611d96016c29180c77ca12ec569edb","amp;dn":"Pulgarcito+Revista+Bruguera+5+%5Bcitaltras%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff1ffacc77611d96016c29180c77ca12ec569edb","infoHashBuffer":{"type":"Buffer","data":[255,31,250,204,119,97,29,150,1,108,41,24,12,119,202,18,236,86,158,219]},"announce":[],"urlList":[]}}