{"title":"John Lee Hooker - That's My Story (1960)","uid":8638309,"size":109835881,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ff63c5c3530eaa2e9f83959989aac13c043ef7dc&amp;dn=John+Lee+Hooker+-+That%27s+My+Story+%281960%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":-1,"time":1372812183,"description":"\nAn acoustic date cut on February 9, 1960, this finds Hooker in top-notch form, running through a dozen performances in his instantly identifiable style. Except for three solo turns, Hooker is ably backed by bassist Sam Jones and drummer Louis Hayes, both wisely following John Lee's idiosyncratic timing and changes. All the tunes are stretched out to comfortable lengths, and his interpretations of then-R&amp;B hits like &quot;Money&quot; and Rosco Gordon's &quot;No More Doggin'&quot; are so vastly reworked that they sound like totally original compositions. A good choice to pick up if you run across a copy.\n\n1. I Need Some Money\n2. Come On And See About Me\n3. I'm Wanderin'\n4. Democrat Man\n5. I Want To Talk About You\n6. Gonna Use My Rod\n7. Wednesday Evenin' Blues\n8. No More Doggin'\n9. One Of These Days\n10. I'll Believe I'll Go Back Home\n11. You're Leavin' Me Baby\n12. That's My Story\n\nAlthough Orrin Keepnews' Riverside Records was primarily a jazz label, the company dabbled in blues in the 1960s -- and one of the bluesmen who recorded for Riverside was John Lee Hooker. Recorded in 1960, this Keepnews-produced session came at a time when Hooker was signed to Vee-Jay. The last thing Keepnews wanted to do was emulate Hooker's electric-oriented, very amplified Vee-Jay output, which fared well among rock and R&amp;B audiences. Keepnews had an acoustic country blues vision for the bluesman, and That's My Story favors a raw, stripped-down, bare-bones approach -- no electric guitar, no distortion, no singles aimed at rock &amp; rollers. Over the years, Hooker fans have debated the merits of his Riverside albums. Some much prefer him in an electric setting; others applaud the rural vision that Keepnews had for him. But, truth be told, both approaches are equally valid. While many of his electric recordings are stunning, he is also well served by the rawness that Keepnews goes for on That's My Story. From the sobering &quot;Gonna Use My Rod&quot; (which finds Hooker warning that he will shoot anyone who fools around with his wife) to the gospel-themed &quot;One of These Days,&quot; Hooker's performances are often compelling. Most of the time, he is joined by two jazz musicians, acoustic bassist Sam Jones and drummer Louis Hayes, both Cannonball Adderley sidemen at the time. However, the blues giant is unaccompanied on a few selections, including the autobiographical title song and the overtly political &quot;Democrat Man&quot; (a passionate endorsement of the Democratic Party). While That's My Story falls short of essential, it is a solid, rewarding product of Hooker's association with Keepnews and Riverside Records. ","torrent":{"xt":"urn:btih:ff63c5c3530eaa2e9f83959989aac13c043ef7dc","amp;dn":"John+Lee+Hooker+-+That%27s+My+Story+%281960%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff63c5c3530eaa2e9f83959989aac13c043ef7dc","infoHashBuffer":{"type":"Buffer","data":[255,99,197,195,83,14,170,46,159,131,149,153,137,170,193,60,4,62,247,220]},"announce":[],"urlList":[]}}