{"title":"The Great Spring: Writing, Zen, and This Zigzag Life - Natalie G","uid":14543468,"size":599102,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ff652917c120e0c70e840fedf656312b5ce22879&amp;dn=The+Great+Spring%3A+Writing%2C+Zen%2C+and+This+Zigzag+Life+-+Natalie+G&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ZamKhan","files":1,"time":1462548752,"description":"What does it take to have a long writing life? Drawing her years of writing, teaching, and practicing Zen, Natalie Goldberg shares the experiences that have opened her to new ways of being alive—experiences that point the way forward in our lives and our writing. \r\n\r\nThe &quot;great spring&quot; of this book title refers to the great rush of energy that arrives when you think no life will ever come again--the early yellow flowering forsythia, for example. It also refers to enlightenment: obstructions shatter, pain cracks open, previously resisted truth releases, an acceptance of transiency flows through. Natalie Goldberg shares the moments that have sprung from her own life of writing, teaching, and Zen practice—moments of searching, wandering, zigzagging, losing, and leaping where she has found herself and her voice. In these pages, we watch as Natalie &quot;makes positive effort for the good&quot;—one of the guiding rules of her writing life—and we see that if we can stay attentive in our lives, even in the middle of the ruins, &quot;we can hear the sound of a songbird in a Paris chestnut tree.&quot; Whether we know if the song comes from inside us or out doesn't matter.\r\n\r\nThirteen of the twenty-two essays in the book have been previously published (often in a different form). Those publications include Yoga Journal, Shambhala Sun, Five Points, and Creative Nonfiction","torrent":{"xt":"urn:btih:ff652917c120e0c70e840fedf656312b5ce22879","amp;dn":"The+Great+Spring%3A+Writing%2C+Zen%2C+and+This+Zigzag+Life+-+Natalie+G","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff652917c120e0c70e840fedf656312b5ce22879","infoHashBuffer":{"type":"Buffer","data":[255,101,41,23,193,32,224,199,14,132,15,237,246,86,49,43,92,226,40,121]},"announce":[],"urlList":[]}}