{"title":"Rainbow/Rising [1976][320 KBPS][JAPAN SHM-CD]","uid":11734630,"size":109496577,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ffa58caad97942bc2c8ec49db89207142beb6087&amp;dn=Rainbow%2FRising+%5B1976%5D%5B320+KBPS%5D%5BJAPAN+SHM-CD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"LameDuck69","files":27,"time":1425512285,"description":"Rainbow - Rising [1976][2008][SHM-CD Japanese UICY-93619]\n\n\n\n01. Tarot Woman  \n02. Run With The Wolf  \n03. Starstruck  \n04. Do You Close Your Eyes  \n05. Stargazer  \n06. A Light In The Black \n------------------------------\n**320 KBPS CBR\n**Cover Art\n------------------------------------------------------\nRainbow (also known as Ritchie Blackmore's Rainbow or Blackmore's Rainbow) were a British rock band led by guitarist Ritchie Blackmore from 1975 to 1984 and 1993 to 1997. They were originally established with American rock band Elf's members, but Blackmore fired all the members except Ronnie James Dio who would leave in 1979. Three British musicians joined in 1979, singer Graham Bonnet, keyboardist Don Airey, former Deep Purple bassist Roger Glover, and this line-up gave the band their commercial breakthrough with the single &quot;Since You Been Gone&quot;. Over the years Rainbow went through many line-up changes with no two studio albums featuring the same line-up. Other lead singers Joe Lynn Turner and Doogie White would follow, and the project consisted of numerous backing musicians. The band started out combining mystical lyric themes with neoclassical metal, but went in a more streamlined commercial style following Dio's departure from the group.\n\nRainbow were ranked No. 90 on VH1's 100 Greatest Artists of Hard Rock. The band has sold over 28 million albums worldwide and 4 million albums in the United States.\n--------------------------------------------------------------------------------\nRising (also known as Rainbow Rising) is the second studio album by the British hard rock band Rainbow, released in 1976. In issue 4 of Kerrang! magazine, Rising was voted as the number 1 album of all time.\n\nBand leader Ritchie Blackmore retained only Ronnie James Dio from the previous album line-up, and recruited drummer Cozy Powell, bassist Jimmy Bain and keyboard player Tony Carey to complete the roster.[2] Recorded in Munich in less than a month, the album was overseen by rock producer and engineer Martin Birch. The band was originally billed as Blackmore's Rainbow in the US.[1]\n\nThe album showpiece, the 8-minute and 26 second piece &quot;Stargazer&quot;, which features the Munich Philharmonic Orchestra, originally had a keyboard intro found on the 2011 Deluxe Edition's &quot;Rough Mix&quot; version.\n\nFew of the album tracks made it into the band's live set: &quot;Stargazer&quot; and &quot;Do You Close Your Eyes&quot;, written prior to the inaugural US tour in late 1975, featured in all the 1975 and 1976 shows, while &quot;A Light in the Black&quot; was dropped early in the 1976 tour, although it was reintroduced into the set during the Japanese dates. &quot;Starstruck&quot; was played in shortened form usually as part of &quot;Man on the Silver Mountain&quot;.\n--------------------------------------------------------------------------------\n\nRainbow:\n\nRonnie James Dio: vocals\nRitchie Blackmore: guitar\nTony Carey: keyboards\nJimmy Bain: bass\nCozy Powell: drums\n\nWith:\n\nMunich Philharmonic Orchestra: Strings, Horn\nFritz Sonnleitner: Concert Master\nRainer Pietsch: Conductor","torrent":{"xt":"urn:btih:ffa58caad97942bc2c8ec49db89207142beb6087","amp;dn":"Rainbow%2FRising+%5B1976%5D%5B320+KBPS%5D%5BJAPAN+SHM-CD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ffa58caad97942bc2c8ec49db89207142beb6087","infoHashBuffer":{"type":"Buffer","data":[255,165,140,170,217,121,66,188,44,142,196,157,184,146,7,20,43,235,96,135]},"announce":[],"urlList":[]}}